Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/ark._json_.po
Languages: tr

# Name
source: Ark Extract Here
tr: Ark Buraya Çıkar

# Name
source: 'Compress' service menu
tr: 'Sıkıştır' hizmet menüsü

# Name
source: 'Extract' service menu
tr: 'Çıkar' hizmet menüsü

# Name
source: Archiver
tr: Arşivleyici

# Name
source: 7z plugin
tr: 7z eklentisi

# Name
source: ARJ plugin
tr: ARJ eklentisi

# Name
source: RAR plugin
tr: RAR eklentisi

# Name
source: The Unarchiver plugin
tr: Unarchiver eklentisi

# Name
source: Info-zip plugin
tr: Info-zip eklentisi

# Name
source: Libarchive plugin
tr: Libarchive eklentisi

# Name
source: Libarchive plugin (read-only formats)
tr: Libarchive eklentisi (saltokunur biçimler)

# Description
source: Archive Handling Tool
tr: Arşiv İşleme Aracı

# Description
source: Full support for the zip and 7z archive formats
tr: Zip ve 7z arşiv biçimleri için tam destek

# Description
source: Full support for the ARJ archive formats
tr: ARJ arşiv biçimi için tam destek

# Description
source: Full support for the RAR archive format
tr: RAR arşiv biçimi için tam destek

# Description
source: Open and extract RAR and LHA archives
tr: RAR ve LHA arşivlerini açın ve çıkarın

# Description
source: Legacy support for the zip archive format
tr: Zip arşivi biçimi için eski desteği

# Description
source: Full support for compressed TAR archives
tr: Sıkıştırılmış TAR arşivleri için tam destek

# Description
source: Open and extract DEB, RPM, ISO, AppImage, XAR and CAB files
tr: DEB, RPM, ISO, AppImage, XAR ve CAB dosyalarını açıp çıkarın
