Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/bluedevil._desktop_.po
Languages: tr

# Comment
source: Bluetooth system
tr: Bluetooth sistemi

# Name
source: Authorization Requested
tr: Yetkilendirme Gerekli

# Comment
source: A device wants to connect
tr: Bir aygıt bağlanmak istiyor

# Name
source: Confirm PIN
tr: PIN’i Onayla

# Comment
source: Confirm a device request using matching PINs
tr: Eşleştirme PIN’i kullanarak bir aygıt isteğini onaylayın

# Name
source: Request PIN
tr: PIN İste

# Comment
source: A PIN is needed
tr: PIN gerekiyor

# Name
source: Incoming File
tr: Gelen Dosya

# Comment
source: Incoming file transfer
tr: Gelen dosya aktarımı

# Name
source: Connection Failed
tr: Bağlanılamadı

# Comment
source: Connection to device failed
tr: Aygıta bağlanılamadı

# Name
source: Device Setup Finished
tr: Aygıt Kurulumu Bitti

# Comment
source: Setting up a Bluetooth device finished successfully
tr: Bir Bluetooth aygıtının kurulumu başarıyla yapıldı

# Name
source: Bluetooth File Transfer
tr: Bluetooth Dosya Aktarımı

# GenericName
source: Bluetooth File Transfer
tr: Bluetooth Dosya Aktarımı

# Comment
source: Send files via Bluetooth
tr: Bluetooth üzerinden dosya gönder

# Name
source: Add Bluetooth Device
tr: Bluetooth Aygıtı Ekle

# GenericName
source: Add Bluetooth Device
tr: Bluetooth Aygıtı Ekle

# Comment
source: Add Bluetooth Device
tr: Bluetooth Aygıtı Ekle
