Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/crow-translate_qt.po
Languages: tr

# OnlineTranslator|
source: Uzbek (Latin)
tr: Özbekçe (Latin)

# OnlineTranslator|
source: Vietnamese
tr: Vietnamca

# OnlineTranslator|
source: Wallisian
tr: Uvean Dili

# OnlineTranslator|
source: Welsh
tr: Galce

# OnlineTranslator|
source: Wolof
tr: Volofça

# OnlineTranslator|
source: Xhosa
tr: Zosa Dili

# OnlineTranslator|
source: Yakut
tr: Yakutça

# OnlineTranslator|
source: Yiddish
tr: Yidiş Dili

# OnlineTranslator|
source: Yoruba
tr: Yorubaca

# OnlineTranslator|
source: Yucatec Maya
tr: Yukatek Mayacası

# OnlineTranslator|
source: Zulu
tr: Zuluca

# OnlineTranslator|
source: Instance error: %1
tr: Örnek hatası: %1

# OnlineTranslator|
source: Error: Unable to parse autodetected language
tr: Hata: Kendiliğinden algılanan dil ayrıştırılamıyor

# PopupWindow|
source: Swap languages
tr: Dilleri değiş–tokuş et

# PopupWindow|
source: Copy source text to the clipboard
tr: Kaynak metni panoya kopyala

# PopupWindow|
source: Copy all translation data to the clipboard
tr: Tüm çeviri verisini panoya kopyala

# PopupWindow|
source: Copy translation to the clipboard
tr: Çeviriyi panoya kopyala

# AppSettings|
source: Unknown language code: %1
tr: Bilinmeyen dil kodu: %1

# AbstractAutostartManager|
source: Unable to apply autostart settings
tr: Kendiliğinden başlatma ayarları uygulanamıyor.

# PortalAutostartManager|
source: Allow %1 to manage autostart setting for itself.
tr: %1 uygulamasının kendisi için olan kendiliğinden başlatma ayarını yönetmesine izin verin.

# PortalAutostartManager|
source: Unable to subscribe to response from xdg-desktop-portal.
tr: xdg-desktop-portal’dan gelen yanıta abone olunamıyor.

# UnixAutostartManager|
source: Unable to create %1
tr: %1 oluşturulamıyor.

# UnixAutostartManager|
source: Unable to copy %1 to %2
tr: %1, %2 konumuna kopyalanamıyor.

# UnixAutostartManager|
source: Unable to remove %1 from %2
tr: %2 içinden %1 kaldırılamıyor.

# SettingsDialog|
source: Portable mode
tr: Taşınabilir kip

# SettingsDialog|
source: Use %1 to store settings
tr: Ayarları depolamak için %1 kullan

# SettingsDialog|
source: <System language>
tr: <Sistem dili>

# SettingsDialog|
source: <Auto>
tr: <Kendiliğinden>

# SettingsDialog|
source: Copy
tr: Kopya

# SettingsDialog|
source: None
tr: Yok

# SettingsDialog|
source: Icons:
tr: Simgeler:

# SettingsDialog|
source: The OCR parameter fields can not be empty.
tr: Optik karakter tanıma parametresi boş olamaz.

# SettingsDialog|
source: Do you want to discard the invalid parameters?
tr: Geçersiz parametreleri atmak istiyor musunuz?

# SettingsDialog|
source: Select icon
tr: Simge Seç

# SettingsDialog|
source: Images (*.png *.ico *.svg *.jpg);;All files()
tr: Görseller (*.png *.ico *.svg *.jpg);;Tüm dosyalar()

# SettingsDialog|
source: Select OCR languages path
tr: Optik Karakter Tanıma Dilleri Yolunu Seç

# SettingsDialog|
source: Piper voices path:
tr: Piper sesleri yolu:

# SettingsDialog|
source: Directory with voice models
tr: Ses modellerinin bulunduğu dizin

# SettingsDialog|
source: Select Piper voices path
tr: Piper Sesleri Yolunu Seç

# SettingsDialog|
source: Back
tr: Geri

# SettingsDialog|
source: Settings
tr: Ayarlar

# SettingsDialog|
source: General
tr: Genel

# SettingsDialog|
source: Interface
tr: Arayüz

# SettingsDialog|
source: Translation
tr: Çeviri

# SettingsDialog|
source: Text-To-Speech
tr: Metin Konuşma

# SettingsDialog|
source: Connection
tr: Bağlantı

# SettingsDialog|
source: Shortcuts
tr: Kısayollar

# SettingsDialog|
source: About
tr: Hakkında

# SettingsDialog|
source: Language:
tr: Dil:

# SettingsDialog|
source: <html><head/><body><p>Interface language</p></body></html>
tr: <html><head/><body><p>Arayüz dili</p></body></html>

# SettingsDialog|
source: Main window orientation:
tr: Ana pencere yönelimi:

# SettingsDialog|
source: <html><head/><body><p>Orientation of the main window layout<br/>When using <span style=" font-style:italic;">Auto</span>, the window orientation will match the screen orientation</p></body></html>
tr: <html><head/><body><p>Ana pencere yerleşiminin yönelimi<br/><span style=" font-style:italic;">Kendiliğinden</span> seçiliyse pencere yönelimi, ekran yönelimi ile aynıdır.</p></body></html>

# SettingsDialog|
source: Auto
tr: Kendiliğinden

# SettingsDialog|
source: Portrait
tr: Dikey

# SettingsDialog|
source: Landscape
tr: Yatay

# SettingsDialog|
source: Translation mode:
tr: Çeviri kipi:

# SettingsDialog|
source: <html><head/><body><p>A window for translating selected text. If the application is minimized, the main window will always be used.</p></body></html>
tr: <html><head/><body><p>Seçili metni çevirmek için bir pencere. Uygulama simge durumuna küçültülmüşse her zaman ana pencere kullanılır.</p></body></html>

# SettingsDialog|
source: Pop-up window
tr: Açılır pencere

# SettingsDialog|
source: Main window
tr: Ana pencere

# SettingsDialog|
source: Notification
tr: Bildirim

# SettingsDialog|
source: Translation notification timeout:
tr: Çeviri bildirimi zaman aşımı:

# SettingsDialog|
source: <html><head/><body><p>Notification with translation display time</p></body></html>
tr: <html><head/><body><p>Çeviri görüntüleme süresiyle bildirim.</p></body></html>

# SettingsDialog|
source: sec
tr: san

# SettingsDialog|
source: <html><head/><body><p>Display icon in the system tray</p></body></html>
tr: <html><head/><body><p>Sistem tepsisinde simgeyi görüntüleyin.</p></body></html>

# SettingsDialog|
source: Show tray icon
tr: Tepsi simgesini göster

# SettingsDialog|
source: <html><head/><body><p>Start application minimized to the system tray</p></body></html>
tr: <html><head/><body><p>Uygulamayı sistem tepsisine küçültülmüş olarak başlatın.</p></body></html>

# SettingsDialog|
source: Start minimized
tr: Küçültülmüş olarak başlat

# SettingsDialog|
source: <html><head/><body><p>Run the application at system startup</p></body></html>
tr: <html><head/><body><p>Uygulamayı sistem başlangıcında çalıştırın.</p></body></html>

# SettingsDialog|
source: Launch at startup
tr: Başlangıçta çalıştır

# SettingsDialog|
source: Font
tr: Yazıtipi

# SettingsDialog|
source: Name:
tr: Ad:

# SettingsDialog|
source: <html><head/><body><p>Translation and source text font</p></body></html>
tr: <html><head/><body><p>Çeviri ve kaynak metni yazıtipi.</p></body></html>

# SettingsDialog|
source: Size:
tr: Boyut:

# SettingsDialog|
source: <html><head/><body><p>Font size of translation and source text</p></body></html>
tr: <html><head/><body><p>Çeviri ve kaynak metnin puntosu.</p></body></html>

# SettingsDialog|
source: <html><head/><body><p>Pop-up window height in pixels</p></body></html>
tr: <html><head/><body><p>Piksel olarak açılır pencere yüksekliği.</p></body></html>

# SettingsDialog|
source: Width:
tr: Genişlik:

# SettingsDialog|
source: <html><head/><body><p>Pop-up window width in pixels</p></body></html>
tr: <html><head/><body><p>Piksel olarak açılır pencere genişliği.</p></body></html>

# SettingsDialog|
source: <html><head/><body><p>Pop-up window opacity</p></body></html>
tr: <html><head/><body><p>Açılır pencere matlığı.</p></body></html>

# SettingsDialog|
source: Opacity:
tr: Matlık:

# SettingsDialog|
source: Show timeout:
tr: Zaman aşımını göster:

# SettingsDialog|
source: Height:
tr: Yükseklik:

# SettingsDialog|
source: <html><head/><body><p>The number of seconds after which the window will be hidden if it has no focus</p></body></html>
tr: <html><head/><body><p>Odaklanmadığı takdirde pencerenin gizleneceği saniye sayısı.</p></body></html>

# SettingsDialog|
source: Language format
tr: Dil Biçimi

# SettingsDialog|
source: Main window:
tr: Ana pencere:

# SettingsDialog|
source: <html><head/><body><p>Languages text on buttons</p></body></html>
tr: <html><head/><body><p>Düğmelerdeki diller metni.</p></body></html>

# SettingsDialog|
source: Full name
tr: Tam ad

# SettingsDialog|
source: ISO 639-1 code
tr: ISO 639-1 kodu

# SettingsDialog|
source: Pop-up:
tr: Açılır pencere:

# SettingsDialog|
source: Tray icon
tr: Tepsi Simgesi

# SettingsDialog|
source: Icon:
tr: Simge:

# SettingsDialog|
source: <html><head/><body><p>System tray icon</p></body></html>
tr: <html><head/><body><p>Sistem tepsisi simgesi.</p></body></html>

# SettingsDialog|
source: Default
tr: Öntanımlı

# SettingsDialog|
source: Monochrome (dark theme)
tr: Siyah–beyaz (koyu tema)

# SettingsDialog|
source: Monochrome (light theme)
tr: Siyah–beyaz (açık tema)

# SettingsDialog|
source: Custom
tr: Özel

# SettingsDialog|
source: Custom:
tr: Özel:

# SettingsDialog|
source: Path to the icon or icon name from theme
tr: Simgenin yolu veya temadaki simge adı

# SettingsDialog|
source: <html><head/><body><p>Select icon</p></body></html>
tr: <html><head/><body><p>Simge seç</p></body></html>

# SettingsDialog|
source: Translation provider:
tr: Çeviri sağlayıcısı:

# SettingsDialog|
source: Automatic language detection
tr: Dil Algılama

# SettingsDialog|
source: Primary translation language:
tr: Birincil çeviri dili:

# SettingsDialog|
source: <html><head/><body><p>Language to which text will be translated when autodetecting</p></body></html>
tr: <html><head/><body><p>Kendiliğinden algılama sırasında metnin çevrileceği dil.</p></body></html>

# SettingsDialog|
source: Secondary translation language:
tr: İkincil çeviri dili:

# SettingsDialog|
source: <html><head/><body><p>Language to which the text will be translated if it is in the language selected above</p></body></html>
tr: <html><head/><body><p>Yukarıda seçili olan dildeyse metnin çevrileceği dil.</p></body></html>

# SettingsDialog|
source: <html><head/><body><p>Automatically switch to <span style=" font-style:italic;">Auto</span> when using OCR and global shortcuts</p></body></html>
tr: <html><head/><body><p>Optik karakter tanıma ve global kısayollar kullanılıyorsa <span style=" font-style:italic;">Kendiliğinden</span> ayarını kullanın.</p></body></html>

# SettingsDialog|
source: Force source language detection
tr: Kaynak dil algılamasını zorla

# SettingsDialog|
source: Force translation language detection
tr: Çeviri dili algılamasını zorla

# SettingsDialog|
source: Text-to-Speech
tr: Metin Konuşma

# SettingsDialog|
source: Provider:
tr: Sağlayıcı:

# SettingsDialog|
source: <html><head/><body><p>Enable or disable source transliteration</p></body></html>
tr: <html><head/><body><p>Kaynak yazıçevrimini etkinleştirin veya devre dışı bırakın.</p></body></html>

# SettingsDialog|
source: Enable source transliteration
tr: Kaynak yazıçevrimini etkinleştir

# SettingsDialog|
source: <html><head/><body><p>Enable or disable translation transliteration</p></body></html>
tr: <html><head/><body><p>Çeviri yazıçevrimini etkinleştirin veya devre dışı bırakın.</p></body></html>

# SettingsDialog|
source: Enable translation transliteration
tr: Çeviri yazıçevrimini etkinleştir

# SettingsDialog|
source: <html><head/><body><p>Enable or disable source transcription</p></body></html>
tr: <html><head/><body><p>Kaynak transkripsiyonunu etkinleştirin veya devre dışı bırakın.</p></body></html>

# SettingsDialog|
source: Enable source transcription
tr: Kaynak transkripsiyonunu etkinleştir

# SettingsDialog|
source: <html><head/><body><p>Enable or disable translation options</p></body></html>
tr: <html><head/><body><p>Çeviri seçeneklerini etkinleştirin veya devre dışı bırakın.</p></body></html>

# SettingsDialog|
source: Enable translation options
tr: Çeviri seçeneklerini etkinleştir

# SettingsDialog|
source: <html><head/><body><p>Enable or disable usage examples</p></body></html>
tr: <html><head/><body><p>Kullanım örneklerini etkinleştirin veya devre dışı bırakın.</p></body></html>

# SettingsDialog|
source: Enable examples
tr: Örnekleri etkinleştir

# SettingsDialog|
source: <html><head/><body><p>Replace each sequence of whitespaces (this includes the ASCII characters '\t', '\n', '\v', '\f', '\r', and ' ') with a single space in queries</p></body></html>
tr: <html><head/><body><p>Sorgulardaki her bir boşluk dizisini tek bir boşlukla değiştirin (bu, “\t”, “\n”, “\v”, “\f”, “\r”, ve “ ” ASCII karakterlerini içerir).</p></body></html>

# SettingsDialog|
source: Simplify source
tr: Kaynağı yalınlaştır

# SettingsDialog|
source: Mozhi instance URL
tr: Mozhi örneği URL’si

# SettingsDialog|
source: Automatically pick the fastest instance based on the ping
tr: Pinge bakarak en hızlı örneği kendiliğinden seç

# SettingsDialog|
source: Detect fastest
tr: En Hızlıyı Algıla

# SettingsDialog|
source: Languages
tr: Diller

# SettingsDialog|
source: <html><head/><body><p>Loading additional languages will impact both speed and accuracy, as there is more work to do to decide on the applicable language, and there is more chance of hallucinating incorrect words.</p></body></html>
tr: <html><head/><body><p>Uygulanabilir dile karar vermek için yapılması gereken daha fazla iş olduğundan ve daha çok yanlış sözcük ortaya çıkarmaya neden olabileceğinden, ek dillerin yüklenmesi hem hızı hem de doğruluğu etkileyecektir.</p></body></html>

# SettingsDialog|
source: Languages path:
tr: Diller yolu:

# SettingsDialog|
source: <html><head/><body><p>Select OCR languages path</p></body></html>
tr: <html><head/><body><p>Optik karakter tanıma dilleri yolunu seç</p></body></html>

# SettingsDialog|
source: <html><head/><body><p>Open GitHub repository</p></body></html>
tr: <html><head/><body><p>GitHub deposunu açın.</p></body></html>

# SettingsDialog|
source: <html><head/><body><p><a href="https://github.com/tesseract-ocr/tessdata"><span style=" text-decoration: underline; color:#2980b9;">Download more</span></a></p></body></html>
tr: <html><head/><body><p><a href="https://github.com/tesseract-ocr/tessdata"><span style=" text-decoration: underline; color:#2980b9;">Daha fazla indirin</span></a></p></body></html>

# SettingsDialog|
source: Directory with trained models
tr: Eğitimli modellerin bulunduğu dizin

# SettingsDialog|
source: <html><head/><body><p>Replace all single line breaks with a space after text recognition</p></body></html>
tr: <html><head/><body><p>Metin tanıma sonrasında tüm tek satır sonlarını boşlukla değiştirin.</p></body></html>

# SettingsDialog|
source: Convert line breaks
tr: Satır sonlarını dönüştür

# SettingsDialog|
source: Screen capture
tr: Ekran Yakalama

# SettingsDialog|
source: Remember region:
tr: Bölgeyi anımsa:

# SettingsDialog|
source: <html><head/><body><p>When to remember the last selected region</p></body></html>
tr: <html><head/><body><p>Son seçili bölgenin ne zaman anımsanacağı.</p></body></html>

# SettingsDialog|
source: Never
tr: Asla

# SettingsDialog|
source: Remember last
tr: Son kullanılanı anımsa

# SettingsDialog|
source: Remember always
tr: Her zaman anımsa

# SettingsDialog|
source: Capture delay:
tr: Yakalama gecikmesi:

# SettingsDialog|
source: Delay before screen capture
tr: Ekran yakalama öncesi gecikme

# SettingsDialog|
source: <html><head/><body><p>Show a magnifier next to the cursor</p></body></html>
tr: <html><head/><body><p>İmlecin yanında bir büyüteç gösterin.</p></body></html>

# SettingsDialog|
source: Show magnifier
tr: Büyüteci göster

# SettingsDialog|
source: <html><head/><body><p>Negate (invert) the image before OCR. Use for bright text on dark background.</p></body></html>
tr: <html><head/><body><p>Optik karakter tanıma öncesi görseli negatife çevirin. Koyu arka plan üzerinde açık renkli metin için kullanın.</p></body></html>

# SettingsDialog|
source: Negate OCR
tr: Optik karakter tanımayı negatif yap

# SettingsDialog|
source: <html><head/><body><p>Finish capturing the fragment when the mouse button is released</p></body></html>
tr: <html><head/><body><p>Fare düğmesi bırakıldığında parçayı yakalamayı tamamlayın.</p></body></html>

# SettingsDialog|
source: Confirm on release
tr: Bırakmada onayla

# SettingsDialog|
source: <html><head/><body><p>Apply a slight fog to the unselected part</p></body></html>
tr: <html><head/><body><p>Seçilmeyen kısma hafif bir sis uygulayın.</p></body></html>

# SettingsDialog|
source: Apply light mask
tr: Işık maskesi uygula

# SettingsDialog|
source: Proxy server
tr: Vekil Sunucu

# SettingsDialog|
source: Type:
tr: Tür:

# SettingsDialog|
source: <html><head/><body><p>Proxy type</p></body></html>
tr: <html><head/><body><p>Vekil türü.</p></body></html>

# SettingsDialog|
source: Use system settings
tr: Sistem ayarlarını kullan

# SettingsDialog|
source: Don't use a proxy
tr: Vekil kullanma

# SettingsDialog|
source: Host:
tr: Makine:

# SettingsDialog|
source: <html><head/><body><p>Proxy host name</p></body></html>
tr: <html><head/><body><p>Vekil makine adı.</p></body></html>

# SettingsDialog|
source: Port:
tr: Kapı:

# SettingsDialog|
source: <html><head/><body><p>Proxy port</p></body></html>
tr: <html><head/><body><p>Vekil kapısı.</p></body></html>

# SettingsDialog|
source: Info: the proxy works only for text translation
tr: Bilgi: Vekil, yalnızca metin çevirisi için çalışır.

# SettingsDialog|
source: <html><head/><body><p>Enable or disable authentication</p></body></html>
tr: <html><head/><body><p>Kimlik doğrulamayı etkinleştirin veya devre dışı bırakın.</p></body></html>

# SettingsDialog|
source: Authentication
tr: Kimlik doğrulama

# SettingsDialog|
source: Username:
tr: Kullanıcı adı:

# SettingsDialog|
source: <html><head/><body><p>Proxy username for authentication</p></body></html>
tr: <html><head/><body><p>Kimlik doğrulama için vekil kullanıcı adı.</p></body></html>

# SettingsDialog|
source: Password:
tr: Parola:

# SettingsDialog|
source: <html><head/><body><p>Proxy password for authentication</p></body></html>
tr: <html><head/><body><p>Kimlik doğrulama için vekil parolası.</p></body></html>

# SettingsDialog|
source: Info: the password is saved unencrypted
tr: Bilgi: Parola şifrelenmeden kaydedilir.

# SettingsDialog|
source: <html><head/><body><p>Register global shortcuts in system</p></body></html>
tr: <html><head/><body><p>Global kısayolları sisteme kaydedin.</p></body></html>

# SettingsDialog|
source: Enable global shortcuts
tr: Global kısayolları etkinleştir

# SettingsDialog|
source: <html><head/><body><p>Reset all shortcuts to defaults</p></body></html>
tr: <html><head/><body><p>Tüm kısayolları öntanımlılarına sıfırlayın.</p></body></html>

# SettingsDialog|
source: Reset all
tr: Tümünü Sıfırla

# SettingsDialog|
source: Shortcut
tr: Kısayol

# SettingsDialog|
source: Key sequence:
tr: Düğme dizisi:

# SettingsDialog|
source: <html><head/><body><p>The key sequence for the selected action</p></body></html>
tr: <html><head/><body><p>Seçili eylem için olan düğme dizisi.</p></body></html>

# SettingsDialog|
source: <html><head/><body><p>Accept shortcut</p></body></html>
tr: <html><head/><body><p>Kısayolu kabul et</p></body></html>

# SettingsDialog|
source: Accept
tr: Kabul Et

# SettingsDialog|
source: <html><head/><body><p>Clear shortcut</p></body></html>
tr: <html><head/><body><p>Kısayolu temizle</p></body></html>

# SettingsDialog|
source: Clear
tr: Temizle

# SettingsDialog|
source: <html><head/><body><p>Reset shortcut to default</p></body></html>
tr: <html><head/><body><p>Kısayolu öntanımlı değere sıfırla</p></body></html>

# SettingsDialog|
source: Reset
tr: Sıfırla

# SettingsDialog|
source: Version:
tr: Sürüm:

# SettingsDialog|
source: License:
tr: Lisans:

# SettingsDialog|
source: Source code:
tr: Kaynak kodu:

# SettingsDialog|
source: Translation backend:
tr: Çeviri arka ucu:

# ShortcutsModel|
source: Translate selected text
tr: Seçili Metni Çevir

# ShortcutsModel|
source: Speak selected text
tr: Seçili Metni Konuş

# ShortcutsModel|
source: Speak translation of selected text
tr: Seçili Metnin Çevirisini Konuş

# ShortcutsModel|
source: Stop text speaking
tr: Metni Konuşmayı Durdur

# ShortcutsModel|
source: Speak / pause text speaking
tr: Metni Konuşmayı Başlat/Duraklat

# ShortcutsModel|
source: Show main window
tr: Ana Pencereyi Göster

# ShortcutsModel|
source: Translate selected text and copy to clipboard
tr: Seçili Metni Çevir ve Panoya Kopyala

# ShortcutsModel|
source: Recognize text in screen area
tr: Ekran Alanındaki Metni Tanı

# ShortcutsModel|
source: Translate text in screen area
tr: Ekran Alanındaki Metni Çevir

# ShortcutsModel|
source: Recognize text in screen area with delay
tr: Ekran Alanındaki Metni Gecikmeyle Tanı

# ShortcutsModel|
source: Translate text in screen area with delay
tr: Ekran Alanındaki Metni Gecikmeyle Çevir

# ShortcutsModel|
source: Toggle color inversion for OCR
tr: Optik Karakter Tanıma için Rengi Tersine Çevirmeyi Aç/Kapat

# ShortcutsModel|
source: Main window
tr: Ana Pencere

# ShortcutsModel|
source: Translate
tr: Çevir

# ShortcutsModel|
source: Swap languages
tr: Dilleri Değiş–Tokuş Et

# ShortcutsModel|
source: Close window
tr: Pencereyi Kapat

# ShortcutsModel|
source: Source text
tr: Kaynak Metin

# ShortcutsModel|
source: Translation
tr: Çeviri

# ShortcutsModel|
source: Speak / pause speaking
tr: Konuşmayı Başlat/Duraklat

# ShortcutsModel|
source: Copy to clipboard
tr: Panoya Kopyala

# ShortcutsModel|
source: Description
tr: Açıklama

# ShortcutsModel|
source: Shortcut
tr: Kısayol

# TesseractParametersTableWidget|
source: Property
tr: Özellik

# TesseractParametersTableWidget|
source: Value
tr: Değer

# QObject|
source: Translation Provider Error
tr: Çeviri Sağlayıcısı Hatası

# QObject|
source: The selected translation provider crashed during initialization and has been reset to 'Copy' to prevent further issues. You can try selecting a different provider in Settings → Translation.
tr: Seçili çeviri sağlayıcısı ilklendirme sırasında çöktü ve daha fazla sorunu engellemek adına “Kopya” olarak sıfırlandı. “Ayarlar → Çeviri” altında farklı bir sağlayıcı seçmeyi deneyebilirsiniz.

# MozhiTranslationProvider|
source: translation options:
tr: Çeviri seçenekleri:

# MozhiTranslationProvider|
source: examples:
tr: Örnekler:

# TrayIcon|
source: Show window
tr: Pencereyi Göster

# TrayIcon|
source: Settings
tr: Ayarlar

# TrayIcon|
source: Quit
tr: Çık

# TrayIcon|
source: Translation result
tr: Çeviri Sonucu

# QObject|
source: TTS Provider Error
tr: Metin Konuşma Sağlayıcısı Hatası

# QObject|
source: The selected TTS provider crashed during initialization and has been reset to 'None' to prevent further issues. You can try selecting a different provider in Settings → TTS.
tr: Seçili metin konuşma sağlayıcısı ilklendirme sırasında çöktü ve daha fazla sorunu engellemek adına “Yok” olarak sıfırlandı. “Ayarlar → Metin Konuşma” altında farklı bir sağlayıcı seçmeyi deneyebilirsiniz.

# MozhiTTSProvider|
source: Text is empty
tr: Boş metin

# MozhiTTSProvider|
source: No audio URLs generated
tr: Üretilen ses URL’si yok

# MozhiTTSProvider|
source: Mozhi instance failed: %1 (HTTP Server Error)
tr: Mozhi örneği başarısız oldu: %1 (HTTP sunucusu hatası)

# MozhiTTSProvider|
source: Cannot connect to Mozhi instance: %1
tr: Mozhi örneğine bağlanılamıyor: %1

# MozhiTTSProvider|
source: Mozhi instance failed: %1 (HTTP 500 Internal Server Error)
tr: Mozhi örneği başarısız oldu: %1 (HTTP 500 iç sunucu hatası)

# MozhiTTSProvider|
source: Mozhi instance error: %1 (HTTP 4XX Client Error)
tr: Mozhi örneği başarısız oldu: %1 (HTTP 4XX istemcisi hatası)

# PiperTTSProvider|
source: Failed to initialize Piper TTS
tr: Piper Metin Konuşma ilklendirilemedi

# PiperTTSProvider|
source: ONNX Runtime exception: %1
tr: ONNX çalışma zamanı istisnası: %1

# PiperTTSProvider|
source: Unknown ONNX Runtime initialization error
tr: Bilinmeyen ONNX çalışma zamanı ilklendirme hatası

# PiperTTSProvider|
source: Failed to initialize espeak-ng
tr: espeak-ng ilklendirilemedi

# PiperTTSProvider|
source: ONNX Runtime initialization error: %1
tr: ONNX çalışma zaman ilklendirme hatası: %1

# PiperTTSProvider|
source: Privacy Notice - Neural TTS
tr: Gizlilik Bildirimi — Neural Metin Konuşma

# PiperTTSProvider|
source: ONNX Runtime Telemetry Information
tr: ONNX Çalışma Zamanı Telemetri Bilgisi
