Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/crow-translate_qt.po
Languages: tr

# PiperTTSProvider|
source: Crow Translate uses ONNX Runtime for neural text-to-speech. The Windows binary includes Microsoft telemetry that collects usage information. Data Collection: • Device and usage data, error reports, performance information • Used by Microsoft to improve product quality and features • Subject to Microsoft Privacy Statement Crow Translate Actions: • Automatically disables telemetry on startup • Uses both environment variables and runtime API calls • Note: Some data may be transmitted during ONNX initialization On Unix systems, telemetry is inactive by default. This notice is shown once per installation.
tr: Crow Çeviri, sinirsel metin konuşma için ONNX çalışma zamanını kullanır. Windows ikilisi, kullanım bilgisini toplayan Microsoft telemetrisini içerir. Toplanan Veriler: • Aygıt ve kullanım bilgisi, hata raporları, başarım bilgisi • Microsoft tarafından ürün kalitesini ve özelliklerini iyileştirmek için kullanılır • Microsoft Gizlilik Bildirimi’ne tabidir Crow Çeviri Eylemleri: • Başlangıçta telemetriyi kendiliğinden devre dışı bırakır • Hem çevre değişkenlerini hem de çalışma zamanı API çağrılarını kullanır • Not: ONNX ilklendirmesi sırasında bazı veriler iletiliyor olabilir UNIX sistemlerde telemetri kendiliğinden devre dışıdır. Bu bildiri, her kurulumda yalnızca bir kez gösterilir.

# PiperTTSProvider|
source: No audio data generated
tr: Üretilen ses verisi yok

# PiperTTSProvider|
source: Failed to create temporary audio file
tr: Geçici ses verisi oluşturulamadı

# PiperTTSProvider|
source: Failed to write audio data
tr: Ses verisi yazılamadı

# PiperTTSProvider|
source: <h3>Piper Voice Models Not Found</h3><p>No Piper TTS voice models were found in the standard locations.</p><p><b>To use Piper TTS:</b></p><ol><li>Download voice models from <a href='https://huggingface.co/rhasspy/piper-voices'>HuggingFace Piper Voices</a></li><li>Extract the models to a directory</li><li>Set the path in Settings → TTS → Piper Voices Path</li></ol><p><b>⚠️ License Warning:</b> Some models may have non-free licenses and cannot be used in commercial settings. Please check the license of each model before commercial use.</p>
tr: <h3>Piper Ses Modelleri Bulunamadı</h3><p>Standart konumlarda herhangi bir Piper Metin Konuşma ses modelleri bulunamadı.</p><p><b>Piper metin konuşmayı kullanmak için:</b></p><ol><li><a href='https://huggingface.co/rhasspy/piper-voices'>HuggingFace Piper Voices</a> konumundan ses modellerini indirin</li><li>Modelleri bir dizine çıkarın</li><li>“Ayarlar → Metin Konuşma → Piper sesleri yolu” içinde yolu ayarlayın</li></ol><p><b>⚠️ Lisans uyarısı:</b> Bazı modellerin lisansı özgür olmayabilir ve ticarî ortamlarda kullanılamaz olabilirler. Ticarî kullanımdan önce her bir modelin lisansına bakmayı unutmayın.</p>

# PiperTTSProvider|
source: Piper Voice Models Required
tr: Piper Ses Modelleri Gerekli

# QtTTSProvider|
source: <h3>Windows TTS Voice Not Found</h3><p>No Windows TTS voice was found for <b>%1</b>.</p><p><b>To install additional languages:</b></p><ol><li>Open <b>Settings → Time & Language → Language & region</b></li><li>Click <b>Add a language</b> and select your desired language</li><li>Click on the installed language and select <b>Language options</b></li><li>Under <b>Speech</b>, click <b>Download</b> for the speech pack</li></ol><p><b>⚠️ License Note:</b> Crow Translate currently only supports "Basic voice models" from Windows TTS. "Narrator voices" have licensing restrictions that are incompatible with this application.</p>
tr: <h3>Windows Metin Konuşma Sesi Bulunamadı</h3><p>%1 için herhangi bir Windows metin konuşma sesi bulunamadı</b>.</p><p><b>Ek diller kurmak için:</b></p><ol><li><b>Ayarlar → Zaman ve Dil → Dil ve Bölge</b> ayarlarını açın</li><li><b>Dil ekle</b> seçeneğine tıklayın ve istediğiniz dili seçin</li><li>Kurulu dile tıklayın ve <b>Dil seçenekleri</b> sayfasını açın</li><li><b>Konuşma</b> altında, konuşma paketi için <b>İndir</b> düğmesine tıklayın</li></ol><p><b>⚠️ Lisans notu:</b> Crow Çeviri şu anda Windows Metin Konuşma altında yalnızca “Temel ses modelleri”ni destekler. “Seslendirici sesleri”nde bu uygulama ile uyumsuz lisans kısıtlamaları bulunmaktadır.</p>

# QtTTSProvider|
source: Windows TTS Voice Installation
tr: Windows Metin Konuşma Sesi Kurulumu
