Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/crow-translate_qt.po
Languages: tr

# Cli|
source: Display all language codes.
tr: Tüm dil kodlarını görüntüle.

# Cli|
source: Specify the source language (by default, engine will try to determine the language on its own).
tr: Kaynak dili belirt (Öntanımlı: Kendiliğinden algılama).

# Cli|
source: Specify the translation language(s), split by '+' (by default, the system language is used).
tr: Çeviri dillerini “+” ile ayırıp belirt (Öntanımlı: Sistem dili).

# Cli|
source: Specify the translator engine ('google', 'yandex', 'bing', 'libretranslate' or 'lingva'), Google is used by default.
tr: Çeviri işletkesini belirt (“google”, “yandex”, “bing”, “libretranslate” veya “lingva”). Öntanımlı olarak Google kullanılır.

# Cli|
source: Specify Mozhi instance URL. Instance URL from the app settings will be used by default.
tr: Mozhi örneği URL’sini belirtin. Öntanımlı olarak, uygulama ayarlarındaki örnek URL’si kullanılır.

# Cli|
source: Specify translation provider ('copy' or 'mozhi'). Provider from app settings will be used by default.
tr: Çeviri sağlayıcısını belirtin (“copy” veya “mozhi”). Öntanımlı olarak uygulama ayarlarındaki sağlayıcı kullanılır.

# Cli|
source: Specify TTS provider ('none', 'mozhi', 'qt', or 'piper'). Provider from app settings will be used by default.
tr: Metin Konuşma sağlayıcısını belirtin (“none”, “mozhi”, “qt” veya “piper”). Öntanımlı olarak uygulama ayarlarındaki sağlayıcı kullanılır.

# Cli|
source: Speak the translation.
tr: Çeviriyi konuş.

# Cli|
source: Speak the source.
tr: Kaynağı konuş.

# Cli|
source: Read source text from files. Arguments will be interpreted as file paths.
tr: Kaynak metni dosyadan oku. Argümanlar, dosya yolu olarak yorumlanır.

# Cli|
source: Add stdin data to source text.
tr: Kaynak metne stdin verisini ekle.

# Cli|
source: Do not print any text when using --%1 or --%2.
tr: --%1 veya --%2 kullanırken herhangi bir metin yazdırma.

# Cli|
source: Print only translations.
tr: Yalnızca çevirileri yazdır.

# Cli|
source: Print output formatted as JSON.
tr: Çıktıyı JSON olarak biçimlendir.

# Cli|
source: Application that allows to translate and speak text using various providers
tr: Çeşitli sağlayıcıları kullanarak çeviri yapmak ve metin konuşmak için bir uygulama

# Cli|
source: Text to translate. By default, the translation will be done to the system language.
tr: Çevrilecek metin. Öntanımlı olarak çeviri sistem diline yapılacaktır.

# Cli|
source: Error: For --%1 you must specify --%2 and/or --%3 options
tr: Hata: --%1 için --%2 ve/veya --%3 seçeneklerini belirtmelisiniz.

# Cli|
source: Error: Unknown source language code '%1'
tr: Hata: Bilinmeyen kaynak dil kodu “%1”

# Cli|
source: Error: Unknown translation language code '%1'
tr: Hata: Bilinmeyen çeviri dili kodu “%1”

# Cli|
source: Error: There is no text for translation
tr: Hata: Çevrilecek metin yok.

# Cli|
source: Error: Unknown translation provider '%1'
tr: Hata: Bilinmeyen çeviri sağlayıcısı “%1”

# Cli|
source: Detecting fastest instance
tr: En hızlı örnek algılanıyor

# Cli|
source: Error: Lingva engine is not supported
tr: Hata: Lingva işletkesi desteklenmiyor

# Cli|
source: Error: Unknown engine
tr: Hata: Bilinmeyen işletke.

# Cli|
source: Error: Unknown TTS provider '%1'
tr: Hata: Bilinmeyen metin konuşma sağlayıcısı “%1”

# Cli|
source: Error: %1
tr: Hata: %1

# Cli|
source: Translation error occurred
tr: Çevirme hatası oluştu

# Cli|
source: Error: TTS failed
tr: Hata: Metin konuşma yapılamadı

# Cli|
source: Error: You can't use --%1 with --%2
tr: Hata: --%2 ile --%1 kullanamazsınız.

# Cli|
source: Error: File does not exist: %1
tr: Hata: Dosya yok: %1

# Cli|
source: Error: Unable to open file: %1
tr: Hata: Dosya açılamıyor: %1

# ContextMenu|
source: Search on Forvo.com
tr: Forvo.com’da Ara

# InstancePinger|
source: Best instance URL is '%1' with time %2 ms
tr: En iyi örnek URL’si, %2 ms’lik değerle “%1”

# InstancePinger|
source: Ping to '%1' takes longer then %2 ms
tr: “%1” pinglemesi, %2 ms’den daha uzun sürüyor

# InstancePinger|
source: Ping to '%1' successful, response time: %2 ms
tr: “%1” pinglemesi başarılı, yanıt süresi: %2 ms

# InstancePinger|
source: Ping to '%1' failed, error: %2
tr: “%1” pinglemesi başarısız, hata: %2

# InstancePingerDialog|
source: Detecting fastest instance. Checking '%1'
tr: En hızlı örnek algılanıyor. “%1” denetleniyor

# LanguageButtonsWidget|
source: Window width is larger than screen due to the languages on the panel.
tr: Paneldeki dillerden dolayı pencere genişliği ekrandan daha büyük.

# LanguageButtonsWidget|
source: Please reduce added languages.
tr: Lütfen eklenen dillerin sayısını azaltın.

# LanguageButtonsWidget|
source: Auto
tr: Kendiliğinden

# LanguageButtonsWidget|
source: Edit languages
tr: Dilleri düzenle

# LanguagesDialog|
source: Filter (%1)
tr: Süzgeç (%1)

# LanguagesDialog|
source: Edit languages
tr: Dilleri düzenle

# LanguagesDialog|
source: Available languages:
tr: Kullanılabilir diller:

# LanguagesDialog|
source: Current languages:
tr: Geçerli diller:

# D-Bus|
source: D-Bus service %1 is already registered by another application
tr: D-Bus hizmeti %1, halihazırda başka bir uygulama tarafından kaydedilmiş

# D-Bus|
source: Unable to register D-Bus object for %1
tr: %1 için D-Bus nesnesi kaydedilemiyor

# QApplication|
source: OCR
tr: Optik Karakter Tanıma

# QApplication|
source: OCR image negated
tr: Optik karakter tanıma görseli negatiflendi

# QApplication|
source: OCR image is normal
tr: Optik karakter tanıma görseli normal

# Ocr|
source: OCR languages are not loaded
tr: Optik Karakter Tanıma Dilleri Yüklü Değil

# Ocr|
source: You should set at least one OCR language in the application settings
tr: Uygulama ayarlarında en az bir optik karakter tanıma dili ayarlamanız gerekir.

# MainWindow|
source: This application uses %1 to provide translations.
tr: Bu uygulama, çeviriler sağlamak için %1 kullanır.

# MainWindow|
source: While Mozhi acts as a proxy to protect your privacy, the third-party services it uses may store and analyze the text you send. Your instance right now is '%1', but you can change it in the translation settings. See instance details in the link above.
tr: Mozhi gizliliğinizi korumak için bir vekil görevi görürken, kullandığı üçüncü taraf hizmetler gönderdiğiniz metni depolayabilir ve çözümleyebilir. Şu anki örneğiniz “%1”; ancak bunu çeviri ayarlarından değiştirebilirsiniz. Yukarıdaki bağlantıdan örnek ayrıntılarına bakın.

# MainWindow|
source: Don't show again
tr: Bir daha gösterme

# TrayIcon|
source: Invalid tray icon
tr: Geçersiz tepsi simgesi

# TrayIcon|
source: The specified icon '%1' is invalid. The default icon will be used.
tr: Belirtilen simge “%1” geçersiz. Öntanımlı simge kullanılacak.

# Ocr|
source: Unable to set OCR languages
tr: Optik karakter tanıma dilleri ayarlanamıyor

# Ocr|
source: Unable to initialize Tesseract with %1
tr: Tesseract %1 ile ilklendirilemiyor

# MainWindow|
source: TTS Error
tr: Metin Konuşma Hatası

# MainWindow|
source: Text-to-Speech error: %1 Please check your TTS settings or try a different voice/locale.
tr: Metin konuşma hatası: %1 Metin konuşma ayarlarınızı denetleyin veya başka bir ses veya yerel ayar seçin.

# MainWindow|
source: Crow Translate
tr: Crow Çeviri

# MainWindow|
source: Translate
tr: Çevir

# MainWindow|
source: Swap languages
tr: Dilleri değiş–tokuş et

# MainWindow|
source: Source
tr: Kaynak

# MainWindow|
source: Cancel
tr: İptal

# MainWindow|
source: Copy source text to the clipboard
tr: Kaynak metni panoya kopyala

# MainWindow|
source: Recognize screen area with delay
tr: Ekran alanını gecikmeli olarak tanı

# MainWindow|
source: Auto-translation
tr: Anında çevir

# MainWindow|
source: Clear
tr: Temizle

# MainWindow|
source: Translation
tr: Çeviri

# MainWindow|
source: Copy translation to the clipboard
tr: Çeviriyi panoya kopyala

# MainWindow|
source: Copy all translation data to the clipboard
tr: Tüm çeviri verisini panoya kopyala

# MainWindow|
source: Translate screen area with delay
tr: Ekran alanını gecikmeli olarak çevir

# MainWindow|
source: Application settings
tr: Uygulama ayarları

# Ocr|
source: %1 is not a valid Tesseract parameter name.
tr: %1, geçerli bir Tesseract parametresi adı değil.

# AbstractScreenGrabber|
source: Unable to grab screen
tr: Ekran yakalanamıyor

# WaylandGnomeScreenGrabber|
source: GNOME failed to take screenshot.
tr: GNOME, ekran görüntüsü alamadı.

# WaylandPlasmaScreenGrabber|
source: Unable to create pipe: %1.
tr: Veriyolu oluşturulamıyor: %1

# WaylandPlasmaScreenGrabber|
source: Unable to detect active screen for screenshot
tr: Ekran görüntüsü için etkin ekran algılanamıyor

# WaylandPlasmaScreenGrabber|
source: Unable to wait for socket readiness: %1.
tr: Yuvanın hazır olup olmaması beklenemiyor: %1.

# WaylandPlasmaScreenGrabber|
source: Timeout reading from pipe.
tr: Veriyolundan okurken zaman aşımı.

# WaylandPlasmaScreenGrabber|
source: Unable to read data from socket: %1.
tr: Yuvadan veri okunamıyor: %1.

# WaylandPlasmaScreenGrabber|
source: Unable to determine target screen
tr: Hedef ekran algılanamıyor

# WaylandPlasmaScreenGrabber|
source: Failed to extract screen area from workspace
tr: Çalışma alanından ekran alanı çıkarılamadı

# WaylandPlasmaScreenGrabber|
source: Screenshot Permission Required
tr: Ekran Görüntüsü İzni Gerekli

# WaylandPlasmaScreenGrabber|
source: Crow Translate needs permission to take screenshots. Please grant permission in your system settings or use the interactive screenshot mode.
tr: Ekran görüntüsü alınabilmesi için Crow Çeviri’nin izninizi alması gerekiyor. Sistem ayarlarınızdan ilgili izni verin veya etkileşimli ekran görüntüsü kipini kullanın.

# WaylandPlasmaScreenGrabber|
source: Screenshot permission denied. Please grant permission in system settings or try interactive mode.
tr: Ekran görüntüsü izni reddedildi. Sistem ayarlarınızdan ilgili izni verin veya etkileşimli ekran görüntüsü kipini kullanın.

# WaylandPortalScreenGrabber|
source: Unable to subscribe to response from xdg-desktop-portal.
tr: xdg-desktop-portal’dan gelen yanıta abone olunamıyor.

# WaylandPortalScreenGrabber|
source: Received an empty path from xdg-desktop-portal.
tr: xdg-desktop-portal’dan boş bir yol alındı.

# SnippingArea|
source: Unable to snip screen area
tr: Ekran alanı kırpılamıyor

# SnippingArea|
source: Received an invalid image of screen %1.
tr: %1. ekranın geçersiz bir görseli alındı.

# SnippingArea|
source: Click and drag to draw a selection rectangle, or press Esc to quit
tr: Bir seçim dörtgeni çizmek için tıklayıp sürükleyin veya çıkmak için Esc’ye basın

# SnippingArea|
source: Confirm:
tr: Onayla:

# SnippingArea|
source: Release left-click
tr: Sol tıkı bırak

# SnippingArea|
source: Enter
tr: Giriş

# SnippingArea|
source: Double-click
tr: Çift tık

# SnippingArea|
source: Create new selection rectangle:
tr: Yeni seçim dörtgeni oluştur:

# SnippingArea|
source: Drag outside selection rectangle
tr: Seçim dörtgeninin dışına sürükle

# SnippingArea|
source: + Shift: Magnifier
tr: + Üst Karakter: Büyüteç

# SnippingArea|
source: Move selection rectangle:
tr: Seçim dörtgenini taşı:

# SnippingArea|
source: Drag inside selection rectangle
tr: Seçim dörtgeni içine sürükle

# SnippingArea|
source: Arrow keys
tr: Ok düğmeleri

# SnippingArea|
source: + Shift: Move in 1 pixel steps
tr: + Üst Karakter: 1 piksellik adımlarla taşı

# SnippingArea|
source: Resize selection rectangle:
tr: Seçim dörtgenini yeniden boyutlandır:

# SnippingArea|
source: Drag handles
tr: Sürükleme tutaçları

# SnippingArea|
source: Arrow keys + Alt
tr: Ok düğmeleri + Seçenek

# SnippingArea|
source: + Shift: Resize in 1 pixel steps
tr: + Üst Karakter: 1 piksellik adımlarla yeniden boyutlandır

# SnippingArea|
source: Reset selection:
tr: Seçimi sıfırla:

# SnippingArea|
source: Right-click
tr: Sağ tık

# SnippingArea|
source: Cancel:
tr: İptal:

# SnippingArea|
source: Esc key
tr: Esc düğmesi

# SnippingArea|
source: DPI Detection Error
tr: DPI Algılama Hatası

# SnippingArea|
source: Screen under cursor disappeared before we got dpi from it. Using primary screen for dpi information.
tr: Biz DPI’sini alana değin imlecin altındaki ekran kayboldu. DPI bilgisi için ana ekran kullanılıyor.

# OnlineTranslator|
source: Language detection is not supported for %1
tr: Dil algılaması %1 için desteklenmiyor

# OnlineTranslator|
source: Operation aborted by user
tr: İşlem, kullanıcı tarafından durduruldu

# OnlineTranslator|
source: %1 engine does not support TTS
tr: %1 işletkesi metin konuşmayı desteklemiyor

# OnlineTranslator|
source: Automatically detect
tr: Kendiliğinden algıla

# OnlineTranslator|
source: Afrikaans
tr: Afrikaanca

# OnlineTranslator|
source: Albanian
tr: Arnavutça

# OnlineTranslator|
source: Amharic
tr: Amharca

# OnlineTranslator|
source: Arabic
tr: Arapça

# OnlineTranslator|
source: Armenian
tr: Ermenice

# OnlineTranslator|
source: Assamese
tr: Assamca

# OnlineTranslator|
source: Aymara
tr: Aymaraca

# OnlineTranslator|
source: Azerbaijani
tr: Azerbaycanca

# OnlineTranslator|
source: Bajan
tr: Bajan Kreolü

# OnlineTranslator|
source: Balkan Gipsy
tr: Balkan Çingenecesi

# OnlineTranslator|
source: Bambara
tr: Bambara Dili

# OnlineTranslator|
source: Bangla
tr: Bengalce

# OnlineTranslator|
source: Bashkir
tr: Başkurtça

# OnlineTranslator|
source: Basque
tr: Baskça

# OnlineTranslator|
source: Belarusian
tr: Beyaz Rusça

# OnlineTranslator|
source: Bemba
tr: Bemba Dili

# OnlineTranslator|
source: Bhojpuri
tr: Arayanice

# OnlineTranslator|
source: Bislama
tr: Bislama Kreolü

# OnlineTranslator|
source: Bosnian
tr: Boşnakça

# OnlineTranslator|
source: Breton
tr: Bretonca

# OnlineTranslator|
source: Bulgarian
tr: Bulgarca

# OnlineTranslator|
source: Cantonese (Traditional)
tr: Kantonca (Geleneksel)

# OnlineTranslator|
source: Catalan
tr: Katalanca

# OnlineTranslator|
source: Cebuano
tr: Sabuanca

# OnlineTranslator|
source: Chamorro
tr: Çamorro Dili

# OnlineTranslator|
source: Chichewa
tr: Çevaca

# OnlineTranslator|
source: Chinese (Literary)
tr: Çince (Yazınsal)

# OnlineTranslator|
source: Chinese (Simplified)
tr: Çince (Basitleştirilmiş)

# OnlineTranslator|
source: Chinese (Traditional)
tr: Çince (Geleneksel)

# OnlineTranslator|
source: Chuvash
tr: Çuvaşça

# OnlineTranslator|
source: Comorian (Ngazidja)
tr: Komor Dili (Ngazidja)

# OnlineTranslator|
source: Coptic
tr: Kıptice

# OnlineTranslator|
source: Corsican
tr: Korsikaca

# OnlineTranslator|
source: Creole English (Antigua and Barbuda)
tr: Kreol İngilizcesi (Antigua ve Barbuda)

# OnlineTranslator|
source: Creole English (Bahamas)
tr: Kreol İngilizcesi (Bahamalar)

# OnlineTranslator|
source: Creole English (Grenadian)
tr: Kreol İngilizcesi (Granada)

# OnlineTranslator|
source: Creole English (Guyanese)
tr: Kreol İngilizcesi (Guyana)

# OnlineTranslator|
source: Creole English (Jamaican)
tr: Kreol İngilizcesi (Jamaika)

# OnlineTranslator|
source: Creole English (Vincentian)
tr: Kreol İngilizcesi (Vinsent)

# OnlineTranslator|
source: Creole English (Virgin Islands)
tr: Kreol İngilizcesi (Virjin Adaları)

# OnlineTranslator|
source: Creole French (Saint Lucian)
tr: Kreol Fransızcası (Saint Lucian)

# OnlineTranslator|
source: Creole French (Seselwa)
tr: Kreol Fransızcası (Seyşeller)

# OnlineTranslator|
source: Creole Portuguese (Upper Guinea)
tr: Kreol Portekizcesi (Yukarı Gine)

# OnlineTranslator|
source: Croatian
tr: Hırvatça

# OnlineTranslator|
source: Czech
tr: Çekçe

# OnlineTranslator|
source: Danish
tr: Danca

# OnlineTranslator|
source: Dari
tr: Darice

# OnlineTranslator|
source: Divehi
tr: Maldivce

# OnlineTranslator|
source: Dogri
tr: Dogri Dili

# OnlineTranslator|
source: Dutch
tr: Hollandaca

# OnlineTranslator|
source: Dzongkha
tr: Dzongkhaca

# OnlineTranslator|
source: Elvish (Sindarin)
tr: Elfçe (Sindarin)

# OnlineTranslator|
source: English
tr: İngilizce

# OnlineTranslator|
source: Esperanto
tr: Esperanto Dili

# OnlineTranslator|
source: Estonian
tr: Estonca

# OnlineTranslator|
source: Ewe
tr: Euece

# OnlineTranslator|
source: Fanagalo
tr: Fanagalo Dili

# OnlineTranslator|
source: Faroese
tr: Faroece

# OnlineTranslator|
source: Fijian
tr: Fijice

# OnlineTranslator|
source: Filipino
tr: Filipince

# OnlineTranslator|
source: Finnish
tr: Fince

# OnlineTranslator|
source: French
tr: Fransızca

# OnlineTranslator|
source: French (Canada)
tr: Fransızca (Kanada)

# OnlineTranslator|
source: Frisian
tr: Frizce

# OnlineTranslator|
source: Galician
tr: Galiçyaca

# OnlineTranslator|
source: Ganda
tr: Gandaca

# OnlineTranslator|
source: Georgian
tr: Gürcüce

# OnlineTranslator|
source: German
tr: Almanca

# OnlineTranslator|
source: Greek
tr: Yunanca

# OnlineTranslator|
source: Greek (Classical)
tr: Yunanca (Klasik)

# OnlineTranslator|
source: Guarani
tr: Guaranice

# OnlineTranslator|
source: Gujarati
tr: Güceratça

# OnlineTranslator|
source: Haitian Creole
tr: Haiti Kreolü

# OnlineTranslator|
source: Hausa
tr: Hausaca

# OnlineTranslator|
source: Hawaiian
tr: Hauaice

# OnlineTranslator|
source: Hebrew
tr: İbranice

# OnlineTranslator|
source: Hill Mari
tr: Dağlık Marice

# OnlineTranslator|
source: Hindi
tr: Hintçe

# OnlineTranslator|
source: Hmong
tr: Hmong Dili

# OnlineTranslator|
source: Hmong Daw
tr: Hmong Dili

# OnlineTranslator|
source: Hungarian
tr: Macarca

# OnlineTranslator|
source: Icelandic
tr: İzlandaca

# OnlineTranslator|
source: Igbo
tr: İgbo Dili

# OnlineTranslator|
source: Ilocano
tr: İlokano Dili

# OnlineTranslator|
source: Indonesian
tr: Endonezce

# OnlineTranslator|
source: Inuinnaqtun
tr: İnüak İnüitçesi

# OnlineTranslator|
source: Inuktitut
tr: İnüit Dili

# OnlineTranslator|
source: Inuktitut (Greenlandic)
tr: İnüit Dili (Grönland)

# OnlineTranslator|
source: Inuktitut (Latin)
tr: İnüit Dili (Latin)

# OnlineTranslator|
source: Irish
tr: İrlandaca

# OnlineTranslator|
source: Italian
tr: İtalyanca

# OnlineTranslator|
source: Japanese
tr: Japonca

# OnlineTranslator|
source: Javanese
tr: Javaca

# OnlineTranslator|
source: Kabuverdianu
tr: Yeşil Burun Kreolü

# OnlineTranslator|
source: Kabylian
tr: Kabilece

# OnlineTranslator|
source: Kannada
tr: Kannadaca

# OnlineTranslator|
source: Kazakh
tr: Kazakça

# OnlineTranslator|
source: Kazakh (Latin)
tr: Kazakça (Latin)

# OnlineTranslator|
source: Khmer
tr: Kmerce

# OnlineTranslator|
source: Kinyarwanda
tr: Ruandaca

# OnlineTranslator|
source: Kirundi
tr: Rundice

# OnlineTranslator|
source: Klingon (Latin)
tr: Klingonca (Latin)

# OnlineTranslator|
source: Konkani
tr: Konkani Dili

# OnlineTranslator|
source: Korean
tr: Korece

# OnlineTranslator|
source: Krio
tr: Krio Dili

# OnlineTranslator|
source: Kurdish (Central)
tr: Kürtçe (Merkezi)

# OnlineTranslator|
source: Kurdish (Northern)
tr: Kürtçe (Kuzey)

# OnlineTranslator|
source: Kurdish (Sorani)
tr: Kürtçe (Sorani)

# OnlineTranslator|
source: Kyrgyz
tr: Kırgızca

# OnlineTranslator|
source: Lao
tr: Laoca

# OnlineTranslator|
source: Latin
tr: Latince

# OnlineTranslator|
source: Latvian
tr: Letonca

# OnlineTranslator|
source: Lingala
tr: Lingala Dili

# OnlineTranslator|
source: Lithuanian
tr: Litvanca

# OnlineTranslator|
source: Lower Sorbian
tr: Aşağı Sorbça

# OnlineTranslator|
source: Luganda
tr: Lugandaca

# OnlineTranslator|
source: Luxembourgish
tr: Lüksemburgca

# OnlineTranslator|
source: Macedonian
tr: Makedonca

# OnlineTranslator|
source: Maithili
tr: Maitili Dili

# OnlineTranslator|
source: Malagasy
tr: Malgaşça

# OnlineTranslator|
source: Malay
tr: Malayca

# OnlineTranslator|
source: Malayalam
tr: Malayalamca

# OnlineTranslator|
source: Maltese
tr: Maltaca

# OnlineTranslator|
source: Manx Gaelic
tr: Manks Gaelcesi

# OnlineTranslator|
source: Marathi
tr: Maratice

# OnlineTranslator|
source: Mari
tr: Marice

# OnlineTranslator|
source: Marshallese
tr: Marşal Adaları Dili

# OnlineTranslator|
source: Meiteilon (Manipuri)
tr: Meitei Dili (Manipuri)

# OnlineTranslator|
source: Mende
tr: Mende Dili

# OnlineTranslator|
source: Mizo
tr: Mizo Dili

# OnlineTranslator|
source: Mongolian
tr: Moğolca

# OnlineTranslator|
source: Mongolian (Cyrillic)
tr: Moğolca (Kiril)

# OnlineTranslator|
source: Mongolian (Traditional)
tr: Moğolca (Geleneksel)

# OnlineTranslator|
source: Morisyen
tr: Morisyen Dili

# OnlineTranslator|
source: Myanmar (Burmese)
tr: Burmaca

# OnlineTranslator|
source: Māori
tr: Maorice

# OnlineTranslator|
source: Nepali
tr: Nepalce

# OnlineTranslator|
source: Niuean
tr: Niuece

# OnlineTranslator|
source: Norwegian
tr: Norveççe

# OnlineTranslator|
source: Nyanja
tr: Nyanya Dili

# OnlineTranslator|
source: Odia
tr: Oriya Dili

# OnlineTranslator|
source: Oromo
tr: Oromo Dili

# OnlineTranslator|
source: Palauan
tr: Palau Dili

# OnlineTranslator|
source: Papiamentu
tr: Papiamentu Dili

# OnlineTranslator|
source: Pashto
tr: Peştuca

# OnlineTranslator|
source: Persian
tr: Farsça

# OnlineTranslator|
source: Pijin
tr: Pijin Dili

# OnlineTranslator|
source: Polish
tr: Lehçe

# OnlineTranslator|
source: Portuguese (Brazilian)
tr: Portekizce (Brezilya)

# OnlineTranslator|
source: Portuguese (Portugal)
tr: Portekizce (Portekiz)

# OnlineTranslator|
source: Potawatomi
tr: Potavomice

# OnlineTranslator|
source: Punjabi
tr: Pencapça

# OnlineTranslator|
source: Quechua
tr: Keçuva Dili

# OnlineTranslator|
source: Querétaro Otomi
tr: Otomi Dili

# OnlineTranslator|
source: Romanian
tr: Rumence

# OnlineTranslator|
source: Rundi
tr: Rundi Dili

# OnlineTranslator|
source: Russian
tr: Rusça

# OnlineTranslator|
source: Samoan
tr: Samoaca

# OnlineTranslator|
source: Sango
tr: Sangoca

# OnlineTranslator|
source: Sanskrit
tr: Sanskritçe

# OnlineTranslator|
source: Scots Gaelic
tr: İskoç Gaelcesi

# OnlineTranslator|
source: Serbian (Cyrillic)
tr: Sırpça (Kiril)

# OnlineTranslator|
source: Serbian (Latin)
tr: Sırpça (Latin)

# OnlineTranslator|
source: Sesotho
tr: Soto Dili

# OnlineTranslator|
source: Sesotho sa Leboa
tr: Kuzey Soto Dili

# OnlineTranslator|
source: Setswana
tr: Tsvana Dili

# OnlineTranslator|
source: Shona
tr: Şona Dili

# OnlineTranslator|
source: Sindhi
tr: Sindce

# OnlineTranslator|
source: Sinhala
tr: Seylanca

# OnlineTranslator|
source: Slovak
tr: Slovakça

# OnlineTranslator|
source: Slovenian
tr: Slovence

# OnlineTranslator|
source: Somali
tr: Somalice

# OnlineTranslator|
source: Spanish
tr: İspanyolca

# OnlineTranslator|
source: Sranan Tongo
tr: Sranan Tongo Dili

# OnlineTranslator|
source: Sundanese
tr: Sundaca

# OnlineTranslator|
source: Swahili
tr: Suahili Dili

# OnlineTranslator|
source: Swedish
tr: İsveççe

# OnlineTranslator|
source: Syriac (Aramaic)
tr: Süryanice (Aramice)

# OnlineTranslator|
source: Tahitian
tr: Tahitice

# OnlineTranslator|
source: Tajik
tr: Tacikçe

# OnlineTranslator|
source: Tamashek (Tuareg)
tr: Tamaşek Dili (Tuareg)

# OnlineTranslator|
source: Tamil
tr: Tamilce

# OnlineTranslator|
source: Tatar
tr: Tatarca

# OnlineTranslator|
source: Telugu
tr: Teluguca

# OnlineTranslator|
source: Tetum
tr: Tetum Dili

# OnlineTranslator|
source: Thai
tr: Tayca

# OnlineTranslator|
source: Tibetan
tr: Tibetçe

# OnlineTranslator|
source: Tigrinya
tr: Tigrinya Dili

# OnlineTranslator|
source: Tokelauan
tr: Tokelau Dili

# OnlineTranslator|
source: Tongan
tr: Tongaca

# OnlineTranslator|
source: Tsonga
tr: Tsongaca

# OnlineTranslator|
source: Turkish
tr: Türkçe

# OnlineTranslator|
source: Turkmen
tr: Türkmence

# OnlineTranslator|
source: Tuvaluan
tr: Tuvalu Dili

# OnlineTranslator|
source: Twi
tr: Tui Dili

# OnlineTranslator|
source: Udmurt
tr: Udmurtça

# OnlineTranslator|
source: Ukrainian
tr: Ukraynaca

# OnlineTranslator|
source: Uma
tr: Uma Dili

# OnlineTranslator|
source: Upper Sorbian
tr: Yukarı Sorbça

# OnlineTranslator|
source: Urdu
tr: Urduca

# OnlineTranslator|
source: Uyghur
tr: Uygurca

# OnlineTranslator|
source: Uzbek (Cyrillic)
tr: Özbekçe (Kiril)
