Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/falkon._desktop_.po
Languages: tr

# Comment
source: A fast and secure web browser
tr: Hızlı ve güvenli bir web tarayıcısı

# GenericName
source: Web Browser
tr: Web Tarayıcısı

# Name
source: Open new tab
tr: Yeni Sekme Aç

# Name
source: Open new window
tr: Yeni Pencere Aç

# Name
source: Start private browsing
tr: Gizli Taramayı Başlat

# Name
source: AdBlock
tr: Reklam Engelle

# Comment
source: Blocks unwanted web content
tr: İstenmeyen web içeriğini engeller

# Name
source: Breeze
tr: Esinti

# Comment
source: Breeze Team
tr: Esinti Takımı

# Name
source: AutoScroll
tr: Otomatik Sarma

# Comment
source: Provides support for autoscroll with middle mouse button
tr: Orta fare düğmesiyle otomatik sarma desteği ekler

# Name
source: Hello Python
tr: Merhaba Python

# Comment
source: Example Python extension
tr: Örnek Python eklentisi

# Name
source: Hello Qml
tr: Merhaba QML

# Comment
source: Sample Qml Plugin
tr: Örnek QML eklentisi

# Name
source: MiddleClickLoader
tr: Orta Tık Yükleyicisi

# Comment
source: Load text in selection clipboard as URL
tr: Seçim metnini panoya URL olarak yükle

# Name
source: Dictionary
tr: Sözlük

# Comment
source: Search with...
tr: Şununla Ara…

# Name
source: Open with mpv
tr: mpv ile Aç

# Name
source: Translate page
tr: Sayfayı Çevir

# Name
source: Validate page
tr: Sayfayı Doğrula

# Name
source: Run Action
tr: Eylem Çalıştır

# Comment
source: Run various actions on sites
tr: Sitelerde çeşitli eylemleri çalıştır

# Comment
source: Chrome like theme for Falkon based on Firefox Chromifox theme
tr: Firefox Chromifox teması tabanlı, Falkon için Chrome benzeri tema

# Comment
source: Default simple theme for Linux using native widget style and some basic icons from desktop icon set
tr: Yerel araç takımı biçemini ve masaüstü simge kümesinden simgeler kullanarak Linux için yalın öntanımlı tema

# Comment
source: Mac like theme for Falkon based on Firefox Mac OS X theme
tr: Firefox macOS teması tabanlı, Falkon için Mac’e benzer tema

# Comment
source: Windows like theme based on Material design
tr: Material design tabanlı, Windows’a benzer tema
