Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/granatier._desktop_.po
Languages: tr

# Description
source: Clanbomber Import
tr: Clanbomber İçe Aktar

# Name
source: Big Block
tr: KBlock

# Name
source: Clanbomber Big Standard
tr: Clanbomber Büyük Standardı

# Name
source: Blast Matrix
tr: Patlama Matrisi

# Name
source: Bloody Ring
tr: Kanlı Yüzük

# Name
source: Boiling Egg
tr: Haşlama Yumurta

# Name
source: Bomb Attack
tr: Bomba Saldırısı

# Name
source: Broken Heart
tr: Kırık Kalp

# Name
source: Crammed
tr: Tıkabasa

# Name
source: Death Corridor
tr: Ölüm Koridoru

# Name
source: Dilemma
tr: İkilem

# Name
source: Fear Circle
tr: Korku Çemberi

# Name
source: Fear Circle Remix
tr: Korku Çemberi Remix

# Name
source: Fire Wheels
tr: Ateş Çarkları

# Name
source: Football
tr: Futbol

# Name
source: Four Instance
tr: KFourInLine

# Name
source: Hard Work
tr: Zor İş

# Name
source: Hole Run
tr: Deliğin Peşinde

# Name
source: Clanbomber Huge Standard
tr: Clanbomber En Büyük Standardı

# Name
source: Juicy Lucy
tr: Yılışık Hayriye

# Name
source: Kitchen
tr: Mutfak

# Name
source: Meeting
tr: Toplantı

# Name
source: Mungo Bane
tr: Mungo Felaketi

# Name
source: Obstacle Race
tr: Engelli Koşu

# Name
source: Overkill
tr: Aşırıya Kaçma

# Name
source: Prison Cells
tr: Hapis Hücreleri

# Name
source: Redirection
tr: Yeniden Yönlendirme

# Name
source: Sixty Nine
tr: Altmış Dokuz

# Name
source: Clanbomber Small Standard
tr: Clanbomber Küçük Standardı

# Name
source: Snake Race
tr: Yılan Oyunu

# Name
source: Clanbomber Tiny Standard
tr: Clanbomber En Küçük Standardı

# Name
source: Whole Mess
tr: Tam Karmaşa

# Name
source: The four-leaf clover
tr: Dört yapraklı yonca

# Description
source: The four-leaf clover is an uncommon variation of the common, three-leaved clover. According to tradition, such leaves bring good luck to their finders, especially if found accidentally. According to legend, each leaf represents something: the first is for hope, the second is for faith, the third is for love, and the fourth is for luck.
tr: Dört yapraklı yonca, alışılmış üç yapraklı yoncanın nadir bir çeşididir. Geleneğe göre, tesadüfen bulunduğunda bu yapraklar bulana şans getirir. Efsaneye göre, her yaprak bir şeyi temsil eder: ilki umut, ikincisi kader, üçüncüsü aşk ve sonuncusu da şanstır.

# Name
source: Crazy
tr: Çılgın

# Description
source: Crazy Arena
tr: Çılgın Arena

# Description
source: Default Granatier Arena
tr: Öntanımlı Granatier Arenası

# Name
source: Labyrinth
tr: Labirent

# Description
source: Labyrinth Arena
tr: Labirent Arena

# Name
source: Three of Three
tr: Üçün Üçü

# Description
source: Three of Three Arena
tr: Üçün Üçü Arenası

# Name
source: Player 1
tr: 1. Oyuncu

# Description
source: This is Player 1
tr: Bu 1. Oyuncu

# Name
source: Player 2
tr: 2. Oyuncu

# Description
source: This is Player 2
tr: Bu 2. Oyuncu

# Name
source: Player 3
tr: 3. Oyuncu

# Description
source: This is Player 3
tr: Bu 3. Oyuncu

# Name
source: Player 4
tr: 4. Oyuncu

# Description
source: This is Player 4
tr: Bu 4. Oyuncu

# Name
source: Player 5
tr: 5. Oyuncu

# Description
source: This is Player 5
tr: Bu 5. Oyuncu

# GenericName
source: Bomberman clone
tr: Bomberman Klonu

# Description
source: Clanbomber Theme
tr: Clanbomber Teması

# Description
source: Granatier Theme
tr: Granatier Teması

# Name
source: Water Bomb
tr: Su Bombası

# Description
source: Water Bomb Theme
tr: Su Bombası Teması
