Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/kapman._desktop_.po
Languages: tr

# GenericName
source: Pac-Man Clone
tr: Pac-Man Klonu

# Comment
source: Eat pills escaping ghosts
tr: Hayaletlerden kaçarken ilaçları yutun

# Name
source: Invisible
tr: Görünmez

# Description
source: Getting bored with Kapman? More than 100,000 points over level 20? Next step: the invisible maze!
tr: Kapman’dan sıkıldınız mı? 20. düzeyin üzerinde 100.000 puan mı aldınız? Bir sonraki düzey: Görünmez labirent!

# Name
source: Matches
tr: Eşleşmeler

# Description
source: A matches drawn maze
tr: Berabere kalınan labirent eşleşmesi

# Name
source: Mountain Adventure
tr: Dağ Macerası

# Description
source: Default
tr: Öntanımlı

# Name
source: Mummies Crypt
tr: Mumya Mahzeni

# Description
source: Avoid the mummies at all costs!
tr: Her koşulda mumyalardan sakının!

# Name
source: Retro
tr: Eski Moda

# Description
source: The old game theme revisited
tr: Eski oyun teması yeniden seçildi
