Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/karp.po
Languages: tr

source: PDF file to edit
tr: Düzenlenecek PDF dosyası

source: Select PDF files
tr: PDF Dosyaları Seç

source: QPDF is missing.
tr: QPDF eksik.

source: Ghostscript is missing.
tr: Ghostcript eksik.

source: Install programs mentioned above, otherwise not all functions will be available.
tr: Yukarıda belirtilen programları kurun; aksi takdirde tüm işlevler kullanılabilir olmayacaktır.

# @action:inmenu
source: Add PDF files
tr: PDF Dosyaları Ekle

# @action:inmenu
source: Clear all files
tr: Tüm Dosyaları Temizle

# @action:inmenu
source: Optimize PDF
tr: PDF Eniyile

# @action:inmenu
source: Reduce size
tr: Boyut Azalt

# @action:inmenu
source: Set password
tr: Parola Ayarla

# @action:inmenu
source: PDF metadata
tr: PDF Üst Verisi

source: KDE arranger for PDFs
tr: PDF Düzenleyicisi

source: (c) 2024-2025 The Karp Developers
tr: © 2024–2025 Karp Geliştiricileri

# NAME OF TRANSLATORS
source: Your names
tr: Emir SARI

# EMAIL OF TRANSLATORS
source: Your emails
tr: emir_sari@icloud.com

source: Title
tr: Başlık

source: Subject
tr: Konu

source: Author
tr: Yazar

source: Keyword
tr: Anahtar Sözcük

source: Producer
tr: Üretici

source: Creator
tr: Oluşturucu

source: Creation Date
tr: Oluşturulma Tarihi

source: Modification Date
tr: Değiştirilme Tarihi

source: Edit Chapter
tr: Faslı Düzenle

# @action:button
source: Remove
tr: Kaldır

# @action:button
source: Save
tr: Kaydet

# @action:button
source: Add
tr: Ekle

# @action:button
source: Cancel
tr: İptal

source: first
tr: ilk

# Edited bookmark/chapter points to page
source: points to page
tr: nokta/sayfa

source: last
tr: son

source: Add Chapter
tr: Fasıl Ekle

# @action:intoolbar
source: Expand All
tr: Tümünü Genişlet

# @action:intoolbar
source: Collapse All
tr: Tümünü Daralt

# @action:intoolbar
source: Clear Table of Contents
tr: İçindekiler Tablosunu Temizle

# @action:inmenu
source: Insert Above
tr: Yukarı Ekle

# @action:inmenu
source: Insert Below
tr: Aşağı Ekle

# @action:inmenu
source: Add Subsection
tr: Alt Bölüm Ekle

# @action:inmenu
source: Expand whole section
tr: Tüm bölümü Genişlet

# @action:inmenu
source: Collapse whole section
tr: Tüm Bölümü Daralt

source: Are you sure you'd like to remove all chapters?
tr: Tüm fasılları kaldırmak istediğinizden emin misiniz?

source: Page range
tr: Sayfa erimi

source: from
tr: şuradan:

source: to
tr: şuraya:

# @action:button
source: Move
tr: Taşı

# @combobox:before/after
source: before
tr: öncesi

# @combobox:before/after
source: after
tr: sonrası

# Move page range after/before (number)
source: page
tr: sayfa

source: %1 page
tr: %1 sayfa

source: Add all pages
tr: Tüm Sayfaları Ekle

source: Add selected pages
tr: Seçili Sayfaları Ekle

source: Remove from list
tr: Listeden Kaldır

source: Select pages to add
tr: Eklenecek Sayfalar Seç

# @title:dialog
source: Add and Arrange PDF files
tr: PDF Dosyaları Ekle ve Yerleştir

# @info:placeholder
source: Add one or more PDF file to proceed
tr: Sürdürmek için bir veya daha çok PDF dosyası ekleyin

# @action:button
source: Add PDF
tr: PDF Ekle

# @info
source: Total pages: %1
tr: Toplam sayfa: %1

# @action:button
source: Apply
tr: Uygula

source: PDF properties
tr: PDF Özellikleri

source: Output PDF
tr: PDF Çıktıla

source: Copy all metadata keys to output file
tr: Tüm üst veri anahtarlarını çıktı dosyasına kopyala

source: Double click to delete all metadata
tr: Tüm üst veriyi silmek için çift tıklayın

source: Double click to copy metadata into output PDF file.
tr: Üst veriyi çıktı PDF dosyasına kopyalamak için çift tıklayın.

source: Password required
tr: Parola Gerekli

source: Provide password to open file %1
tr: %1 dosyasını açmak için parolayı sağlayın

source: all pages in selected range
tr: seçili erimdeki tüm sayfalar

source: every %1 page
tr: her %1 sayfa

source: all pages out of range
tr: erim dışındaki tüm sayfalar

source: Simple PDF editor
tr: Basit PDF Düzenleyicisi

source: Quit
tr: Çık

# @action:inmenu
source: Save As...
tr: Farklı Kaydet…

# @action:inmenu
source: Save
tr: Kaydet

source: file
tr: dosya

source: PDF Options
tr: PDF Seçenekleri

# @action:inmenu
source: PDF Version
tr: PDF Sürümü

# like default PDF version
source: Default
tr: Öntanımlı

# PDF version
source: Version %1
tr: Sürüm %1

source: Set password
tr: Parola Ayarla

source: Protect PDF file with password.
tr: PDF dosyalarını parola ile koruyun.

# @action:intoolbar
source: Select pages to delete
tr: Silinecek sayfaları seç

# @action:intoolbar
source: Select pages to rotate
tr: Döndürülecek sayfaları seç

# @action:intoolbar
source: Select pages to move
tr: Taşınacak sayfaları seç

# @action:intoolbar
source: Table of Content (Bookmarks)
tr: İçindekiler (Yer İmleri)

# @action:intoolbar
source: Multiple pages selection
tr: Birden Çok Sayfa Seç

# @action:intoolbar
source: Show page labels
tr: Sayfa etiketlerini göster

# @action:intoolbar
source: Zoom Out
tr: Uzaklaştır

# @action:intoolbar
source: Zoom In
tr: Yakınlaştır

source: Page %1 of %2
tr: Sayfa %1/%2

source: Select pages to delete
tr: Silinecek Sayfaları Seç

# @action:button
source: Delete
tr: Sil

source: Select pages to rotate
tr: Döndürülecek Sayfaları Seç

# @action:button
source: Rotate
tr: Döndür

source: Angle
tr: Açı

source: Select pages to move
tr: Taşınacak Sayfaları Seç

source: Select one or more PDF files.
tr: Bir veya daha çok PDF dosyası seçin.

source: When more files is selected - order them first. Then arrange all pages: reorder, rotate, remove. At the end save new PDF with selected options.
tr: Daha fazla dosya seçildiğinde onları önce sıralayın. Sonrasında tüm sayfaları düzenleyin: Yeniden sıralayın, döndürün, kaldırın. En sonda yeni PDF’yi seçili seçeneklerle kaydedin.

source: Generating PDF file
tr: PDF dosyası üretiliyor…

source: Reducing PDF file size did not produce expected results!
tr: PDF dosyasını indirgemek beklenen sonucu vermedi!

source: Open file dialog at
tr: Dosya İletişim Kutusu Aç

source: Last opened directory
tr: Son açılan dizin

source: Fixed path
tr: Sabit yol

source: Default name for output PDF
tr: PDF çıktısı için öntanımlı ad

source: Always ask for file name
tr: Her zaman dosya adı sor

source: Combine with input file name
tr: Girdi dosyası adıyla kombine et

source: Append
tr: Sonuna iliştir

source: Prepend
tr: Önüne iliştir

source: It will produce: <b>%1filename%2.pdf</b>
tr: Üretilecek ad: <b>%1dosyaadı%2.pdf</b>

source: PDF Tools
tr: PDF Araçları

source: Qpdf lets you arrange pages in edited PDF files.
tr: QPDF, düzenlenmiş PDF dosyalarındaki sayfaların sırasını değiştirmenize olanak tanır.

source: Force PDF version of generated file
tr: Üretilen dosyanın PDF sürümünü zorla

source: When set to default, PDF version of input file will be used.
tr: Öntanımlı olarak ayarlandığında, girdi dosyasının PDF sürümü kullanılacaktır.

source: default
tr: öntanımlı

source: not found
tr: bulunamadı

source: Ghostscript manages size and quality of output PDF file.
tr: Ghostscript, PDF çıktı dosyasının boyutunu ve kalitesini yönetir.

# @action:button Category in settings
source: General
tr: Genel

# @action:button Category in settings
source: PDF tools
tr: PDF Araçları

# @action:button
source: About Karp
tr: Karp Hakkında

# @action:button
source: About KDE
tr: KDE Hakkında
