Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/kcm_snap.po
Languages: tr

source: No error
tr: Hata yok

source: Unknown error occurred
tr: Bilinmeyen bir hata oluştu

source: Not able to connect to snapd
tr: snapd’ye bağlanılamıyor

source: An error occurred while writing to snapd
tr: snapd’ye yazarken bir hata oluştu

source: An error occurred while reading from snapd
tr: snapd’den okurken bir hata oluştu

source: Snapd did not understand the request that was sent
tr: snapd, gönderilen isteği anlamadı

source: The response received from snapd was not understood
tr: snapd’den alınan yanıt anlaşılamadı

source: The requested operation requires super user password
tr: İstenen işlem süper kullanıcı parolasını gerektiriyor

source: The provided super user password is invalid
tr: Sağlanan süper kullanıcı parolası geçersiz

source: Login requires a two-factor code
tr: Oturum açma, bir iki aşamalı kod gerektiriyor

source: The two-factor code provided at login is invalid
tr: Oturum açarken sağlanan iki aşamalı kod geçersiz

source: This user account is not permitted to perform the requested operation
tr: Bu kullanıcı hesabına istenilen işlemi gerçekleştirmesi için izin verilmiyor

source: An unspecified error occurred while communicating with snapd
tr: snapd ile iletişim kurarken belirtilmeyen bir hata oluştu

source: This user has not accepted the store’s terms of service
tr: Bu kullanıcı mağazanın kullanım koşullarını kabul etmemiş

source: This user has not configured a payment method
tr: Bu kullanıcı bir ödeme yöntemi yapılandırmamış

source: This user has had their payment method declined by the payment provider
tr: Bu kullanıcının ödemi yöntemi ödeme sağlayıcısı tarafından reddedilmiş

source: The requested snap is already installed
tr: İstenen Snap halihazırda kurulu

source: The requested snap is not installed
tr: İstenen Snap kurulu değil

source: No update is available for this snap
tr: Bu Snap için kullanılabilir bir güncelleme yok

source: Provided password is not valid
tr: Sağlanan parola geçerli değil

source: This snap needs to be installed using devmode
tr: Bu Snap’in geliştirme kipi kullanılarak kurulması gerekiyor

source: This snap needs to be installed using classic mode
tr: Bu Snap’in klasik kip kullanılarak kurulması gerekiyor

source: A classic system is required to install this snap
tr: Bu Snap’i kurmak için bir klasik sistem gerekiyor

source: Operation was cancelled
tr: İşlem iptal edildi

source: A bad query was provided
tr: Hatalı bir sorgu sağlandı

source: A timeout occurred during the request
tr: İstek sırasında bir zaman aşımı oluştu

source: The requested snap couldn’t be found
tr: İstenen Snap bulunamadı

source: The requested snap is not in the store
tr: İstenen Snap mağazada yok

source: Authentication was cancelled by the user
tr: Kimlik doğrulama kullanıcı tarafından iptal edildi

source: Snap not compatible with classic mode
tr: Snap klasik kiple uyumlu değil

source: Requested snap revision not available
tr: İstenen Snap revizyonu kullanılabilir değil

source: Requested snap channel not available
tr: İstenen Snap kanalı kullanılabilir değil

source: The given snap or directory does not look like a snap
tr: Verilen Snap veya dizin bir Snap gibi görünmüyor

source: A hostname failed to resolve during the request
tr: İstek sırasında bir makine adı çözülemedi

source: A requested configuration option is not set
tr: İstenen bir yapılandırma seçeneği ayarlı değil

source: The requested app couldn't be found
tr: İstenen uygulama bulunamadı

source: No snap revision on specified architecture
tr: Belirtilen mimari için bir Snap revizyonu yok

source: The requested operation would conflict with currently ongoing change
tr: İstenen işlem şu anda süren işlemle çakışacaktır

source: The requested interface has not changed
tr: İstenen arayüz değişmemiş

source: Unknown error code
tr: Bilinmeyen hata kodu

source: Error
tr: Hata

source: Snap Applications
tr: Snap Uygulamalar

source: Install snaps to change the permissions
tr: İzinlerini değiştirmek için Snap’ler kurun

source: Permissions
tr: İzinler

source: Permissions for %1
tr: %1 İzinleri

source: Select an application from the list to view its permissions here
tr: Burada izinlerini görüntülemek için listeden bir uygulama seçin
