Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/kdepim-runtime._desktop_.po
Languages: tr

# Comment
source: KDE e-mail client
tr: KDE e-posta istemcisi

# Name
source: KDE Mail
tr: KDE E-posta

# Name
source: E-mail successfully sent
tr: E-posta Gönderildi

# Name
source: E-mail sending failed
tr: E-posta Gönderilemedi

# Name
source: Mail Dispatcher Agent
tr: E-posta Yönetim Aracı

# Comment
source: Dispatches email messages
tr: E-posta iletilerini yollar

# Name
source: Migration Agent
tr: Göç Aracısı

# Comment
source: New email notify
tr: Yeni e-posta bildirimi

# Name
source: New email notify
tr: Yeni E-posta Bildirimi

# Name
source: New email arrived
tr: Yeni E-posta Alındı

# Name
source: New Email Notifier
tr: Yeni E-posta Bildirimi

# Comment
source: Notifications about newly received emails
tr: Yeni gelen e-postalar için bildirimler

# Name
source: Personal Contacts
tr: Kişisel Bağlantılar

# Name
source: Personal Calendar
tr: Kişisel Takvim

# Name
source: Notes
tr: Notlar

# Name
source: AkoNotes
tr: AkoNotlar

# Comment
source: Loads a notes hierarchy from a local maildir folder
tr: Yerel bir maildir klasöründen not hiyerarşisini yükler

# Name
source: Birthdays & Anniversaries
tr: Doğum Günleri ve Yıldönümleri

# Comment
source: Provides access to birthday and anniversary dates of contacts in your address book as calendar events
tr: Adres defterindeki kişilerin doğum günleri ve yıl dönümlerine takvim olayları olarak erişmeyi sağlar

# Comment
source: The address book with personal contacts
tr: Kişisel bağlantıları içeren adres defteri

# Name
source: DAV groupware resource
tr: DAV Groupware Özkaynağı

# Comment
source: Resource to manage DAV calendars and address books (CalDAV, CardDAV)
tr: "DAV takvim ve adres defterlerini yönetmek için özkaynak (CalDAV, CardDAV)"

# Name
source: ownCloud (> 5.0 and < 9.0)
tr: ownCloud (> 5.0 ve < 9.0)

# Name
source: EteSync Groupware Resource
tr: EteSync Groupware Özkaynağı

# Comment
source: Access your encrypted EteSync calendars, contacts and tasks from KDE
tr: EteSync takvimlerinize, kişilerinize ve görevlerinize KDE’den erişin

# Comment
source: Microsoft Exchange Server (EWS)
tr: Microsoft Exchange Sunucusu (EWS)

# Name
source: Microsoft Exchange authentication expired
tr: Microsoft Exchange Kimlik Doğrulaması Doldu

# Comment
source: Credentials used to access Microsoft Exchange are no longer valid
tr: Microsoft Exchange’e erişmek için kullanılan kimlik doğrulama bilgileri artık geçerli değil

# Name
source: Microsoft Exchange Server (EWS) Mail Transport
tr: Microsoft Exchange Suncusu (EWS) Mail Taşıması

# Comment
source: Allows sending e-mail through the Microsoft Exchange server using EWS
tr: EWS kullanarak Microsoft Exchange sunucu üzerinde e-posta göndermeye izin verir

# Name
source: Microsoft Exchange Server (EWS)
tr: Microsoft Exchange Sunucusu (EWS)

# Comment
source: Provides access to mail, appointments tasks and contacts of a Microsoft Exchange server using EWS
tr: EWS kullanarak bir Microsoft Exchange sunucusunun postalarına, randevularına ve kişilerine erişmenizi sağlar

# Comment
source: Access your Google Calendars, Contacts and Tasks from KDE
tr: Google Takvimlerinize, Kişilerinize ve Görevlerinize KDE’den erişin

# Name
source: Google Groupware needs to authenticate
tr: Google Groupware’in Kimlik Doğrulaması Gerekiyor

# Comment
source: Google Groupware has been logged off and needs to be reauthenticated
tr: Google Groupware oturumu kapattı ve yeniden kimlik doğrulaması gerekiyor

# Name
source: iCal Calendar Folder
tr: iCal Takvim Klasörü

# Comment
source: Provides access to calendar items, each stored in a single file, in a given directory
tr: Belirtilen dizinde tek bir yerel dosyada depolanmış bir alarm takvimine erişim sağlar

# Name
source: iCal Calendar File
tr: iCal Takvim Dosyası

# Comment
source: Loads data from an iCal file
tr: iCal dosyasından veri yükler

# Comment
source: Loads data from a notes file
tr: Bir not dosyasından veri yükler

# Name
source: IMAP E-Mail Server
tr: IMAP E-posta Sunucusu

# Comment
source: Connects to an IMAP e-mail server
tr: IMAP e-posta sunucusuna bağlanır

# Name
source: Emails
tr: E-postalar

# Name
source: Kolab Groupware Server
tr: Kolab Groupware Sunucusu

# Comment
source: Provides access to Kolab groupware folders and e-mail on a Kolab IMAP Server.
tr: Kolab Groupware klasörlerine ve Kolab IMAP sunucusuna erişim sağlar

# Comment
source: Loads data from a local maildir folder
tr: Yerel maildir klasöründen veri yükleme aracı

# Comment
source: Loads data from a local mbox file
tr: Yerel mbox dosyasından veri yükler

# Name
source: KMail Mail Folder
tr: K Posta Posta Klasörü

# Comment
source: Loads data from a local KMail mail folder
tr: Yerel K Posta posta klasöründen veri yükleme aracı

# Name
source: Open-Xchange Groupware Server
tr: Open-Xchange Groupware Sunucusu

# Comment
source: Provides access to the appointments, tasks, and contacts of an Open-Xchange groupware server.
tr: Open-Xchange groupware sunucusundaki toplantı, yapılacak iş ve kişilere erişimi sağlar.

# Comment
source: POP3 Resource
tr: POP3 Kaynağı

# Name
source: Error While Checking Mail
tr: Posta Denetlenemedi

# Comment
source: There was an error while checking for new mail
tr: Yeni e-postalar denetlenirken bir hata oluştu

# Name
source: POP3 E-Mail Server
tr: POP3 E-posta Sunucusu

# Comment
source: Connects to a POP3 e-mail server
tr: POP3 e-posta sunucusuna bağlanır

# Name
source: Akonadi TomboyNotes Resource
tr: Akonadi TomboyNotes Kaynağı

# Comment
source: Resource for Tomboy compatible notes server
tr: Tomboy uyumlu not sunucusu için kaynak

# Name
source: vCard Directory
tr: VCard Dizini

# Comment
source: Loads data from a directory with vCards
tr: VCard dosyaları bulunan bir dizinden verileri yükler

# Name
source: vCard File
tr: VCard Dosyası

# Comment
source: Loads data from a vCard file
tr: Bir VCard dosyasından veri yükler
