Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/kdeplasma-addons._json_.po
Languages: tr

# Name
source: Binary Clock
tr: İkili Saat

# Name
source: Calculator
tr: Hesap Makinesi

# Name
source: Color Picker
tr: Renk Seçicisi

# Name
source: Comic Strip
tr: Çizgi Roman Şeridi

# Name
source: Dictionary
tr: Sözlük

# Name
source: Disk Quota
tr: Disk Kotası

# Name
source: Fifteen Puzzle
tr: Onbeşli Yapboz

# Name
source: Fuzzy Clock
tr: Belirsiz Saat

# Name
source: Grouping Plasmoid
tr: Gruplayan Plasmoid

# Name
source: Kate Sessions
tr: Kate Oturumları

# Name
source: Lock Keys Status
tr: Kilit Düğmeleri Durumu

# Name
source: Application Dashboard
tr: Uygulama Gösterge Tablosu

# Name
source: Konsole Profiles
tr: Konsol Profilleri

# Name
source: Media Frame
tr: Ortam Çerçevesi

# Name
source: Sticky Note
tr: Yapışkan Not

# Name
source: Quicklaunch
tr: Hizlı Başlat

# Name
source: Timer
tr: Sayaç

# Name
source: User Switcher
tr: Kullanıcı Değiştiricisi

# Name
source: Weather Report
tr: Hava Durumu Raporu

# Name
source: Web browser
tr: Web Tarayıcısı

# Name
source: Cube
tr: Küp

# Name
source: Large Icons
tr: Büyük Simgeler

# Name
source: Compact
tr: Kompakt

# Name
source: Cover Switch
tr: Kapak Değiştirici

# Name
source: Flip Switch
tr: Anahtarı Ters Çevir

# Name
source: Sidebar
tr: Kenar Çubuğu

# Name
source: Alternate Calendar
tr: Alternatif Takvim

# Name
source: Astronomical Events
tr: Gökbilimsel Olaylar

# Name
source: Special Characters
tr: Özel Karakterler

# Name
source: Unit Converter
tr: Birim Dönüştürücüsü

# Name
source: Date and Time
tr: Tarih ve Zaman

# Name
source: Spell Checker
tr: Yazım Denetimi

# Name
source: Picture of the Day
tr: Günün Resmi

# Name
source: Astronomy (NASA)
tr: Gökbilim (NASA)

# Name
source: Weather Satellite (NOAA)
tr: Hava Durumu Uydusu (NOAA)

# Name
source: Simon Stålenhag Wallpapers
tr: Simon Stålenhag Duvar Kağıtları

# Description
source: Time displayed in binary format
tr: İkili biçimde gösterilen zaman

# Description
source: Calculate simple sums
tr: Yalın toplamları hesapla

# Description
source: Pick a color from the desktop
tr: Masaüstünden bir renk seç

# Description
source: View comic strips from the Internet
tr: İnternetten çizgi roman şeritlerini görüntüle

# Description
source: Look up the meaning of words and their translation into different languages
tr: Sözcüklerin anlamlarına ve diğer dillerdeki çevirilerine bak

# Description
source: Shows details about disk quota
tr: Disk kotası hakkında ayrıntılar göster

# Description
source: Put the pieces in order
tr: Parçaları sıraya koy

# Description
source: Time displayed in a less precise format
tr: Daha az kesin bir biçimde görüntülenen zaman

# Description
source: Group Plasma widgets together
tr: Plasma araç takımlarını grupla

# Description
source: Kate Session Launcher
tr: Kate Oturumu Başlatıcısı

# Description
source: Shows whether Caps Lock or Num Lock are active
tr: Büyük Harf veya Sayı Kilidi’nin etkin olup olmadığını gösterir

# Description
source: A fullscreen application launcher
tr: Tam ekran uygulama başlatıcısı

# Description
source: List and launch Konsole profiles
tr: Konsole profillerini listele ve çalıştır

# Description
source: (Picture) Frame
tr: (Resim) Çerçeve(si)

# Description
source: Desktop sticky note
tr: Masaüstü yapışkan notu

# Description
source: Launch your favourite Applications
tr: Favori uygulamalarınızı çalıştır

# Description
source: Countdown over a specified time period
tr: Belirli bir zamandan geriye say

# Description
source: Quickly switch between different users
tr: Farklı kullanıcılar arasında tez geçiş yap

# Description
source: Forecast and current conditions
tr: Hava tahmini ve geçerli durum

# Description
source: Add a webpage on your desktop.
tr: Masaüstünüze bir web sayfası ekleyin

# Description
source: Arrange desktops in a virtual cube
tr: Masaüstlerini sanal bir küp biçiminde düzenleyin

# Description
source: A window switcher layout using large icons to represent the window
tr: Pencereyi göstermek için büyük simgeler kullanan bir pencere değiştirici yerleşimi

# Description
source: A compact window switcher layout
tr: Sıkışık bir pencere değiştirici yerleşimi

# Description
source: A Window Switcher layout showing thumbnails as a 3D carousel
tr: Küçük görselleri 3B atlıkarınca olarak gösteren bir pencere değiştirici yerleşimi

# Description
source: A Window Switcher layout showing thumbnails as a 3D card deck
tr: Küçük görselleri 3B kart destesi olarak gösteren bir pencere değiştirici yerleşimi

# Description
source: Window switcher layout using a vertical sidebar
tr: Dikey bir kenar çubuğu kullanan pencere değiştirici yerleşimi

# Description
source: Calendar plugin for displaying dates from the alternate calendar system
tr: Alternatif takvim sisteminden tarihleri görüntülemek için takvim eklentisi

# Description
source: Calendar plugin for displaying astronomical events
tr: Gökbilimsel olayları görüntülemek için takvim eklentisi

# Description
source: Creates special characters from their hexadecimal codes
tr: Onaltılık kodlarından özel karakterler oluşturur

# Description
source: Convert values to different units
tr: Değerleri değişik birimlere dönüştür

# Description
source: The current date and time, locally or in any timezone
tr: Geçerli tarih ve zaman, yerel olarak veya değişik zaman dilimlerinde

# Description
source: Define words
tr: Sözcükleri tanımla

# Description
source: Matches Kate Sessions
tr: Kate oturumlarını eşleştirir

# Description
source: Matches Konsole Profiles
tr: Konsole profillerini eşleştirir

# Description
source: Check the spelling of a word
tr: Bir sözcüğün yazımını denetle

# Description
source: Haenau wallpaper
tr: Haenau duvar kağıdı

# Description
source: Hunyango wallpaper
tr: Hunyango duvar kağıdı

# Description
source: A new picture from the Internet each day
tr: Her gün internetten yeni bir resim

# Description
source: Plugin for Plasma PoTD Engine
tr: Plasma PoTD İşletkesi Eklentisi

# Authors Name
source: Reza Fatahilah Shah
tr: Reza Fatahilah Şah

# Authors Name
source: The Plasma Team
tr: Plasma Takımı

# Authors Name
source: Mikhail Ivchenko
tr: Mihail İvçenko

# Authors Name
source: KDE Visual Design Group
tr: KDE Görsel Tasarım Grubu

# Authors Name
source: Plasma Team
tr: Plasma Takımı

# Authors Name
source: Weng Xuetian
tr: Veng Şütian
