Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/kget._desktop_.po
Languages: tr

# Name
source: KGet Plugin
tr: K İndir Eklentisi

# Comment
source: Plugin for KGet
tr: K İndir için Eklenti

# Name
source: Download with KGet
tr: K İndir ile İndir

# Name
source: KGet
tr: K İndir

# GenericName
source: Download Manager
tr: İndirme Yöneticisi

# Comment
source: KGet is a versatile and user-friendly download manager
tr: K İndir, çok kapsamlı ve kullanıcı dostu bir indirme yöneticisidir

# Comment
source: KGet Download Manager
tr: K İndir İndirme Yöneticisi

# Name
source: Transfer Added
tr: Aktarım Eklendi

# Comment
source: A new download has been added
tr: Yeni dosya eklendi

# Name
source: Download Started
tr: İndirme İşlemi Başladı

# Comment
source: Downloading started
tr: Dosya indirme başladı

# Name
source: Download Finished
tr: İndirme İşlemi Bitti

# Comment
source: Downloading finished
tr: Dosya indirme tamamlandı

# Name
source: All Downloads Finished
tr: Tüm İndirme İşlemleri Tamamlandı

# Comment
source: All downloads finished
tr: Tüm dosyaların indirilmesi tamamlandı

# Name
source: Error Occurred
tr: Hata Oluştu

# Comment
source: An Error has Occurred
tr: Bir Hata Oluştu

# Name
source: Information
tr: Bilgiler

# Comment
source: User Notified of Information
tr: Kullanıcıya Bildirilen Bilgiler
