Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/kgoldrunner._desktop_.po
Languages: tr

# Name
source: KGoldrunner
tr: K Altın Avı

# GenericName
source: Hunt Gold, Dodge Enemies and Solve Puzzles
tr: Altın Avla, Düşmanlarını Atlat ve Bulmacaları Çöz

# Comment
source: A game of action and puzzle-solving
tr: Aksiyon ve bulmaca çözümlerini barındıran bir oyun

# Name
source: Black on White
tr: Beyaz üzerine Siyah

# Description
source: A monochrome, black on white theme for KGoldrunner
tr: K Altın Avı için beyaz üzerine siyah, tek renkli bir tema

# Name
source: KGoldRunner Default
tr: K Altın Avı Öntanımlı

# Description
source: A light and clean theme for KDE4
tr: KDE 4 için aydınlık ve temiz bir tema

# Name
source: The Treasure of Egypt
tr: Mısır'ın Hazineleri

# Description
source: Help Matt Goldrunner escape the traps of ancient Egypt.
tr: Mert Altınpeşinde'ye eski Mısır'ın tuzaklarından kurtulmakta yardımcı olun.

# Name
source: Geek City
tr: Geek Şehri

# Description
source: The hero is trapped inside a computer.
tr: Bir kahraman bilgisayarın içinde mahsur kaldı.

# Name
source: Nostalgia Blues
tr: Nostalji Mavisi

# Description
source: A theme for KGoldrunner that brings back that 8-bit look... now in blue!
tr: K Altın Avı'na 8-bit görünümünü geri getiren bir tema... Hem de şimdi mavi!

# Name
source: Nostalgia
tr: Nostalji

# Description
source: A scalable theme for KGoldrunner that brings back that 8-bit look...
tr: K Altın Avı'na 8-bit görünümünü geri getiren ölçeklenebilir bir tema...
