Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/kmahjongg._desktop_.po
Languages: tr

# Name
source: 4 Winds
tr: 4 Rüzgar

# Description
source: A layout resembling a fortress
tr: Kaleyi andıran bir yerleşim

# Name
source: Alien
tr: Uzaylı

# Description
source: A humanoid made up of Mahjongg tiles
tr: Mahjongg taşlarından yapılan insansı bir robot

# Name
source: Altar
tr: Sunak

# Description
source: An elevated surface with stairs and columns aside
tr: Merdivenler ve kenarda kolonlarıyla yerden yükseltilen bir yüzey

# Description
source: Circular-aligned seats around a performance area
tr: Gösteri alanı çevresinde daire şeklinde dizili oturaklar

# Name
source: Arrow
tr: Ok

# Description
source: A big arrow pointing in the right direction
tr: Doğru yönü gösteren büyük bir ok

# Description
source: The starship-city from Stargate Atlantis
tr: Yıldız Kapısı Atlantis'ten bir uzaygemisi-şehri

# Description
source: A layout resembling Aztec buildings
tr: Aztek binalarını andıran bir yerleşim

# Name
source: Balance
tr: Denge

# Description
source: Time to weight every decision carefully!
tr: Alınan her kararı dikkatle ölçüp tartma zamanı!

# Name
source: Bat
tr: Yarasa

# Description
source: A bat-shaped layout
tr: Yarasa şeklinde bir yerleşim

# Name
source: Bug
tr: Hata

# Description
source: The bug. Let us take it apart!
tr: Hata. Bize bırakın!

# Name
source: Castle View
tr: Kale Görünümü

# Description
source: A castle as viewed from one side
tr: Bir taraftan göründüğü şekilde bir kale görünümü

# Name
source: Castle
tr: Kale

# Description
source: Vista-styled castle layout
tr: Manzara-stilli kale yerleşimi

# Name
source: Cat
tr: Kedi

# Description
source: Vista-styled cat layout
tr: Manzara-stilli kedi yerleşimi

# Name
source: Chains
tr: Zincirler

# Description
source: Four chains making up a single structure
tr: Tek bir yapı meydana getiren dört zincir

# Name
source: Checkered
tr: Damalı

# Description
source: What if the chess board was not square?
tr: Peki ya satranç tahtası kare olmasaydı ne olurdu?

# Name
source: Chip
tr: Yonga

# Description
source: An electronic component with many connectors
tr: Birçok bağlantı parçası olan elektronik bir bileşen

# Name
source: Clubs
tr: Sinek

# Description
source: A layout resembling a multitude of card clubs
tr: Sinek destesini temsilen bir yerleşim

# Name
source: Columns
tr: Sütunlar

# Description
source: A circular arena covered with columns of varying height
tr: Değişen boylarda kolonlarla kaplı dairesel bir arena

# Name
source: Crab
tr: Yengeç

# Description
source: Vista-styled crab layout
tr: Manzara tarzı yengeç yerleşimi

# Name
source: Cross
tr: Haç

# Description
source: A six-ended cross resembling the Cyrillic letter Zh
tr: Kiril alfabesi harfi J'yi temsil eden 6 uçlu haç

# Name
source: Default
tr: Öntanımlı

# Description
source: Default KMahjongg game layout
tr: Öntanımlı K Mahjongg oyun yerleşimi

# Name
source: Dragon
tr: Ejderha

# Description
source: Vista-styled dragon layout
tr: Manzara tarzı ejderha yerleşimi

# Name
source: Eagle
tr: Kartal

# Description
source: A large carnivore bird in Mahjongg tiles
tr: Mahjongg taşlarında bulunan büyük etobur bir kuş

# Name
source: Enterprise
tr: Kuruluş

# Description
source: A layout for Star Trek fans
tr: Star Trek meraklıları için bir yerleşim

# Name
source: Explosion
tr: Patlama

# Description
source: Something has exploded. Collect the pieces.
tr: Bir şeyler patladı. Parçaları toplayın.

# Name
source: Flowers
tr: Çiçekler

# Description
source: A layout consisting of six flowers
tr: Altı çiçekten oluşan bir yerleşim

# Name
source: Future
tr: Gelecek

# Description
source: An abstract image resembling an asterisk
tr: Yıldız işareti(asteriks) şeklinde bir yerleşim planı

# Name
source: Galaxy
tr: Galaksi

# Description
source: Diversely sized piles of matter
tr: Muhtelif boyutlarda madde yığınları

# Name
source: Garden
tr: Bahçe

# Description
source: Regular patterns resembling a classical garden
tr: Klasik bir bahçeyi andıran düzenli desenler

# Name
source: Girl
tr: Kız

# Description
source: A layout resembling a girl's face
tr: Bir kızın yüzünü andıran bir yerleşim

# Name
source: Glade
tr: Açık Hava Alanı

# Description
source: A small piece of empty space surrounded by a forest
tr: Ormanlarla çevrili ufak bir açık hava alanı

# Name
source: Grid
tr: Izgara

# Description
source: A rectangular grid of varying height
tr: Değişen yüksekliklerde dikdörtgen bir ızgara

# Name
source: Helios
tr: Güneş

# Description
source: The greek Sun god's sign
tr: Eski Yunan Güneş Tanrısı'nın simgesi

# Name
source: Hole
tr: Delik

# Description
source: A pyramid with a hole in the middle
tr: Ortada deliği olan bir piramit

# Name
source: Inner Circle
tr: Gizli Daire

# Description
source: Concentric boxes with openings pointing in opposite directions
tr: Ters yönleri gösteren boşlukları olan eş merkezli kutular

# Name
source: Key
tr: Anahtar

# Description
source: A large key made of Mahjongg tiles
tr: Mahjongg taşlarından yapılan geniş bir anahtar

# Description
source: Letters K and M. Do you have your favourite extension for that?
tr: K ve M harfleri. Bunun için favori bir uzantınız var mı?

# Name
source: Labyrinth
tr: Labirent

# Description
source: A complex yet symmetric labyrinth
tr: Karmaşık ve hâlâ simetrik bir labirent

# Name
source: Mask
tr: Maske

# Description
source: A scary embossed pagan mask
tr: Korkunç şekilde süslenmiş bir putperest maskesi

# Description
source: A layout resembling Maya pyramids
tr: Maya piramitlerini temsilen bir yerleşim

# Name
source: Maze
tr: Labirent

# Description
source: An extremely twisted maze. Beware of minotaurs!
tr: Fazlasıyla burulmuş bir labirent. Minotorlardan (Yarı insan-yarı boğa yaratıklardan) sakının!

# Name
source: Mesh
tr: Tuzak

# Description
source: An interweaved structure made up of Mahjongg tiles
tr: Mahjongg taşlarından yapılan birleştirme bir yapı

# Name
source: Moth
tr: Güve

# Description
source: A layout representing a small flying insect
tr: Küçük uçan bir böceği temsilen bir yerleşim

# Name
source: Order
tr: Sıralama

# Description
source: A cross with thick ends
tr: Kalın uçları olan bir çubuk

# Name
source: Pattern
tr: Desen

# Description
source: A mysterious pattern atop rectangular blocks
tr: Dikdörtgen blokların üzerinde gizemli bir desen

# Name
source: Penta
tr: Beş

# Description
source: A fortress with five towers
tr: 5 kulesi olan bir kale

# Name
source: Pillars
tr: Sütunlar

# Description
source: A couple of vertical pillars supporting a flat surface
tr: Düz zemini destekleyen bir kaç dik sütun

# Name
source: Pirates
tr: Korsanlar

# Description
source: A sailing boat under the sun
tr: Güneşin altında yüzen bir gemi

# Name
source: Pyramid
tr: Piramit

# Description
source: Can you tear the pyramid apart?
tr: Piramidi parçalayabilir misiniz?

# Name
source: Rocket
tr: Roket

# Description
source: A rocket for you to launch off the board
tr: Bordadan ateşlemeniz için bir roket

# Name
source: Shield
tr: Kalkan

# Description
source: A shield and a sword made up of Mahjongg tiles
tr: Mahjongg taşlarından yapılan bir kalkan ve bir kılıç

# Name
source: Spider
tr: Örümcek

# Description
source: Vista-styled spider layout
tr: Manzara-stili örümcek yerleşimi

# Name
source: Squares
tr: Kareler

# Description
source: Concentric squares of alterating height
tr: Değişken yüksekliklerde eş merkezli kareler

# Name
source: Squaring
tr: Kareleme

# Description
source: Who said squares are flat?
tr: Kim karelerin düz olduğunu iddia etti ki?

# Name
source: Stadion
tr: Stadyum

# Description
source: A layout representing a football field
tr: Futbol sahasını temsilen bir yerleşim

# Name
source: Stairs
tr: Merdiven Basamakları

# Description
source: A staircase for those who dislike taking the same path twice
tr: Aynı yolu iki kere kat etmeyi sevmeyenler için bir merdiven

# Name
source: Star
tr: Yıldız

# Description
source: An asterisk-shaped embossed layout
tr: Yıldız şeklinde süslenen bir yerleşim

# Name
source: Star Ship
tr: Yıldız Aracı

# Description
source: A sci-fi space transport
tr: Bir bilim-kurgu uzay nakliye aracı

# Name
source: Stacks
tr: Yığınlar

# Description
source: Difficult layout with stacks of tiles
tr: Taş yığınlarıyla zor bir yerleşim

# Name
source: Swirl
tr: Girdap

# Description
source: A spiral with thick ends
tr: Kalın uçları olan bir sarmal

# Name
source: Temple
tr: Tapınak

# Description
source: A temple-shaped layout
tr: Tapınak şeklinde bir yerleşim

# Name
source: Theatre
tr: Tiyatro

# Description
source: A rectangular building with empty space in the middle
tr: Ortada boş bir alanı olan dikdörtgen bir bina

# Name
source: The Door
tr: Kapı

# Description
source: A doorway through a pyramid-shaped wall
tr: Piramit-şeklinde bir duvardan geçen antre

# Name
source: Time Tunnel
tr: Zaman Tüneli

# Name
source: Tomb
tr: Mezar

# Description
source: Fans of Lara Croft may start digging
tr: Lara Croft hayranları kazmaya başlayabilir

# Description
source: A T-shaped embossed object with a hole
tr: Deliği olan, T şeklinde süslenen bir nesne

# Name
source: Tower
tr: Kule

# Description
source: Remove the towers
tr: Kuleleri sil

# Name
source: Triangle
tr: Üçgen

# Description
source: Triangular pyramid
tr: Üçgen piramit

# Name
source: Up&Down
tr: Yukarı&Aşağı

# Description
source: Have you ever tried to represent waves in rectangular blocks?
tr: Hiç dikdörtgen bloklarda dalgaları tasvir etmeyi denemiş miydiniz?

# Description
source: A V-shaped layout with thick lower corners
tr: Kalın alt köşeleri olan V-şeklinde bir yerleşim

# Name
source: Well
tr: Kuyu

# Description
source: A rectangular well with stairs at all sides
tr: Her yanında yıldızlar olan dikdörtgen şeklinde bir kuyu

# Name
source: X-shaped
tr: X-şeklinde

# Description
source: A large letter X made of mahjongg tiles
tr: Mahjongg taşlarından yapılan büyük bir X harfi
