Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/knights._desktop_.po
Languages: tr

# Name
source: Knights
tr: K Satranç

# GenericName
source: Chess game
tr: Satranç Oyunu

# Name
source: Grayscale
tr: Gri ton

# Description
source: A grayscale theme using the Oxygen palette
tr: Oxygen paleti kullanılarak bir gri tonlu tema

# Name
source: East and West
tr: Doğu ve Batı

# Description
source: A middle ages styled chess set
tr: Ortaçağ biçemli satranç seti

# Description
source: Original Knights theme.
tr: Özgün K Satranç teması

# Name
source: Plain
tr: Düz

# Description
source: A plain and simple theme
tr: Düz ve basit bir tema

# Name
source: XBoard Two
tr: XBoard İki

# Description
source: Theme variation of XBoard chess program.
tr: XBoard satranç programının tema biçimi.
