Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/komodo.po
Languages: tr

# NAME OF TRANSLATORS
source: Your names
tr: Emir SARI

# EMAIL OF TRANSLATORS
source: Your emails
tr: emir_sari@icloud.com

source: Work on To-Do lists
tr: Yapılacaklar listeleri ile çalışın

# @info:credit
source: Author
tr: Yazar

# Longer description in about page
source: <p>KomoDo is a todo manager that uses todo.txt specification. It parses any compliant todo.txt files and turns them into easy to use list of tasks.</p>
tr: <p>KomoDo, todo.txt belirtimini kullanan bir yapılacaklar yöneticisidir. Herhangi bir uygun todo.txt dosyasını ayrıştırır ve onları kullanımı kolay bir görevler listesine dönüştürür.</p>

# @info:shell
source: Inserts the given text in the search bar.
tr: Verilen metni arama çubuğuna yerleştir.

# @info:shell
source: Open the given filename. The one in the config will be ignored.
tr: Verilen dosya adını aç. Yapılandırmadaki değer yok sayılır.

# @info:tooltip
source: Toggle completion status
tr: Tamamlanma durumunu aç/kapat

source: Priority
tr: Öncelik

source: Task completion date
tr: Görevin tamamlanma tarihi

source: Task due date
tr: Görevin bitiş tarihi

source: Task creation date
tr: Görevin oluşturulma tarihi

# @button
source: Edit
tr: Düzenle

# @button
source: Delete
tr: Sil

# Placeholder text for creating new tasks
source: (A) YYYY-MM-DD Description +Project @Context key:value
tr: (A) YYYY-AA-GG Açıklama +Proje @Bağlam anahtar:değer

# @button
source: Insert Date…
tr: Tarih Gir…

source: Open a date picker and insert it at cursor position
tr: Bir tarih seçicisi aç ve imleç konumunda yerleştir

source: Syntax Information
tr: Sözdizim Bilgisi

# Syntax quick guide
source: <p>Order of items matters:</p><pre>Completion Priority Creation-Date Description</pre><ul><li>x : Completion status. Remove to set task incompleted.</li><li>(A) : Priority. Can be from A to Z. Optional.</li><li>Completion Date: Date in Year-Month-Day format. Add only if there is creation date and task is completed.</li><li>Creation date: Date in Year-Month-Day format. Optional, but recommended.</li><li>Description: General task description. Mandatory.<ul><li>+Project: Projects this task is relevant to. Optional.</li><li>@Context: In which contexts this task is relevant in. Optional.</li><li>key:value: Various key-value pairs of information. Optional.</li></ul></li></ul><p>Description, contexts, key:value-pairs and projects can be mixed with each other.</p><p>For more detailed information and examples, click on the Help button.</p><br>
tr: <p>Ögelerin sırası önemlidir:</p><pre>Tamamlama Öncelik Oluşturma Tarihi Açıklama</pre><ul><li>x: Tamamlanma durumu. Görevi tamamlanmamış yapmak için kaldırın.</li><li>(A): Öncelik. A–Z arasında olabilir. İsteğe bağlıdır.</li><li>Tamamlanma tarihi: Tarih, Yıl-Ay-Gün olarak belirtilir. Yalnızca oluşturma tarihi varsa ve görev tamamlanmışsa ekleyin.</li><li>Oluşturma tarihi: Tarih, Yıl-Ay-Gün olarak belirtilir. İsteğe bağlıdır; ancak tavsiye edilir.</li><li>Açıklama: Genel görev açıklaması. Zorunludur.<ul><li>+Proje: Bu görevin ilişkili olduğu proje. İsteğe bağlıdır.</li><li>@Bağlam: Bu görevin hangi bağlamlarda geçerli olduğu. İsteğe bağlıdır.</li><li>anahtar:değer: Çeşitli anahtar ve değer bilgi çiftleri. İsteğe bağlıdır.</li></ul></li></ul><p>Açıklama, bağlamlar, anahtar:değer çiftleri ve projeler birbirleriyle karıştırılabilir.</p><p>Daha fazla ayrıntılı bilgi ve örnekler için “Yardım” düğmesine tıklayın.</p><br>

source: Syntax Information…
tr: Sözdizim Bilgisi…

source: Show todo.txt syntax reference
tr: todo.txt sözdizim başvurusunu göster

# @button
source: Save
tr: Kaydet

# @button
source: Cancel
tr: İptal

source: Delete To-Do
tr: Yapılacağı Sil

source: Are you sure you wish to delete this To-Do?
tr: Bu yapılacağı silmek istediğinizden emin misiniz?

source: Filter:
tr: Süz:

source: Show All
tr: Tümünü Göster

source: Due Date
tr: Bitiş Tarihi

source: Incomplete
tr: Tamamlanmamış

source: Completed
tr: Tamamlanmış

source: This To-Do list has been changed externally. Reloading it is strongly advised!
tr: Bu yapılacak listesi dışarıdan değiştirilmiş. Yeniden yüklemeniz şiddetle önerilir.

# @action:button
source: Reload
tr: Yeniden Yükle

source: This To-Do list has been deleted! Open another To-Do list or create new one.
tr: Bu yapılacak listesi silinmiş. Başka bir yapılacak listesi açın veya yenisini oluşturun.

# @button
source: Create New To-Do List…
tr: Yeni Yapılacak Listesi Oluştur…

# @action:button
source: Open To-Do List…
tr: Yapılacak Listesi Aç…

# @action:inmenu
source: New To-Do…
tr: Yeni Yapılacak…

# @action:inmenu
source: Open To-Do List…
tr: Yapılacak Listesi Aç…

# @action:inmenu
source: Help…
tr: Yardım…

# @action:inmenu
source: Auto-insert creation date
tr: Oluşturulma Tarihini Kendiliğinden Ekle

# A checkbox for toggling this setting
source: Insert a creation date for any new task automatically
tr: Yeni görevler için oluşturulma tarihini kendiliğinden ekle

# @action:inmenu
source: About KomoDo
tr: KomoDo Hakkında

# @info:placeholder
source: Welcome to KomoDo!
tr: KomoDo’ya hoş geldiniz!

# Welcome introduction text
source: <p>KomoDo is a To-Do list application that uses <a href='https://github.com/todotxt/todo.txt'>todo.txt</a> rules.</p><p>The rules are fairly quick to learn and KomoDo has help sections for it: <br>On the toolbar, click the <i><interface>Help…</interface></i> button.<br>While editing a task, click the <i><interface>Syntax Information…</interface></i> button.</p><p>You can follow the rules as much or as little as you wish.<br> Feel free to experiment to find out your ideal way of managing tasks.</p><p>Click <i><interface>Open To-Do list…</interface></i> to use an existing list or <i><interface>Create New To-Do list…</interface></i> to start a new list.</p>
tr: <p>KomoDo, <a href='https://github.com/todotxt/todo.txt'>todo.txt</a> kurallarını kullanan bir yapılacaklar listesi uygulamasıdır.</p><p>Kurallarını öğrenmesi pek kolaydır ve KomoDo içinde ilgili yardım bölümleri bulunur: <br>Araç çubuğunda <i><interface>Yardım…</interface></i> düğmesine tıklayın.<br>Bir görevi düzenlerken <i><interface>Sözdizim Bilgisi…</interface></i> düğmesine tıklayın.</p><p>Kuralları ister harfiyen veya keyfinize göre kullanabilirsiniz.<br>Görevlerinizi yönetmenin ideal yolunu bulmak için yeni şeyler denemekten çekinmeyin.</p><p>Var olan bir listeyi açmak için <i><interface>Yapılacak Listesi Aç…</interface></i> düğmesini veya yeni bir liste başlatmak için <i><interface>Yeni Yapılacak Listesi Oluştur…</interface></i> düğmesini kullanın.</p>

# @info:placeholder
source: No To-Dos found.
tr: Bulunan yapılacak yok.
