Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/konqueror._json_.po
Languages: tr

# Name
source: Konqueror Feed Icon
tr: Konqueror Besleme Simgesi

# Name
source: Add Feed to Akregator
tr: Beslemeyi Akregatör’e Ekle

# Name
source: Auto Refresh
tr: Otomatik Yenile

# Name
source: Translate
tr: Çevir

# Name
source: Directory Filter
tr: Dizin Süzgeci

# Name
source: File Size View
tr: Dosya Boyutu Görünümü

# Name
source: Download Manager
tr: İndirme Yöneticisi

# Name
source: HTML Settings
tr: HTML Ayarları

# Name
source: Image Gallery
tr: Görsel Galerisi

# Name
source: Search Bar
tr: Arama Çubuğu

# Name
source: Shell Command Plugin
tr: Kabuk Komutu Eklentisi

# Name
source: Text-to-Speech
tr: Metinden Konuşmaya

# Name
source: UserAgent Changer
tr: UserAgent Değiştiricisi

# Name
source: Web Archiver
tr: Web Arşivcisi

# Name
source: Web Archives and HTML files
tr: Web Arşivleri ve HTML Dosyaları

# Name
source: Bookmarks
tr: Yer İmleri

# Name
source: Behavior
tr: Davranış

# Name
source: Cache
tr: Önbellek

# Name
source: Cookies
tr: Çerezler

# Name
source: Appearance
tr: Görünüş

# Name
source: Web Behavior
tr: Web Davranışı

# Name
source: AdBlocK Filters
tr: AdBlock Süzgeçleri

# Name
source: General
tr: Genel

# Name
source: Java & JavaScript
tr: Java ve JavaScript

# Name
source: Tabs Behavior
tr: Sekmeler Davranışı

# Name
source: Browser Identification
tr: Tarayıcı Tanımlaması

# Name
source: KDE Performance
tr: KDE Başarımı

# Name
source: Bookmarks SideBar Module
tr: Yer İmleri Kenar Çubuğu Modülü

# Name
source: History
tr: Geçmiş

# Name
source: History SideBar Module
tr: Geçmiş Kenar Çubuğu Modülü

# Name
source: Sidebar
tr: Kenar Çubuğu

# Name
source: Places SideBar Module
tr: Yerler Kenar Çubuğu Modülü

# Name
source: Tree SideBar Module
tr: Ağaç Kenar Görünümü Modülü

# Description
source: Displays an icon in the status bar if the page contains a feed
tr: Sayfa bir besleme içeriyorsa durum çubuğunda bir simge görüntüler

# Description
source: Adds selected feed to Akregator
tr: Seçili beslemeyi Akregatör’e ekler

# Description
source: Auto Refresh plugin
tr: Otomatik Yenile eklentisi

# Description
source: Language translation for the current page using Google
tr: Google kullanarak geçerli sayfanın dilini çevirir

# Description
source: Filter directory view using an attribute filter
tr: Bir öznitelik süzgeci kullanırken dizini süzer

# Description
source: Enables a proportional view of directories and files based on file size
tr: Dosya boyutuna göre dizinlerin ve dosyaların oransal bir görünümünü etkinleştirir

# Description
source: A versatile and easy to use file download manager
tr: Çok yönlü ve kullanımı kolay dosya indirme yöneticisi

# Description
source: A fast way to change the HTML settings
tr: HTML ayarlarını değiştirmenin hızlı bir yolu

# Description
source: An easy way to generate an HTML image gallery
tr: Bir HTML görsel galerisi üretmenin hızlı bir yolu

# Description
source: Provides a text box for easier access to search engines like Google.
tr: Google gibi arama motorlarına daha kolay erişim için bir metin kutusu sağlar

# Description
source: Shell Command Plugin for Konqueror
tr: Konqueror için kabuk komutu eklentisi

# Description
source: Produces audio output for text in the current page
tr: Geçerli sayfadaki metin için ses çıktısı üretir

# Description
source: Allows the detected UserAgent to be modified
tr: Algılanan UserAgent’ın değiştirilmesine izin verir

# Description
source: Creates archives of websites
tr: Web sitelerinin arşivlerini oluşturur

# Description
source: Configure the bookmarks home page
tr: Yer imleri ana sayfasını yapılandırın

# Description
source: You can configure how Konqueror behaves as a file manager here
tr: Buradan, Konqueror’un bir dosya yöneticisi olarak nasıl davranacağını yapılandırabilirsiniz

# Description
source: Configure the use of Cache
tr: Önbellek kullanımını yapılandırın

# Description
source: Configure the way cookies work
tr: Çerezlerin nasıl çalıştığını yapılandırın

# Description
source: Configure how to display web pages
tr: Web sayfalarının nasıl görüntüleneceğini yapılandırın

# Description
source: Configure the browser behavior
tr: Tarayıcı davranışını yapılandırın

# Description
source: Configure Konqueror AdBlocK filters
tr: Konqueror AdBlock süzgeçlerini yapılandırın

# Description
source: Configure general Konqueror behavior
tr: Genel Konqueror davranışını yapılandırın

# Description
source: Configure the behavior of Java and JavaScript
tr: Java ve JavaScript davranışını yapılandırın

# Description
source: Configure tabs behavior in Konqueror
tr: Konqueror’daki sekmeler davranışını yapılandırın

# Description
source: Configure the user agent string
tr: Kullanıcı aracısı dizisini yapılandırın

# Description
source: Configure settings that can improve KDE performance
tr: KDE başarımını iyileştirebilecek ayarları yapılandırın

# Description
source: Configure the history sidebar
tr: Geçmiş kenar çubuğunu yapılandırın

# Description
source: Embeddable HTML component
tr: Gömülebilir HTML bileşeni

# Authors Name
source: KGet Maintainers
tr: K İndir bakımcıları

# Authors Name
source: Dirk Mueller
tr: Dirk Müller

# Copyright
source: Copyright 2002 Josef Weidendorfer
tr: Telif hakkı 2002 Josef Weidendorfer

# Copyright
source: Copyright 2009-2010 Dawit Alemayehu, 2008-2010 Urs Wolfer, 2007 Trolltech ASA
tr: Telif hakkı 2009–2010 Dawit Alemayehu, 2008–2010 Urs Wolfer, 2007 Trolltech ASA
