Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/kontainer.po
Languages: tr

# @title:window, %1 is a container name
source: Applications — %1
tr: Uygulamalar ― %1

source: No exported applications
tr: Dışa aktarılan uygulama yok

source: Unexport
tr: Aktarımı Geri Al

source: Remove the selected application from your host system
tr: Seçili uygulamayı ana makineden kaldır

source: Unexport App
tr: Uygulamanın Aktarımını Geri Al

source: No available applications
tr: Kullanılabilir uygulama yok

source: Export
tr: Dışa Aktar

source: Make the selected application available on your host system
tr: Seçili uygulamayı ana makinede kullanılabilir yap

source: Export App
tr: Uygulamayı Dışa Aktar

source: Exported Apps
tr: Dışa Aktarılmış Uygulamalar

source: Available Apps
tr: Kullanılabilir Uygulamalar

source: Error: Command timed out
tr: Hata: Komut zaman aşımına uğradı.

source: Error: No supported backend available
tr: Hata: Desteklenen arka uç yok

source: Error: Failed to start container creation process
tr: Hata: Kapsayıcı oluşturma süreci başlatılamadı

source: Container created successfully
tr: Kapsayıcı başarıyla oluşturuldu

source: Container creation failed
tr: Kapsayıcı oluşturulamadı

source: Error:
tr: Hata:

source: Error: Unknown container backend
tr: Hata: Bilinmeyen kapsayıcı arka ucu

source: Error: Command failed with exit code %1
tr: Hata: Komut, %1 çıkış koduyla başarısız oldu

# Error message when application is not found in container
source: Application %1 not found in container %2
tr: %2 kapsayıcısında %1 uygulaması bulunamadı

# Error message when desktop file is not found
source: Could not find desktop file for %1 in container %2
tr: %2 kapsayıcısında %1 için olan desktop dosyası bulunamadı

# Error message when desktop file creation fails
source: Failed to create desktop file: %1
tr: Desktop dosyası oluşturulamadı: %1

# Success message after exporting application
source: Successfully exported %1 from %2
tr: %1, %2 konumundan başarıyla dışa aktarıldı

# Error message when no exported app is found
source: No exported application %1 found for container %2
tr: %2 kapsayıcısı için %1 dışa aktarılan uygulama bulunamadı

# Error message when desktop file removal fails
source: Failed to remove desktop file: %1
tr: Desktop dosyası kaldırılamadı: %1

# Success message after unexporting application
source: Successfully unexported %1 from %2
tr: %1 aktarımı, %2 konumundan başarıyla geri alındı

source: Create New Container
tr: Yeni Kapsayıcı Oluştur

source: my-container
tr: kapsayıcım

source: Container name:
tr: Kapsayıcı adı:

source: Search images...
tr: Görseller ara…

source: Available images:
tr: Kullanılabilir görseller:

source: Leave empty for default
tr: Öntanımlı olarak boş bırak

source: Custom home path:
tr: Özel ana klasör yolu:

source: e.g., /host/path:/container/path (comma separate multiple)
tr: örn., /anamakine/yol:/kapsayıcı/yol (virgülle ayrılmış değerler)

source: Additional volumes:
tr: Ek disk bölümleri:

source: Enable systemd init
tr: systemd init’i etkinleştir

source: Enable systemd as init system inside the container
tr: Kapsayıcı içinde init sistemi olarak systemd’yi etkinleştir

source: Init system:
tr: Init sistemi:

source: Refresh Images
tr: Görselleri Yenile

source: Cancel
tr: İptal

source: Create
tr: Oluştur

source: Error
tr: Hata

source: Please enter a container name
tr: Lütfen bir kapsayıcı adı girin

source: Please select an image
tr: Lütfen bir görsel seçin

source: Creating Container
tr: Kapsayıcı Oluşturuluyor

source: Starting container creation...
tr: Kapsayıcı oluşturmaya başlanıyor…

source: Container '%1' created successfully! A terminal session with the new container will now open.
tr: “%1” kapsayıcısı başarıyla oluşturuldu! Şimdi yeni kapsayıcıyı içeren bir uçbirim oturumu açılacak.

source: Success
tr: Başarılı

source: Process output:
tr: Süreç çıktısı:

source: Process error:
tr: Süreç hatası:

source: Failed to start
tr: Başlatılamadı

source: Crashed
tr: Çöktü

source: Timed out
tr: Zaman aşımına uğradı

source: Write error
tr: Yazma hatası

source: Read error
tr: Okuma hatası

source: Unknown error
tr: Bilinmeyen hata

source: Container “%1” created successfully!
tr: “%1” kapsayıcısı başarıyla oluşturuldu!

source: Container creation failed (exit code: %1)
tr: Kapsayıcı oluşturma başarısız (çıkış kodu: %1)

source: Container creation failed (exit code: %1) Error output: %2
tr: Kapsayıcı oluşturma başarısız (çıkış kodu: %1) Hata çıktısı: %2

source: Fetching containers...
tr: Kapsayıcılar getiriliyor…

source: No containers found
tr: Bulunan kapsayıcı yok

source: Checking for available container backends...
tr: Kullanılabilir kapsayıcı arka uçları denetleniyor…

source: No container backends found. Please install either distrobox or toolbox.
tr: Bulunan kapsayıcı arka ucu yok. Lütfen “distrobox” veya “toolbox” araçlarından birini kurun.

source: No Terminal Mode Disabled
tr: Uçbirimsiz Kip Devre Dışı

source: The No Terminal Mode will be removed soon and is now disabled. Please install a terminal emulator like Konsole: flatpak install org.kde.konsole
tr: Uçbirimsiz Kip şu anda devre dışıdır ve yakında uygulamadan kaldırılacaktır. Lütfen Konsole veya benzeri bir uçbirim öykünücüsü kurun: flatpak install org.kde.konsole

source: Enter
tr: Gir

source: Enter the selected container
tr: Seçili kapsayıcıya gir

source: Delete
tr: Sil

source: Delete the selected container
tr: Seçili kapsayıcıyı sil

source: Applications
tr: Uygulamalar

source: Manage exported applications
tr: Dışa aktarılan uygulamaları yönet

source: Upgrade
tr: Yükselt

source: Upgrade the selected container
tr: Seçili kapsayıcıyı yükselt

source: Refresh
tr: Yenile

source: Refresh container list
tr: Kapsayıcı listesini yenile

source: Install .deb
tr: .deb Kur

source: Install Debian/Ubuntu package
tr: Debian/Ubuntu paketi kur

source: Install .rpm
tr: .rpm Kur

source: Install Fedora/OpenSUSE package
tr: Fedora/OpenSUSE paketi kur

source: Install .pkg
tr: .pkg Kur

source: Install Arch Linux package
tr: Arch Linux paketi kur

source: New Container
tr: Yeni Kapsayıcı

source: Create new container
tr: Yeni kapsayıcı oluştur

source: Upgrade all Containers
tr: Tüm Kapsayıcıları Yükselt

source: Upgrades all containers
tr: Tüm kapsayıcıları yükseltir

source: Assemble
tr: Topla

source: Create container from INI file
tr: INI dosyasından kapsayıcı oluştur

source: No terminal emulator found - output will be shown in dialog
tr: Bulunan bir uçbirim öykünücüsü yok — çıktı, bir iletişim kutusunda gösterilecek.

source: Confirm Deletion
tr: Silmeyi Onayla

source: Delete container <b>%1</b>?
tr: <b>%1</b> kapsayıcısı silinsin mi?

source: This action cannot be undone.
tr: Bu eylem geri alınamaz.

source: Function Not Supported
tr: İşlev Desteklenmiyor

source: Toolbox backend doesn't support container assembly. Please switch to Distrobox backend to use this feature.
tr: Toolbox arka ucu kapsayıcı toplamayı desteklemiyor. Bu özelliği kullanmak için Distrobox arka ucuna geçin.

source: Select Distrobox INI File
tr: Distrobox INI Dosyası Seç

source: INI Files (*.ini);;All Files (*)
tr: INI dosyaları (*.ini);;Tüm dosyalar (*)

source: Assembling container...
tr: Kapsayıcı toplanıyor…

source: Processing...
tr: İşleniyor…

source: Select .deb Package
tr: .deb Paketi Seç

source: Debian Packages (*.deb)
tr: Debian paketleri (*.deb)

source: Installing .deb package...
tr: .deb paketi kuruluyor…

source: Select .rpm Package
tr: .rpm Paketi Seç

source: RPM Packages (*.rpm)
tr: RPM paketleri (*.rpm)

source: Installing .rpm package...
tr: .rpm paketi kuruluyor…

source: Select Arch Package
tr: Arch Paketi Seç

source: Arch Packages (*.pkg.tar.*)
tr: Arch paketleri (*.pkg.tar.*)

source: Installing Arch package...
tr: Arch paketi kuruluyor…

source: Upgrading container...
tr: Kapsayıcı yükseltiliyor…

source: Upgrading all containers...
tr: Tüm kapsayıcılar yükseltiliyor…
