Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/konvex.po
Languages: tr

# NAME OF TRANSLATORS
source: Your names
tr: Emir SARI

# EMAIL OF TRANSLATORS
source: Your emails
tr: emir_sari@icloud.com

source: Konvex
tr: Konveks

source: 3D Model Viewer
tr: 3B Model Görüntüleyicisi

source: Maintainer
tr: Bakımcı

# Application Description
source: 3D Model Viewer
tr: 3B Model Görüntüleyicisi

# @info:shell
source: Model file
tr: Model dosyası

# @title:window Main window
source: Konvex
tr: Konveks

# @action:intoolbar Re-center the model so it's visible in the viewport
source: Re-center
tr: Yeniden Ortala

# @action:intoolbar
source: Settings
tr: Ayarlar

# @info:placeholder Viewport placeholder, when no model was loaded
source: No model loaded
tr: Yüklü model yok

# @info:placeholder Viewport placeholder, when no model was loaded
source: Open a model with Konvex, or drag a model into this window.
tr: Bir modeli Konveks ile açın veya bu pencereye sürükleyin.

# @action:button
source: Select File
tr: Dosya Seç

# @title:window
source: Settings
tr: Ayarlar

# @action:button
source: About Konvex
tr: Konveks Hakkında

# @action:button
source: About KDE
tr: KDE Hakkında
