Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/korganizer._json_.po
Languages: tr

# Name
source: Journal
tr: Günce

# Name
source: Upcoming Events
tr: Yaklaşan Olaylar

# Name
source: Pending To-dos
tr: Bekleyen Yapılacak Ögeleri

# Name
source: Calendar
tr: Takvim

# Name
source: To-do List
tr: Yapılacaklar Listesi

# Name
source: Upcoming Special Dates
tr: Yaklaşan Özel Tarihler

# Name
source: Special Dates
tr: Özel Tarihler

# Name
source: Colors and Fonts
tr: Renkler ve Yazıtipleri

# Name
source: Custom Pages
tr: Özel Sayfa

# Name
source: Free/Busy
tr: Uygun/Meşgul

# Name
source: Group Scheduling
tr: Grup Zamanlama

# Name
source: General
tr: Genel

# Name
source: Plugins
tr: Eklentiler

# Name
source: Time and Date
tr: Saat ve Tarih

# Name
source: Views
tr: Görünümler

# Name
source: User Feedback
tr: Kullanıcı Geri Bildirimi

# Description
source: Kontact KOrganizer Journal Plugin
tr: Kontak K Organizatör Günce Eklentisi

# Description
source: Upcoming Events Summary Setup
tr: Gelecek Etkinlikler Özet Yapılandırması

# Description
source: Pending To-dos Summary Setup
tr: Bekleyen Yapılacak Ögeler Özet Yapılandırması

# Description
source: Kontact KOrganizer Plugin
tr: Kontak K Organizatör Eklentisi

# Description
source: Kontact KOrganizer To-do List Plugin
tr: Kontak K Organizatör Yapılacaklar Listesi Eklentisi

# Description
source: Upcoming Special Dates Summary Setup
tr: Yaklaşan Özel Tarih Özeti Yapılandırması

# Description
source: Special Dates Plugin
tr: Özel Tarihler Eklentisi

# Description
source: KOrganizer Colors and Fonts Configuration
tr: K Organizatör Renk ve Yazıtipi Yapılandırması

# Description
source: Configure the Custom Pages
tr: Özel Sayfaları Yapılandır

# Description
source: KOrganizer Free/Busy Configuration
tr: K Organizatör Uygun/Meşgul Yapılandırması

# Description
source: KOrganizer Group Scheduling Configuration
tr: K Organizatör Grup Zamanlama Yapılandırması

# Description
source: KOrganizer Main Configuration
tr: K Organizatör Temel Yapılandırması

# Description
source: KOrganizer Plugin Configuration
tr: K Organizatör Eklenti Yapılandırması

# Description
source: KOrganizer Time and Date Configuration
tr: K Organizatör Tarih ve Saat Yapılandırması

# Description
source: KOrganizer View Configuration
tr: K Organizatör Görünüm Yapılandırması

# Description
source: KOrganizer User Feedback Configuration
tr: K Organizatör Kullanıcı Geri Bildirimi Yapılandırması
