Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/kpat._desktop_.po
Languages: tr

# Name
source: KPatience
tr: K Sabır

# GenericName
source: Patience Card Game
tr: Sabır Kart Oyunu

# Comment
source: Solitaire card game
tr: Solitaire kart oyunu

# Name
source: Desert Sands
tr: Çöl Kumları

# Description
source: Egyptian style theme.
tr: Mısır biçemi teması

# Name
source: Clean Green
tr: Temiz Yeşil

# Description
source: A simple green felt theme
tr: Basit bir yeşil keçe teması

# Name
source: Green Blaze
tr: Yeşil Ateş

# Name
source: Royal Hearts
tr: Kraliyet Kupası

# Description
source: Card style theme
tr: Kart biçemi teması
