Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/ktorrent._desktop_.po
Languages: tr

# Name
source: Torrent silently opened
tr: Torrent sessizce açıldı

# Name
source: Torrent stopped by error
tr: Torrent bir hata tarafından durduruldu

# Name
source: Torrent has finished downloading
tr: Torrent indirme işlemi tamamlandı

# Name
source: Maximum share ratio reached
tr: En yüksek paylaşım oranına ulaşıldı

# Name
source: Maximum seed time reached
tr: En yüksek besleme süresine ulaşıldı

# Name
source: Disk space is running low
tr: Disk alanı azalıyor

# Name
source: Corrupted data has been found
tr: Bozuk veri bulundu

# Name
source: Torrent cannot be enqueued
tr: Torrent kuyruğa eklenemiyor

# Name
source: Torrent cannot be started
tr: Torrent başlatılamadı

# Name
source: Torrent cannot be loaded silently
tr: Torrent sessizce yüklenemedi

# Name
source: DHT is not enabled
tr: DHT etkin değil

# Name
source: Event generated by plugin
tr: Olay, eklenti tarafından oluşturuldu

# Name
source: Magnet link download started
tr: Mıknatıs bağlantısı indirmesi başlatıldı

# Name
source: Magnet link copied to clipboard
tr: Mıknatıs bağlantısı panoya kopyalandı

# GenericName
source: BitTorrent Client
tr: BitTorrent İstemcisi

# Comment
source: A BitTorrent program by KDE
tr: KDE tarafından yapılan bir BitTorrent uygulaması
