Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/libksysguard._desktop_.po
Languages: tr

# Name
source: System monitor Sensor Display Styles
tr: Sistem Monitörü Algılayıcı Görüntüleme Biçemleri

# Name
source: System monitor Sensor Presets
tr: Sistem Monitörü Algılayıcı Önayarları

# Name
source: Kill or stop etc a process
tr: Bir süreci durdur veya sonlandır

# Description
source: Sends a given signal to a given process
tr: Belirli bir sürece belirli bir sinyali gönderir

# Name
source: Change the priority of a process
tr: Bir sürecin önceliğini değiştirir

# Description
source: Change the niceness of a given process
tr: Verilen sürecin iyileştirmesini değiştirir

# Name
source: Change IO Scheduler and priority
tr: Girdi Çıktı Zamanlayıcısını ve önceliği değiştir

# Description
source: Change how the read and writes of a given process are prioritized
tr: Verilen sürecin okuma/yazmalarının nasıl önceliklendirildiğini değiştir

# Name
source: Change CPU Scheduler and priority
tr: İşlemci Zamanlayıcısını ve önceliği değiştir

# Description
source: Change which CPU scheduler is to schedule the running of a given process
tr: Verilen sürecin hangi işlemci zamanlayıcısı tarafından zamanlanacağını değiştir
