Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/libkdegames._desktop_.po
Languages: tr

# Name
source: Ancient Egyptians
tr: Eski Mısırlılar

# Comment
source: An ancient Egyptian card deck.
tr: Eski Mısırlı kart destesi

# Name
source: Future Simple
tr: Basit Gelecek

# Comment
source: A clean and easy style with a distinctively royal touch.
tr: Tipik kraliyet ailesi cinsi dokunuşlarıyla temiz ve basit bir stil

# Name
source: Nicu Ornamental
tr: Nicu Süsleyici

# Name
source: Nicu White
tr: Nicu Beyazı

# Name
source: Oxygen White
tr: Oxygen Beyaz

# Name
source: Penguins
tr: Penguenler

# Name
source: Standard
tr: Standart

# Comment
source: Standard KDE card set\nGPL license
tr: Standart KDE kart seti\nGPL lisansı

# Name
source: Tigullio International
tr: Tigullio Uluslararası

# Name
source: XSkat French
tr: XSkat Fransızca

# Name
source: XSkat German
tr: XSkat Almanca
