Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/libkmahjongg._desktop_.po
Languages: tr

# Name
source: Chinese Landscape
tr: Çin Manzarası

# Description
source: Chinese landscape with mountains and a waterfall
tr: Dağlar ve bir şelale içeren çin manzarası

# Name
source: Plain Color
tr: Düz Renk

# Description
source: Use the default window background color.
tr: Öntanımlı pencere arka plan rengini kullan.

# Name
source: Default
tr: Öntanımlı

# Description
source: A green background with light geometric patterns
tr: Aydınlık geometrik desenli yeşil bir arka plan

# Name
source: Egyptian
tr: Mısırlı

# Description
source: A Egyptian style background
tr: Eski Mısır stili arka plan

# Name
source: Summer Field
tr: Yazlık Çayır Çimen

# Description
source: The Summertime Greens
tr: Yaz Zamanı Yeşillikleri

# Name
source: Light Wood
tr: Aydınlık Tahta

# Description
source: Resembles the surface of a wood table
tr: Tahta masanın yüzeyini göstermektedir

# Name
source: Alphabet
tr: Abece

# Description
source: A colorful tileset designed for kids of all ages.
tr: Her yaştan çocuklar için tasarlanan renkli bir taş kümesi

# Description
source: Japanese tileset with brightly-colored kanji on a soft woodgrain
tr: Yumuşak tahta zemin üzerine parıldayan renklerdeki Kanji'den oluşan Japon taş kümesi

# Name
source: Classic
tr: Klasik

# Description
source: Chinese tileset, inspired by the classic version shipped with KDE 3
tr: KDE 3 ile birlikte dağıtılan sürümden esinlenilen Çin taş kümesi

# Description
source: Art inspired by real Japanese Mahjongg tiles
tr: Gerçek Japon Mahjongg taşlarından esinlenilen sanat

# Name
source: Ancient Egyptians
tr: Eski Mısırlılar

# Name
source: Imperial Jade
tr: İmparatorluk Şıllığı

# Name
source: Traditional
tr: Geleneksel

# Description
source: Americanized tiles inspired by Japanese Mahjongg tiles
tr: Japon Mahjongg taşlarından esinlenilen Amerikanvari taşlar
