Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/libplasma._json_.po
Languages: tr

# Name
source: Breeze Dark
tr: Esinti Koyu

# Name
source: Breeze Light
tr: Esinti Açık

# Name
source: Breeze
tr: Esinti

# Name
source: Oxygen
tr: Oksijen

# Description
source: Breeze Dark by the KDE VDG
tr: KDE VDG tarafından Esinti Koyu

# Description
source: Breeze Light by the KDE VDG
tr: KDE VDG tarafından Esinti Açık

# Description
source: Breeze by the KDE VDG
tr: KDE VDG tarafından Esinti

# Description
source: Theme done in the Oxygen style
tr: Oksijen tarzında yapılmış tema

# Description
source: what your app does in a few words
tr: uygulamanızı birkaç sözcükle anlatın

# Authors Name
source: KDE Visual Design Group
tr: KDE Görsel Tasarım Grubu

# Authors Name
source: The Oxygen Project
tr: Oksijen Projesi
