Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/lightdm_theme_userbar.po
Languages: tr

source: Background image:
tr: Arka plan görseli:

source: The connection will be active only on the login screen.
tr: Bağlantı, yalnızca oturum açma ekranında etkin olur.

source: Disconnect from %1 ?
tr: %1 bağlantısı kesilsin mi?

source: Abort connecting to %1 ?
tr: %1 bağlantısı iptal edilsin mi?

source: Connect to %1 ?
tr: %1 bağlantısı yapılsın mı?

source: Connect to an insecure access point %1 ?
tr: %1 güvenliksiz erişim noktasına bağlanılsın mı?

source: Enter the password to connect to %1
tr: %1 bağlantısı için parolayı gir

source: Enter login and password to connect to %1
tr: %1 bağlantısı için kullanıcı ve parola bilgisini gir

source: %1: Connection error, try again.
tr: %1: Bağlantı hatası, yeniden deneyin.

source: Provide the secrets to connect to %1:
tr: %1 bağlantısı için gizleri sağla:

source: The security protocol is not supported for %1
tr: %1 için güvenlik protokolü desteklenmiyor

source: Failed to connect to %1
tr: %1 bağlantısı yapılamadı

source: Error: Can't find access point %1
tr: Hata: %1 erişim noktası bulunamıyor

source: Login
tr: Kullanıcı

source: Password
tr: Parola

source: Disable wireless
tr: Kablosuzu Devre Dışı Bırak

source: Enable wireless
tr: Kablosuzu Etkinleştir

source: Action prohibited
tr: Eyleme izin verilmiyor

source: Disable networking
tr: Ağı Devre Dışı Bırak

source: Enable networking
tr: Ağı Etkinleştir

source: Press %1 to change the primary screen
tr: Birincil ekranı değiştirmek için %1 düğmesine bas

source: Login failed
tr: Oturum açma başarısız

source: Caps Lock is on
tr: Büyük Harf açık

source: Num Lock is on
tr: Sayı Kilidi açık

source: Caps Lock and Num Lock is on
tr: Büyük Harf ve Sayı Kilidi açık

source: Log in
tr: Oturum Aç

source: Log in as another user
tr: Başka Bir Kullanıcı Olarak Oturum Aç

source: Keyboard layout
tr: Klavye yerleşimi

source: Desktop session
tr: Masaüstü oturumu

source: Suspend
tr: Askıya Al

source: Hibernate
tr: Derin Uykuya Geçir

source: Restart
tr: Yeniden Başlat

source: Shutdown
tr: Kapat

# Button to show/hide virtual keyboard
source: Virtual Keyboard
tr: Sanal Klavye
