Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/lightdm_kde_greeter.po
Languages: tr

# NAME OF TRANSLATORS
source: Your names
tr: Emir SARI

# EMAIL OF TRANSLATORS
source: Your emails
tr: emir_sari@icloud.com

source: Battery at %1%
tr: Pil %​%1

source: VPN connection deactivated.
tr: VPN bağlantısı devre dışı bırakıldı.

source: VPN connection was deactivated because the device it was using was disconnected.
tr: VPN bağlantısı devre dışı bırakıldı; çünkü onu kullanan aygıtın bağlantısı kesildi.

source: The service providing the VPN connection was stopped.
tr: VPN bağlantısını sağlayan hizmet durduruldu.

source: The IP config of the VPN connection was invalid.
tr: VPN bağlantısının IP yapılandırması geçersiz.

source: The connection attempt to the VPN service timed out.
tr: VPN hizmetine olan bağlantı denemesi zaman aşımına uğradı.

source: A timeout occurred while starting the service providing the VPN connection.
tr: VPN bağlantısını sağlayan hizmete bağlantı başlatılırken bir zaman aşımı oluştu.

source: Starting the service providing the VPN connection failed.
tr: VPN bağlantısını sağlayan hizmeti başlatma başarısız oldu.

source: Necessary secrets for the VPN connection were not provided.
tr: VPN bağlantısı için gerekli olan gizler sağlanmadı.

source: Authentication to the VPN server failed.
tr: VPN sunucusuna kimlik doğrulama işlemi başarısız oldu.

source: The connection was deleted.
tr: Bağlantı silindi.

source: No connection
tr: Bağlantı yok

source: LightDM KDE Greeter
tr: LightDM KDE Karşılayıcısı

source: Login screen using the LightDM framework
tr: LightDM çatısını kullanan oturum açma ekranı

source: Password
tr: Parola

source: Certificate password
tr: Sertifika parolası

source: HTTP proxy password
tr: HTTP vekili parolası

source: Previously Used Session
tr: Önceki Kullanılan Oturum

source: Guest
tr: Konuk
