Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/mauikitarchiver.po
Languages: tr

source: Archive Ready
tr: Arşiv Hazır

source: The new file is now ready.
tr: Yeni dosya artık hazır.

source: Failed
tr: Başarısız

source: The archive could not be created.
tr: Arşiv oluşturulamadı.

source: Extraction Ready
tr: Çıkarma Hazır

source: The archive contents have been extracted.
tr: Arşiv içeriği çıkarıldı.

source: The extraction has failed.
tr: Çıkarma başarısız oldu.

source: Search
tr: Ara

source: Extract
tr: Çıkar

source: Extract to...
tr: Şuraya Çıkar…

source: Name
tr: Ad

source: Date
tr: Tarih

source: Size
tr: Boyut

source: Compress
tr: Sıkıştır

source: Drop files in here to compress them.
tr: Onları sıkıştırmak için dosyaları buraya bırakın.

source: Preview
tr: Önizleme

source: Open
tr: Aç

source: Open with
tr: Birlikte Aç

source: Delete
tr: Sil

source: Add here
tr: Buraya ekleyin

source: Drop files in here to add them to the archive.
tr: Onları arşive eklemek için buraya dosyalar bırakın.

source: Extract the contents of the compressed file
tr: Sıkıştırılmış dosyanın içeriğini çıkar

source: A directory with the same name already exists!
tr: Aynı adlı bir dizin halihazırda var!

source: The name looks good
tr: Ad iyi görünüyor

source: Compress %1 file into a new archive
tr: %1 Dosyayı Bir Arşive Sıkıştır

source: Cancel
tr: İptal

source: Create
tr: Oluştur

source: Some error occured. Maybe current user does not have permission for writing in this directory.
tr: Bir hata oluştu. Belki geçerli kullanıcının bu dizine yazmak için izni yoktur.

source: File compressed successfully
tr: Dosya başarıyla sıkıştırıldı

source: Failed to compress
tr: Sıkıştırılamadı

source: Archive name
tr: Arşiv adı

source: Destination
tr: Hedef konum

source: The final location of the new archive
tr: Yeni arşivin nihai konumu

source: Base location does not exists. Try with a different location.
tr: Taban konum yok. Başka bir konum ile deneyin.

source: File name can not be empty.
tr: Dosya adı boş olamaz.

source: File already exists. Try with another name.
tr: Dosya halihazırda var. Başka bir ad deneyin.

source: Looks good
tr: İyi görünüyor
