Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/optiimage.po
Languages: tr

# @title
source: Console output
tr: Konsol Çıktısı

source: No log output
tr: Konsol çıktısı yok

source: Optimize your images
tr: Görselleri Eniyile

# @action:button
source: Re-check
tr: Yeniden Denetle

# @info
source: The following programs are missing for OptiImage to run correctly:
tr: OptiImage’in düzgünce çalışması için gereken aşağıdaki programlar eksik:

# @action:button
source: Select Images
tr: Görseller Seç

source: Settings
tr: Ayarlar

# @title:window
source: Select an image to compress
tr: Sıkıştırılacak Görseli Seç

source: Image files (*.jpg *.jpeg *.png *.svg *.webp)
tr: Görsel dosyaları (*.jpg *.jpeg *.png *.svg *.webp)

source: All files (*)
tr: Tüm dosyalar (*)

# Size information with no change
source: %1 (No change)
tr: %1 (Değişiklik yok)

# Size information
source: %1 -> %2 (%3% decrease)
tr: %1 → %2 (%​%3 azalma)

# @action:button
source: More options
tr: Daha Fazla Seçenek

# @action:button
source: Remove
tr: Kaldır

# @action:inmenu
source: Open
tr: Aç

# @action:inmenu
source: Open Containing Folder
tr: İçeren Klasörü Aç

# @action:inmenu
source: Properties
tr: Özellikler

source: No images to optimize
tr: Eniyilenecek görsel yok

# @title:window
source: Settings
tr: Ayarlar

source: General
tr: Genel

source: Keep Metadata
tr: Üst veriyi tut

source: Safe mode
tr: Güvenli kip

source: Save the compressed image in a new file
tr: Sıkıştırılan görseli yeni bir dosyaya kaydet

source: Suffix to append at the end of new file
tr: Yeni dosya adının sonuna eklenecek sonek

source: Progressive Encode
tr: İlerlemeli kodlama

source: To enable incremental image rendering: blurry to clear.
tr: Artımlı görsel sunumunu etkinleştirmek için: Bulanıktan berrağa.

# @label
source: Use lossless compression
tr: Kayıpsız sıkıştırma kullan

# @info
source: Only use compression algorithms which do not reduce image quality.
tr: Yalnızca görsel kalitesini azaltmayan sıkıştırma algoritmalarını kullanın.

source: Default optimization level of lossy optimization:
tr: Kayıplı eniyilemenin öntanımlı eniyileme düzeyi:

source: Default optimization level of lossless optimization:
tr: Kayıpsız eniyilemenin öntanımlı eniyileme düzeyi:

# @label
source: Maximum Compression Level
tr: En yüksek sıkıştırma düzeyi

# @info
source: Can be more destructive for the image.
tr: Görsel için daha yıkıcı olabilir.

source: About OptiImage
tr: OptiImage Hakkında

source: About KDE
tr: KDE Hakkında

source: Images Optimiser
tr: Görsel Eniyileyicisi

source: Maintainer
tr: Bakımcı

# NAME OF TRANSLATORS
source: Your names
tr: Emir SARI

# EMAIL OF TRANSLATORS
source: Your emails
tr: emir_sari@icloud.com
