Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.neochat.appdata.po
Languages: tr

source: Chat on Matrix
tr: Matrix Üzerinde Sohbet

source: NeoChat is a chat app that lets you take full advantage of the Matrix network. It provides you with a secure way to send text messages, videos and audio files to your family, colleagues and friends.
tr: NeoChat, Matrix ağının tüm özelliklerini kullanan bir sohbet uygulamasıdır. Ailenize, arkadaşlarınıza ve iş arkadaşlarınıza metin iletileri, ses ve video dosyaları göndermenin kolay bir yolunu sunar.

source: NeoChat aims to be a fully featured application for the Matrix specification. As such everything in the current stable specification with the notable exceptions of VoIP, threads and some aspects of End-to-End Encryption are supported. There are a few other smaller omissions due to the fact that the Matrix spec is constantly evolving but the aim remains to provide eventual support for the entire spec.
tr: NeoChat, Matrix belirtimi için tam özellikli bir uygulama olmayı hedefler. Bu nedenle; VoIP, ileti zincirleri ve Uçtan Uca Şifreleme’nin bazı yönleri gibi dikkate değer istisnalar dışında var olan kararlı belirtimdeki her şey desteklenir. Matrix belirtiminin sürekli gelişmesi nedeniyle birkaç küçük eksiklik daha var; ancak amaç tüm belirtim için nihai destek sağlamak olmayı sürdürüyor.

source: Due to the nature of the Matrix specification development NeoChat also supports numerous unstable features. Currently these are:
tr: NeoChat, Matrix belirtimi geliştirmesinin doğası gereği çok sayıda kararsız özelliği de destekler. Şu anda bunlar:

source: Polls - MSC3381
tr: Anketler — MSC3381

source: Sticker Packs - MSC2545
tr: Çıkartma Paketleri — MSC2545

source: Location Events - MSC3488
tr: Konum Etkinlikleri — MSC3488

source: Main view with room list, chat, and room information
tr: Oda listesini, sohbet penceresini ve oda bilgisini gösteren ana görünüm

source: Discover new communities with Matrix Spaces
tr: Matrix Alanlar ile yeni topluluklar keşfedin

source: Login screen
tr: Oturum açma ekranı
