Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.kolourpaint.appdata.po
Languages: tr

source: KolourPaint
tr: RenkliBoya

source: Paint Program
tr: Boyama Programı

source: KolourPaint is a simple painting program to quickly create raster images. It is useful as a touch-up tool and for simple image editing tasks.
tr: RenkliBoya, tez raster görseller oluşturabileceğiniz basit bir boyama programıdır. Bir rötuş aracı ve basit görsel düzenleme görevleri için kullanışlıdır.

source: Features:
tr: Özellikler:

source: Support for drawing various shapes - lines, rectangles, rounded rectangles, ovals and polygons
tr: Çeşitli şekiller, çizgiler, dörtgenler, yuvarlatılmış dörtgenler, ovaller ve çokgenler desteği

source: Curves, lines and text
tr: Eğriler, çizgiler ve metin

source: Color picker
tr: Renk seçicisi

source: Selections
tr: Seçimler

source: Rotation, monochrome and other advanced effects
tr: Döndürme, tek renkli resim ve diğer gelişmiş efektler

source: Painting in KolourPaint
tr: RenkliBoya’da Boyama
