Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.kdiff3.appdata.po
Languages: tr

source: A file and folder comparison and merge tool
tr: Dosya/klasör karşılaştırma ve birleştirme aracı

source: KDiff3 is a file and folder diff and merge tool which
tr: KDiff3, şunları yapabilen bir dosya/klasör diff ve birleştirme aracıdır

source: compares and merges two or three text input files or folders,
tr: dosyalardan ve klasörlerden iki veya üç metin girdi dosyasını karşılaştırır,

source: shows the differences line by line and character by character(!),
tr: ayrımları satır satır ve karakter karakter gösterir,

source: provides an automatic merge-facility,
tr: otomatik bir birleştirme ortamı sağlar,

source: has an editor for comfortable solving of merge-conflicts,
tr: birleştirme çakışmalarını çözmek için kolay kullanılabilir bir düzenleyicisi vardır,

source: provides network transparency via KIO,
tr: KIO ile ağ saydamlığı sağlar,

source: has options to highlight or hide changes in white-space or comments,
tr: boşluk veya yorum değişikliklerini vurgulamak veya gizlemek için seçenekleri vardır,

source: supports Unicode, UTF-8 and other file encodings,
tr: Unicode, UTF-8 ve diğer dosya kodlamalarını destekler,

source: prints differences,
tr: ayrımları yazdırır,

source: supports version control keyword and history merging.
tr: sürüm denetimi anahtar sözcüklerini ve geçmiş birleştirmesini destekler.
