Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.konsole.appdata.po
Languages: tr

source: Use the command line interface
tr: Komut satırı arayüzünü kullanın

source: Konsole is a terminal to run a command shell. It provides a command line interface for directly controlling your computer.
tr: Konsole, komut kabukları çalıştırmak için kullanılan bir uçbirimdir. Bilgisayarınızı doğrudan denetlemek için bir komut satırı arabirimi sağlar.

source: Features:
tr: Özellikler:

source: Tabs
tr: Sekmeler

source: Multiple profiles
tr: Çoklu profiller

source: Silence and Activity monitoring
tr: Sessizlik ve Etkinlik izleme

source: Bookmark support
tr: Yer imi desteği

source: Searching
tr: Arama

source: Saving output
tr: Çıktıyı kaydetme

source: Konsole being used as a terminal emulator
tr: Konsole uçbirim öykünücüsü olarak kullanılırken
