Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.knights.appdata.po
Languages: tr

source: KNights
tr: K Satranç

source: Chess game
tr: Satranç oyunu

source: KNights is a chess game. As a player, your goal is to defeat your opponent by checkmating their king.
tr: K Satranç bir satranç oyunudur. Oyuncu olarak hedefiniz, rakibinizi şah mat yapmaktır.

source: Features:
tr: Özellikler:

source: Local play between two players on the same computer
tr: Aynı bilgisayar üstünde iki oyuncu arasında yerel oyun

source: Play against any computer program that supports the XBoard protocol
tr: XBoard protokolünü destekleyen bir bilgisayar programına karşı oyna

source: Play on the Free Internet Chess Server (FICS)
tr: Özgür İnternet Satranç Sunucusu (FICS) üzerinden Oyna

source: Watching two computer engines play against each other
tr: İki bilgisayar işletkesinin birbiriyle oynamasını izle

source: Support for legal move checking
tr: Uygun hareket denetimi desteği

source: Markers for possible moves, opponent’s last move and sources of check
tr: OLası hamleler için işaretleyici, rakibin son hamlesi ve denetim kaynakları

source: Board borders and site notations
tr: Tahta çizgileri ve saha gösterimi

source: Complete time control, with Plasma-styled clocks
tr: Tamamlama süresi kontrolü, Plasma biçimi saat ile

source: Several themes, with the possibility of downloading new ones from within the program
tr: Birkaç tema, program üstünden de yenileri indirilebilir

source: Animated moves (configurable)
tr: Canlandırılmış hamleler (yapılandırılabilir)

source: Views for playing on a chess server, including a seek graph, text console, and chat widget
tr: Satranç sunucusu üzerindeki oyunlar için görünüm, grafik arama, metin konsolu ve sohbet programcığı da içerir

source: Option to undo and redo moves
tr: Hareketleri geri ve ileri alma seçeneği

source: Graphic interface for making and receiving offers from remote players
tr: Uzak oyuncuların önerilerini almak ve yapmak için grafik arayüzü

source: Support for the UCI protocol (used by Stockfish, Chessbase, and many others)
tr: UCI protokolü desteği (Stockfish, Chessbase ve diğerleri tarafından kullanılır)

source: Support for saving and loading Portable game notation (PGN) files
tr: Taşınabilir oyun gösterimi (PGN) dosyalarının kaydedilmesi ve yüklenmesi için destek

source: Speak opponent’s moves
tr: Rakibin hamlelerini seslendir

source: Ability to control the program via a D-Bus interface
tr: D-Bus arayüzü üzerinden program denetimi sağlar

source: Knights, chess game
tr: Satranç oyunu

source: Main Window - Human vs. Chess Engine
tr: Ana Pencere - İnsan, Satranç İşletkesine Karşı

source: Main Window - Chess Engine vs. Chess Engine
tr: Ana Pencere - Satranç İşletkesi, Kendisine Karşı

source: "New Game" Dialog
tr: "Yeni Oyun" Penceresi

source: Auto-Detection of Chess Engines
tr: Satranç İşletkesini Kendiliğinden Algılama

source: Playing online - FICS Console
tr: Çevrimiçi oyna - FICS Konsolu

source: Playing online - graphical Seek-Graph
tr: Çevrimiçi oyna - grafik Seek-Graph
