Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.ktechlab.appdata.po
Languages: tr

source: IDE for microcontrollers and electronics
tr: Mikro denetçiler ve elektronikler için tümleşik geliştirme ortamı

source: KTechlab is an IDE for microcontrollers and electronics designed to be as easy to use and unintrusive as possible.
tr: KTechlab, mikro denetçiler ve elektronikler için kullanımı kolay ve zahmetsiz olması için tasarlanmış bir tümleşik geliştirme ortamıdır.

source: Features:
tr: Özellikler:

source: Wide range of components with editable characteristics
tr: Düzenlenebilir karakteristiklerle geniş bir bileşen erimi

source: Visual editor for circuits
tr: Devreler için görsel düzenleyici

source: Context help for the components
tr: Bileşenler için bağlam yardımı

source: Two modes of connector routing: automatic and manual
tr: Bağlayıcı yönlendirme için iki kip: Kendiliğinden ve elle

source: Several ways to define the PIC logic: assembly code, Microbe (own high level programming language) code, C code, and visual FlowCode
tr: PIC mantığını tanımlamak için birkaç yol: Assembly kodu, Microbe (kendi yüksek düzey programlama dili), C kodu ve görsel FlowCode

source: Interconversion of the programming code between supported languages
tr: Desteklenen diller arasında programlama kodu dönüştürme özelliği

source: Inbuilt debugger
tr: Yerleşik hata ayıklayıcısı

source: Simulation with oscilloscope and probes
tr: Salınımölçer ve sondalarla benzetim

source: Uploading the assembly code to PIC using hardware programmer
tr: Donanım programcısı kullanarak Assembly kodunu PIC’e yükleme
