Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.karp.metainfo.po
Languages: tr

source: KDE arranger for PDFs
tr: PDF Düzenleyicisi

source: Karp - gives simple UI for PDF files modification. With a few mouse strokes user can:
tr: Karp, PDF dosyalarında değişiklik yapmak üzere yalın bir arayüz sunar. Birkaç fare hareketiyle kullanıcılar:

source: Append more PDF files and merge
tr: Ek PDF dosyalarını iliştirebilir ve birleştirebilir

source: Delete, rotate and reorder pages
tr: Sayfaları silebilir, döndürebilir ve yeniden sıralayabilir

source: Reduce PDF file size
tr: PDF dosyalarının boyutunu azaltabilir

source: Optimize images
tr: Görselleri eniyileyebilir

source: View and modify PDF properties
tr: PDF özelliklerini görüntüleyebilir ve üzerinde değişiklik yapabilir

source: Protect PDF with password
tr: PDF’leri parola ile koruyabilir

source: Karp main window with pages of PDF file
tr: PDF dosyasının sayfalarını gösteren Karp ana sayfası

source: Appending password protected PDF file
tr: Parola korumalı PDF dosyasına iliştiriliyor
