Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.kasts.appdata.po
Languages: tr

source: Kasts
tr: Kastlar

source: Podcast application
tr: Pod yayını uygulaması

source: The KDE Community
tr: KDE Topluluğu

source: Kasts is a convergent podcast application that looks good on desktop and mobile.
tr: Kastlar, hem masaüstü hem de taşınabilirde iyi çalışan, yakınsak bir pod yayını uygulamasıdır.

source: Its main features are:
tr: Temel özellikleri:

source: Episode management through play queue
tr: Çalma kuyruğu üzerinden bölüm yönetimi

source: Sync playback positions with other clients through gpodder.net or gpodder-nextcloud
tr: Çalma konumlarını, gpodder.net veya gpodder-nextcloud üzerinden eşzamanlama

source: Variable playback speed
tr: Değişken çalma hızı

source: Search for podcasts
tr: Pod yayını arama

source: Full system integration: e.g. inhibit system suspend while listening
tr: Tam sistem tümleşimi; örn. dinlerken sistem uykusunu engelleme

source: Kasts on the desktop with default header bar
tr: Öntanımlı başlık çubuğuyla masaüstünde Kastlar

source: Kasts on the desktop with minimized header bar
tr: Küçültülmüş başlık çubuğuyla masaüstünde Kastlar

source: Kasts on a phone
tr: Telefonda Kastlar

source: Kasts mobile player controls
tr: Kastlar taşınabilir çalar denetimleri
