Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.liquidshell.appdata.po
Languages: tr

source: liquidshell is an alternative to plasmashell
tr: Plasma’ya Alternatif Bir Kabuk

source: It does not use QtQuick but instead relies on QtWidgets, therefore no hardware graphics acceleration is needed.
tr: QtQuick yerine QtWidgets kullanır, dolayısıyla herhangi bir donanım ivmelendirmesine gerek duymaz.

source: Main Features:
tr: Ana özellikler:

source: Wallpaper per virtual desktop
tr: Her sanal masaüstüne ayrı duvar kâğıdı

source: No animations, no CPU hogging, low Memory footprint
tr: Canlandırma içermez, CPU’yu sıkboğaz etmez, düşük oranda bellek kullanır

source: Instant startup
tr: Anında başlar

source: No use of activities
tr: Etkinlikleri kullanmaz

source: QtWidgets based, therefore follows widget style from systemsettings
tr: QtWidgets tabanlıdır, dolayısıyla Sistem Ayarları araç takımı biçemini kullanır

source: Icons are used from your globally defined icon theme from systemsettings
tr: Simgeler, Sistem Ayarları’ndaki global simge temanızdan kullanılır

source: Colors are used from your globally defined color theme from systemsettings
tr: Renkler, sistem ayarlarındaki global renk temanızdan kullanılır

source: Can additionally be styled with css by passing the commandline option -stylesheet filename.css (see included example stylesheet.css)
tr: -stylesheet dosyaadı.css komut satırı seçeneğini kullanarak ek olarak temalanabilir (stylesheet.css örnek dosyasına bakın)

source: uses existing KDE dialogs for most configurations, e.g. StartMenu, Virtual Desktops, Bluetooth, Network
tr: Çoğu yapılandırma için KDE iletişim kutularını kullanır; örneğin Başlangıç Menüsü, Sanal Masaüstleri, Bluetooth, Ağ

source: One bottom DesktopPanel
tr: Bir adet altta masaüstü paneli

source: Desktop Applets
tr: Masaüstü uygulamacıkları
