Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.zanshin.metainfo.po
Languages: tr

source: Zanshin
tr: Zanşin

source: To Do Management Application
tr: Yapılacaklar Yönetimi Uygulaması

source: Zanshin is a powerful yet simple application for managing your day to day actions. It helps you organize and reduce the cognitive pressure of what one has to do in his job and personal life. You'll never forget anything anymore, getting your mind like water.
tr: Zanşin, günlük işlerinizi yönetmek için güçlü ve basit bir uygulamadır. Birinin işinde ve kişisel hayatında yapması gereken şeyin kavramsal baskısını düzenlemenize ve azaltmanıza yardımcı olur. Artık dikkatinizi toplayabilecek ve hiçbir şeyi unutmayacaksınız.

source: Collect
tr: Topla

source: Worried about forgetting something? Unexpected memory losses? Zanshin is here to help you. You can collect your tasks and free your mind. You will soon stop hearing this voice nagging you about what you probably forgot, or what you should do. Just fire up Zanshin, once something is collected, you are sure to find it there.
tr: Bir şeyi unutmaktan mı korkuyorsunuz? Belleğiniz eskisi gibi değil mi? Zanşin size yardım etmek için burada. Görevlerinizi toplayabilir ve zihninizi boşaltabilirsiniz. Yakında büyük olasılıkla unuttuğunuz veya ne yapmanız gerektiği konusunda sizi dırdır eden bu sesi duymayı bırakacaksınız. Sadece Zanşin’i açın, bir şeyi onun içine koyduysanız onu ne kadar zaman geçse bile orada bulacağınızdan emin olabilirsiniz.

source: Organize
tr: Organize Et

source: Zanshin makes it simple to put your daily life in order. Just create a few projects, a few contexts and start filling them with tasks. You can simply do this using drag and drop. Something has to be done before a given day? Just set a due date and it'll stand out from your other items. You need to work on a project? Focus on it and you will see all the related tasks. Feeling like dealing with your phone calls? Focus on your phone context to find all the pending calls you have to give.
tr: Zanşin, günlük yaşamınızı sıraya koymanıza yardımcı olur. Yalnızca birkaç proje ve bağlam oluşturun ve onları görevlerle doldurmaya başlayın. Bunu sürükle-bırak yaparak kolaylıkla gerçekleştirebilirsiniz. Bir gün öncesinden bir şey mi yapmanız gerekli? Yalnızca bir bitiş günü ayarlayın ve o diğerlerinden ayrı bir konumda duracaktır. Bir proje üzerine mi çalışmanız gerek? Ona odaklanın ve tüm ilgili görevleri görün. Aramanız gerekenleri mi halletmek istiyorsunuz? Telefon bağlamınıza odaklanın ve tüm aramalara geri dönün.

source: Optimize
tr: Eniyile

source: We hackers love our keyboards, and you probably find yourself more efficient with your hands on the keyboard as much as possible. That's why we crafted Zanshin carefully to be completely drivable from the keyboard. We added shortcuts to add tasks, move them to a project or a context, navigate, etc.
tr: Biz kurcalamayı sevenled klavyelerimizi çok severiz; siz de büyük olasılıkla ellerinizi olabildiğince klavyenin üzerinde tutmaya çalışıyorsunuzdur. Bu yüzden, Zanşin’i tümüyle klavye ile yürütülebilir kıldık. Her tür eylem için bir kısayol bulabilirsiniz.

source: Integrate
tr: Tümleştir

source: Zanshin is an application of the KDE community, as such it unleashes even more power when used with other KDE Applications or within KDE Plasma Desktop. Using KMail? You can create a task right from an email you received and it'll appear in Zanshin's Inbox. Using KOrganizer? All your overdue and coming task will appear in the calendar view. Using Plasma Desktop? Then you can collect from anywhere using KRunner, just type in "todo: Buy apples", and you will find that tasks in Zanshin's Inbox, even if it wasn't running!
tr: Zanşin, KDE topluluğuna ait bir uygulamadır; dolayısıyla onu başka KDE uygulamalarıyla veya Plasma Masaüstü ile kullanırken çok daha üretken olabildiğinizi fark edeceksiniz. K Posta mı kullanıyorsunuz? Aldığınız iletiden doğrudan bir görev oluşturun ve o Zanşin’in Gelen Kutusu’nda görünsün. K Organizatör? Tüm bekleyen görevleriniz takvim görünümünüzde görünür. Plasma Masaüstü? K Çalıştır kullanarak her yerden öge toplayabilirsiniz. Yalnızca "todo: Markete git" yazın ve Zanşin çalışmıyor olsa bile onun Gelen Kutusu’na eklensin!

source: Zanshin main window
tr: Zanşin ana penceresi
