Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.kile.appdata.po
Languages: tr

source: TeX/LaTeX Editor
tr: TeX/LaTeX Düzenleyicisi

source: Kile is a user-friendly TeX/LaTeX editor by KDE. Kile gives you the ability to use all the functionality of LaTeX in a graphical interface and has interactive preview mechanisms to readily see the results of editing.
tr: Kile, KDE tarafından yapılan kullanıcı dostu bir TeX/LaTeX düzenleyicisidir. Kile, LaTeX’in tüm işlevselliğini grafik bir arabirimde kullanmanıza izin verir ve düzenlemenizin sonuçlarını anında görebilmeniz için etkileşimli önizleme mekanizmaları sunar.

source: Features:
tr: Özellikler:

source: Compile, convert and view your document with one click
tr: Tek tıklama ile belgenizi derleyin, dönüştürün ve görüntüleyin

source: Auto-completion of (La)TeX commands
tr: (La)TeX komutlarının kendiliğinden tamamlanması

source: Templates and wizards make starting new documents very little work
tr: Şablonlar ve sihirbazlar yeni belgelere başlamayı çok kolaylaştırır

source: Easy insertion of many standard tags and symbols and the option to define (an arbitrary number of) user defined tags
tr: Pek çok standart etiketin ve sembolün kolayca eklenmesi ve kullanıcı tanımlı etiketleri (isteğe bağlı sayıda) tanımlama seçeneği

source: Inverse and forward search: click in the DVI viewer and jump to the corresponding LaTeX line in the editor, or jump from the editor to the corresponding page in the viewer
tr: Tersine ve ileri arama: DVI görüntüleyiciyi tıklayın ve düzenleyicideki ilgili LaTeX satırına atlayın veya düzenleyiciden görüntüleyicideki ilgili sayfaya atlayın

source: Finding chapter or sections is very easy, Kile constructs a list of all the chapter etc. in your document. You can use the list to jump to the corresponding section
tr: Fasıl veya bölümleri bulmak çok kolay, Kile belgenizdeki tüm bölümlerin vb. bir listesini oluşturur. İlgili bölüme atlamak için listeyi kullanabilirsiniz

source: Collect documents that belong together into a project
tr: Birlikte bir projeye ait olan belgeleri toplayın

source: Easy insertion of citations and references when using projects
tr: Projeleri kullanırken alıntıların ve başvuruların kolayca ekleyin

source: Flexible and smart build system to compile your LaTeX documents
tr: LaTeX belgelerinizi derlemek için esnek ve akıllı bir yapı sistemi

source: QuickPreview: preview a selected part of your document
tr: QuickPreview: Belgenizin seçili bir bölümünü önizleyin

source: Easy access to various help sources
tr: Çeşitli yardım kaynaklarına kolay erişim

source: Advanced editing commands
tr: İleri düzey düzenleme komutları

source: Document editing in Kile
tr: Kile’de belge düzenleme
