Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.kxstitch.appdata.po
Languages: tr

source: KXStitch
tr: KX Dikiş

source: A cross stitch pattern creator
tr: Çapraz dikiş desen oluşturucusu

source: KXStitch is a program that lets you create cross stitch patterns and charts. Patterns can be created from scratch on a user defined size of grid, which can be enlarged or reduced in size as your pattern progresses. Alternatively you can import images from many graphics file formats which will allow you to reduce the number of colors and to restrict the conversion to full stitches or optionally use fractional stitches. You may also use images as backgrounds allowing you to trace over them. These imported images can then be modified using the supplied tools to produce your final design.
tr: KX Dikiş, size çapraz dikiş desenler ve çizelgeler oluşturmanızı sağlayan bir programdır. Kalıplar sıfırdan ya da kullanıcı tarafından tanımlanmış ızgaradan oluşturulabilir. Bunlar sizin desen ilerlemenize göre büyüyebilir ya da küçülebilir. Alternatif olarak, çoğu resim dosya biçiminden içe görsel aktarabilir, renk sayısını düşürebilir ve dönüşümü yalnızca dikiş ile sınırlayabilir ya da kesirli dikiş kullanabilirsiniz. Ayrıca görselleri, üzerinden geçmek için arka planda kullanabilirsiniz. Bu içe aktarılan resimler, sağlanan araçlarla düzenlenebilir; böylece son tasarımınızı elde edebilirsiniz.

source: Features:
tr: Özellikler:

source: Creation of new patterns
tr: Yeni desen oluşturma

source: Editing of existing patterns - KXStitch is also capable of reading PC Stitch files
tr: Var olan desenleri düzenleme — KXStitch, PC Stitch dosyalarını da okuyabilir

source: Use of various floss pallets, DMC, Anchor, Madeira
tr: Çeşitli ip paleti, DMC, Anchor, Madeira kullanımı

source: Creation of custom palettes and colors
tr: Özel palet ve renk oluşturma

source: Use of standard stitches
tr: Standart dikiş kullanımı

source: Free use of backstitching
tr: İğne ardı dikiş kullanımı

source: Importing of various picture formats
tr: Çeşitli resim biçimlerini içe aktarma

source: Printing of patterns and floss keys
tr: Desenleri ve ip anahtarlarını yazdırma

source: A stitch pattern created from an image
tr: Bir görselden oluşturulmuş çapraz dikiş deseni
