Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.ktorrent.appdata.po
Languages: tr

source: BitTorrent Client
tr: BitTorrent İstemcisi

source: KTorrent is a BitTorrent application by KDE which allows you to download files using the BitTorrent protocol. It enables you to run multiple torrents at the same time and comes with extended features to make it a full-featured client for BitTorrent.
tr: K Torrent, KDE tarafından geliştirilen, BitTorrent protokolünü kullanarak dosyaları indirmenize izin veren bir BitTorrent uygulamasıdır. Aynı anda birden fazla torrent çalıştırabilmenizi ve BitTorrent için tam özellikli bir istemci yapabilmeniz için genişletilmiş özellikler ile birlikte geliştirilmiştir.

source: Features:
tr: Özellikler:

source: Queuing of torrents
tr: Torrent kuyruğu

source: Global and per torrent speed limits
tr: Global ve torrent başına hız sınırı

source: Previewing of certain file types, build in (video and audio)
tr: Belirli dosya türleri için önizleme (video ve ses)

source: Importing of partially or fully downloaded files
tr: Kısımsal veya tam indirilmiş dosyaları içe aktarma

source: File prioritization for multi-file torrents
tr: Birden çok dosya barındıran torrentler için dosya önceliklendirme

source: Selective downloading for multi-file torrents
tr: Birden çok dosya barındıran torrentler için seçimli indirme

source: Kick/ban peers with an additional IP Filter dialog for list/edit purposes
tr: Listeleme/Düzenleme amaçları için ek bir IP Süzgeci penceresi ile eşleri kovma/engelleme

source: UDP tracker support
tr: UDP izleyici desteği

source: Support for private trackers and torrents
tr: Özel izleyici ve torrent desteği

source: Support for µTorrent's peer exchange
tr: µTorrent eş değişimi desteği

source: Support for protocol encryption (compatible with Azureus)
tr: Protok şifreleme desteği (Azureus ile uyumlu)

source: Support for creating trackerless torrents
tr: İzleyicisiz torrentler için destek

source: Support for distributed hash tables (DHT, the Mainline version)
tr: Dağıtılmış özet tabloları için destek (DHT, Ana sürümü)

source: Support for UPnP to automatically forward ports on a LAN with dynamic assigned hosts
tr: Dinamik olarak atanmış makineler ile LAN üzerinde otomatik kapı yönlendirme için UPnP desteği

source: Support for webseeds
tr: Web beslemeleri için destek

source: System tray integration
tr: Sistem tepsisi tümleştirmesi

source: Tracker authentication support
tr: İzleyici kimlik doğrulama desteği

source: Connection through a proxy
tr: Vekil sunucu üzerinden bağlantı

source: In addition to the built-in functionalities, there are some plugins available for KTorrent.
tr: Yerleşik işlevlere ek olarak, K Torrent için kullanılabilen bazı eklentiler de bulunmaktadır.
