Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.kwave.appdata.po
Languages: tr

source: Kwave
tr: K Dalga

source: Sound editor
tr: Ses Düzenleyicisi

source: Kwave is a sound editor that can record to, play, open, and edit many file formats. Kwave makes it simple to edit audio in many ways.
tr: K Dalga, birçok dosya biçimini kaydedebilen, çalabilen, açabilen ve düzenleyebilen bir ses düzenleyicisidir. K Dalga, sesi birçok şekilde düzenlemeyi kolaylaştırır.

source: Adjust volume level:
tr: Ses düzeyini ayarla:

source: Fade in, fade out, or custom amplitude curve
tr: Solma, kaybolma veya özel genlik eğrisi

source: Scale volume by a constant factor
tr: Ses düzeyini sabit bir çarpanla ölçeklendir

source: Normalize volume
tr: Ses düzeyini normalleştir

source: Adjust frequency content:
tr: Frekans içeriğini ayarla

source: Lowpass filter
tr: Düşük geçiş süzgeci

source: Bandpass filter
tr: Bant geçişi süzgeci

source: Notch filter
tr: Çentik süzgeci

source: Pitch shift
tr: Perde kayması

source: Other features:
tr: Diğer özellikler:

source: Add noise
tr: Gürültü ekle

source: Add silence
tr: Sessizlik ekle

source: Convert audio sample rate
tr: Ses örneklem hızını dönüştür

source: Go to position
tr: Konuma git

source: Insert audio from clipboard
tr: Panodan ses ekle

source: Reverse audio
tr: Sesi tersine çevir

source: Save audio blocks between labels as separate files
tr: Etiketler arasındaki ses bloklarını ayrı dosyalar olarak kaydet

source: Sonagram (spectrogram)
tr: Sonagram (Spektogram)

source: Supported file formats:
tr: Desteklenen dosya biçimleri:

source: ASCII coded audio (*.ascii)
tr: ASCII kodlu ses (*.ascii)

source: all file formats supported by libaudiofile (some formats are import only)
tr: libaudiofile tarafından desteklenen tüm dosya biçimleri (bazı biçimler yalnızca içe aktarılabilir)

source: Kwave in action
tr: K Dalga çalışırken
