Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.angelfish.metainfo.po
Languages: tr

source: Angelfish
tr: Melekbalığı

source: Webbrowser for mobile devices
tr: Taşınabilir aygıtlar için web tarayıcısı

source: Angelfish is a modern mobile webbrowser
tr: Melekbalığı; çağdaş ve taşınabilir bir web tarayıcısıdır

source: It supports typical browser features, such as
tr: Aşağıda bir listesini görebileceğiniz standart web tarayıcısı özelliklerine sahiptir:

source: bookmarks
tr: yer imleri

source: history
tr: geçmiş

source: tabs
tr: sekmeler

source: Homepage
tr: Ana Sayfa

source: Menu Actions
tr: Menü Eylemleri

source: Tabs View
tr: Sekmeler Görünümü

source: Desktop User Interface
tr: Masaüstü Kullanıcı Arayüzü
