Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.kgraphviewer.appdata.po
Languages: tr

source: KGraphViewer
tr: K Grafik Görüntüleyicisi

source: A Graphviz DOT graph viewer
tr: Graphviz DOT graf görüntüleyicisi

source: KGraphViewer is a Graphviz DOT graph file viewer, aimed to replace the other outdated Graphviz tools. Graphs are commonly used in scientific domains and particularly in computer science.
tr: K Grafik Görüntüleyicisi bir Graphiz DOT graf dosyası görüntüleyicisidir. Zamanı dolmuş diğer GraphViz araçlarının yerini alması amaçlanmıştır. Grafikler genel olarak bilimsel alanda ve bilgisayar bilişmlerinde kullanılmaktadır.

source: Features:
tr: Özellikler:

source: Zooming
tr: Yakınlaştırma

source: Threaded loading of several graphs in tabs
tr: Birden çok grafiği sekmelere yükleyebilme

source: Saving of the recent files list
tr: Geçerli dosya listesini kaydedebilme

source: Manual reload of files
tr: Dosyaların elle yeniden yüklenmesi

source: Display of a bird-eye view of the graph
tr: Grafiğin kuş bakışı görüntülenmesi

source: Moving of the graph by dragging
tr: Grafiği sürükleyerek taşıyabilme

source: Full featured printing
tr: Tam özellikli yazdırma

source: Perfect drawing of all graphviz example graphs
tr: Tüm graphviz örnek grafiklerinin mükemmel çizimi

source: Automatically choose dot for directed graphs and neato for undirected
tr: Yönlendirilmiş grafikler için dot, yönlendirilmemişler için neato seçin

source: Possibility to use an arbitrary layout algorithm as soon as it produces xdot format
tr: Genellikle hızlı bir biçimde xdot biçiminde üretmek için rastgele düzen algoritması kullanır

source: Automatic reloading with user confirmation of (externally) modified files (configurable)
tr: Değişiklik yapılmış(harici) dosyalarda(yapılandırılabilir), kullanıcı onaylamasıyla otomatik yeniden yükleme

source: Open new instances as new tabs in the old one (configurable)
tr: Eskisi içinde (yapılandırılabilir) yeni sekmeler olarak yeni örnekler aç
