Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.dragonplayer.appdata.po
Languages: tr

source: Dragon Player
tr: Dragon

source: Video player with focus on simplicity
tr: Sadeliğe odaklanan video oynatıcısı

source: Dragon Player is a multimedia player where the focus is on simplicity, instead of features. Dragon Player does one thing, and only one thing, which is playing multimedia files. Its simple interface is designed not to get in your way and instead empower you to simply play multimedia files.
tr: Dragon, özellikler yerine yalınlığa odaklanan bir çoklu ortam oynatıcıdır. Dragon tek bir şey yapar, o da çoklu ortam dosyalarını oynatmak. Basit arayüzü, yolunuza çıkmayacak şekilde tasarlanmıştır ve bunun yerine çoklu ortam dosyalarını kolayca oynatmanızı sağlar.

source: Features:
tr: Özellikler:

source: Simple Interface
tr: Yalın Arayüz

source: Resuming videos: Starts playing a video where you were watching it last time
tr: Videoları kaldığı yerden sürdürme: Bir videoyu son izlediğiniz yerden oynatmaya başlar

source: Support for subtitles: Automatically loads subtitles with the matching name
tr: Altyazı desteği: Adı uyuşan altyazıları kendiliğinden yükler

source: Video display settings (brightness, contrast)
tr: Video görüntüleme ayarları (parlaklık, karşıtlık)

source: Due to using Solid and Phonon DragonPlayer is independent of any multimedia framework or hardware abstraction layer
tr: Solid ve Phonon kullandığı için Dragon herhangi bir çoklu ortam çatısına veya donanım soyutlama katmanına bağlı değildir

source: Supports playing CDs and DVDs
tr: CD ve DVD oynatmayı destekler
