Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.labplot.appdata.po
Languages: tr

source: Visualize and analyze data
tr: Veri görselleyin ve çözümleyin

source: LabPlot is a FREE, open source and cross-platform Data Visualization and Analysis software accessible to everyone.
tr: LabPlot herkese açık, ÜCRETSİZ, açık kaynaklı ve çok sayıda platform üzerinde çalışan bir veri görselleştirme ve çözümleme yazılımıdır.

source: LabPlot provides an easy way to create, manage and edit plots. It allows you to produce plots based on data from a spreadsheet or on data imported from external files. Plots can be exported to several pixmap and vector graphic formats.
tr: LabPlot çizimler oluşturmanın, yönetmenin ve düzenlemenin kolay bir yolunu sunar. Bir elektronik tablodan veya başka dosyalardan içe aktarılan verilerden yola çıkarak çizimler üretebilirsiniz. Çizimler çeşitli piksel haritası ve vektör grafik biçimlerine dışa aktarılabilir.

source: Basic visualization of data
tr: Temel veri görselleştirmesi

source: Advanced layouting of plots and images
tr: Çizimlerin ve görsellerin gelişmiş yerleşimi

source: Theming
tr: Temalama

source: Visualization of mathematical functions
tr: Matematiksel işlevlerin görselleştirilmesi

source: Fit pre-defined or custom models to the data
tr: Veriye önceden tanımlanmış veya özel modelleri uydurun

source: Smooth the data with the help of various smoothing methods
tr: Çeşitli pürüzsüzleştirme yöntemlerinin yardımıyla veriyi pürüzsüzleştirin

source: Notebook interface for interactive sessions in Maxima, Octave, R, Sage, Scilab, Python, Julia, etc
tr: Maxima, Octave, R, Sage, Scilab, Python, Julia vb. içinde etkileşimli oturumlar için defter arayüzü

source: Signal analysis
tr: Sinyal çözümlemesi

source: Herzsprung-Russel diagram in LabPlot
tr: LabPlot’ta Herzsprung-Russel diyagramı

source: Visualization of data calculated in an interactive Maxima session
tr: Bir etkileşimli Maxima oturumunda hesaplanan verinin görselleştirilmesi
