Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.kaddressbook.appdata.po
Languages: tr

source: The KDE Community
tr: KDE Topluluğu

source: KAddressBook
tr: K Adres Defteri

source: An address book manager
tr: Adres defteri yöneticisi

source: KAddressBook stores all the personal details of your family, friends and other contacts. It supports large variety of services, including NextCloud, Kolab, Google Contacts, Microsoft Exchange (EWS) or any standard CalDAV server.
tr: K Adres Defteri, ailenizin, arkadaşlarınızın ve diğer tanıdıklarınızın tüm kişisel ayrıntılarını depolar. Nexcloud, Kolab, Google Kişiler, Microsoft Exchange ve herhangi bir standart CalDAV sunucusu da dahil olmak üzere geniş bir hizmet çeşidini destekler.

source: Features:
tr: Özellikler:

source: Powerful search - KAddressBook has configurable filters and powerful search capabilities.
tr: Güçlü arama - K Adres Defteri yapılandırılabilir süzgeçlere ve güçlü arama yeteneklerine sahiptir.

source: Duplicate detection and merging - KAddressBook can find duplicated contacts from multiple sources and can merge them into a single contact.
tr: K Adres Defteri, birden çok kaynaktan yinelenmiş kişileri bulabilir ve onları tek bir kişiye birleştirir.

source: Good standard support - KAddressBook can import and export from and to nearly every address book standard.
tr: İyi standartlar desteği - K Adres Defteri, neredeyse her adres defteri standartından kişileri içe/dışa aktarabilir.

source: LDAP integration - Can connect to multiple LDAP servers, which can then be used for contact autocompletion when composing emails in KMail.
tr: LDAP tümleştirmesi - Birden çok LDAP sunucusuna bağlanabilir ve bunlar örneğin K Posta’da otomatik tamamlama için kullanılabilir.

source: Integration - Integrates with other Kontact components, e.g. exporting birthday reminders to KOrganizer
tr: Tümleştirme - Diğer Kontak bileşenleriyle bütünleşir; örneğin K Organizatör’e doğum günlerini dışa aktarabilirsiniz

source: QR codes - KAddressBook can display a QR code for each contact to quickly scan it into your phone or send to someone.
tr: Kare kodlar - K Adres Defteri, telefonunuza kolaylıkla taramanız veya başkasına gönderebilmeniz için her kişiye bir kare kod atar ve görüntüler.

source: KAddressBook embedded into Kontact
tr: Kontak içine gömülü K Adres Defteri
