Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.krusader.appdata.po
Languages: tr

source: File Manager
tr: Dosya Yöneticisi

source: Krusader is an advanced twin panel (commander style) file manager for KDE Plasma and other desktops in the *nix world
tr: Krusader, KDE Plasma ve *nix dünyasındaki diğer masaüstleri için gelişmiş bir ikiz panel (commander türünde) dosya yöneticisidir

source: Features:
tr: Özellikler:

source: Extensive archive handling
tr: Kapsamlı arşiv yönetimi

source: Mounted filesystem support
tr: Bağlı dosya sistemi desteği

source: FTP support
tr: FTP desteği

source: Advanced search module
tr: Gelişmiş arama modülü

source: Internal viewer/editor
tr: Dahili görüntüleyici/düzenleyici

source: Folder synchronisation
tr: Klasör eşzamanlama

source: File content comparisons
tr: Dosya içeriği karşılaştırma

source: Powerful batch renaming
tr: Güçlü toplu yeniden adlandırma

source: Support for a wide variety of archive formats and can handle other KIO slaves such as smb or fish.
tr: Çok çeşitli arşiv biçimleri desteği ve smb veya fish gibi diğer KIO araçlarının yönetimi.

source: Completely customizable and very user friendly
tr: Tamam kişiselleştirilebilir ve oldukça kullanıcı dostu

source: File management in Krusader
tr: Krusader'da dosya yönetimi
