Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.konversation.appdata.po
Languages: tr

source: IRC client
tr: IRC istemcisi

source: Konversation is a user-friendly Internet Relay Chat (IRC) client by KDE. It provides easy access to standard IRC networks such as Libera, where the KDE IRC channels can be found.
tr: Konversation, KDE tarafından yapılan, kullanıcı dostu bir IRC istemcisidir. KDE IRC kanallarının bulunduğu Libera gibi standart IRC ağlarına kolay erişim sağlar.

source: Features:
tr: Özellikler:

source: Standard IRC features
tr: Standart IRC özellikleri

source: SSL server support
tr: SSL sunucu desteği

source: Bookmarking support
tr: Yer imi desteği

source: Easy to use graphical user interface
tr: Kullanımı kolay grafik kullanıcı arayüzü

source: Multiple servers and channels in one single window
tr: Tek bir pencerede birden çok sunucu ve kanal

source: DCC file transfer
tr: DCC dosya aktarımı

source: Multiple identities for different servers
tr: Farklı sunucular için birden fazla kimlik

source: Text decorations and colors
tr: Metin süslemeleri ve renkleri

source: OnScreen Display for notifications
tr: Bildirimler için Ekran Üzeri Görüntü

source: Automatic UTF-8 detection
tr: Otomatik UTF-8 algılaması

source: Per channel encoding support
tr: Kanal başına şifreleme desteği

source: Theme support for nick icons
tr: Takma ad simgeleri için tema desteği

source: Highly configurable
tr: Son derece yapılandırılabilir
