Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.haruna.metainfo.po
Languages: tr

source: Haruna Media Player
tr: Haruna Ortam Oynatıcısı

source: Open source media player built with Qt/QML and libmpv
tr: Qt/QML ve libmpv ile yapılmış, açık kaynaklı ortam oynatıcısı

source: Open source media player built with Qt/QML and libmpv.
tr: Qt/QML ve libmpv ile yapılmış, açık kaynaklı ortam oynatıcısı.

source: Features
tr: Özellikler

source: play online videos, through youtube-dl
tr: çevrimiçi videoları youtube-dl aracılığıyla oynat

source: supports youtube playlists
tr: youtube oynatma listelerini destekler

source: toggle playlist with mouse-over, playlist overlays the video
tr: oynatma listelerini fare imleci üzerine geldiğinde aç/kapat, liste videonun üzerine yerleşir

source: auto skip chapter containing certain words
tr: kimi sözcükleri içeren fasılları kendiliğinden atla

source: configurable shortcuts and mouse buttons
tr: yapılandırılabilir kısayollar ve fare düğmeleri

source: quick jump to next chapter by middle click on progress bar
tr: ilerleme çubuğuna orta tıklayarak sonraki fasıla çabucak atla

source: Haruna main window
tr: Haruna ana penceresi

source: Haruna main window, breeze dark color scheme
tr: Esinti Koyu renk şeması ile Haruna ana penceresi

source: Haruna without menubar and toolbar
tr: menü çubuğu ve araç çubuğu olmadan Haruna

source: Haruna settings window
tr: Haruna ayarlar penceresi
