Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.elf-dissector.appdata.po
Languages: tr

source: ELF Dissector
tr: ELF Parçalara Ayırıcı

source: Static analysis tool for ELF files
tr: ELF dosyaları için durağan çözümleme aracı

source: ELF Dissector is useful if you need to do one or more of the following tasks:
tr: ELF Parçalara Ayırıcı, aşağıdaki görevlerden birini veya birkaçını yapmanız gerektiğinde yararlıdır:

source: Inspecting forward and backward dependencies, on library and symbol level.
tr: İleri ve geri bağımlılıkları denetleme, kitaplık ve sembol düzeyinde.

source: Identifying load-time performance bottlenecks such as expensive static constructors or excessive relocations.
tr: Durağan yapıcılar veya gereğinden çok yeniden konumlandırmalar gibi yükleme zamanı başarım tıkanıklıklarını belirleme.

source: Size profiling of ELF files.
tr: ELF dosyalarının boyut profillemesi.

source: Main features:
tr: Ana özellikler:

source: ELF structure browser.
tr: ELF yapısı tarayıcısı

source: Tree map visualization of the size of the various parts of an ELF file.
tr: Bir ELF dosyasının çeşitli kısımlarının ağaç haritası biçiminde görselleştirmesi

source: Relocation heatmap.
tr: Yeniden konumlandırma ısı haritası

source: Built-in disassembler for x86 and AArch64.
tr: x86 ve AArch64 için gömülü gelen parçalara ayırıcı

source: Browser for data type memory layouts extracted from DWARF debug information.
tr: DWARF hata ayıklama bilgisinden ayıklanan veri türü bellek yerleşimleri için tarayıcı

source: Forward and backward dependency viewer.
tr: İleri ve geri bağımlılık görüntüleyicisi

source: Size treemap views
tr: Boyut ağaç haritası görünümleri
