Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.kget.appdata.po
Languages: tr

source: KGet
tr: K İndir

source: Download manager
tr: İndirme Yöneticisi

source: KGet is a versatile and user-friendly download manager.
tr: K İndir, geniş kapsamlı ve kullanıcı dostu bir indirme yöneticisidir.

source: Features:
tr: Özellikler:

source: Downloading files from FTP and HTTP(S) sources.
tr: FTP ve HTTP(S) kaynaklarından dosya indirme.

source: Pausing and resuming of downloading files, as well as the ability to restart a download.
tr: İndirilen dosyaların duraklatılması ve sürdürülmesi ve aynı zamanda yeniden başlatılması.

source: Tells lots of information about current and pending downloads.
tr: Geçerli ve bekleyen indirmeler hakkında ek bilgiler.

source: Embedding into system tray.
tr: Sistem tepsisinde çalışabilme.

source: Integration with the Konqueror web browser.
tr: Konqueror web tarayıcısı ile tümleşme.

source: Metalink support which contain multiple URLs for downloads, along with checksums and other information.
tr: İndirmeler için birden çok bağlantı ve/veya sağlama toplamları ve başka bilgiler içeren Metalink desteği.

source: Downloading files with KGet
tr: K İndir ile dosya indirme
