Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.massif-visualizer.appdata.po
Languages: tr

source: Massif-Visualizer
tr: Massif Görselleyicisi

source: A visualizer for Valgrind Massif data files
tr: Valgrind Massif veri dosyaları için bir görselleyici

source: Massif Visualizer is a tool that - who'd guess that - visualizes massif data. You run your application in Valgrind with --tool=massif and then open the generated massif.out.%pid in the visualizer. Gzip or Bzip2 compressed massif files can also be opened transparently.
tr: Massif Görselleyicisi, Massif verilerini görselleştiren bir araçtır. Uygulamanızı --tool=massif ile Valgrind’de çalıştırdıktan sonra üretilen massif.out.%pid dosyasını görüntüleyicide açın. Gzip veya Bzip2 ile sıkıştırılmış Massif dosyaları da saydam bir biçimde açılabilir.

source: Features:
tr: Özellikler:

source: Interactive chart of memory consumption over time.
tr: Zaman içinde, etkileşimli bellek tüketim tablosu.

source: Detailed snapshot analysis with callgraph visualization (requires KGraphViewer).
tr: Çağrı Grafiği görselleştirmesi (K Grafik Görüntüleyicisi gerektirir) ile ayrıntılı anlık çözümleme.

source: Summary of peak memory consumption of all allocating functions.
tr: Yer ayrılan tüm işlevlerin tepe bellek tüketiminin özeti.

source: Interactive chart of memory consumption over time
tr: Zaman içindeki etkileşimli bellek tüketim tablosu

source: Detailed snapshot analysis with callgraph visualization (requires KGraphViewer)
tr: Çağrı Grafiği görselleştirmesi (K Grafik Görüntüleyicisi gerektirir) ile ayrıntılı anlık çözümleme

source: Summary of peak memory consumption of all allocating functions
tr: Yer ayrılan tüm işlevlerin tepe bellek tüketiminin özeti
