Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.smb4k.appdata.po
Languages: tr

source: Discover and mount SAMBA and Windows shares over the network
tr: SAMBA ve Windows paylaşımlarını ağ üzerinden keşfedin ve bağlayın

source: Smb4K is an advanced network neighborhood browser and Samba share mounting utility. It is based on the KDE Frameworks, QtKeychain, Samba's client library (libsmbclient) and, optionally, the KDSoap WS-Discovery client. It scans your network neighborhood for all available workgroups, servers and shares and can mount all desired shares to your local file system.
tr: Smb4K, gelişmiş bir ağ komşuları tarayıcısı ve samba paylaşım bağlama programıdır. KDE Frameworks, QtKeyChain, Samba istemci kitaplığı (libsmbclient) ve isteğe bağlı olarak KDSoap WS-Discovery istemcisi temellidir. Tüm ulaşılabilir çalışma grupları, sunucular ve paylaşımlar sizin ağ komşularınızı tarar, gerekli paylaşımları yerel dosya sisteminize bağlar.

source: Features:
tr: Özellikler:

source: Scanning for (active) workgroups, hosts, and shares using Samba's client library, DNS Service Discovery (DNS-SD) and, optionally, Web Services Dynamic Discovery (WS-Discovery)
tr: Samba’nın istemci kitaplığını, DNS Hizmet Keşfini (DNS-SD) ve isteğe bağlı olarak Wib Hizmetleri Dinamik Keşfi’ni (WS-Discovery) kullanarak (etkin) çalışma gruplarını, makineleri ve paylaşımları tarayın

source: Support of the CIFS and SMB3 file system under Linux as well as the SMBFS file system under BSD
tr: Linux altında CIFS ve SMB3 dosya sistemini ve BSD altında SMBFS dosya sistemini destekler

source: Mounting and unmounting of shares
tr: Paylaşımları bağlama ve bağlantılarını kesme

source: Access to the files of a mounted share using a file manager or terminal
tr: Bağlanmış paylaşımın dosyalarına, dosya yöneticisi veya uçbirim üzerinden erişim

source: Auto-detection of external mounts and unmounts
tr: Dış bağlamaların otomatik algılanması ve bağlantılarının kesilmesi

source: Remounting of previously used shares on program start
tr: Program başlangıcında, daha önce kullanılmış paylaşımları yeniden bağlama

source: Miscellaneous information about remote network items and mounted shares
tr: Uzak ağ ögeleri ve bağlı paylaşımlar hakkında çeşitli bilgiler

source: Network search
tr: Ağ arama

source: Preview of the contents of a remote share
tr: Bir uzak paylaşımın içeriğinin önizlemesi

source: Default login
tr: Öntanımlı oturum açma

source: Special handling of home shares
tr: Ev paylaşımlarına özel işlemler

source: Ability to bookmark favorite shares
tr: Sık kullanılan paylaşımlara yer imi koyma olanağı

source: System tray widget
tr: Sistem tepsisi araç takımı

source: Support of advanced mount options
tr: Gelişmiş bağlama seçenekleri desteği

source: Support of printer shares
tr: Yazıcı paylaşımları desteği

source: Support of several secure storage solutions for the login credentials via QtKeychain
tr: Oturum açma bilgilerini kaydetmek için QtKeyChain de içerilmek üzere çeşitli güvenli depolama çözümleri desteği

source: Synchronization of a remote share with a local copy and vice versa
tr: Uzak paylaşımın yerel bir kopya ile eşitlenmesi veya tam tersi

source: Ability to define custom settings for individual servers and shares
tr: Kişisel sunucular ve paylaşımlar için özel ayarlar tanımlama yeteneği

source: Hardware support through the Solid device integration framework, the KDBusAddons convenience classes and the Qt Network module
tr: Solid aygıt çatısı, KDBusAddons kolaylık sınıfları ve Qt ağ modülü aracılığıyla donanım desteği

source: Wake-On-LAN capabilities
tr: Yerel ağ üzerinden açma yetenekleri

source: Plasmoid for desktop integration
tr: Masaüstü tümleştirmesi için Plasmoid

source: Profiles for different network neighborhood setups
tr: Farklı ağ komşuları kurulumları için profiller

source: If you are working in a Windows dominated network environment, you may want to install this application to be able to easily access the provided Windows shares.
tr: Windows’un hakim olduğu bir ağ ortamında çalışıyorsanız sağlanan Windows paylaşımlarına kolayca erişebilmek için bu uygulamayı kurmak isteyebilirsiniz.

source: The main window
tr: Ana pencere

source: The plasmoid
tr: Plasmoid
