Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.kapptemplate.appdata.po
Languages: tr

source: KAppTemplate
tr: K Uygulama Şablonu

source: App Code Template Generator
tr: Uygulama Kod Şablonu Oluşturucu

source: KAppTemplate is an application to start development quickly using existing templates providing basic repeatedly written code and a proper structure.
tr: K Uygulama Şablonu, var olan şablonları kullanarak yinelenen kodları ve uygun yapıyı sağlayan ve tez geliştirmeye başlayabileceğiniz bir araçtır.

source: Features:
tr: Özellikler:

source: Templates for C++, Ruby, Python and PHP
tr: C++, Ruby, Python ve PHP için şablonlar

source: Categories
tr: Kategoriler

source: Templates for different build-systems and frameworks
tr: Farklı yapı sistemleri ve kod kitaplıkları için şablonlar

source: Templates especially for KDE-development (plugins for Plasma, QtQuick, KTextEditor, KRunner, Akonadi)
tr: KDE geliştirmesi için şablonlar (Plasma, Calligra, KTextEditor, K Çalıştır, Akonadi için eklentiler)

source: It is easy to create new templates using space holders and a simple CMake-command
tr: Yer tutucular ve basit CMake komutları kullanarak yeni şablonlar oluşturmak çok kolaydır

source: Integrated into KDevelop
tr: K Geliştir ile tümleşik çalışır
