Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.juk.appdata.po
Languages: tr

source: Music Player
tr: Müzik Çalar

source: JuK is an audio jukebox application, supporting collections of MP3, Ogg Vorbis, and FLAC audio files. It allows you to edit the "tags" of your audio files, and manage your collection and playlists. Its main focus, in fact, is on music management.
tr: JuK; MP3, Ogg Vorbis ve FLAC ses dosyalarını destekleyen bir müzik kutusu uygulamasıdır. Ses dosyalarının “künyelerini” düzenlemenize ve koleksiyon ve çalma listelerini yönetmenize izin verir. Ana odak noktası müzik yönetimidir.

source: Features:
tr: Özellikler:

source: Collection list and multiple user defined playlists
tr: Koleksiyon listesi ve çoklu kullanıcı tanımlı çalma listeleri

source: Ability to scan directories to automatically import playlists and music files on start up
tr: Açılışta dizinleri kendiliğinden tarayarak çalma listelerini ve müzik dosyalarını içe aktarma yeteneği

source: Dynamic Search Playlists that are automatically updated as fields in the collection change
tr: Koleksiyondaki alanlar değiştiğinde kendiliğinden güncellenen Devingen Arama Çalma Listeleri

source: A Tree View mode where playlists are automatically generated for sets of albums, artists and genres
tr: Çalma listeleri albüm, sanatçı ve türlerden kendiliğinden oluşturulan Ağaç Görünümü kipi

source: Playlist history to indicate which files have been played and when
tr: Hangi dosyaların ne zaman çalındığını belirleyen çalma listesi geçmişi

source: Inline search for filtering the list of visible items
tr: Görünür ögeleri süzmek için yeniden arama

source: The ability to guess tag information based on the track's file name
tr: Parçanın dosya adına dayanarak künye bilgisini tahmin etme

source: File renamer that can rename files based on the tag content
tr: Künye içeriğine bağlı olarak dosyayı yeniden adlandırabilme

source: Tag reading and editing support for many formats including ID3v1, ID3v2 and Ogg Vorbis
tr: ID3v1, ID3v2 ve Ogg Vorbis dahil pek çok biçim için künye okuma ve düzenleme desteği
