Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.korganizer.appdata.po
Languages: tr

source: The KDE Community
tr: KDE Topluluğu

source: KOrganizer
tr: K Organizatör

source: KOrganizer is a calendar and scheduling application
tr: K Organizatör bir takvim ve zamanlama uygulamasıdır

source: KOrganizer is the calendar and scheduling component of Kontact. It provides management of events and tasks, alarm notification, web export, network transparent handling of data, group scheduling, import and export of calendar files and more. It is able to work together with a wide variety of calendaring services, including NextCloud, Kolab, Google Calendar and others. KOrganizer is fully customizable to your needs and is an integral part of the Kontact suite, which aims to be a complete solution for organizing your personal data. KOrganizer supports the two dominant standards for storing and exchanging calendar data, vCalendar and iCalendar.
tr: K Organizatör, Kontak'ın takvim ve zamanlama bileşenidir. Etkinlikler ve görevler yönetimi, alarm bildirimleri, web biçiminde dışa aktarım, ağda iletilebilir veri yönetimi, grup zamanlama ve takvim dosyalarının içe/dışa aktarımını tek bir program altında sunar. Nextcloud, Kolab, Google Takvim ve bir çok daha takvim hizmetleriyle birlikte çalışabilir. K Organizatör, gereksinimlerinize göre tümüyle özelleştirilebilir ve kişisel verinizi düzenlemenin tam takım bir yolu olan Kontak takımının ayrılmaz bir parçasıdır. K Organizatör, günümüzde kullanılan iki yaygın takvim verisi taşıma biçimi olan vCalendar ve iCalendar'ı destekler.

source: Features:
tr: Özellikler:

source: Support for multiple calendars and todo lists
tr: Birden çok takvim ve yapılacaklar listesi destekler

source: Storage model
tr: Depolama modeli

source: Undo and Redo
tr: Geri Al ve Yinele

source: Todo integration with agenda view
tr: Ajanda görünümüyle yapılacakların tümleşimi

source: Attachments for events and todos
tr: Olaylar ve yapılacaklar için ekler

source: Quick todo and event entries
tr: Tez yapılacak ve etkinlik girişi

source: Print support
tr: Yazdırma desteği
