Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.CrowTranslate.metainfo.po
Languages: tr

source: Crow Translate
tr: Crow Çeviri

source: Application that allows you to translate and speak text using Mozhi
tr: Metinleri çevirmek ve seslendirmek için basit bir çeviri yazılımı

source: Application written in C++ / Qt that allows you to translate and speak text using Mozhi.
tr: C++/Qt ile yazılmış, Mozhi kullanarak metinleri çevirmenize ve seslendirmenize olanak tanıyan bir uygulama.

source: Features:
tr: Özellikler:

source: Multiple translation engines provided by Mozhi (some instances can disable specific engines)*
tr: Mozhi tarafından sağlanan birden çok çeviri işletkesi (bazı örnekler belirli işletkeleri devre dışı bırakabilir)*

source: Translate and speak text from screen or selection
tr: Ekrandan veya bir seçimden olan metni çevir ve konuş

source: Highly customizable shortcuts
tr: Yüksek derecede özelleştirilebilir kısayollar

source: Command-line interface with rich options
tr: Zengin seçenekler içeren komut satırı arayüzü

source: D-Bus API
tr: D-Bus API’si

source: Available for Linux and Windows
tr: Linux ve Windows üzerinde kullanılabilir

source: *While Mozhi acts as a proxy to protect your privacy, the third-party services it uses may store and analyze the text you send.
tr: * Mozhi, gizliliğinizi korumak adına bir vekil olarak davranırken, kullandığı üçüncü parti hizmetlerin bazıları gönderdiğiniz metinleri depolayabilir ve çözümleyebilir.

source: Main window
tr: Ana pencere

source: Settings
tr: Ayarlar

source: Main window on Plasma Mobile
tr: Plasma Cep üzerinde ana pencere

source: Portrait main window on Plasma Mobile
tr: Plasma Cep üzerinde dikey ana pencere

source: Settings on Plasma Mobile
tr: Plasma Cep üzerinde ayarlar
