Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.itinerary.appdata.po
Languages: tr

source: KDE Itinerary
tr: KDE Yol Kılavuzu

source: Digital travel assistant
tr: Sayısal yolculuk asistanı

source: KDE Itinerary is a digital travel assistant with a priority on protecting your privacy.
tr: KDE Yol Kılavuzu, gizliliğinize öncelik veren bir sayısal yolculuk asistanıdır.

source: Features:
tr: Özellikler:

source: Timeline view of a unified travel itinerary with automatic trip grouping.
tr: Otomatik yolculuk gruplandırması ile birleşik yolcu belgelerinin zaman akışı görünümü.

source: Supports train, bus and flight bookings as well as hotel, restaurant, event and rental car reservations.
tr: Tren, otobüs ve uçak rezervasyonlarının yanı sıra otel, restoran ve kiralık araç rezervasyonlarını da destekler.

source: Boarding pass management.
tr: Biniş kartı yönetimi.

source: Supports ticket management for multi-traveler and multi-ticket bookings.
tr: Çok yolculu ve çok biletli rezervasyonlar için bilet yönetimi desteği.

source: Automatic booking data extraction from various input formats, performed locally on your device.
tr: Yerel olarak aygıtınızda gerçekleştirilen, çeşitli girdi biçimlerinden otomatik rezervasyon verisi çıkarımı.

source: Real-time delay and platform change information for trains.
tr: Trenler için gerçek zamanlı gecikme ve platform değişikliği bilgisi.

source: Weather forecast for destination along your trip.
tr: Yolculuk noktalarınız için hava durumu tahmini.

source: Full control over all online access.
tr: Tüm çevrimiçi erişim üzerinde tam denetim.

source: Selection of alternative train connections on unbound tickets or on missed connections.
tr: Açık biletler veya kaçırılan aktarmalar için alternatif tren önerileri seçimi.

source: Local ground transportation navigation between elements of your itinerary.
tr: Yolcu belgesi ögeleriniz arasında yerel yer ulaşımı dolaşımı.

source: Train coach layout view (for some operators only).
tr: Tren vagonu yerleşimi görünümü (yalnızca bazı operatörlerde).

source: Train station and airport per-floor maps based on OpenStreetMap data.
tr: OpenStreetMap verisine dayalı tren istasyonu ve havaalanı kat haritaları.

source: Available dock-based or free-floating rental bikes can be displayed on the train station map.
tr: Tren istasyonu haritasında rıhtımlı veya serbest bırakılmış kiralık bisiklet bilgisi görüntülenebilir.

source: Personal travel statistics to monitor environmental impact.
tr: Çevre etkisini izlemek üzere kişisel yolculuk istatistikleri.

source: KDE Itinerary works best alongside KMail's itinerary extraction plug-in and KDE Connect, or Nextcloud Hub and DavDroid.
tr: KDE Yol Kılavuzu, en iyi olarak K Posta’nın yolculuk belgesi çıkarma eklentisi ve KDE Bağlan, Nextcloud Hub veya DavDroid ile birlikte çalışır.

source: Timeline view
tr: Zaman akışı görünümü

source: Boarding pass view
tr: Biniş kartı görünümü

source: Train layout view highlighting the coach with a seat reservation
tr: Koltuk rezervasyonunu vurgulayan vagon görünümlü tren yerleşimi

source: Train station platform map, highlighting arrival and departure platforms
tr: Varış ve kalkış platformlarını vurgulayan tren istasyonu platform haritası

source: Train station map showing real-time availability of rental bikes
tr: Kiralık bisikletlerin kullanılabilirliğini gösteren tren istasyonu haritası

source: Detailed information for the select entity on the train station map
tr: Tren istasyonu haritasında seçili varlık için ayrıntılı bilgi

source: Travel statistics view
tr: Yolculuk istatistikleri görünümü
