Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.kontact.appdata.po
Languages: tr

source: The KDE Community
tr: KDE Topluluğu

source: Kontact
tr: Kontak

source: Handle all your emails, calendars, contacts and more within a single window
tr: Tüm e-posta, takvim, kişiler ve daha fazlasını tek bir pencerede yönetin

source: Handle your email, calendar, contacts and other personal data with Kontact. Kontact groups everything together in one place and helps you manage your communications, organize your day and work with your colleagues.
tr: E-posta, takvim, kişiler ve diğer kişisel verinizi Kontak ile yönetin. Kontak, her şeyi tek bir yerde toplar ve iletişiminizi yönetmenize, gününüzü organize etmenize ve iş arkadaşlarınızla verimli çalışmanıza yardımcı olur.

source: Kontact unifies several personal information management applications into a single window to give you the best possible experience and boost your productivity. With Kontact you can use all the tools of our powerful suite in one place. Unlike proprietary web applications we value your privacy and support open standards, which is why Kontact gives you full control over your data. You can of course also access your data offline if you want to.
tr: Kontak, birkaç kişisel bilgi yönetim uygulamasını tek bir pencereye birleştirerek size olası en iyi deneyimi sunar ve üretkenliğinizi artırır. Kontak ile, güçlü bir takımın tüm araçlarını tek bir yerden kullanabilirsiniz. Müseccel web uygulamalarının yaptığının aksine, gizliliğinize önem verir ve açık standartları destekleriz. Kontak, size veriniz üzerinde tam denetim sunar. Verilerinize çevrimdışı olarak istediğiniz zaman erişebilirsiniz.

source: Kontact consists of several well-integrated components:
tr: Kontak, birkaç iyi tümleştirilmiş bileşenden oluşur:

source: KMail - a powerful and feature-rich email client with support for a wide range of email providers.
tr: K Posta - güçlü ve özellikli bir e-posta istemcisi. Çok sayıda e-posta sağlayıcısını destekler.

source: KOrganizer - a calendar and scheduling component of Kontact which is able to work with NextCloud, Kolab, Google Calendar and other calendaring services.
tr: K Organizatör - takvim ve ajanda bileşeni. NextCloud, Kolab, Google Takvim ve daha birçok takvim hizmeti ile çalışabilir.

source: KAddressBook - an easy to use contact management tool that can synchronize contacts with many popular services.
tr: K Adres Defteri - birçok popüler hizmetle eşzamanlama yapabilen bir kişi yönetim sistemi.

source: Akregator - a news reader with powerful search and archiving functionality.
tr: Akregatör - güçlü arama ve arşivleme işlevlerine sahip bir haber okuyucu.

source: KNotes - a simple program that lets you write the computer equivalent of sticky notes.
tr: K Notlar - yapışkan notların bilgisayar dengini yazmanıza izin veren yalın bir program.

source: KMail, the email component of Kontact
tr: K Posta, Kontak'ın e-posta bileşeni

source: Organize your time, manage events, create todos or schedule meetings with KOrganizer
tr: K Organizatör ile zamanınızı, etkinliklerinizi, toplantılarınızı ve yapılacaklarınızı düzenleyin

source: KAddressBook provides an easy way to manage your contacts
tr: K Adres Defteri, size kişilerinizi kolayca yönetme olanağı sunar

source: Stay on top of the new with Akregator, our news reader
tr: Haber okuyucumuz Akregatör ile her zaman güncel kalın
