Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.kcalc.appdata.po
Languages: tr

source: KCalc
tr: K Hesap

source: Scientific calculator
tr: Bilimsel Hesap Makinesi

source: KCalc has everything you would expect from a scientific calculator, plus:
tr: K Hesap, bilimsel bir hesap makinesinden bekleyebileceğiniz her şeye sahiptir. Ayrıca:

source: Trigonometric functions, logic operations and statistical calculations
tr: Trigonometrik işlevler, mantık işlemleri ve istatistiksel hesaplamalar

source: A results stack which enables convenient recall of previous calculation results
tr: Bir önceki hesaplama sonuçlarını size anımsatan kullanıcı dostu bir sonuçlar rafı

source: Precision is user-definable
tr: Hesaplama kesinliği kullanıcı tarafından tanımlanabilir

source: The display allows cut and paste of numbers
tr: Görüntü, sayıların kesimine ve yapıştırmasına izin verir

source: The display colors and font are configurable, aiding usability
tr: Görüntü renkleri ve yazıtipleri yapılandırılabilir, böylelikle kullanılabilirliğe katkıda bulunur

source: The use of key-bindings make it easy to use without a pointing device
tr: Düğme bağıntılarının kullanımı, bir işaret aygıtı olmadan rahatça kullanıma olanak verir

source: Main window of KCalc
tr: K Hesap ana penceresi

source: KCalc window in numeral system mode
tr: Sayısal sistem kipinde K Hesap penceresi

source: Kcalc window in scientific mode
tr: Bilimsel kipte K Hesap penceresi

source: Kcalc window in statistics mode
tr: İstatistik kipinde K Hesap penceresi
