Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.kate.appdata.po
Languages: tr

source: Advanced text editor
tr: Gelişmiş Metin Düzenleyicisi

source: Kate is a fast multi-document, multi-view text editor for programmers by KDE. It features stuff like LSP (Language Server Protocol) support, projects, multiple cursors and selections, git integration, folder wide search, horizontal and vertical splits, vi mode, syntax highlighting for 300+ languages, built-in terminal, dynamic word wrap and much more. It is available on Linux, BSD, Windows and MacOS.
tr: Kate, KDE tarafından programcılar için yapılan hızlı bir çok belgeli, çok görünümlü bir metin düzenleyicisidir. LSP (Dil Sunucusu Protokolü) desteği, projeler, çoklu imleç ve seçim, Git tümleştirmesi, klasör çapında arama, yatay ve dikey bölmeler, vi(1) kipi, 300’den fazla dil için sözdizim vurgulaması, yerleşik uçbirim, devingen sözcük kaydırma ve çok daha fazlası gibi özelliklere sahiptir. Linux, BSD, Windows ve macOS üzerinde kullanılabilirdir.

source: Features:
tr: Özellikler:

source: MDI, window splitting, window tabbing
tr: MDI, pencere bölme, sekmeli pencereler

source: Spell checking
tr: Yazım denetimi

source: CR, CRLF, LF newline support
tr: CR, CRLF, LF yenisatır desteği

source: Encoding support (utf-8, utf-16, ascii etc.)
tr: Kodlama desteği (utf-8, utf-16, ascii vb.)

source: Encoding conversion
tr: Kodlama dönüştürme

source: Regular expression based find &amp; replace
tr: Bul ve değiştir için düzenli ifade desteği

source: Syntax highlighting for 300+ languages
tr: 300+ dil için sözdizim vurgulaması

source: Code and text folding
tr: Kod ve metin katlama

source: Multiple cursors and multiple selections
tr: Birden çok imleç ve seçim olanağı

source: Block selection mode
tr: Blok seçim kipi

source: Auto indentation
tr: Otomatik girintileme

source: Auto completion support
tr: Otomatik tamamlama desteği

source: Shell integration
tr: Kabuk tümleştirmesi

source: Wide protocol support (http, ftp, ssh, webdav etc.)
tr: Geniş protokol desteği (http, ftp, ssh, webdav vb.)

source: Extensible via plugins
tr: Eklentilerle genişletilebilir

source: Integrated terminal
tr: Tümleşik uçbirim

source: Scriptable using JavaScript
tr: JavaScript kullanılarak betikleştirilebilir

source: Vi mode
tr: vi(1) kipi

source: Intellisense support using LSP (Language Server Protocol)
tr: LSP (Dil Sunucusu Protokolü) kullanarak Intellisense desteği

source: DAP (Debug Adapter Protocol) support
tr: DAP (Hata Ayıklama Bağdaştırıcısı Protokolü) desteği

source: Vertical tabs/document list
tr: Dikey sekme/belge listesi

source: Lightweight project support. Kate can open folders as projects
tr: Hafif proje desteği. Kate, klasörleri proje olarak açabilir

source: Code formatting using native formatters such as clang-format, prettier etc
tr: clang-format, prettier vb. gibi yerel biçimlendiricileri kullanarak kod biçimlendirmesi

source: Built in filesystem browser
tr: Yerleşik dosya sistemi tarayıcısı

source: CTags support
tr: CTags desteği

source: Project wide and folder wide search
tr: Proje çapı ve klasör çapı arama

source: Git integration
tr: Git tümleştirmesi

source: Editing code with Kate
tr: Kate ile kod düzenleme

source: Kate with some Git based project
tr: Git tabanlı bir proje ile Kate

source: Kate with split view
tr: Bölünmüş görünüm ile Kate

source: Kate in dark mode
tr: Koyu kipte Kate

source: Create a new Git branch with Kate
tr: Kate ile yeni bir Git dalı oluştur
