Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.calligra.karbon.metainfo.po
Languages: tr

source: Scalable Graphics
tr: Ölçeklenebilir Grafikler

source: Karbon is a vector drawing application with a user interface that is easy to use, highly customizable and extensible. That makes Karbon a great application for users starting to explore the world of vector graphics as well as for artists wanting to create breathtaking vector art.
tr: Karbon, kullanımı kolay, son derece özelleştirilebilir ve genişletilebilir bir kullanıcı arayüzüne sahip bir vektör çizim uygulamasıdır. Bu, Karbon’u vektör grafikleri dünyasını keşfetmeye başlayan kullanıcılar ve nefes kesici vektör sanatı yaratmak isteyen sanatçılar için harika bir uygulama haline getiriyor.

source: Features:
tr: Özellikler:

source: Loading support for ODG, SVG, WPG, WMF, EPS/PS
tr: ODG, SVG, WPG, WMF, EPS/PS için yükleme desteği

source: Writing support for ODG, SVG, PNG, PDF, WMF
tr: ODG, SVG, PNG, PDF, WMF için yazma desteği

source: Customizable user interface with freely placeable toolbars and dockers
tr: Serbestçe konumlandırılabilir araç çubukları ve rıhtımlar ile özelliştirilebilir kullanıcı arayüzü

source: Layer docker for easy handling of complex documents including preview thumbnails, support for grouping shapes via drag and drop, controlling visibility of shapes or locking
tr: Önizleme küçük görselleri, sürükle ve bırak yoluyla şekilleri gruplandırma desteği, şekillerin görünürlüğünü denetleme veya kilitleme içerilmek üzere karmaşık belgelerin kolay kullanımı için katman rıhtımı

source: Advanced path editing tool with great on-canvas editing capabilities
tr: Harika tuval üzerinde düzenleme özelliklerine sahip gelişmiş yol düzenleme aracı

source: Various drawing tools for creating path shapes including a draw path tool, a pencil tool as well as a calligraphy drawing tool
tr: Yol çizme aracı, kurşun kalem aracı ve hat çizim aracı dahil olmak üzere yol şekilleri oluşturmak için çeşitli çizim araçları

source: Gradient and pattern tools for easy on-canvas editing of gradient and pattern styles
tr: Gradyan ve desen stillerinin tuval üzerinde kolay düzenlenmesi için gradyan ve desen araçları

source: Top notch snapping facilities for guided drawing and editing (e.g. snapping to grid, guide lines, path nodes, bounding boxes, orthogonal positions, intersections of path shapes or extensions of lines and paths)
tr: Kılavuzlu çizim ve düzenleme için birinci sınıf yapıştırma olanakları (örneğin ızgaraya, kılavuz çizgilere, yol düğümlerine, sınırlayıcı kutulara, ortogonal konumlara, yol şekillerinin kesişimlerine veya çizgilerin ve yolların uzantılarına yapıştırma)

source: Includes many predefined shapes including basic shapes like stars, circle/ellipse, rectangle, image
tr: Yıldızlar, daire/elips, dikdörtgen, görüntü gibi temel şekiller dahil olmak üzere önceden tanımlanmış birçok şekil içerir

source: Artistic text shape with support for following path outlines (i.e. text on path)
tr: Aşağıdaki yol ana hatlarını destekleyen sanatsal metin şekli (örn. yol üzerindeki metin)

source: Complex path operations and effects like boolean set operations, path flattening, rounding and refining as well as whirl/pinch effects
tr: Boole küme işlemleri, yol düzleştirme, yuvarlama ve iyileştirme gibi karmaşık yol işlemleri ve efektleri ile burma/kıstırma efektleri

source: Extensible by writing plugins for new tools, shapes and dockers
tr: Yeni araçlar, şekiller ve rıhtımlar için eklentiler yazarak genişletilebilir

source: Main window of Karbon
tr: Karbon’un ana penceresi
