Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.kronometer.appdata.po
Languages: tr

source: Kronometer
tr: Kronometre

source: Chronometer
tr: Kronometre

source: Kronometer is a stopwatch application. It features the basic stopwatch actions (pause/resume/reset/laps), as well as the ability to save the times and resume them later. Kronometer is part of the KDE Extragear collection, within the Utils sub-module.
tr: Kronometre, bir kronometre uygulamasıdır. Temel kronometre eylemlerini (duraklatma/sürdürme/sıfırlama/turlama), zaman kazanma ve bunları daha sonra yeniden başlatma becerisi sunar. Kronometre, Utils alt modülündeki KDE Extragear koleksiyonunun bir parçasıdır.

source: Features:
tr: Özellikler:

source: Start/pause/resume the stopwatch widget
tr: Kronometre araç takımını başlat/duraklat/sürdür

source: Laps recording: you can capture the stopwatch time when you want
tr: Tur kayıtları: İstediğinizde kronometre saatini yakalayabilirsiniz

source: Lap times sorting: you can easily find the shortest lap time or the longest one
tr: Tur zamanı sıralama: En kısa tur zamanı veya en uzun tur zamanını kolayca bulabilirsiniz

source: Reset the stopwatch widget and the lap times
tr: Kronometre araç takımını ve tur zamanlarını sıfırla

source: Time format settings: you can choose the stopwatch granularity
tr: Zaman biçimi ayarları: Kronometre ayrıntılılığını seçebilirsiniz

source: Times saving and resuming: you can save the stopwatch status and resume it later
tr: Zaman kaydetme ve sürdürme: Kronometre durumunu kaydedebilir ve sonradan sürdürebilirsiniz

source: Font customization: you can choose the fonts for each of the stopwatch digits
tr: Yazıtipi özelleştirme: Kronometrenin her bir basamağının yazıtipini seçebilirsiniz

source: Color customization: you can choose the color for the stopwatch digits and the stopwatch background
tr: Renk özelleştirme: Kronometrenin her bir basamağını ve arka planının rengini seçebilirsiniz

source: Lap times export: you can export the lap times to a file using the JSON or CSV format
tr: Tur zamanlarını dışa aktarma: Tur zamanlarını JSON veya CSV biçiminde bir dosyaya aktarabilirsiniz
