Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.kclock.appdata.po
Languages: tr

source: Clock
tr: Saat

source: Keep time and set alarms
tr: Zaman Tutucusu ve Alarm Kurucusu

source: A universal clock application for desktop and mobile. Clock includes a stopwatch and a world clock, and allows you to set multiple alarms and timers.
tr: Masaüstü ve taşınabilir aygıtlar için evrensel bir saat uygulaması. Saat, bir kronometre ve dünya saati içerir ve birden çok alarm ve sayaç kurmanıza olanak tanır.

source: It contains alarm, timer, stopwatch and timezone functionalities. Alarms and timers are able to wake the device from suspend on Plasma.
tr: Alarm, sayaç, kronometre ve zaman dilimi işlevlerini içerir. Alarmlar ve sayaçlar, aygıtı Plasma’da iken uykudan uyandırabilir.

source: Mobile view
tr: Taşınabilir görünümü

source: Desktop view
tr: Masaüstü görünümü

source: Timers page
tr: Sayaçlar sayfası

source: Timer page
tr: Sayaç sayfası

source: Stopwatch page
tr: Kronometre sayfası

source: Alarms page
tr: Alarmlar sayfası
