Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.calligra.words.metainfo.po
Languages: tr

source: Calligra Words
tr: Calligra Sözcükler

source: Word Processor
tr: Sözcük İşlemcisi

source: Words is an intuitive word processor and desktop publisher application. With it, you can create informative and attractive documents with pleasure and ease.
tr: Sözcükler, sezgisel bir sözcük işlemcisi ve masaüstü yayın uygulamasıdır. Bununla birlikte, zevkli ve kolaylıkla bilgilendirici ve çekici belgeler oluşturabilirsiniz.

source: Features:
tr: Özellikler:

source: Frame-based editing
tr: Çerçeve tabanlı düzenleme

source: Allows embedding of Documents
tr: Belgelerin gömülmesine izin verir

source: Customization of user interface
tr: Kullanıcı arayüzü özelleştirmesi

source: Includes all features expected from a modern word processor
tr: Çağdaş bir sözcük işlemcisinden beklenen tüm özellikleri sağlar

source: ODT (Open Document Text) support
tr: ODT (Open Document Text) desteği

source: Calligra Words main window
tr: Calligra Sözcükler ana penceresi
