Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.kmail2.appdata.po
Languages: tr

source: KMail
tr: K Posta

source: A feature-rich email application
tr: Çok özellikli bir e-posta uygulaması

source: KMail is a state-of-the-art email client that integrates well with widely used email providers like GMail. It provides many tools and features to maximize your productivity and makes working with large email accounts easy and fast. KMail supports a large variety of email protocols - POP3, IMAP, Microsoft Exchange (EWS) and more.
tr: K Posta, yaygın kullanılan e-posta sağlayıcıları ile sorunsuzca çalışan gelişmiş bir e-posta istemcisidir. Üretkenliğinizi artıracak ve büyük e-posta hesaplarıyla çalışmanızı kolaylaştıracak pek çok özellik ve araçla gelir. K Posta, geniş bir e-posta protokolü listesini destekler — POP3, IMAP, Microsoft Exchange (EWS) ve çok daha fazlası.

source: Features:
tr: Özellikler:

source: Secure - KMail has secure default settings to protect your privacy, great end-to-end encryption support, and spam detection.
tr: Güvenli — K Posta öntanımlı ayarları gizliliğinizi korur, uçtan uca şifreleme ve istenmeyen posta algılama desteği sunar.

source: Powerful - Features include offline support, multiple sender identities, multi-language support, powerful filtering, searching and tagging functionality, mailing list management and very flexible configuration.
tr: Güçlü — Çevrimiçi çalışma desteği, çoklu gönderici kimlikleri, çoklu dil desteği, güçlü süzme ve etiketleme yetenekleri, posta listesi yönetimi ve esnek yapılandırma özellikleri sunar.

source: Integrated - Meeting invitations can be easily added as events into KOrganizer, address auto-completion, avatars and crypto preferences are loaded from KAddressBook.
tr: Tümleşik — Toplantı davetleri K Organizatör’e kolaylıkla eklenebilir, adres otomatik tamamlaması, avatarlar ve kripto tercihleri K Adres Defteri’nden yüklenir.

source: Standard Compliant - Supports standard mail protocols, push email, server-side filtering and inline OpenPGP, PGP/MIME and S/MIME.
tr: Standartlara Uygun — Standart posta protokollerini, itmeli e-postaları, sunucu yanı süzmeyi ve satır içi OpenPGP, PGP/MIME ve S/MIME protokollerini destekler.

source: KMail main window with a list of email folders and emails.
tr: E-postalar klasörleri ve iletileriyle birlikte K Posta ana penceresi

source: Email Composer with an embedded translator
tr: Gömülü bir çevirmen içeren e-posta oluşturucusu
