Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.glaxnimate.metainfo.po
Languages: tr

source: Vector Animation Editor
tr: Vektör Canlandırma Düzenleyicisi

source: Glaxnimate is an open-source vector animation and motion design desktop application.
tr: Glaxnimate bir açık kaynaklı vektör canlandırma ve hareket tasarımı uygulamasıdır.

source: Features:
tr: Özellikler:

source: Tweening
tr: Ara Doldurma

source: Precompositions
tr: Ön Kompozisyonlar

source: Time Stretching
tr: Zaman Germe

source: Motion Along Path
tr: Yol Üzerinde Hareket

source: Shape Modifiers
tr: Şekil Niteleyicileri

source: Text Support
tr: Metin Desteği

source: Animated Gradients
tr: Hareketli Gradyanlar

source: Raster to Vector
tr: Rasterden Vektöre

source: Scripting Support
tr: Betik Yazımı Desteği

source: Supported file formats:
tr: Desteklenen dosya biçimleri:

source: Animated SVG
tr: Hareketli SVG

source: Animated WebP
tr: Hareketli WebP

source: Animated Vector Drawables
tr: Hareketli Vektör Çizilebilirleri

source: Video Export
tr: Video Dışa Aktarım

source: Spritesheet Export
tr: Grafik Sayfası Dışa Aktarım

source: Glaxnimate main window
tr: Glaxnimate ana penceresi
