Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.gcompris.appdata.po
Languages: tr

source: Educational game for children
tr: Çocuklar için Oyunlar

source: GCompris is a high quality educational software suite, including a large number of activities for children aged 2 to 10.
tr: GCompris, 2 ile 10 yaş arasındaki çocuklar için çok sayıda etkinlik içeren bir eğitim yazılımı paketidir.

source: Some of the activities are game orientated, but nonetheless still educational.
tr: Bazı etkinlikler oyun odaklıdır; ancak yine de eğiticidir.

source: Below you can find a list of categories with some of the activities available in that category.
tr: Aşağıda bazı etkinliklerin bulunduğu kategorilerin bir listesini bulabilirsiniz.

source: computer discovery: keyboard, mouse, different mouse gestures, etc.
tr: bilgisayarı keşfetme: klavye, fare, farklı fare hareketleri, vb.

source: arithmetic: table memory, enumeration, mirror image, balance the scale, change giving, etc.
tr: aritmetik: tablo belleği, numaralandırma, ayna görüntüsü, ölçeği dengelemek, para üstü, vb.

source: science: the canal lock, color mixing, gravity concept, etc.
tr: bilim: kanal kilidi, renk karışımı, yerçekimi kavramı, vb.

source: games: memory, connect 4, tic tac toe, sudoku, hanoi tower, etc.
tr: oyunlar: bellek, dörtleme, üç taş, sudoku, hanoi kulesi, vb.

source: reading: reading practice, etc.
tr: okuma: okuma egzersizi, vb.

source: other: learn to tell time, the braille system, maze, music instruments, etc.
tr: diğer: saati söylemeyi öğrenme, braille sistemi, labirent, müzik, çalgılar, vb.

source: Currently GCompris offers in excess of 100 activities and more are being developed. GCompris is free software, that means that you can adapt it to your own needs, improve it and, most importantly, share it with children everywhere.
tr: Şu anda GCompris 100’den fazla etkinlik sunuyor ve daha fazlası da geliştiriliyor. GCompris özgür bir yazılımdır; bu, onu kendi gereksinimlerinize uyarlayabileceğiniz, geliştirebileceğiniz ve en önemlisi, her yerde çocuklarla paylaşabileceğiniz anlamına gelir.

source: GCompris main menu
tr: GCompris ana menüsü

source: "Click on an uppercase letter" activity
tr: “Bir büyük harfe tıkla” etkinliği

source: "Learning Clock" activity
tr: “Saatleri öğren” etkinliği

source: "Mixing color of paint" activity
tr: “Renkli boya karışımı” etkinliği

source: "Colors" activity
tr: “Renkler” etkinliği

source: "Build the same model" activity
tr: “Aynı modeli yap” etkinliği

source: "Count the items" activity
tr: “Nesneleri say” etkinliği

source: "The fifteen game" activity
tr: “On beş oyun” etkinliği

source: "Hexagon" activity
tr: “Altıgen” etkinliği

source: "Balance the scales properly" activity
tr: “Teraziyi doğru şekilde dengele” etkinliği

source: "End of chess game" activity
tr: “Satranç oyunu sonu” etkinliği

source: "A sliding-block puzzle game" activity
tr: “Kayan blok yap boz oyunu” etkinliği
