Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.tellico.appdata.po
Languages: tr

source: Collection Manager
tr: Koleksiyon Yöneticisi

source: Tellico is an application for organizing your collections. It provides default templates for books, bibliographies, videos, music, video games, coins, stamps, trading cards, comic books, and wines. It allows you to enter your collection in a catalogue database, saving many different properties like title, author, etc.
tr: Tellico koleksiyonlarınızı yönetmek için bir programdır. Kitaplar, kaynakçalar, videolar, müzikler, video oyunları, paralar, pullar, kartlar, çizgi romanlar ve şaraplar için öntanımlı şablonlar içerir. Koleksiyonunuzu bir katalog veritabanına girmenize ve başlık, yazar gibi pek çok özelliğe göre kaydetmenize olanak tanır.

source: Features:
tr: Özellikler:

source: Supports default collections of books, bibliographic entries, videos, music, video games, comic books, coins, stamps, trading cards, wines, board games, and file catalogs
tr: Kitapların, kaynakça girdilerinin, videoların, müziklerin, video oyunlarının, çizgi romanların, paraların, pulların, kartların, şarapların, oyunların ve dosya katalogların öntanımlı koleksiyonlarını destekler

source: Supports user-defined custom collections
tr: Kullanıcı tanımlı özel koleksiyonları destekler

source: Supports any number of user-defined fields, of several different types: text, paragraph, list, checkbox, number, URL, date, images, and combinations
tr: Çok farklı türlerde kullanıcı tanımlı alanları destekler: metin, paragraf, liste, işaret kutusu, sayı, URL, tarih, görseller ve bunların bileşimleri

source: Handles entries with multiple authors, genres, keywords, etc
tr: Birden çok yazarı, türü ve anahtar sözcüğü işleyebilir

source: Automatically formats titles and names
tr: Başlık ve adları otomatik biçimlendirir

source: Supports collection searching and view filtering
tr: Koleksiyon araması ve süzerek görüntülemeyi destekler

source: Sorts and groups collection by various properties
tr: Koleksiyonları çeşitli özelliklerine göre sıralar ve gruplar

source: Allows customizable entry templates through XSLT
tr: XSLT üzerinden girdi şablonlarının özelleştirilmesine izin verir

source: Imports MODS, Bibtex, RIS, CSV, PDF metadata, and many other formats
tr: MODS, Bibtex, RIS, CSV, PDF üst verisi ve pek çok diğer biçimi içe aktarır

source: Exports to Bibtex, ONIX, CSV, HTML, and other formats
tr: Bibtex, ONIX, CSV, HTML, PilotDB ve pek çok diğer biçimi dışa aktarır

source: Imports information directly from Amazon.com, IMDb, z39.50 servers, PubMed, SRU servers, CrossRef.org, various other websites, and from external scripts
tr: Bilgileri doğrudan Amazon.com, IMDb, z39.50 sunucuları, PubMed, SRU sunucuları, CrossRef.org ve çeşitli başka sitelerden ve harici betiklerden içe aktarır

source: Imports CDDB data for cataloging audio CDs
tr: CD’leri kataloglamak için CDDB verisini içe aktarır

source: Scans and imports audio file collections, such as mp3 or ogg
tr: Mp3 ve ogg gibi ses dosyalarını tarar ve içe aktarır

source: The main window showing a movie collection
tr: Bir film koleksiyonunu gösteren ana pencere

source: The main window showing a simple item in a book collection
tr: Bir kitap koleksiyonundaki tek bir ögeyi gösteren ana pencere

source: The main window showing side-by-side views of a game collection
tr: Bir oyun koleksiyonunun yan yana görünümlerini gösteren ana pencere
