Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.step.appdata.po
Languages: tr

source: Interactive Physical Simulator
tr: Etkileşimli Fizik Öykünücüsü

source: Step is an interactive physical simulator. It allows you to explore the physical world through simulations. It works like this: you place some bodies on the scene, add some forces such as gravity or springs, then click Simulate and Step shows you how your scene will evolve according to the laws of physics. You can change every property of the bodies/forces in your experiment (even during simulation) and see how this will change evolution of the experiment. With Step you cannot only learn but feel how physics works!
tr: Step bir etkileşimli fizik öykünücüsüdür. Fiziksel dünyayı benzetimlerle keşfetmenize olanak verir. Şöyle çalışır: Ekrandaki bazı nesneleri seçersiniz ve yerçekimi veya yay gibi kuvvetler eklersiniz, ardından Hesapla düğmesine tıkladığınızda Step, fizik kurallarına göre ekranın nasıl dönüşeceğini gösterir. Deneyinizdeki nesnelerin/kuvvetlerin her özelliğini (benzetim sırasında bile) değiştirerek bunun sonucu nasıl değiştirdiğini görebilirsiniz. Step ile fiziği yalnızca öğrenmez onu hissedersiniz!

source: Features:
tr: Özellikler:

source: Classical mechanical simulation in two dimensions
tr: İki boyutlu klasik mekanik benzetimi

source: Particles, springs with damping, gravitational and coulomb forces
tr: Parçacıklar, sönümlemeli yaylar, yerçekimi ve coulomb kuvvetleri

source: Rigid bodies
tr: Katı nesneler

source: Collision detection (currently only discrete) and handling
tr: Çarpışma algılama (şu anda yalnızca ayrık) ve idaresi

source: Soft (deformable) bodies simulated as user-editable particles-springs system, sound waves
tr: Yumuşak (form değiştirebilen), kullanıcının düzenleyebildiği parçacık–yay sistemleri, ses dalgaları

source: Molecular dynamics (currently using Lennard-Jones potential): gas and liquid, condensation and evaporation, calculation of macroscopic quantities and their variances
tr: Moleküler dinamik (şu anda Lennard-Jones potansiyeli kullanıyor): Gaz ve sıvı, yoğuşma ve buharlaşma, makroskopik tutarların ve sapmaların hesaplanması

source: Units conversion and expression calculation: you can enter something like "(2 days + 3 hours) * 80 km/h" and it will be accepted as distance value (requires libqalculate)
tr: Birim dönüştürme ve ifade hesaplama: “(2 gün + 3 saat) * 80 km/sa” gibi bir ifade girebilirsiniz ve bu mesafe değeri (libqalculate gerektirir) olarak kabul edilecektir

source: Errors calculation and propagation: you can enter values like "1.3 ± 0.2" for any property and errors for all dependent properties will be calculated using statistical formulas
tr: Hata hesaplama ve yayılım: Her özellik için “1,3 ± 0,2” gibi değerler girebilirsiniz ve tüm bağımlı özelliklerin hataları istatistik formülleri kullanılarak hesaplanır

source: Solver error estimation: errors introduced by the solver is calculated and added to user-entered errors
tr: Çözücü hata tahmini: Çözücü tarafından katılan hatalar hesaplanır ve kullanıcı tarafından girilen hatalara eklenir

source: Several different solvers: up to 8th order, explicit and implicit, with or without adaptive timestep (most of the solvers require GSL library)
tr: Çeşitli farklı çözücüler: 8. dereceye kadar, açık ve kapalı, uyarlanır zamanlama varken ve yokken (çözücülerin çoğu GSL kitaplığını gerektirir)

source: Controller tool to easily control properties during simulation (even with custom keyboard shortcuts)
tr: Benzetim sırasında özelliklerin denetimi için araç (özel klavye kısayolları ile bile kullanılabilir)

source: Tools to visualize results: graph, meter, tracer
tr: Sonuçları görselleştirmek için araçlar: Grafik, ölçü, izleyici

source: Context information for all objects, integrated wikipedia browser
tr: Tüm nesneler için içerik bilgileri, tümleşik Vikipedi tarayıcısı

source: Collection of example experiments, more can be downloaded with KNewStuff
tr: Örnek deney koleksiyonu, bir çoğu KNewStuff ile indirilebilir

source: Integrated tutorials
tr: Tümleşik eğitmenler

source: Physical simulation in Step
tr: Step içinde fiziksel benzetim
