Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.calligra.metainfo.po
Languages: tr

source: All-in-one office solution
tr: Hepsi Bir Arada Ofis Paketi

source: Calligra is an office and graphics suite. It contains applications for word processing, spreadsheets, presentation and vector graphics.
tr: Calligra bir ofis ve grafik paketidir. Sözcük işleme, tablolar, sunum ve vektör grafikler için araçlar içerir.

source: Words is an intuitive word processor and desktop publisher application. With it, you can create informative and attractive documents with pleasure and ease.
tr: Calligra Sözcükler, sezgisel bir sözcük işlemcisi ve masaüstü yayım uygulamasıdır. Bununla, zevkle ve kolaylıkla bilgilendirici ve alımlı belgeler oluşturabilirsiniz.

source: Calligra Sheets is a fully-featured calculation and spreadsheet tool. Use it to quickly create and calculate various business-related spreadsheets, such as income and expenditure, employee working hours, etc.
tr: Calligra Tablolar, tam özellikli bir hesaplama ve elektronik tablo aracıdır. Gelir ve gider, çalışan çalışma saatleri vb. gibi çeşitli iş ile ilgili elektronik tabloları hızla oluşturmak ve hesaplamak için kullanın.

source: Calligra Stage is an easy to use yet still flexible presentation application. You can easily create presentations containing a rich variety of elements, from graphics to text, from charts to images. Calligra Stage is extensible through a plugin system, so it is easy to add new effects, new content elements or even new ways of managing your presentation. Because of the integration with Calligra, all the power and flexibility of the Calligra content elements are available to Stage.
tr: Calligra Sahne, kullanımı kolay; ancak yine de esnek bir sunum uygulamasıdır. Grafiklerden metne, çizelgelerden resimlere kadar zengin çeşitlilikte öğeler içeren sunumları kolayca oluşturabilirsiniz. Calligra Sahne, bir eklenti sistemi aracılığıyla genişletilebilir, bu nedenle yeni efektler, yeni içerik ögeleri veya hatta sunumunuzu yönetmenin yeni yollarını eklemek kolaydır. Calligra ile tümleşim sayesinde, Calligra içerik ögelerinin tüm gücü ve esnekliği Sahne’ye sunulur.

source: Karbon is a vector drawing application with a user interface that is easy to use, highly customizable and extensible. That makes Karbon a great application for users starting to explore the world of vector graphics as well as for artists wanting to create breathtaking vector art.
tr: Karbon, kullanımı kolay, son derece özelleştirilebilir ve genişletilebilir bir kullanıcı arayüzüne sahip bir vektör çizim uygulamasıdır. Bu, Karbon’u vektör grafikleri dünyasını keşfetmeye başlayan kullanıcılar ve nefes kesici vektör sanatı yaratmak isteyen sanatçılar için harika bir uygulama haline getirir.

source: Calligra Words main window showing random text in the main editor
tr: Ana düzenleyicide rastgele bir metin parçası gösteren Calligra Sözcükler ana penceresi

source: Calligra Sheets main window
tr: Calligra Tablolar ana penceresi

source: Calligra Stage main window
tr: Calligra Sahne ana penceresi

source: Main window of Karbon
tr: Karbon ana penceresi
