Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.amarok.appdata.po
Languages: tr

source: Rediscover your music
tr: Müziğinizi yeniden keşfedin

source: Amarok is a free, cross-platform, versatile, powerful and feature-rich music player and collection manager.
tr: Amarok; ücretsiz, çapraz platformlu, çok amaçlı, güçlü ve çok özellikli bir müzik çalar ve koleksiyon yöneticisidir.

source: Features:
tr: Özellikler:

source: Dynamic playlists matching different criteria
tr: Farklı kriterlerle eşleşen devingen çalma listeleri

source: Collection managing with rating support
tr: Derecelendirme desteği ile koleksiyon yönetimi

source: Support for basic iPod, MTP and UMS music player devices
tr: Temel iPod, MTP ve UMS müzik çalar aygıtlar desteği

source: Integrated Internet services: last.fm, Magnatune, Ampache and more.
tr: Tümleştirilmiş İnternet hizmetleri: last.fm, Magnatune, Ampache ve daha fazlası

source: Scripting support
tr: Betik yazımı desteği

source: Cover manager
tr: Kapak görseli yöneticisi

source: Replay gain support
tr: Ses düzeyi dengeleme desteği

source: Playing music in Amarok 3.0
tr: Amarok 3.0’da müzik çalma

source: Amarok 3.1 player window with a customized layout
tr: Özelleştirilmiş bir yerleşimle gösterilen Amarok 3.1 müzik çaları

source: Amarok 3.3 player window
tr: Amarok 3.3 çalar penceresi
