Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.kgoldrunner.appdata.po
Languages: tr

source: KGoldrunner
tr: K Altın Avı

source: Hunt Gold, Dodge Enemies and Solve Puzzles
tr: Altın Avla, Düşmanlarını Atlat ve Bulmacaları Çöz

source: KGoldrunner is an action game where the hero runs through a maze, climbs stairs, dig holes and dodges enemies in order to collect all the gold nuggets and escape to the next level. Your enemies are also after the gold. Worse still, they are after you!.
tr: K Altın Avı, kahramanımızın labirentte dolaştığı, tüm altın külçelerini toplamak ve bir sonraki düzeye çıkmak için merdiven tırmandığı, delik açtığı ve düşman avı yaptığı bir kaçış aksiyon oyunudur. Düşmanların da altının peşinde. Daha da kötüsü, senin peşindeler!

source: Features:
tr: Özellikler:

source: Themeable
tr: Temalaştırılabilir

source: Hundreds of levels
tr: Yüzlerce düzey

source: Level-editor
tr: Düzey düzenleyici

source: Two modes for the enemies: classical and KGoldrunner-mode, in KGoldrunner-mode they are more intelligent, in the classical mode it is easier to fool them
tr: Düşmanlar için iki kip: Klasik ve K Altın Avı kipi. K Altın Avı kipinde daha zekidir, klasik kipte onları kandırmak daha kolaydır

source: Very very difficult levels
tr: Aşırı zor düzeyler

source: Keyboard or mouse control
tr: Klavye veya fare denetimi

source: Savable games
tr: Kaydedilebilir oyunlar

source: Playing KGoldrunner
tr: K Altın Avı oynarken
