Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/org.kde.kgeography.appdata.po
Languages: tr

source: KGeography
tr: K Coğrafya

source: Geography learning tool
tr: Coğrafya öğrenme aracı

source: KGeography is a geography learning tool, which allows you to learn about the political divisions of some countries (divisions, capitals of those divisions and their associated flags if there are some).
tr: K Coğrafya, bazı ülkelerin politik bölümü hakkında daha fazla bilgi almanızı sağlayan bir coğrafya öğrenme aracıdır (bölümler, o bölümlerin başkentleri ve varsa ilişkili bayrakları).

source: Features:
tr: Özellikler:

source: Browse the maps clicking in a map division to see its name, capital and flag
tr: Haritaları, harita bölümlerinin adını, başkentini ve bayrağını görmek için tarayın

source: The game tells you a map division name and you have to click on it
tr: Oyun size bir harita bölümü söyler ve ona tıklamanız gerekir

source: The game tells you a capital and you have to guess the division it belongs to
tr: Oyun size bir başkent söyler ve hangi bölüme ait olduğunu tahmin etmeniz gerekir

source: The game tells you a division and you have to guess its capital
tr: Oyun size bir bölüm söyler ve onun başkenti tahmin etmeniz gerekir

source: The game shows you a map division flag and you have to guess its name
tr: Oyun size bir bayrak gösterir ve o bölümün adını tahmin etmeniz gerekir

source: The game tells you a map division name and you have to guess its flag
tr: Oyun size bir harita bölümü adı söyler ve onun bayrağını bilmeniz gerekir

source: The game shows an empty map and you have to place divisions on it one by one
tr: Oyun size boş bir harita gösterir ve onun üzerine bölümleri teker teker koymanız gerekir

source: Training geography with KGeography
tr: K Coğrafya ile coğrafya alıştırmaları
