Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/oxygen._desktop_.po
Languages: tr

# Name
source: Oxygen Cold
tr: Oksijen Soğuğu

# Name
source: Oxygen
tr: Oksijen

# Name
source: KDE Classic
tr: KDE Klasik

# Comment
source: The default cursor theme in KDE 2 and 3
tr: KDE2 ve 3'te bulunan öntanımlı imleç teması

# Name
source: Oxygen Black
tr: Oksijen Karası

# Comment
source: Oxygen mouse theme. Oxygenize your desktop!
tr: Oksijen fare teması. Masaüstünüzü Oksijenleştirin!

# Name
source: Oxygen Blue
tr: Oksijen Mavisi

# Name
source: Oxygen White
tr: Oksijen Akı

# Name
source: Oxygen Yellow
tr: Oksijen Sarısı

# Name
source: Oxygen Zion
tr: Oksijen Göğü

# Comment
source: Widget style for the Plasma desktop
tr: Plasma masaüstü için araç takımı biçemi
