Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/palapeli._desktop_.po
Languages: tr

# Name
source: Import into your Palapeli puzzle collection
tr: Palapeli yapboz koleksiyonunuza aktarın

# Name
source: Castle of Maintenon
tr: Maintenon Kalesi

# Comment
source: Eure-et-Loir département, France
tr: Eure-et-Loir Bölgesi, Fransa

# Name
source: Roebling Suspension Bridge
tr: Roebling Asma Köprüsü

# Comment
source: in Cincinnati
tr: Cincinnati'de

# Name
source: Citrus Fruits
tr: Narenciye

# Name
source: European Honey Bee
tr: Bal Arısı

# Name
source: Furcifer pardalis
tr: Panter Bukalemun

# Comment
source: Female panther chameleon
tr: Dişi panter bukalemunu

# GenericName
source: Jigsaw puzzle game
tr: Yapboz bulmaca oyunu

# Comment
source: Palapeli Jigsaw Puzzle
tr: Palapeli Yapboz Bulmacası

# Name
source: File management operations
tr: Dosya yönetimi işlemleri

# Name
source: Importing puzzle
tr: Bulmaca İçe Aktarılıyor

# Comment
source: A puzzle is being imported into the local puzzle collection
tr: Yerel bulmaca koleksiyonuna bulmaca aktarılıyor
