Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/plasma-nm._desktop_.po
Languages: tr

# Name
source: Network Management
tr: Ağ Yönetimi

# Comment
source: Network management
tr: Ağ yönetimi

# Name
source: Connection Activated
tr: Bağlantı Etkinleştirildi

# Name
source: Connection Deactivated
tr: Bağlantı Sonlandırıldı

# Name
source: Connection Added
tr: Bağlantı Eklendi

# Name
source: Connection Removed
tr: Bağlantı Kaldırıldı

# Name
source: Connection Updated
tr: Bağlantı Güncellendi

# Name
source: Device Failed
tr: Aygıt Başarısız Oldu

# Name
source: Failed to Activate Connection
tr: Bağlantı Etkinleştirilemedi

# Name
source: Failed to Add Connection
tr: Bağlantı Eklenemedi

# Name
source: Failed to Deactivate Connection
tr: Bağlantı Devre Dışı Bırakılamadı

# Name
source: Failed to Remove Connection
tr: Bağlantı Kaldırılamadı

# Name
source: Failed to Get Secrets
tr: Gizler Alınamadı

# Name
source: Failed to Update Connection
tr: Bağlantı Güncellenemedi

# Name
source: Missing VPN Plugin
tr: VPN Eklentisi Eksik

# Name
source: No Longer Connected to a Network
tr: Artık Bir Ağa Bağlı Değil

# Name
source: Captive Portal Detected
tr: Esir Kapı Algılandı

# Name
source: Limited Connectivity
tr: Sınırlı Bağlantı

# Name
source: Failed to Create Hotspot
tr: Kişisel Erişim Noktası Oluşturulamadı
