Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/plasma-desktop._json_.po
Languages: tr

# Name
source: Activity Pager
tr: Etkinlik Sayfalayıcısı

# Name
source: Icons-only Task Manager
tr: Simgesel Görev Yöneticisi

# Name
source: Keyboard Layout
tr: Klavye Yerleşimi

# Name
source: Application Menu
tr: Uygulama Menüsü

# Name
source: Application Launcher
tr: Uygulama Başlatıcısı

# Name
source: Input Method Panel
tr: Giriş Yöntemi Paneli

# Name
source: Margins Separator
tr: Kenar Boşlukları Ayırıcısı

# Name
source: Minimize all Windows
tr: Tüm Pencereleri Küçült

# Name
source: Pager
tr: Sayfalayıcı

# Name
source: Activities
tr: Etkinlikler

# Name
source: Peek at Desktop
tr: Masaüstüne Bak

# Name
source: Task Manager
tr: Görev Yöneticisi

# Name
source: Trashcan
tr: Çöp Kutusu

# Name
source: Window List
tr: Pencere Listesi

# Name
source: Desktop
tr: Masaüstü

# Name
source: Folder View
tr: Klasör Görünümü

# Name
source: Accessibility
tr: Erişilebilirlik

# Name
source: File Search
tr: Dosya Arama

# Name
source: Default Applications
tr: Öntanımlı Uygulamalar

# Name
source: Date & Time
tr: Tarih ve Zaman

# Name
source: Locations
tr: Konumlar

# Name
source: Game Controller
tr: Oyun Kumandası

# Name
source: Background Services
tr: Arka Plan Hizmetleri

# Name
source: Keyboard
tr: Klavye

# Name
source: Keyboard Daemon
tr: Klavye Ardalan Süreci

# Name
source: Shortcuts
tr: Kısayollar

# Name
source: Desktop Session
tr: Masaüstü Oturumu

# Name
source: Splash Screen
tr: Açılış Ekranı

# Name
source: Quick Settings
tr: Tez Ayarlar

# Name
source: Mouse
tr: Fare

# Name
source: Plasma Renderer
tr: Plasma Sunucu

# Name
source: Recent Files
tr: Son Kullanılan Dosyalar

# Name
source: KRunner Settings
tr: K Çalıştır Ayarları

# Name
source: Plasma Search
tr: Plasma Arama

# Name
source: Device Actions
tr: Aygıt Eylemleri

# Name
source: Spell Check
tr: Yazım Denetimi

# Name
source: Drawing Tablet
tr: Çizim Tableti

# Name
source: Touchpad
tr: Dokunmatik Yüzey

# Name
source: Touchscreen
tr: Dokunmatik Ekran

# Name
source: General Behavior
tr: Genel Davranış

# Name
source: Application Menu Bar
tr: Uygulama Menüsü Çubuğu

# Name
source: Default Panel
tr: Öntanımlı Pano

# Name
source: Empty Panel
tr: Boş Panel

# Name
source: Plasma Desktop Shell
tr: Plasma Masaüstü Kabuğu

# Name
source: Device Auto-Mount
tr: Aygıtı Kendiliğinden Bağla

# Name
source: Removable Device Automounter
tr: Çıkarılabilir Aygıt Otomatik Bağlayıcı

# Name
source: Declarative Toolbox
tr: Bildirim Araç Kutusu

# Name
source: Panel Toolbox
tr: Panel Araç Kutusu

# Description
source: Switch between activities
tr: Etkinlikler arasında gezin

# Description
source: Modern dock-style window switcher displaying only icons
tr: Yalnızca simgeleri görüntüleyen, çağdaş rıhtım tarzında pencere değiştiricisı

# Description
source: Show/switch keyboard layout
tr: Klavye yerleşimini görüntüle/geçiş yap

# Description
source: A launcher based on cascading popup menus
tr: Basamaklı açılır menü tabanlı bir başlatıcı

# Description
source: Launcher to start applications
tr: Uygulamaları başlatın ve sisteminizi yönetin

# Description
source: A generic input method panel
tr: Genel bir giriş yöntemi paneli

# Description
source: To be used as a separator between margin areas in themes that support them
tr: Destekleyen temalarda kenar boşlukları arasında ayırıcı olarak kullanılmak üzere

# Description
source: Shows the desktop by minimizing all windows
tr: Bütün pencereleri küçülterek masaüstünü gösterir

# Description
source: Switch between virtual desktops
tr: Sanal masaüstleri arasında geçiş yapın

# Description
source: Shows the activity manager
tr: Etkinlik yöneticisini gösterir

# Description
source: Temporarily shows the desktop by moving windows away
tr: Pencereleri uzaklaştırarak masaüstünü geçici olarak gösterir

# Description
source: Classic taskbar-style window switcher displaying icons and text
tr: Klasik görev çubuğu tarzı, simgeler ve metin görüntüleyen pencere değiştiricisi

# Description
source: Provides access to the files sent to trash
tr: Çöp Kutusuna gönderilen dosyalara erişim sağlar

# Description
source: Show open windows in a menu
tr: Açık pencereleri bir menüde göster

# Description
source: A clean and simple layout
tr: Temiz ve basit bir yerleşim

# Description
source: Display the contents of folders
tr: Klasörlerin içeriğini görüntüle

# Description
source: Desktop view furniture
tr: Masaüstü görünümü mobilyası

# Description
source: Configure Accessibility Options
tr: Erişilebilirlik Seçeneklerini Yapılandır

# Description
source: Activities help you to focus on a specific task
tr: Etkinlikler, belirli bir göreve odaklanmanıza yardımcı olur

# Description
source: Configure File Search
tr: Dosya Aramayı Yapılandır

# Description
source: Choose default Applications
tr: Öntanımlı Uygulamaları Seç

# Description
source: Date and Time
tr: Tarih ve Zaman

# Description
source: Location for Personal Files
tr: Kişisel Dosyaların Konumu

# Description
source: Test and Configure Game Controllers
tr: Oyun Kumandasını Kalibre Et

# Description
source: Configure background services
tr: Arka plan hizmetlerini yapılandır

# Description
source: Keyboard Hardware and Layout
tr: Klavye Donanımı ve Yerleşimi

# Description
source: Enables switching keyboard layout through shortcuts or system tray
tr: Klavye yerleşimini kısayollardan veya sistem tepsisinden değiştirmeyi etkinleştirir

# Description
source: Configure Keyboard Shortcuts
tr: Klavye Kısayollarını Yapılandır

# Description
source: Desktop Session Login and Logout
tr: Masaüstü Oturumunu Açma ve Kapatma

# Description
source: Choose splash screen theme
tr: Açılış ekranı temasını seçin

# Description
source: Landing page with some basic settings
tr: Açılış sayfası ve bazı temel ayarlar

# Description
source: Mouse Controls
tr: Fare Denetimleri

# Description
source: Manage your file activity history preferences
tr: Dosya etkinlik geçmişi tercihlerinizi yönetin

# Description
source: Configure KRunner behavior
tr: K Çalıştır davranışını yapılandırın

# Description
source: Configure search settings
tr: Arama ayarlarını yapılandırın

# Description
source: Manage actions available to the user when connecting new devices
tr: Yeni aygıtlar bağlandığında kullanıcıya sunulan eylemleri yönet

# Description
source: Spell Checker Dictionaries and Options
tr: Yazım Denetimi Sözlükleri ve Seçenekleri

# Description
source: Touchpad settings
tr: Dokunmatik yüzey ayarları

# Description
source: Enables or disables touchpad
tr: Dokunmatik yüzeyi etkinleştirir veya devre dışı bırakır

# Description
source: Configure general workspace behavior
tr: Çalışma alanı genel davranışını yapılandırın

# Description
source: Panel containing the global menu applet
tr: Global menü uygulamacığını barındıran panel

# Description
source: Default panel featuring application launcher, task manager and system tray
tr: Uygulama başlatıcısını, görev yöneticisini ve sistem tepsisini sunan öntanımlı panel

# Description
source: Empty panel
tr: Boş panel

# Description
source: Interact with the Plasma Compositor
tr: Plasma Bileşikleştiricisi ile etkileşimde bulunun

# Description
source: Interact with the Plasma desktop shell
tr: Plasma Masaüstü Kabuğu ile etkileşimde bulunun

# Description
source: Configure automatic mounting of disks and volumes
tr: Disklerin ve bölümlerinin otomatik bağlanmasını yapılandırın

# Description
source: Automatically mounts devices as needed
tr: Aygıtları gerektiğinde kendiliğinden bağlar

# Description
source: Manage Plasma
tr: Plasma’yı Yönet

# Description
source: Manage Plasma panel
tr: Plasma panelini yönetin

# Authors Name
source: The Plasma Team
tr: Plasma Takımı

# Authors Name
source: Weng Xuetian
tr: Veng Şüetien

# Authors Name
source: Niccolo Venerandi
tr: Niccolo Veneradi

# Authors Name
source: Plasma Team
tr: Plasma Takımı
