Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/plasma-sdk._desktop_.po
Languages: tr

# Name
source: Plasma Engine Explorer
tr: Plasma İşletke Gezgini

# GenericName
source: Plasma Data Engines Viewing Tool
tr: Plasma Veri İşletkeleri Görüntüleme Aracı

# Comment
source: Explorer for the data published by Plasma DataEngines
tr: Plasma Veri İşletkeleri tarafından yayımlanan veri için gezgin

# Name
source: Icon Explorer
tr: Simge Gezgini

# GenericName
source: Icon Viewer
tr: Simge Görüntüleyicisi

# Comment
source: Icon Previewer for Artists and Developers
tr: Sanatçılar ve Geliştiriciler için Simge Önizleyicisi

# Keywords
source: design;icon;preview;symbol;cuttlefish;
tr: tasarım;simge;önizleme;sembol;cuttlefish;mürekkepbalığı;

# Name
source: Plasmoidviewer
tr: Plasmoid Görüntüleyicisi

# GenericName
source: Plasma Widget Testing Tool
tr: Plasma Araç Takımı Sınama Aracı

# Comment
source: Testing tool for Plasma applets
tr: Plasma uygulamacıkları için sınama aracı

# Comment
source: Explore and edit your Plasma themes
tr: Plasma temalarınızı keşfedin ve düzenleyin

# Name
source: Plasma Theme Explorer
tr: Plasma Tema Gezgini
