Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/purpose._json_.po
Languages: tr

# Name
source: Share
tr: Paylaş

# Name
source: Generate QR code
tr: Kare Kod Oluştur

# Name
source: Send via Bluetooth
tr: Bluetooth ile Gönder

# Name
source: Send via Email
tr: E-posta ile Gönder

# Name
source: Upload...
tr: Karşıya Yükle...

# Name
source: Send To Device
tr: Aygıta Gönder

# Name
source: Send SMS via KDE Connect
tr: KDE Bağlan ile SMS olarak gönder

# Name
source: Save as
tr: Farklı Kaydet

# Name
source: Share...
tr: Paylaş...

# Name
source: Send via Telegram
tr: Telegram ile gönder

# Description
source: Share using Purpose
tr: Purpose kullararak Paylaş

# Description
source: Generate a QR code for this link
tr: Bu bağlantı için bir kare kod oluştur

# Description
source: Send via Bluetooth
tr: Bluetooth ile gönder

# Description
source: Send via Email
tr: E-posta ile Gönder

# Description
source: Upload pictures to Imgur
tr: Resimleri Imgur'e yükle

# Description
source: Send through KDE Connect
tr: KDE Bağlan ile gönder

# Description
source: Send SMS via KDE Connect
tr: KDE Bağlan ile SMS olarak gönder

# Description
source: Upload files to Nextcloud
tr: Dosyaları Nextcloud'a yükle

# Description
source: Upload text to Pastebin
tr: Metni Pastebin'e yükle

# Description
source: Upload patches to Phabricator
tr: Yamaları Phabricator'e yükle

# Description
source: Upload patches to reviewboard
tr: Yamaları gözden geçirme panosuna yükle

# Description
source: Saves the share into the chosen location.
tr: Paylaşımı seçilen konuma kaydeder.

# Description
source: Send via Telegram
tr: Telegram ile gönder

# Description
source: Share via Twitter
tr: Twitter'da paylaş

# Description
source: Upload videos to YouTube
tr: Videoları YouTube'a yükle

# X-Purpose-ActionDisplay
source: Generate QR Code
tr: Kare Kod Oluştur

# X-Purpose-ActionDisplay
source: Send via Bluetooth...
tr: Bluetooth ile Gönder...

# X-Purpose-ActionDisplay
source: Send via Email...
tr: E-posta ile Gönder...

# X-Purpose-ActionDisplay
source: Send To Device...
tr: Aygıta Gönder...

# X-Purpose-ActionDisplay
source: Send SMS via KDE Connect...
tr: KDE Bağlan ile SMS olarak gönder...

# X-Purpose-ActionDisplay
source: Upload Publicly to Pastebin
tr: Metni Herkes için Pastebin'e Yükle

# X-Purpose-ActionDisplay
source: Save as...
tr: Farklı Kaydet...

# X-Purpose-ActionDisplay
source: Send via Telegram...
tr: Telegram ile Gönder...
