Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/rolisteam-diceparser_qt.po
Languages: tr

# QObject|
source: Error: %1
tr: Hata: %1

# QObject|
source: Warning: %1
tr: Uyarı: %1

# QObject|
source: # %1 Details:[%3 (%2)]
tr: # %1 Ayrıntılar: [%3 (%2)]

# QObject|
source: Result: e[0;%4;1m%1e[0m - details:[%3 (%2)]
tr: Sonuç: e[0;%4;1m%1e[0m — ayrıntılar: [%3 (%2)]

# QObject|
source: Result: %1 - details:[%3 (%2)]
tr: Sonuç: %1 — ayrıntılar: [%3 (%2)]

# QObject|
source: Nothing was understood. To roll dice: !1d6 - full documentation: <a href="https://github.com/Rolisteam/DiceParser/blob/master/HelpMe.md">https://github.com/Rolisteam/DiceParser/blob/master/HelpMe.md</a>
tr: Bir şey anlaşılmadı. Zar atmak için: !1d6 — tam belgelendirme: <a href="https://github.com/Rolisteam/DiceParser/blob/master/HelpMe.md">https://github.com/Rolisteam/DiceParser/blob/master/HelpMe.md</a>

# QObject|
source: Unexpected character at %1 - end of command was ignored "%2"
tr: %1 konumunda beklenmedik karakter — komut bitişi yok sayıldı “%2”

# DiceRoller|
source: Error: %1 Warnings: %2
tr: Hata: %1 Uyarılar: %2

# AllSameNode|
source: No valid previous node
tr: Geçerli önceki düğüm yok

# AllSameNode|
source: No dice result
tr: Zar sonucu yok

# QObject|
source: No Previous node
tr: Önceki düğüm yok

# QObject|
source: No result from previous node
tr: Önceki düğümden bir sonuç yok

# QObject|
source: No dice to roll
tr: Atılacak zar yok

# QObject|
source: More unique values asked than possible values (D operator)
tr: Olası değerlerden daha çok benzersiz değer istendi (D işleç)

# QObject|
source: Condition (%1) cause an endless loop with this dice: %2
tr: Koşul (%1), bu zarlarla sonsuz bir döngüye neden oldu: %2

# QObject|
source: Condition (%1) cause an endless loop with dice: %2
tr: Koşul (%1), zarlarla sonsuz bir döngüye neden oldu: %2

# FilterNode|
source: No Previous node
tr: Önceki düğüm yok

# FilterNode|
source: No Valid result
tr: Geçerli sonuç yok

# GroupNode|
source: No Previous node
tr: Önceki düğüm yok

# GroupNode|
source: No Valid result
tr: Geçerli sonuç yok

# GroupNode|
source: No Valid Dice result
tr: Geçerli zar sonucu yok

# QObject|
source: Rolisteam Dice Parser: Example (with ! as prefix): !2d6 !1d20 !6d10e10k3 (L5R) Full documentation at: %1
tr: Rolisteam Zar Ayrıştırıcısı: Örnek (! önek olarak): !2d6 !1d20 !6d10e10k3 (L5R) Tam belgelendirme için: %1

# HelpNode|
source: Rolisteam Dice Parser: Full documentation at
tr: Rolisteam Zar Ayrıştırıcısı: Tam belgelendirme için

# IfNode|
source: No Previous node
tr: Önceki düğüm yok

# IfNode|
source: No Valid result
tr: Geçerli sonuç yok

# IfNode|
source: No Valid copy of result
tr: Geçerli sonuç kopyası yok

# IfNode|
source: No validator list
tr: Doğrulayıcı listesi yok

# JumpBackwardNode|
source: The @ operator expects dice result. Please check the documentation to fix your command.
tr: @ işleci, zar sonucu bekliyor. Komutunuzu düzeltmek için belgelendimeye bir bakın.

# KeepDiceExecNode|
source: No Valid result
tr: Geçerli sonuç yok

# QObject|
source: You ask to keep %1 dice but the result only has %2
tr: %1 zarı tutmak istiyorsunuz; ancak sonuçta yalnızca %2 var

# QObject|
source: List of Alias:
tr: Arma Listesi:

# ListSetRollNode|
source: No Previous node
tr: Önceki düğüm yok

# ListSetRollNode|
source: No Valid result
tr: Geçerli sonuç yok

# ListSetRollNode|
source: More unique values asked than possible values (L operator)
tr: Olası değerlerden daha çok benzersiz değer istendi (L işleci)

# MergeNode|
source: No previous node before Merge operator
tr: Birleştirme işlecinden önce düğüm yok

# MergeNode|
source: No several instruction
tr: Çeşitli yönerge yok

# OccurenceCountNode|
source: No Previous node
tr: Önceki düğüm yok

# OccurenceCountNode|
source: No Valid result
tr: Geçerli sonuç yok

# QObject|
source: No matching result
tr: Eşleşen sonuç yok

# PainterNode|
source: No Previous node
tr: Önceki düğüm yok

# PainterNode|
source: No Valid result
tr: Geçerli sonuç yok

# PainterNode|
source: No Valid Dice result
tr: Geçerli zar sonucu yok

# ReplaceValueNode|
source: No previous node before Switch/Case operator
tr: switch/case işlecinden önce düğüm yok

# ReplaceValueNode|
source: No scalar or dice result before Switch/Case operator
tr: switch/case işlecinden önce sayıl veya zar sonucu yok

# RerollDiceNode|
source: No Previous node
tr: Önceki düğüm yok

# RerollDiceNode|
source: No Valid result
tr: Geçerli sonuç yok

# RerollDiceNode|
source: The a operator expects dice result. Please check the documentation and fix your command.
tr: a işleci, zar sonucu bekliyor. Komutunuzu düzeltmek için belgelendimeye bir bakın.

# ScalarOperatorNode|
source: No Previous node
tr: Önceki düğüm yok

# ScalarOperatorNode|
source: No internal node to run
tr: Çalıştırılacak içsel düğüm yok

# ScalarOperatorNode|
source: No valid result
tr: Geçerli sonuç yok

# ScalarOperatorNode|
source: No Valid result in arithmetic operation: %1
tr: Aritmetik işlemde geçerli sonuç yok: %1

# QObject|
source: Division by zero
tr: Sıfırla bölme

# SortResultNode|
source: No Previous node
tr: Önceki düğüm yok

# SortResultNode|
source: No Valid dice result
tr: Geçerli zar sonucu yok

# SplitNode|
source: No Previous node
tr: Önceki düğüm yok

# SplitNode|
source: No Valid result
tr: Geçerli sonuç yok

# SplitNode|
source: No Valid dice result
tr: Geçerli zar sonucu yok

# SwitchCaseNode|
source: No previous node before Switch/Case operator
tr: switch/case işlecinden önce düğüm yok

# SwitchCaseNode|
source: No scalar or dice result before Switch/Case operator
tr: switch/case işlecinden önce sayıl veya zar sonucu yok

# SwitchCaseNode|
source: No value fits the Switch/Case operator
tr: switch/case işlecine herhangi bir değer uymuyor

# UniqueNode|
source: No Previous node
tr: Önceki düğüm yok

# UniqueNode|
source: No Valid result
tr: Geçerli sonuç yok

# UniqueNode|
source: No Valid dice result
tr: Geçerli zar sonucu yok

# VariableNode|
source: No variable at index:%1
tr: İndekste değişken yok: %1

# VariableNode|
source: No Valid dice result
tr: Geçerli zar sonucu yok

# QObject|
source: Can read the parameter for Round Function.
tr: Yuvarla işlevi için olan parametreyi okuyabilir.

# QObject|
source: Expected closing parenthesis - can't validate the inside.
tr: Kapatma ayracı bekleniyordu — içindeki doğrulanamıyor.

# QObject|
source: Validator is missing after the c operator. Please, change it
tr: c işlecinden sonra doğrulayıcı eksik. Lütfen değiştirin

# QObject|
source: Validator is always true for the %1 operator. Please, change it
tr: %1 işleci için doğrulayıcı her zaman doğru. Lütfen değiştirin

# QObject|
source: Condition can't be reached, causing endless loop. Please, change the %1 option condition
tr: Koşul erişilemediğinden sonsuz döngüye neden oluyor. Lütfen %1 seçeneği koşulunu değiştirin

# QObject|
source: Validator is missing after the %1 operator. Please, change it
tr: %1 işlecinden sonra doğrulayıcı eksik. Lütfen değiştirin

# QObject|
source: This condition %1 introduces an endless loop. Please, change it
tr: %1 koşulu, sonsuz bir döngüye neden oluyor. Lütfen değiştirin

# QObject|
source: Validator is missing after the e operator. Please, change it
tr: e işlecinden sonra doğrulayıcı eksik. Lütfen değiştirin

# QObject|
source: Missing parameter for Painter node (p)
tr: Boyama düğümü için eksik parametre (p)

# QObject|
source: Dice with %1 face(s) does not exist. Please, put a value higher than 0
tr: %1 yüzlü bir zar yok. Lütfen 0’dan büyük bir değer girin

# QObject|
source: List is missing after the L operator. Please, add it (e.g : 1L[sword,spear,gun,arrow])
tr: L işlecinden sonra liste eksik. Lütfen ekleyin (örneğin: 1L[kılıç,mızrak,tabanca,ok])
