Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/yakuake._desktop_.po
Languages: tr

# GenericName
source: Drop-down Terminal
tr: Yukarıdan Açılan Uçbirim

# Comment
source: A drop-down terminal emulator based on KDE Konsole technology.
tr: KDE Konsole teknolojisi üzerine kurulu, yukarıdan aşağı açılabilen bir uçbirim öykünücüsü.

# Name
source: Silence detected
tr: Sessizlik algılandı

# Comment
source: Silence detected in a monitored terminal or session
tr: İzlenen uçbirimde veya oturumda sessizlik algılandı

# Name
source: Activity detected
tr: Etkinlik algılandı

# Comment
source: Activity detected in a monitored terminal or session
tr: İzlenen uçbirimde veya oturumda etkinlik algılandı

# Name
source: Bell in Visible Session
tr: Görünür Oturumda Zil

# Comment
source: Bell emitted within a visible session
tr: Görünür bir oturumda zil çalındı

# Name
source: Bell in Non-Visible Session
tr: Görünmeyen Oturumda Zil

# Comment
source: Bell emitted within a non-visible session
tr: Görünmeyen bir oturumda zil çalındı
