Repository: yakushabb/foss-desktop-turkish
Catalog: GNOME/Extra/Blurble.main.*.po
Languages: tr

source: Word guessing game
tr: Sözcük öngörme oyunu

source: Solve the riddle until you run out of guesses!
tr: Öngörüler bitene dek bulmacayı çöz!

source: The game is a clone of Wordle and made with localization in mind.
tr: Wordle oyununun ikizidir ve yerelleştirme gözlenerek hazırlanmıştır.

source: Show keyboard
tr: Klavyeyi Göster

source: translator-credits
tr: Sabri Ünal <libreajans@gmail.com>

source: Copyright © 2022 Vojtěch Perník
tr: Telif Hakkı © 2022 Vojtěch Perník

source: Main Menu
tr: Ana Menü

source: Show Keyboard
tr: Klavyeyi Göster

source: Help
tr: Yardım

source: About Blurble
tr: Blurble Hakkında

source: _Play
tr: _Oyna

source: Current word: %s
tr: Geçerli sözcük: %s

source: You won!
tr: Kazandınız!

source: You lost!
tr: Yitirdiniz!

source: The word was:
tr: Doğru sözcük:

source: _Play Again
tr: Yeniden _Oyna

source: <b>W</b> is in the word and in the correct spot.
tr: <b>W</b> sözcük içinde ve doğru konumda.

source: <b>I</b> is in the word but in the wrong spot.
tr: <b>I</b> sözcük içinde ancak başka konumda.

source: <b>U</b> is not in the word in any spot.
tr: <b>U</b> sözcük içinde herhangi bir konumda yok.

# Game keyboard
source: data-keyboard
tr: {q/q}, {w/w}, {e/e}, {r/r}, {t/t}, {y/y}, {u/u}, {ı/ı}, {o/o}, {p/p}, {ğ/ğ}, {ü/ü}; {a/a}, {s/s}, {d/d}, {f/f}, {g/g}, {h/h}, {j/j}, {k/k}, {l/l}, {ş/ş}, {i/i}; {enter}, {z/z}, {x/x}, {c/c}, {v/v}, {b/b}, {n/n}, {m/m}, {ö/ö}, {ç/ç}, {backspace}

# Available letters
source: data-letters
tr: a/b/c/ç/d/e/f/g/ğ/h/ı/i/j/k/l/m/n/o/ö/p/r/s/ş/t/u/ü/v/y/z/q/x/w
