Repository: yakushabb/foss-desktop-turkish
Catalog: GNOME/Extra/fractal.main.*.po
Languages: tr

source: Could not start emoji verification
tr: Emoji doğrulaması başlatılamadı

source: Could not cancel the verification
tr: Doğrulama iptal edilemedi

source: Can’t scan QR code?
tr: QR kod taranmıyor mu?

source: Scan QR code with this session
tr: Bu oturumla QR kodunu tara

source: Compare Emoji
tr: Emoji Karşılaştır

source: Cancel Verification
tr: Doğrulamayı İptal Et

source: Request Complete
tr: İstek Tamamlandı

source: The new session is now ready to send and receive secure messages.
tr: Yeni oturum artık güvenli ileti göndermeye ve almaya hazır.

source: Verification Complete
tr: Doğrulama Tamamlandı

source: {user} is verified and you can now be sure that your communication will be private.
tr: {user} doğrulandı ve artık iletişiminizin gizli olacağından emin olabilirsiniz.

source: Does the other session show a confirmation?
tr: Diğer oturum onay gösteriyor mu?

source: Does {user} see a confirmation on their session?
tr: {user} oturumunda onay görüyor mu?

source: Could not confirm the scan of the QR Code
tr: QR Kodunun taranması doğrulanamadı

source: Confirm Scan
tr: Taramayı Doğrula

source: Confirm
tr: Doğrula

source: Scan QR Code
tr: QR Kodunu Tara

source: New Identity Verification Request
tr: Yeni Kimlik Doğrulama İsteği

source: Wait for Other Party
tr: Karşıyı Bekle

source: No Supported Verification Methods
tr: Desteklenen Doğrulama Yöntemi Yok

source: Verification Request Methods
tr: Doğrulama İstek Yöntemleri

source: Scan Complete
tr: Tarama Tamamlandı

source: Confirm Scan Result
tr: Tarama Sonucunu Onayla

source: Short Authentication String Verification
tr: Kısa Kimlik Doğrulama Dizgesi Doğrulaması

source: Verification Successful
tr: Doğrulama Başarılı

source: None of the methods offered by the other client are supported by Fractal.
tr: Diğer istemci tarafından sunulan yöntemlerin hiçbiri Fractal tarafından desteklenmiyor.

source: A login request was received, but none of the methods offered by the other client are supported by Fractal.
tr: Giriş isteği alındı, ancak diğer istemci tarafından sunulan yöntemlerin hiçbiri Fractal tarafından desteklenmiyor.

source: None of the methods offered by {user}’s client are supported by Fractal.
tr: {user} istemcisi tarafından sunulan yöntemlerin hiçbiri Fractal tarafından desteklenmiyor.

source: {user} sent a verification request, but none of the methods offered by the other client are supported by Fractal.
tr: {user} doğrulama isteği gönderdi, ancak diğer istemci tarafından sunulan yöntemlerin hiçbiri Fractal tarafından desteklenmiyor.

source: Decline Verification
tr: Doğrulamayı Reddet

source: Could not decline the verification
tr: Doğrulama reddedilemedi

source: You can accept this verification from another session or decline it for all your sessions
tr: Bu doğrulamayı başka oturumdan kabul edebilir ya da tüm oturumlarınız için reddedebilirsiniz

source: You scanned the QR code successfully. You may need to confirm the verification from the other session.
tr: QR kodunu taradınız. Doğrulamayı diğer oturumdan onaylamanız gerekebilir.

source: You scanned the QR code successfully. {user} may need to confirm the verification.
tr: QR kodunu taradınız. {user} doğrulamayı onaylaması gerekebilir.

source: You are no longer in the room where the verification was taking place
tr: Artık doğrulamanın yapıldığı odada değilsiniz

source: Check if the same emoji appear in the same order on the other client.
tr: Aynı emojinin diğer istemcide de aynı sırada görünüp görünmediğini denetleyin.

source: Check if the same numbers appear in the same order on the other client.
tr: Aynı sayıların diğer istemcide da aynı sırada görünüp görünmediğini denetleyin.

source: Ask {user} if they see the following emoji appear in the same order on their screen.
tr: {user} kullanıcısına aşağıdaki emojilerin ekranlarında aynı sırada görünüp görünmediğini sorun.

source: Ask {user} if they see the following numbers appear in the same order on their screen.
tr: {user} kullanıcısına aşağıdaki sayıların ekranlarında aynı sırada görünüp görünmediğini sorun.

source: Could not send that the data does not match
tr: Veriler eşleşmediği için gönderilemedi

source: Could not send confirmation that the data matches
tr: Verilerin eşleştiği onayı gönderilemedi

source: Do Not Match
tr: Eşleşmiyor

source: Match
tr: Eşleşiyor

source: Scan the QR code displayed by the other session.
tr: Diğer oturumca görüntülenen QR kodunu tarayın.

source: Scan the QR code shown on the device of {user}.
tr: {user} aygıtında gösterilen QR kodunu tarayın.

source: Could not validate scanned QR Code
tr: Taranan QR Kodu doğrulanamadı

source: Show a QR code to scan with another device
tr: Başka aygıtta taramak için QR kodu göster

source: Get Another Device
tr: Başka Aygıt Getir

source: Accept the verification request from another session or device.
tr: Başka oturumdan ya da aygıttan gelen doğrulama isteğini kabul et.

source: Waiting for {user}
tr: {user} bekleniyor

source: Ask {user} to accept the verification request.
tr: {user} kullanıcısına doğrulama isteğini kabul etmesini sor.

source: To be secure, the verification should happen in person or use a trusted way of communication.
tr: Güvenli olması için doğrulama yüz yüze yapılmalı ya da güvenilir bir iletişim yolu kullanılmalıdır.

source: The request is not showing up on the other device?
tr: İstek diğer aygıtta görünmüyor mu?

source: Cancel Verification Request
tr: Doğrulama İsteğini İptal Et

source: Homeserver Discovery
tr: Ev Sunucusu Keşfi

source: Auto-discovery, also known as “well-known lookup”, allows to discover the URL of a Matrix homeserver from a domain name. This should only be disabled if your homeserver doesn’t support auto-discovery or if you want to provide the URL yourself.
tr: “well-known lookup” olarak da bilinen kendiliğinden keşfet, Matrix ev sunucu URL’sini alan adından keşfetmeyi sağlar. Yalnızca ev sunucunuz kendiliğinden keşfetmeyi desteklemiyorsa ya da URL’yi kendiniz belirlemek istiyorsanız devre dışı bırakın.

source: _Auto-Discovery
tr: _Kendiliğinden Keşfet

source: Welcome to Fractal
tr: Fractal’a Hoş Geldiniz

source: _Log In
tr: _Giriş Yap

source: _Create Account
tr: _Hesap Oluştur

source: Domain Name
tr: Alan Adı

source: The domain of your Matrix homeserver, for example gnome.org
tr: Matrix ev sunucunuzun alan adı, örneğin gnome.org

source: Homeserver URL
tr: Ev Sunucusu URL’si

source: The URL of your Matrix homeserver, for example {address}
tr: Matrix ev sunucunuzun URLʼsi, örneğin {address}

source: Could not set up login
tr: Giriş ayarlanamadı

source: Homeserver
tr: Ev Sunucusu

source: Next
tr: Sonraki

source: Advanced…
tr: Gelişmiş…

source: Could not open URL
tr: URL açılamadı

source: Click on the button below and follow the steps in the browser
tr: Aşağıdaki düğmeye tıkla ve tarayıcıdaki adımları izle

source: Log in to {domain_name}
tr: {domain_name} giriş yap

source: Log in
tr: Giriş Yap

source: More SSO Providers
tr: Daha çok SSO Sağlayıcı

source: Login via SSO
tr: SSO ile Giriş Yap

source: Log In
tr: Giriş Yap

source: Matrix Username
tr: Matrix Kullanıcı Adı

source: Password
tr: Parola

source: Single Sign-On Providers
tr: Tekil Oturum Açma Sağlayıcıları

source: Could not store session
tr: Oturum depolanamadı

source: Authorization Completed
tr: Yetkilendirme Tamamlandı

source: The authorization step is complete. You can close this page and go back to Fractal.
tr: Yetkilendirme adımı tamamlandı. Bu sayfayı kapatabilir ve Fractalʼa geri dönebilirsiniz.

source: Login Complete
tr: Giriş Tamamlandı

source: This session is ready to send and receive secure messages
tr: Bu oturum, güvenli ileti göndermeye ve almaya hazır

source: Start Chatting
tr: Konuşma Başlat

source: Session Setup
tr: Oturum Kurulumu

source: Fetching Account Data…
tr: Hesap Verileri Alınıyor…

source: Log in with {brand}
tr: {brand} ile giriş yap

source: Fractal: Matrix credentials for {user_id}
tr: Fractal: {user_id} için Matrix kimlik bilgileri

source: The secret storage file is corrupted.
tr: Giz depolama dosyası bozuk.

source: Could not access the secret storage file location.
tr: Giz depolama dosyası konumuna erişilemedi.

source: An unexpected error occurred when accessing the secret storage file.
tr: Gizli depolama dosyasına erişilirken beklenmedik hata oluştu.

source: The secret storage file has been changed by another process.
tr: Giz depolama dosyası başka süreççe değiştirildi.

source: The request to the Flatpak Secret Portal was cancelled. Make sure to accept any prompt asking to access it.
tr: Flatpak Giz Kapısına yapılan istek iptal edildi. Erişmek isteyen herhangi bir istemi kabul ettiğinizden emin olun.

source: The Flatpak Secret Portal is not available. Make sure xdg-desktop-portal is installed, and it is at least at version 1.5.0.
tr: Flatpak Giz Kapısı yok. xdg-desktop-portalʼın kurulu olduğundan ve en az 1.5.0 sürümünün olduğundan emin olun.

source: An unexpected error occurred when interacting with the D-Bus Secret Portal backend.
tr: D-Bus Giz Kapı arka ucuyla etkileşim kurulurken beklenmedik hata oluştu.

source: The Flatpak Secret Portal provided a key that is too weak to be secure.
tr: Flatpak Giz Kapısı, güvenli olamayacak dek zayıf bir anahtar sağladı.

source: The item was deleted.
tr: Öge silinmiş.

source: An unexpected error occurred when interacting with the D-Bus Secret Service.
tr: D-Bus Giz Hizmeti ile etkileşim kurulurken beklenmedik hata oluştu.

source: The collection or item is locked.
tr: Derleme ya da öge kilitli.

source: The D-Bus Secret Service session does not exist.
tr: D-Bus Giz Hizmeti oturumu yok.

source: The collection or item does not exist.
tr: Derleme ya da öge yok.

source: The request to the D-Bus Secret Service was cancelled. Make sure to accept any prompt asking to access it.
tr: D-Bus Giz Hizmeti’ne yapılan istek iptal edildi. Erişmek için sorulan istemi kabul ettiğinizden emin olun.

source: Could not access the default collection. Make sure a keyring was created and set as default.
tr: Öntanımlı derlemeye erişilemedi. Anahtarlık oluşturulduğundan ve öntanımlı olarak ayarlandığından emin olun.

source: Could not log the session out
tr: Oturum kapatılamadı

source: {user} sent a verification request
tr: {user} doğrulama isteği gönderdi

source: Verify your new session “{name}”
tr: “{name}” yeni oturumunuzu doğrulayın

source: {user} sent an audio file.
tr: {user} ses dosyası gönderdi.

source: {user} sent a file.
tr: {user} dosya gönderdi.

source: {user} sent an image.
tr: {user} görüntü gönderdi.

source: {user} sent their location.
tr: {user} kendi konumunu gönderdi.

source: {user} sent a video.
tr: {user} video gönderdi.

source: {user} sent a sticker.
tr: {user} yapışkan gönderdi.

source: {user} invited you
tr: {user} sizi davet etti

source: Only invited users, and users can request an invite
tr: Yalnızca davetli kullanıcılar ve kullanıcılar davet isteyebilir

source: Only invited users
tr: Yalnızca davetli kullanıcılar

source: Members of {room}, and users can request an invite
tr: {room} üyeleri ve kullanıcılar davet isteyebilir

source: Members of {room}
tr: {room} üyeleri

source: Any registered user
tr: Herhangi bir kayıtlı kullanıcı

source: Unsupported rule
tr: Desteklenmeyen kural

source: Empty Room (was {user})
tr: Oda Boş ({user} vardı)

source: Empty Room
tr: Boş Oda

source: Unknown
tr: Bilinmeyen

source: Default
tr: Öntanımlı

source: Moderator
tr: Moderatör

source: Admin
tr: Yönetici

source: Creator
tr: Kurucu

source: Muted
tr: Sessiz

source: Could not join room {room_name}
tr: {room_name} odasına katılamadı

source: Could not request an invite to room {room_name}
tr: {room_name} odasına davet istenemedi

source: Verifications
tr: Doğrulamalar

source: Invite Requests
tr: Davet İstekleri

source: Invited
tr: Davet Edildi

source: Favorites
tr: Gözdeler

source: Rooms
tr: Odalar

source: Low Priority
tr: Düşük Öncelik

source: Historical
tr: Tarihsel

source: Explore
tr: Keşfet

source: Forget Room
tr: Odayı Unut

source: Last seen at %H:%M
tr: Son görülme: %H:%M

source: Last seen at %I:%M %p
tr: Son görülme: %I:%M %p

source: Last seen yesterday at %H:%M
tr: Son görülme: Dün, %H:%M

source: Last seen yesterday at %I:%M %p
tr: Son görülme: Dün, %I:%M %p

source: Last seen %A at %H:%M
tr: Son görülme: %A, %H:%M

source: Last seen %A at %I:%M %p
tr: Son görülme: %A, %l:%M %p

source: Last seen %B %-e at %H:%M
tr: Son görülme: %-e %B, %H:%M

source: Last seen %B %-e at %I:%M %p
tr: Son görülme: %-e %B, %l:%M %p

source: Last seen %B %-e %Y at %H:%M
tr: Son görülme: %-e %B %Y, %H:%M

source: Last seen %B %-e %Y at %I:%M %p
tr: Son görülme: %-e %B %Y, %l:%M %p

source: Export Room Encryption Keys
tr: Oda Şifreleme Anahtarlarını Dışa Aktar

source: Exporting your room encryption keys allows you to make a backup to be able to decrypt your messages in end-to-end encrypted rooms on another device or with another Matrix client.
tr: Oda şifreleme anahtarlarınızı dışa aktarmak, uçtan uca şifrelenmiş odalardaki iletilerinizin şifresini başka aygıtta ya da başka bir Matrix istemcisinde çözebilmek için yedeklemenizi sağlar.

source: The backup must be stored in a safe place and must be protected with a strong passphrase that will be used to encrypt the data.
tr: Yedek, güvenli bir yerde saklanmalı ve verileri şifrelemek için kullanılacak güçlü bir parola metniyle korunmalıdır.

source: Export Keys
tr: Anahtarları Dışa Aktar

source: Import Room Encryption Keys
tr: Oda Şifreleme Anahtarlarını İçe Aktar

source: Importing your room encryption keys allows you to decrypt your messages in end-to-end encrypted rooms with a previous backup from a Matrix client.
tr: Oda şifreleme anahtarlarınızı içe aktarmak, Matrix istemcisinde önceki yedeklemeyle uçtan uca şifrelenmiş odalardaki iletilerinizin şifresini çözmenizi sağlar.

source: Enter the passphrase provided when the backup file was created.
tr: Yedekleme dosyası oluşturulurken belirlenen parola metnini girin.

source: Import Keys
tr: Anahtarları İçe Aktar

source: fractal-encryption-keys
tr: fractal-şifreleme-anahtarları

source: Save Encryption Keys To…
tr: Şifreleme Anahtarını Şuraya Kaydet…

source: Import Encryption Keys From…
tr: Şifreleme Anahtarlarını Şuradan İçe Aktar…

source: Could not access file
tr: Dosyaya erişilemedi

source: Passphrases do not match
tr: Parola metinleri eşleşmiyor

source: Room encryption keys exported successfully
tr: Oda şifreleme anahtarları dışa aktarıldı

source: Imported 1 room encryption key
tr: {n} odanın şifreleme anahtarları içe aktarıldı

source: Could not export the keys
tr: Anahtarlar dışa aktarılamadı

source: The passphrase doesn't match the one used to export the keys.
tr: Parola metni, anahtarları dışa aktarmak için kullanılanla eşleşmiyor.

source: Could not import the keys
tr: Anahtarlar içe aktarılamadı

source: Passphrase
tr: Parola Metni

source: Confirm Passphrase
tr: Parola Metnini Doğrula

source: File
tr: Dosya

source: Choose…
tr: Seç…

source: No Crypto Identity
tr: Kripto Kimliği Yok

source: Verifying your own devices or other users is not possible
tr: Kendi aygıtlarınızı ya da diğer kullanıcıları doğrulamak olanaksız

source: Enable…
tr: Etkinleştir…

source: Enable Crypto Identity
tr: Kripto Kimliğini Etkinleştir

source: Crypto Identity Enabled
tr: Kripto Kimliği Etkin

source: The crypto identity exists and this device is verified
tr: Kripto kimliği var ve bu aygıt doğrulanmış

source: Reset…
tr: Sıfırla…

source: Crypto Identity Incomplete
tr: Kripto Kimliği Eksik

source: The crypto identity exists but this device is not verified
tr: Kripto kimliği var ancak bu aygıt doğrulanmamış

source: Verify…
tr: Doğrula…

source: Verify This Session
tr: Bu Oturumu Doğrula

source: Account Recovery Disabled
tr: Hesap Kurtarma Devre Dışı

source: Enable recovery to be able to restore your account without another device
tr: Hesabı başka aygıt olmadan geri yüklemek için kurtarmayı etkinleştir

source: Enable Account Recovery
tr: Hesap Kurtarmayı Etkinleştir

source: Account Recovery Enabled
tr: Hesap Kurtarma Etkin

source: Your signing keys and encryption keys are synchronized
tr: İmzalama ve şifreleme anahtarları eşzamanlandı

source: Reset Account Recovery Key
tr: Hesap Kurtarma Anahtarını Sıfırla

source: Recover to synchronize your signing keys and encryption keys
tr: İmzalama ve şifreleme anahtarlarını eşzamanlamak için kurtar

source: Recover…
tr: Kurtar…

source: Recover Account Data
tr: Hesap Verilerini Kurtar

source: Encryption
tr: Şifreleme

source: Crypto Identity
tr: Kripto Kimliği

source: Allows you to verify other Matrix accounts and automatically trust their verified sessions
tr: Diğer Matrix hesaplarını doğrulamanıza ve doğrulanmış oturumlarına kendiliğinden güvenmenizi sağlar

source: Account Recovery
tr: Hesap Kurtarma

source: Allows to fully recover your account with a recovery key or passphrase, if you ever lose access to all your sessions
tr: Tüm oturumlarınıza erişimi yitirmeniz durumunda, bir kurtarma anahtarı ya da parola metni ile hesabınızı kurtarmanızı sağlar

source: Password must be at least 8 characters long
tr: Parola en azından 8 karakter uzunluğunda olmalı

source: Password must have at least one lower-case letter
tr: Parola en azından 1 küçük harf içermeli

source: Password must have at least one upper-case letter
tr: Parola en azından 1 büyük harf içermeli

source: Password must have at least one digit
tr: Parola en azından 1 sayı içermeli

source: Password must have at least one symbol
tr: Parola en azından 1 sembol içermeli

source: Passwords do not match
tr: Parolalar eşleşmiyor

source: Password changed successfully
tr: Parola değiştirildi

source: Password rejected for being too weak
tr: Parola çok zayıf olduğundan reddedildi

source: Could not change password
tr: Parola değiştirilemedi

source: Change Password
tr: Parola Değiştir

source: Changing your password will log you out of your other sessions.
tr: Parolanızı değiştirmek, diğer oturumlarınızdan çıkmanıza neden olur.

source: New Password
tr: Yeni Parola

source: Confirm New Password
tr: Yeni Parolayı Doğrula

source: Continue
tr: Sürdür

source: Account successfully deactivated
tr: Hesap devre dışı bırakıldı

source: Could not deactivate account
tr: Hesap devre dışı bırakılamadı

source: Deactivate Account
tr: Hesabı Devre Dışı Bırak

source: Deactivating your account means you will lose access to all your messages, contacts, files, and more, forever.
tr: Hesabınızı devre dışı bırakmak; tüm iletilerinize, bağlantılarınıza, dosyalarınıza ve daha çoğuna erişiminizi sonsuza dek yitireceğiniz anlamına gelir.

source: To confirm that you really want to deactivate this account, type in your Matrix user ID:
tr: Bu hesabı gerçekten devre dışı bırakmak istediğinizi onaylamak için Matrix kullanıcı kimliğinizi yazın:

source: The crypto identity and account recovery are not set up properly. If this is your last connected session and you have no recent local backup of your encryption keys, you will not be able to restore your account.
tr: Kripto kimliği ve hesap kurtarma düzgün ayarlanmamış. Bu son bağlı oturumunuzsa ve şifreleme anahtarlarınızın yakın zamanda alınmış yerel yedeği yoksa hesabınızı geri yükleyemezsiniz.

source: This is your last connected session. Make sure that you can still access your recovery key or passphrase, or to backup your encryption keys before logging out.
tr: Bu sizin son bağlı oturumunuz. Oturumu kapatmadan önce kurtarma anahtarınıza ya da parola metnine hala erişebildiğinizden veya şifreleme anahtarlarınızı yedeklediğinizden emin olun.

source: Log Out
tr: Çıkış Yap

source: Log Out of This Session
tr: Bu Oturumdan Çıkış Yap

source: Are you sure you want to log out of this session?
tr: Bu oturumdan çıkmak istediğinize emin misiniz?

source: Review Account Security
tr: Hesap Güvenliğini İncele

source: Logout Failed
tr: Oturum Kapatılamadı

source: Logging out of this session failed. You can try again, or, if this is a permanent error, you can remove the session.
tr: Bu oturum kapatılamadı. Yeniden deneyebilir ya da bu kalıcı bir hataysa oturumu kaldırabilirsiniz.

source: Removing the session deletes the associated data from the system, but your homeserver and other sessions will not be aware that this session was logged out.
tr: Oturumun kaldırılması ilişkili verileri sistemden siler, ancak ana sunucunuz ve diğer oturumlar bu oturumun kapatıldığından haberdar olmaz.

source: Remove Session
tr: Oturumu Kaldır

source: Avatar removed successfully
tr: Profil resmi kaldırıldı

source: Avatar changed successfully
tr: Profil resmi değişitirildi

source: Could not load file
tr: Dosya yüklenemedi

source: Could not upload avatar
tr: Profil resmi yüklenemedi

source: Could not change avatar
tr: Profil resmi değiştirilemedi

source: Remove Avatar?
tr: Profil Resmi Kaldırılsın Mı?

source: Do you really want to remove your avatar?
tr: Profil resmi gerçekten kaldırılsın mı?

source: Could not remove avatar
tr: Profil resmi kaldırılamadı

source: Name changed successfully
tr: Ad değiştirildi

source: Could not change display name
tr: Görünen ad değiştirilemedi

source: General
tr: Genel

source: Account Avatar
tr: Hesap Profil Resmi

source: Name
tr: Ad

source: Matrix User ID
tr: Matrix Kullanıcı Kimliği

source: Sessions
tr: Oturumlar

source: Manage Account
tr: Hesabı Yönet

source: Advanced Information
tr: Gelişmiş Bilgiler

source: Copy Homeserver Address
tr: Ev Sunucusu Adresini Kopyala

source: Homeserver address copied to clipboard
tr: Ev sunucusu adresi panoya kopyalandı

source: Local Session ID
tr: Yerel Oturum Kimliği

source: Copy Local Session ID
tr: Yerel Oturum Kimliğini Kopyala

source: Local session ID copied to clipboard
tr: Yerel oturum kimliği panoya kopyalandı

source: Could not enable account notifications
tr: Hesap bildirimleri etkinleştirilemedi

source: Could not disable account notifications
tr: Hesap bildirimleri devre dışı bırakılamadı

source: Could not change global notifications setting
tr: Genel bildirim ayarları değiştirilemedi

source: Remove “{keyword}”
tr: “{keyword}” kaldır

source: Could not remove notification keyword
tr: Bildirim anahtar sözcüğü kaldırılamadı

source: Could not add notification keyword
tr: Bildirim anahtar sözcüğü eklenemedi

source: Notifications
tr: Bildirimler

source: Enable for This Account
tr: Bu Hesap İçin Etkinleştir

source: Enable for This Session
tr: Bu Oturum İçin Etkinleştir

source: Global
tr: Genel

source: Which messages trigger notifications in rooms that do not have more specific rules
tr: Daha özel kuralları olmayan odalarda hangi iletilerin bildirimleri tetiklediği

source: All messages in all rooms
tr: Tüm odalardaki tüm iletiler

source: All messages in direct chats, and mentions and keywords in all rooms
tr: Doğrudan söyleşideki tüm iletiler ve tüm odalardaki değinmeler ve anahtar sözcükler

source: Only mentions and keywords in all rooms
tr: Tüm odalarda yalnızca değinmeler ve anahtar sözcükler

source: Keywords
tr: Anahtar Sözcükler

source: Messages that contain one of these keywords trigger notifications. Matching on these keywords is case-insensitive.
tr: Bu anahtar sözcüklerden birini içeren iletiler bildirimleri tetikler. Anahtar sözcüklerle eşleştirme büyük/küçük duyarsızdır.

source: Add Keyword
tr: Anahtar Sözcük Ekle

source: Ignored Users
tr: Yok Sayılan Kullanıcılar

source: Toggle Ignored Users Search
tr: Yok Sayılan Kullanıcı Aramasını Aç/Kapat

source: Search for ignored users
tr: Yok Sayılan kullanıcıları ara

source: No Ignored Users
tr: Yok Sayılan Kullanıcı Yok

source: You can add users to this list from their room member profile
tr: Kullanıcıları oda üye profillerinden bu listeye ekleyebilirsiniz

source: Could not change media previews setting
tr: Ortam ön izleme ayarları değiştirilemedi
