Repository: yakushabb/foss-desktop-turkish
Catalog: GNOME/Extra/fractal.main.*.po
Languages: tr

source: Could not enable avatars for invites
tr: Davet edenler için profil resmi etkinleştirilemedi

source: Could not disable avatars for invites
tr: Davet edenler için profil resmi devre dışı bırakılamadı

source: Safety
tr: Güvenlik

source: All messages or invitations sent by these users will be ignored. You will still see some of their activity, like when they join or leave a room.
tr: Bu kullanıcılarca gönderilen tüm iletiler ya da davetler yok sayılacak. Yine de odaya katılıp çıkmaları gibi bazı etkinliklerini görebilirsiniz.

source: Privacy
tr: Gizlilik

source: Send Read Receipts
tr: Okundu Alındızı Gönder

source: Allow other members of the rooms you participate in to track which messages you have seen
tr: Katıldığınız odalardaki diğer üyelerin hangi iletileri gördüğünüzü izlemesine izin ver

source: Send Typing Notifications
tr: Yazıyor Bildirimlerini Gönder

source: Allow other members of the rooms you participate in to see when you are typing a message
tr: Katıldığınız odalardaki diğer üyelerin ne zaman ileti yazdığınızı görmesine izin ver

source: Media Previews
tr: Ortam Ön İzlemeleri

source: Which rooms automatically show previews for images and videos. Hidden previews can always be shown by clicking on the media.
tr: Hangi odalarda resimler ve videolar için kendiliğinden ön izlemeler gösterilir. Gizli ön izlemeler her zaman ortama tıklanarak gösterilebilir.

source: Show in all rooms
tr: Tüm odalarda göster

source: Show only in private rooms
tr: Yalnızca özel odalarda göster

source: Hide in all rooms
tr: Tüm odalarda gizle

source: Show Avatars for Invites
tr: Davetler İçin Avatarları Göster

source: Display the avatars of the room and the inviter
tr: Odanın ve davetçinin avatarlarını göster

source: Current Session
tr: Geçerli Oturum

source: Other Active Sessions
tr: Diğer Etkin Oturumlar

source: Could not load the list of connected devices
tr: Bağlı aygıtların listesi yüklenemedi

source: Verified
tr: Doğrulanmış

source: Not verified
tr: Doğrulanmamış

source: Session renamed
tr: Oturum yeniden adlandırıldı

source: Could not rename session
tr: Oturum yeniden adlandırılamadı

source: Could not disconnect session “{device_name}”
tr: “{device_name}” oturumunun bağlantısı kesilemedi.

source: Matrix Session ID
tr: Matrix Oturum Kimliği

source: Copy Matrix Session ID
tr: Matrix Oturum Kimliğini Kopyala

source: Matrix session ID copied to clipboard
tr: Matrix oturum kimliği panoya kopyalandı

source: Public Name
tr: Genel Ad

source: Last Seen
tr: Son Görülme

source: Last Location
tr: Son Konum

source: Disconnect
tr: Bağlantıyı Kes

source: Public Rooms Search
tr: Genel Oda Arama

source: Search for a room in the public directory of the selected server
tr: Seçilen sunucunun genel dizininde oda ara

source: Switch servers
tr: Sunucuları değiştir

source: No Rooms
tr: Oda Yok

source: No rooms matching the search were found
tr: Aramayla eşleşen oda bulunamadı

source: List of Public Rooms
tr: Genel Odaların Listesi

source: An error occurred while searching for matches
tr: Eşleşmeler aranırken hata oluştu

source: View {room_name}
tr: {room_name} odasını görüntüle

source: Request an invite to {room_name}
tr: {room_name} odasına davet iste

source: Join {room_name}
tr: {room_name} odasına katıl

source: Server List
tr: Sunucu Listesi

source: Add Server
tr: Sunucu Ekle

source: Remove Server
tr: Sunucuyu Kaldır

source: {user_name} ({user_id}) invited you
tr: {user_name} ({user_id}) sizi davet etti

source: Could not accept invitation for {room}
tr: {room} için davetiye kabul edilemedi

source: Could not decline invitation for {room}
tr: {room} için davetiye reddedilemedi

source: _Decline
tr: _Reddet

source: _Accept
tr: _Kabul Et

source: Could not retract invite request
tr: Davet isteği geri çekilemedi

source: Invite Request
tr: Davet İsteği

source: You requested an invite to this room
tr: Bu odaya davet edilmek istediniz

source: _Retract
tr: _Geri Çek

source: Main Content
tr: Ana İçerik

source: No Room Selected
tr: Oda Seçilmedi

source: Join a room to start chatting
tr: Söyleşmek için odaya katıl

source: Room History
tr: Oda Geçmişi

source: Room Invite
tr: Oda Daveti

source: Explore Rooms
tr: Odaları Keşfet

source: Address auto-completion
tr: Adres kendiliğinden tamamlama

source: Local Addresses on {homeserver}
tr: {homeserver} Üzerindeki Yerel Adresler

source: Remove address
tr: Adresi kaldır

source: Remove “{address}”
tr: “{address}” adresini kaldır

source: Main Address
tr: Ana Adres

source: Set as main address
tr: Ana adres olarak ayarla

source: Set “{address}” as main address
tr: “{address}” adresini ana adres ayarla

source: Could not remove public address
tr: Genel adres kaldırılamadı

source: Could not set main public address
tr: Ana genel adres ayarlanamadı

source: Could not add public address
tr: Genel adres eklenemedi

source: This address is not registered as a local address
tr: Bu adres yerel adres olarak kaydedilmemiş

source: This address does not belong to this room
tr: Bu adres bu odaya ait değil

source: Unregister local address
tr: Yerel adres kaydını kaldır

source: Unregister “{address}”
tr: “{address}” adresinin kaydını kaldır

source: Could not unregister local address
tr: Yerel adresin kaydı kaldırılamadı

source: Register “{address}”
tr: “{address}” adresini kaydet

source: Could not register local address
tr: Yerel adres kaydedilemedi

source: This address is already registered
tr: Bu adres zaten kayıtlı

source: Edit Room Addresses
tr: Oda Adreslerini Düzenle

source: Public Addresses
tr: Genel Adresler

source: Public addresses are advertised for all users in the room and the main address is used to identify a room publicly. Before adding an address to this list, it must be registered as a local address.
tr: Genel adresler odadaki tüm kullanıcılara duyrulur ve ana adres odayı genel olarak tanımlamada kullanılır. Bir adres, bu listeye eklemeden önce yerel adres olarak kaydedilmelidir.

source: Local addresses can only be registered with your own homeserver. If they are not made public, only people on your homeserver can discover them.
tr: Yerel adresler yalnızca kendi ev sunucunuzla kaydedilebilir. Genel olarak ayarlanmazsa, yalnızca ev sunucunuzdaki kişiler keşfedebilir.

source: Add Public Address
tr: Genel Adres Ekle

source: Register Local Address
tr: Yerel Adresi Kaydet

source: my-room
tr: odam

source: First part of the address, for example “my-room”
tr: Adresin ilk bölümü, örn: “odam”

source: Do you really want to remove the avatar for this room?
tr: Bu odanın profil resmini gerçekten kaldırmak istiyor musunuz?

source: Room name saved successfully
tr: Oda adı kaydedildi

source: Could not change room name
tr: Oda adı değiştirilemedi

source: Room description saved successfully
tr: Oda açıklaması kaydedildi

source: Could not change room description
tr: Oda açıklaması değiştirilemedi

source: Edit Room Details
tr: Oda Ayrıntılarını Düzenle

source: Room Avatar
tr: Oda Profil Resmi

source: Description
tr: Açıklama

source: Save Description
tr: Açıklamayı Kaydet

source: Member
tr: Üyeler

source: Could not change notifications setting
tr: Bildirim ayarları değiştirilemedi

source: Copy address
tr: Adresi kopyala

source: Address copied to clipboard
tr: Adres panoya kopyalandı

source: Room link copied to clipboard
tr: Oda bağlantısı panoya kopyalandı

source: Could not change guest access
tr: Konuk erişimi değiştirilemedi

source: Publish in the {homeserver} directory
tr: {homeserver} dizininde yayınla

source: Could not publish room in directory
tr: Oda dizinde yayınlanamadı

source: Could not unpublish room from directory
tr: Oda dizinden kaldırılamadı

source: Anyone, even if they are not in the room
tr: Herkes, odada olmasalar bile

source: Members only, since this option was selected
tr: Yalnızca üyeler, bunun seçilmesinden bu yana

source: Members only, since they were invited
tr: Yalnızca üyeler, davet edilmelerinden bu yana

source: Members only, since they joined the room
tr: Yalnızca üyeler, odaya katılmalarından bu yana

source: Enable Encryption?
tr: Şifreleme Etkinleştirilsin Mi?

source: Enabling encryption will prevent new members to read the history before they arrived. This cannot be disabled later.
tr: Şifrelemenin etkinleştirilmesi, yeni üyelerin katılmadan önce geçmişi okumasını önler. Bu daha sonra devre dışı bırakılamaz.

source: Enable
tr: Etkinleştir

source: Could not enable encryption
tr: Şifreleme etkinleştirilemedi

source: Federated
tr: Federasyon

source: Not federated
tr: Federasyon değil

source: Room upgraded successfully
tr: Oda başarıyla yükseltildi

source: Could not upgrade room
tr: Oda yükseltilemedi

source: Room Details
tr: Oda Ayrıntıları

source: Edit Details
tr: Ayrıntıları Düzenle

source: There are no members in this room
tr: Bu odada hiç üye yok

source: Media
tr: Ortam

source: Files
tr: Dosyalar

source: Audio
tr: Ses

source: Which messages trigger notifications in this room
tr: Bu odada hangi iletilerin bildirimleri tetiklediği

source: Use Global Setting
tr: Genel Ayarı Kullan

source: All Messages
tr: Tüm İletiler

source: Only Mentions and Keywords
tr: Yalnızca Değinmeler ve Anahtar Sözcükler

source: Disable Notifications
tr: Bildirimleri Devre Dışı Bırak

source: Edit Public Addresses
tr: Genel Adresleri Düzenle

source: _Edit
tr: _Düzenle

source: This room has no public addresses
tr: Bu odanın genel adresi yok

source: Copy Room Link
tr: Oda Bağlantısını Kopyala

source: Access and Visibility
tr: Erişim ve Görünürlük

source: Who Can Join
tr: Kim Katılabilir

source: Allow Guests
tr: Konuklara İzin Ver

source: Guests are Matrix users without a registered account
tr: Konuklar, kayıtlı hesabı olmayan Matrix kullanıcılarıdır

source: Who Can Read History
tr: Geçmişi Kim Okuyabilir

source: Matrix Room ID
tr: Matrix Oda Kimliği

source: Copy Matrix Room ID
tr: Matrix Oda Kimliğini Kopyala

source: Matrix room ID copied to clipboard
tr: Matrix oda kimliği panoya kopyalandı

source: Enable Encryption
tr: Şifrelemeyi Etkinleştir

source: Permissions
tr: İzinler

source: Room Version
tr: Oda Sürümü

source: Upgrade…
tr: Yükselt…

source: Federation
tr: Federasyon

source: Play {filename}
tr: {filename} çal

source: Unknown duration
tr: Bilinmeyen süre

source: Play
tr: Oynat

source: No Audio
tr: Ses Yok

source: This room does not contain any audio
tr: Bu oda ses içermiyor

source: Could Not Load Audio
tr: Ses Yüklenemedi

source: Check your network connection
tr: Ağ bağlantınızı denetleyin

source: Audio History
tr: Ses Geçmişi

source: Save {filename}
tr: {filename} kaydet

source: Unknown size
tr: Bilinmeyen boyut

source: Open File
tr: Dosya Aç

source: Save File
tr: Dosyayı Kaydet

source: Could not save file
tr: Dosya kaydedilemedi

source: No Files
tr: Dosya Yok

source: This room does not contain any files
tr: Bu oda dosya içermiyor

source: Could Not Load Files
tr: Dosyalar Yüklenemedi

source: File History
tr: Dosya Geçmişi

source: No Media
tr: Ortam Yok

source: This room does not contain any media
tr: Bu oda ortam içermiyor

source: Could Not Load Media
tr: Ortam Yüklenemedi

source: Media History
tr: Ortam Geçmişi

source: _Save
tr: _Kaydet

source: Could not change who can read history
tr: Geçmişi kimin okuyabileceği değiştirilemedi

source: Banned
tr: Yasaklanmış

source: Could not invite {user} to {room}
tr: {n} kullanıcı {room} odasına davet edilemedi

source: Invite New Members
tr: Yeni Üye Davet Et

source: I_nvite
tr: _Davet Et

source: Search
tr: Ara

source: Search for users to invite them to this room
tr: Odaya davet edecek kullanıcıları ara

source: Matching Users
tr: Eşleşen Kullanıcılar

source: No Users Found
tr: Kullanıcı Bulunamadı

source: No users matching the search were found
tr: Aramayla eşleşen kullanıcı bulunamadı

source: Searching for Users
tr: Kullanıcıları Ara

source: The version of this room does not support all possibilities. Upgrade this room to the latest version to see more options.
tr: Bu odanın sürümü tüm olasılıkları desteklemiyor. Daha çok seçenek görmek için bu odayı en son sürüme yükseltin.

source: Could not change who can join
tr: Kimlerin katılabileceği değiştirilemedi

source: Only Invited Users
tr: Yalnızca Davetli Kullanıcılar

source: Any Registered User
tr: Herhangi Kayıtlı Kullanıcı

source: Allow Invite Requests
tr: Davet İsteklerine İzin Ver

source: Identity Verified
tr: Kimlik Koğrulandı

# members
source: Invited
tr: Davet Edildi

# members
source: Banned
tr: Yasaklanmış

# members
source: Invite Request
tr: Davet İsteği

source: Could not load the full list of room members
tr: Oda üyelerinin tam listesi yüklenemedi

source: Room Member
tr: Oda Üyeleri

source: Invited Room Member
tr: Davet Edilen Oda Üyeleri

source: Banned Room Member
tr: Yasaklanmış Oda Üyeleri

source: No Room Members
tr: Oda Üyesi Yok

source: No Invited Room Members
tr: Davetli Oda Üyesi Yok

source: There are no invited members in this room
tr: Bu odada davetli üye yok

source: No Banned Room Members
tr: Yasaklanmış Oda Üyeleri Yok

source: There are no banned members in this room
tr: Bu odada yasaklı üye yok

source: No Invite Requests
tr: Davet İsteği Yok

source: There are no invite requests in this room
tr: Bu odada herhangi bir davet isteği yok

source: Toggle Room Members Search
tr: Oda Üyeleri Aramayı Aç/Kapat

source: Search for room members
tr: Oda üyeleri ara

source: The user is not in the room members list anymore
tr: Kullanıcı artık oda üyeleri listesinde değil

source: Add Custom Permissions
tr: Özel İzinler Ekle

source: _Add
tr: _Ekle

source: Assign Power Level
tr: Güç Düzeyi Ata

source: Search Results
tr: Arama Sonuçları

source: No Matching Members Found
tr: Eşleşen Üye Bulunamadı

source: No room members matching the search were found
tr: Aramayla eşleşen oda üyesi bulunamadı

source: There are no room members with assigned power levels in this room
tr: Bu odada atanmış güç düzeyi olan oda üyesi yok

source: There are no room members with assigned power levels matching the search
tr: Aramayla eşleşen atanmış güç düzeyi olan oda üyesi yok

source: Members With Assigned Power Levels
tr: Güç Düzeyi Atanmış Üyeler

source: Add
tr: Ekle

source: Could not save permissions
tr: İzinler kaydedilemedi

source: Room Actions
tr: Oda Eylemleri

source: Power level required to perform different actions in the room
tr: Odada başka eylemleri gerçekleştirmek için gereken güç düzeyi

source: Send Messages
tr: İleti Gönder

source: Remove Own Messages
tr: Kendi İletilerini Kaldır

source: Remove Messages of Other Members
tr: Diğer Üye İletilerini Kaldır

source: Notify Entire Room
tr: Tüm Odayı Bilgilendir

source: Change Room Settings
tr: Oda Ayarlarını Değiştir

source: Change Room Name
tr: Oda Adını Değiştir

source: Change Room Description
tr: Oda Açıklamasını Değiştir

source: Change Room Avatar
tr: Oda Profil Resmini Değiştir

source: Change Addresses
tr: Adresleri Değiştir

source: Change Who Can Read History
tr: Geçmişi Okuyabilenleri Değiştir

source: Change Permissions
tr: İzinleri Değiştir

source: Change Server Access Control List
tr: Sunucu Erişim Denetim Listesini Değiştir

source: Upgrade Room
tr: Odayı Yükselt

source: Member Actions
tr: Üye Eylemleri

source: Power level required to perform different actions on room members
tr: Oda üyelerinde başka eylemler gerçekleştirmek için gereken güç düzeyi

source: Members Power Levels
tr: Üye Güç Düzeyleri

source: Power levels defined for all members of the room
tr: Odanın tüm üyeleri için tanımlanmış güç düzeyleri

source: Default Power Level
tr: Öntanımlı Güç Düzeyi

source: Stable
tr: Kararlı

source: Experimental
tr: Deneysel

source: After the upgrade, you will be the only creator in the room. The other creator will be demoted to the default power level.
tr: Yükseltmeden sonra, odadaki tek kurucu siz olacaksınız. Diğer kurucular öntanımlı güç düzeyine indirilecek.

source: After the upgrade, you will be the only creator in the room. The current creator will be demoted to the default power level.
tr: Yükseltmeden sonra odadaki tek kurucu siz olacaksınız. Var olan kurucular öntanımlı güç düzeyine indirilecek.

source: Upgrading a room to a more recent version allows to benefit from new features from the Matrix specification. It can also be used to reset the room state, which should make the room faster to join. However it should be used sparingly because it can be disruptive, as room members need to join the new room manually.
tr: Oda, daha yeni sürüme yükseltilerek yeni Matrix özelliklerinden yararlanılabilir. Ayrıca, oda durumunu sıfırlamada kullanılabilir; bu, odaya katılımı hızlandırabilir. Yine de, oda üyelerinin yeni odaya elle katılmaları gerekeceğinden bozucu olabilir, tutumlu kullanılmalıdır.

source: Version
tr: Sürüm

source: After the upgrade, you will be the only member of the room and other members will need to be re-invited manually. This could be avoided by using third-party upgrade tooling that handles this for you.
tr: Yükseltmeden sonra odanın tek üyesi siz olacaksınız ve diğer üyelerin elle yeniden davet edilmesi gerekecek. Bunu sizin için yapan üçüncü taraf yükseltme araçları kullanılarak bu durumdan kaçınılabilir.

source: Upgrade
tr: Yükselt

source: This is the start of the visible history
tr: Bu, görünür geçmişin başlangıcıdır

source: %A, %B %-e
tr: %-e %B %A

source: %A, %B %-e, %Y
tr: %-e %B %Y, %A

source: New Messages
tr: Yeni İletiler

source: Context Menu
tr: İçerik Menüsü

source: _Reply
tr: _Yanıtla

source: _Forward
tr: İl_eri

source: _Select
tr: _Seç

source: Revoke _Invite
tr: _Daveti Geri Al

source: _Copy Text
tr: Metni _Kopyala

source: Copy T_humbnail
tr: Küçük Resmi _Kopyala

source: S_ave Image
tr: Görüntüyü K_aydet

source: S_ave Video
tr: _Videoyu Kaydet

source: S_ave Audio
tr: _Sesi Kaydet

source: Copy Message _Link
tr: İleti _Bağlantısını Kopyala

source: _Properties
tr: _Özellikler

source: _Discard
tr: _Gözden Çıkar

source: Rep_ort…
tr: _Bildir…

source: Re_move
tr: _Kaldır

source: Message link copied to clipboard
tr: İleti bağlantısı panoya kopyalandı

source: Thumbnail copied to clipboard
tr: Küçük resim panoya kopyalandı

source: Text copied to clipboard
tr: Metin panoya kopyalandı

source: Remove Message?
tr: İleti Kaldırılsın Mı?

source: Do you really want to remove this message? This cannot be undone.
tr: Bu iletiyi gerçekten kaldırmak istiyor musunuz? Bu işlem geri alınamaz.

source: Could not remove message
tr: İleti kaldırılamadı

source: Could not toggle reaction
tr: Karşılık açılıp kapatılamadı

source: Report Event?
tr: Olay Bildirilsin Mi?

source: Reporting an event will send its unique ID to the administrator of your homeserver. The administrator will not be able to see the content of the event if it is encrypted or redacted.
tr: Bir olayı bildirmek, ev sunucunuzun yöneticisine eşsiz kimliği gönderecektir. Yönetici, şifrelenmiş ya da düzenlenmişse olayın içeriğini göremez.

source: Report
tr: Bildir

source: Could not report event
tr: Olay bildirilemedi

source: Could not discard message
tr: İleti gözden çıkarılamadı

source: Revoking invite…
tr: Davet geri alınıyor…

source: Original Event Source
tr: Özgün Olay Kaynağı

source: Event Source
tr: Olay Kaynağı

source: Latest Edit Source
tr: En Son Düzenleme Kaynağı

source: Source copied to clipboard
tr: Kaynak panoya kopyalandı

source: Event Properties
tr: Olay Özellikleri

source: Original Event
tr: Özgün Olay

source: Event ID
tr: Olay Kimliği

source: Copy Event ID
tr: Olay Kimliğini Kopyala

source: Event ID copied to clipboard
tr: Olay kimliği panoya kopyalandı

source: Room ID
tr: Oda Kimliği

source: Copy Room ID
tr: Oda Kimliğini Kopyala

source: Room ID copied to clipboard
tr: Oda kimliği panoya kopyalandı

source: Sender ID
tr: Gönderen Kimliği

source: Show Profile
tr: Profili Göster

source: Timestamp
tr: Zaman damgası

source: Copy Timestamp
tr: Zaman Damgasını Kopyala

source: Timestamp copied to clipboard
tr: Zaman damgası panoya kopyalandı

source: View Source
tr: Kaynağı Göster

source: Latest Edit
tr: En Son Düzenleme

source: Copy Source
tr: Kaynağı Kopyala

source: Send a Reaction
tr: Karşılık Gönder

source: More Reactions
tr: Daha Çok Karşılık

source: Audio: {filename}
tr: Ses: {filename}

source: Could not retrieve audio file
tr: Ses dosyası alınamadı

source: Error reading audio file
tr: Ses dosyası okunamadı

source: Could not decrypt this message, decryption will be retried once the keys are available.
tr: Bu iletinin şifresi çözülemedi, anahtarlar kullanılabildiğinde şifre çözme yeniden denenecek.

source: This message was removed.
tr: Bu ileti kaldırıldı.

source: Unsupported event
tr: Desteklenmeyen olay

source: File: {filename}
tr: Dosya: {filename}

source: Location is invalid and cannot be displayed
tr: Konum geçersiz ve görüntülenemiyor

source: User Location
tr: Kullanıcı Konumu

source: Sending…
tr: Gönderiliyor…

source: Temporary Error Sending Message
tr: İleti Gönderilirken Geçici Hata

source: Message Cannot Be Sent
tr: İleti Gönderilemiyor

source: Sent
tr: Gönderildi

source: Edited
tr: Düzenlendi

source: Sent at {time}
tr: {time} tarihinde gönderildi

source: Show Sender Profile
tr: Gönderen Profilini Göster

source: 1 member reacted with {reaction_key}
tr: {n} üye {reaction_key} ile karşılık verdi

source: {user} reacted with {reaction_key}
tr: {user} {reaction_key} ile karşılık verdi

source: Reactions
tr: Karşılıklar

source: In Reply To
tr: Yanıt Olarak

source: Mention
tr: Değin

source: Details
tr: Ayrıntılar

source: Image
tr: Görüntü

source: Sticker
tr: Yapışkan

source: Image: {filename}
tr: Görüntü: {filename}

source: Sticker: {filename}
tr: Yapışkan: {filename}

source: Could not retrieve media
tr: Ortam alınamadı

source: An unexpected error occurred
tr: Beklenmedik hata oluştu

source: Click to show preview
tr: Ön izlemeyi göstermek için tıkla

source: Hide media preview
tr: Ortam ön izlemesini gizle

source: _Send
tr: _Gönder

source: Public Room Mention Auto-completion
tr: Genel Oda Değinme Kendiliğinden Tamamlama

source: Room Member Mention Auto-completion
tr: Oda Üyesi Değinme Kendiliğinden Tamamlama

source: The conversation continues in a new room
tr: Konuşma yeni odada sürüyor

source: The conversation has ended
tr: Konuşma sonlandı

source: Reply to {user}
tr: Şunu yanıtla: {user}

# room-history
source: Edit
tr: Düzenle

source: Could not send reply
tr: Yanıt gönderilemedi

source: Could not send edit
tr: Düzenleme gönderilemedi

source: Could not send message
tr: İleti gönderilemedi

source: Your Location
tr: Konumunuz

source: User Location {geo_uri} at {iso8601_datetime}
tr: Kullanıcı konumu {geo_uri} {iso8601_datetime}

source: Could not send location
tr: Konum gönderilemedi

source: The location request has been cancelled
tr: Konum isteği iptal edildi

source: The location services are disabled
tr: Konum hizmetleri devre dışı

source: Could not retrieve current location
tr: Geçerli konum alınamadı

source: Could not send file
tr: Dosya gönderilemedi

source: Select File
tr: Dosya Seç

source: Select
tr: Seç

source: Could not open file
tr: Dosya açılamadı

source: Error reading file
tr: Dosya okunamadı

source: Error getting image from clipboard
tr: Panodan görüntü alınamadı

source: Error getting file from clipboard
tr: Panodan dosya alınamadı

source: _Location
tr: _Konum

source: Send a File
tr: Dosya Gönder

source: Insert an Emoji
tr: Emoji Ekle

source: Message Composer
tr: İleti Oluşturucu

source: More Options
tr: Daha Çok Seçenek

source: Send Message
tr: İleti Gönder

source: You don’t have permission to send messages to this room
tr: Bu odaya ileti gönderme izniniz yok

source: %B %-e at %I:%M %p
tr: %-e %B, %p %I:%M

source: %B %-e at %H:%M
tr: %-e %B, %H:%M

source: Error getting file from drop
tr: Sürükle bıraktan dosya alınırken hata oluştu
