Repository: yakushabb/foss-desktop-turkish
Catalog: GNOME/Extra/fractal.main.*.po
Languages: tr

source: Fractal is a decentralized, secure messaging client for collaborative group communication.
tr: Fractal iş birlikli küme iletişimi için dağıtık, güvenli mesajlaşma istemcisidir.

source: Fractal group messaging
tr: Fractal küme mesajlaşma

source: Matrix;matrix.org;chat;irc;communications;talk;riot;element;
tr: Matrix;matrix.org;sohbet;söyleşi;irc;iletişim;konuşma;riot;element;

source: Window width
tr: Pencere genişliği

source: Window height
tr: Pencere yüksekliği

source: Window maximized state
tr: Pencerenin ekranı kapladığı durum

source: Enable markdown formatting
tr: Markdown biçimlendirmeyi etkinleştir

source: Whether messages should be processed as markdown when sending them
tr: İletiler gönderilirken markdown olarak işlenip işlenmeyeceği

source: Session settings
tr: Oturum ayarları

source: Serialized list of settings per session
tr: Oturum başına serileştirilmiş ayar listesi

source: Current session
tr: Geçerli oturum

source: Chat on Matrix
tr: Matrixʼte söyleş

source: Fractal is a Matrix messaging app for GNOME written in Rust. Its interface is optimized for collaboration in large groups, such as free software projects, and will fit all screens, big or small.
tr: Fractal, GNOME için Rust’la yazılmış Matrix mesajlaşma uygulamasıdır. Arayüzü özgür yazılım projeleri gibi büyük kümelerde iş birliği için iyileştirilmiştir, ve büyük ya da küçük tüm ekranlara uyacaktır.

source: Highlights:
tr: Öne çıkanlar:

source: Find rooms to discuss your favorite topics, or talk privately to people, securely thanks to end-to-end encryption
tr: Gözde konuları tartışmak için odalar bulun ya da uçtan uca şifreleme ile güvenle insanlarla konuşun

source: Send rich formatted messages, files, or your current location
tr: Zengin formatlı iletiler, dosyalar ya da konumunuzu gönderin

source: Reply to specific messages, react with emoji, mention users or rooms, edit or remove messages
tr: Belirli iletileri yanıtlayın, emoji ile karşılık verin, kullanıcılara ya da odalara değinin, iletileri düzenleyin ya da kaldırın

source: View images, and play audio and video directly in the conversation
tr: Görüntüleri görüntüleyin ve doğrudan iliti içinde ses ve video oynatın

source: See who has read messages, and who is typing
tr: Kimin iletileri okuduğunu ve kimin yazdığını görün

source: Log into multiple accounts at once (with Single-Sign On support)
tr: Aynı anda birden çok hesapta oturum açın (Single-Sign On desteği ile)

source: Fractal’s main window
tr: Fraktal ana penceresi

source: View the media history of a Matrix room
tr: Matrix odasının ortam geçmişini görüntüsü

source: Fractal’s interface adapts to small screens
tr: Fractal arayüzü küçük ekranlara uyum sağlarken

source: Select an Account
tr: Hesap Seç

source: Select the account you want to open the URI with
tr: URIʼyi açmak istediğiniz hesabı seçin

source: Switch Accounts
tr: Hesap Değiştir

source: _Add Account
tr: _Hesap Ekle

source: Account Settings
tr: Hesap Ayarları

source: The Fractal Team
tr: Fractal Takımı

source: © The Fractal Team
tr: © Fractal Takımı

source: translator-credits
tr: Sabri Ünal <yakushabb@gmail.com> Emin Tufan Çetin <etcetin@gmail.com>

source: Name by
tr: Adlandıran

source: Session not found
tr: Oturum bulunamadı

source: Confirm Change
tr: Değişikliği Onayla

source: Try Again
tr: Yeniden Dene

source: Loading
tr: Yükleniyor

source: Success
tr: Başarılı

source: Warning
tr: Uyarı

source: Error
tr: Hata

source: Images
tr: Görüntüler

source: Choose Avatar
tr: Profil Resmi Seç

source: Choose
tr: Seç

source: Could not open avatar file
tr: Profil resmi dosyası açılamadı

source: The chosen file is not an image
tr: Seçilen dosya görüntü değil

source: Could not determine the type of the chosen file
tr: Seçilen dosyanın türü belirlenemedi

source: Remove Avatar
tr: Profil Resmini Kaldır

source: Select New Avatar
tr: Yeni Profil Resmi Seç

source: Camera
tr: Kamera

source: QR Code Scanner
tr: QR Kod Tarayıcı

source: Could Not Connect to Camera
tr: Kameraya Bağlanamadı

source: Viewfinder
tr: Vizör

source: Could not send a new verification request
tr: Yeni doğrulama isteği gönderilemedi

source: Could not create the crypto identity
tr: Kripto kimliği oluşturulamadı

source: Verify Your New Session
tr: Yeni Oturumunuzu Doğrulayın

source: Verifying your session allows you and the people you chat with to be sure that no one is trying to impersonate you or intercept your conversations.
tr: Oturumunuzu doğrulamak, kimsenin, sizi ya da söyleştiğiniz kişileri taklit etmeye, ya da konuşmalarınızı ele geçirimeye çalışmadığından emin olmanızı sağlar.

source: Verify With Another Session
tr: Başka Oturumla Doğrula

source: No other devices logged into this account?
tr: Bu hesaba başka aygıt giriş yapmadı mı?

source: Recover Account
tr: Hesap Kurtar

source: Reset
tr: Sıfırla

source: Identity Verification
tr: Kimlik Doğrulama

source: Set Up Crypto Identity
tr: Kripto Kimliği Ayarla

source: Your crypto identity allows you to verify other Matrix accounts and automatically trust their verified sessions.
tr: Kripto kimliğiniz, diğer Matrix hesaplarını doğrulamanıza ve doğrulanmış oturumlarına kendiliğinden güvenmenizi sağlar.

source: You need to set up a crypto identity, since it has never been created.
tr: Hiç oluşturulmadığından kripto kimliği ayarlamanız gerekir.

source: Set Up
tr: Ayarla

source: Reset Crypto Identity
tr: Kripto Kimliğini Sıfırla

source: You should reset your crypto identity if a device that does not belong to you managed to be verified.
tr: Size ait olmayan bir aygıt doğrulanmayı başardıysa kripto kimliğinizi sıfırlamanız gerekir.

source: To proceed, you will also need to reset your account recovery key.
tr: Sürdürmek için hesap kurtarma anahtarınızı da sıfırlamanız gerekecektir.

source: Invalidates the verifications of all users and sessions
tr: Tüm kullanıcıların ve oturumların doğrulamalarını geçersiz kılar

source: Required because the crypto identity in the recovery data is incomplete. Invalidates the verifications of all users and sessions.
tr: Kurtarma verisindeki kripto kimliği eksik olduğu için gereklidir. Tüm kullanıcıların ve oturumların doğrulamalarını geçersiz kılar.

source: You might not be able to read your past encrypted messages anymore
tr: Geçmiş şifreli iletilerinizi okuyamayabilirsiniz

source: Required because the backup is not set up properly. You might not be able to read your past encrypted messages anymore.
tr: Yedekleme düzgün ayarlanmadığı için gereklidir. Geçmiş şifrelenmiş iletilerinizi okuyamayabilirsiniz.

source: Make sure to store this recovery key in a safe place. You will need it to recover your account if you lose access to all your sessions.
tr: Kurtarma anahtarının güvenli bir yerde depolandığından emin olun. Tüm oturumlarınıza erişiminizi yitirirseniz hesabınızı kurtarmak için gereksineceksiniz.

source: Make sure to remember your passphrase or to store it in a safe place. You will need it to recover your account if you lose access to all your sessions.
tr: Parola metnini anımsadığınızdan ya da güvenli yerde depoladığınızdan emin olun. Tüm oturumlarınıza erişiminizi yitirirseniz hesabınızı kurtarmak için buna gereksineceksiniz.

source: The recovery passphrase or key is invalid
tr: Kurtarma parola metni ya da anahtarı geçersiz

source: Could not access recovery data
tr: Kurtarma verilerine erişilemedi

source: Could not reset the crypto identity
tr: Kripto kimliği sıfırlanamadı

source: Could not reset account recovery
tr: Hesap kurtarma sıfırlanamadı

source: Could not reset account recovery key
tr: Hesap kurtarma anahtarı sıfırlanamadı

source: Could not enable account recovery
tr: Hesap kurtarma etkinleştirilemedi

source: Restore full access to your account.
tr: Hesabınıza tam erişim kazanın.

source: To access the recovery data, we need the recovery passphrase or the recovery key that is usually set up when you create your account.
tr: Kurtarma verisine erişmek için, genellikle hesabınızı oluşturduğunuzda ayarlanan kurtarma parola metnine ya da kurtarma anahtarına gereksiniyoruz.

source: Recovery Passphrase or Key
tr: Kurtarma Parola Metni ya da Anahtarı

source: Recover
tr: Kurtar

source: Lost your recovery passphrase or key?
tr: Kurtarma parola metnini ya da anahtarınızı mı yitirdiniz?

source: Reset Account Recovery
tr: Hesap Kurtarmayı Sıfırla

source: Resetting account recovery can allow you to fix or reset part or all of your recovery setup.
tr: Hesap kurtarmayı sıfırlamak, kurtarma kurulumunuzu kısmen ya da tümüyle düzeltmenizi ya da sıfırlamanızı sağlayabilir.

source: Reset Room Encryption Keys Backup
tr: Oda Şifreleme Anahtarı Yedeklerini Sıfırla

source: If you do not provide a new recovery passphrase, a recovery key will be created.
tr: Yeni kurtarma parola metni sağlamazsanız, kurtarma anahtarı oluşturulacak.

source: You should not reuse the password of your Matrix account as a passphrase. Otherwise, if someone manages to get your account password, they will also be able to access all your encrypted conversations and to impersonate you.
tr: Matrix hesabınızın parolasını parola metni olarak yeniden kullanmayın. Aksi takdirde, birisi hesap parolanızı ele geçirirse, tüm şifreli iletilerinize erişip siz gibi davranabilir.

source: Recovery Passphrase (Optional)
tr: Kurtarma Parola Metni (İsteğe Bağlı)

source: Set Up Account Recovery
tr: Hesap Kurtarmayı Ayarla

source: Account recovery allows you to recover your crypto identity and to read your encrypted messages even if you lose access to all your sessions.
tr: Hesap kurtarma, tüm oturumlarınıza erişimi yitirseniz bile kripto kimliğinizi kurtarmayı ve şifrelenmiş iletileri okumayı sağlar.

source: If you do not provide a recovery passphrase, a recovery key will be created.
tr: Kurtarma parola metni sağlamazsanız, kurtarma anahtarı oluşturulur.

source: Account Recovery Set Up Successfully
tr: Hesap Kurtarma Kuruldu

source: Copy Recovery Key
tr: Kurtarma Anahtarını Kopyala

source: _Done
tr: _Bitti

source: Account Recovery Incomplete
tr: Hesap Kurtarma Eksik

source: The recovery was successful but the recovery data was incomplete.
tr: Kurtarma başarılı oldu ancak kurtarma verileri eksikti.

source: To fix this, you should reset the recovery from a session that has all the data, and attempt to recover this session again.
tr: Bunu düzeltmek için, tüm verileri içeren bir oturumdan kurtarmayı sıfırlamalı ve bu oturumu yeniden kurtarmayı denemelisiniz.

source: Note that account recovery can have a different name in other Matrix clients, like “key backup” or “secure backup”.
tr: Hesap kurtarma diğer Matrix istemcilerinde “anahtar yedekleme” ya da “güvenli yedekleme” gibi başka adda olabilir.

source: Alternatively, you can reset Account Recovery
tr: Alternatif olarak, Hesap Kurtarmayı sıfırlayabilirsiniz

source: Authentication
tr: Kimlik Doğrulama

source: Please authenticate the operation via the browser and, once completed, press confirm
tr: Lütfen işlemi tarayıcıyla kimlik doğrulayın ve tamamlandıktan sonra onayla düğmesine basın

source: Contin_ue
tr: _Sürdür

source: _Cancel
tr: İ_ptal

source: C_onfirm
tr: _Onayla

source: The password is invalid.
tr: Parola geçersiz.

source: An unexpected error occurred.
tr: Beklenmedik hata oluştu.

source: Please authenticate the operation with your password
tr: Lütfen işlemi parolanızla doğrulayın

source: Decline Invite?
tr: Davet Reddetilsin Mi?

source: Do you really want to decline this invite? You can join this room on your own later.
tr: Bu daveti gerçekten reddetmek istiyor musunuz? Bu odaya daha sonra kendiniz katılabilirsiniz.

source: Do you really want to decline this invite? You will not be able to join this room without it.
tr: Daveti gerçekten reddetmek istiyor musunuz? Davet olmadan bu odaya katılamazsınız.

source: Decline
tr: Reddet

source: Leave Room?
tr: Oda Terk Edilsin Mi?

source: Do you really want to leave this room? You can come back later.
tr: Gerçekten bu odadan çıkmak istiyor musunuz? Daha sonra gelebilirsiniz.

source: Do you really want to leave this room? You will not be able to come back without an invitation.
tr: Gerçekten bu odadan ayrılmak istiyor musunuz? Davetiye olmadan geri gelemezsiniz.

source: Leave
tr: Terk Et

source: Cancel
tr: İptal

source: Ignore {user}
tr: {user} kullanıcısını yok say

source: All messages or invitations sent by this user will be ignored
tr: Bu kullanıcının gönderdiği tüm iletiler ve davetler yok sayılacak

source: Ban {user}?
tr: {user} yasaklansın mı?

source: Are you sure you want to ban {user_id}? They will not be able to join the room again until someone unbans them.
tr: {user_id} kullanıcısını yasaklamak istediğinizden emin misiniz? Birisi yasağını kaldırana dek odaya yeniden katılamayacaklar.

source: Ban
tr: Yasakla

source: Revoke Invite for {user}?
tr: {user} için davet geri alınsın mı?

source: Are you sure you want to revoke the invite for {user_id}? They will still be able to join the room on their own.
tr: {user_id} için daveti geri almak istediğinizden emin misiniz? Yine de odaya katılabilecekler.

source: Are you sure you want to revoke the invite for {user_id}? They will not be able to join the room again until someone reinvites them.
tr: {user_id} için daveti geri almak istediğinizden emin misiniz? Birisi yeniden davet edene dek odaya katılamayacaklar.

source: Revoke Invite
tr: Daveti Geri Al

source: Deny Access to {user}?
tr: {user} Kullanıcısına Erişim Reddedilsin Mi?

source: Are you sure you want to deny access to {user_id}?
tr: {user_id} kullanıcısına erişimi reddetmek istediğinizden emin misiniz?

source: Deny Access
tr: Erişimi Reddet

source: Kick {user}?
tr: {user} atılsın mı?

source: Are you sure you want to kick {user_id}? They will still be able to join the room again on their own.
tr: {user_id} kullanıcısını atmak istediğinizden emin misiniz? Yine de odaya katılabilecekler.

source: Are you sure you want to kick {user_id}? They will not be able to join the room again until someone invites them.
tr: {user_id} kullanıcısını atmak istediğinizden emin misiniz? Birisi davet edene dek odaya yeniden katılamayacaklar.

source: Kick
tr: At

source: Remove Messages Sent by {user}?
tr: {user} Tarafından Gönderilen İletiler Kaldırılsın Mı?

source: This removes all the messages received from the homeserver. Are you sure you want to remove 1 message sent by {user_id}? This cannot be undone.
tr: Bu, ev sunucusunca alınmış tüm iletileri kaldırır. {user_id} tarafından gönderilmiş {n} iletiyi kaldırmak istediğinizden emin misiniz? Bu işlem geri alınamaz.

source: Remove
tr: Kaldır

source: No Messages Sent by {user}
tr: {user} Tarafından Gönderilen İleti Yok

source: There are no messages received from the homeserver sent by {user_id}. You can try to load more by going further back in the room history.
tr: {user_id} tarafından gönderilmiş ve ev sunucusunca alınmış ileti yok. Oda geçmişinde geriye giderek daha çoğunu yüklemeyi deneyebilirsiniz.

source: Reason (optional)
tr: Neden (isteğe bağlı)

source: Remove the latest message sent by the user
tr: Kullanıcıca gönderilmiş son {n} iletiyi kaldır

source: Mute {user}?
tr: Sessize Alınsın Mı?

source: Are you sure you want to mute {user_id}? They will not be able to send new messages to this room.
tr: Kullanıcıyı/Kullanıcıları sessize almak istediğinizden emin misiniz? Yine de bu odaya yeni ileti gönderemeyecekler.

source: Mute
tr: Sessize Al

source: Promote {user}?
tr: Yükseltilsin Mi?

source: If you promote {user_id} to the same level as yours, you will not be able to demote them in the future.
tr: Eğer kullanıyı/Kullanıcıları sizinle aynı düzeye yükseltirseniz, ileride bu kullanıcının/kullanıcıların düzeyini düşüremezsiniz.

source: Promote
tr: Yükselt

source: Demote Yourself?
tr: Rütbeniz İndirilsin Mi?

source: Are you sure you want to lower your power level? You will need to ask another member with a higher power level to undo this.
tr: Güç düzeyinizi düşürmek istediğinizden emin misiniz? Bunu geri almak için daha yüksek güç düzeyindeki başka bir üyeden yardım almanız gerekecektir.

source: Demote
tr: Düşür

source: Save Changes?
tr: Değişiklikler Kaydedilsin Mi?

source: This page contains unsaved changes. Changes which are not saved will be lost.
tr: Bu sayfada kaydedilmemiş değişiklikler var. Kaydedilmeyen değişiklikler yitecek.

source: Discard
tr: Gözden Çıkar

source: Save
tr: Kaydet

source: View
tr: Görünüm

source: Look Up
tr: Ara

source: The room details cannot be previewed. It can be because the room is not known by the homeserver or because its details are private. You can still try to join it.
tr: Oda ayrıntıları ön izlenemez. Bu, odanın ev sunucusunca tanınmamasından ya da ayrıntıların gizli olmasından kaynaklanabilir. Yine de katılmayı deneyebilirsiniz.

source: 1 member
tr: {n} üye

source: Request an Invite
tr: Davetiye İste

source: Join
tr: Katıl

source: Join a Room
tr: Odaya Katıl

source: Back
tr: Geri

source: Enter an address or link to look up a room
tr: Oda aramak için adres ya da bağlantı girin

source: User Profile
tr: Kullanıcı Profili

source: Offline
tr: Çevrim Dışı

source: No network connection
tr: Ağ bağlantısı yok

source: No Internet connection
tr: İnternet bağlantısı yok

source: Image not Viewable
tr: Görüntü Görüntülenemiyor

source: Audio Clip not Playable
tr: Ses Klibi Oynatılamaz

source: Video not Playable
tr: Video Oynatılamaz

source: File not Viewable
tr: Dosya Görüntülenemiyor

source: Location at latitude {latitude} and longitude {longitude}
tr: {latitude} enlem ve {longitude} boylamındaki konum

source: Notify the whole room
tr: Tüm odaya bildir

source: Custom
tr: Özel

source: Confirm Custom Role
tr: Özel Rolü Onayla

source: More Information
tr: Daha çok bilgi

source: Creator is an immutable role that can be attributed to several users when creating a room. Creators always have a higher power level than any other room members, except other creators, and have the permission to do anything in the room. The only way to demote a creator is to replace the current room with another one with a different creator, by upgrading the room for example.
tr: Kurucu, oda oluştururken birkaç kullanıcıya yüklenebilen değişmez bir roldür. Kurucular, diğer kurucular dışında, her zaman diğer oda üyelerinden daha yüksek güç düzeyindedir ve odada her şeyi yapma iznini bulundurur. Bir kurucunun rütbesini düşürmenin tek yolu, örneğin odayı yükselterek var olan odayı başka kurucusu olan başka bir odayla değiştirmektir.

source: Matrix user ID copied to clipboard
tr: Matrix kullanıcı kimliği panoya kopyalandı

source: Open Direct Chat
tr: Doğrudan Söyleşi Aç

source: Create Direct Chat
tr: Doğrudan Söyleşi Oluştur

source: Could not create a new Direct Chat
tr: Yeni Doğrudan Söyleşi oluşturulamadı

source: In {room_name}
tr: {room_name} odasında

# member
source: Invited
tr: Davet Edildi

# member
source: Banned
tr: Yasaklanmış

# member
source: Requested an Invite
tr: Davetiye İstendi

# member
source: Unknown
tr: Bilinmeyen

source: Deny Request
tr: İsteği Reddet

source: Could not change the role
tr: Rol değiştirilemedi

source: Could not invite user
tr: Kullanıcı davet edilemedi

source: Could not revoke invite of user
tr: Kullanıcı davetiyesi geri alınamadı

source: Could not deny access to user
tr: Kullanıcıya erişim reddedilemedi

source: Could not kick user
tr: Kullanıcı atılamadı

source: Could not ban user
tr: Kullanıcı yasaklanamadı

source: Could not unban user
tr: Kullanıcı yasağı kaldırılamadı

source: Could not remove 1 message sent by the user
tr: Kullanıcıca gönderilen {n} ileti kaldırılamadı

source: Identity verified
tr: Kimlik doğrulandı

source: Identity not verified
tr: Kimlik doğrulanmadı

source: Could not start user verification
tr: Kullanıcı doğrulama başlatılamadı

source: Ignored
tr: Yok Sayılmış

source: Stop Ignoring
tr: Yok Saymayı Durdur

source: Not Ignored
tr: Yok Sayılmamış

source: Ignore
tr: Yok Say

source: Could not stop ignoring user
tr: Kullanıcı yok sayılması durdurulamadı

source: Could not ignore user
tr: Kullanıcı yok sayılamadı

source: Copy Matrix User ID
tr: Matrix Kullanıcı Kimliğini Kopyala

source: Role
tr: Rol

source: Power Level
tr: Güç Düzeyi

source: Invite
tr: Davet Et

source: Unban
tr: Yasak Kaldır

source: Remove Messages
tr: İletileri Kaldır

source: Security
tr: Güvenlik

source: Verify
tr: Doğrula

source: QR Code
tr: QR Kodu

source: About Fractal
tr: Fractal Hakkında

source: Secret Portal Error
tr: Giz Kapısı Hatası

source: Fractal relies on a Secret Portal to manage your sensitive session information and an error occurred while we were trying to restore your sessions.
tr: Fractal, hassas oturum bilgilerinizi yönetmek için Giz Kapısına güveniyor ve oturumlarınız geri yüklenmeye çalışırken hata oluştu.

source: Here are a few things that might help you fix issues with the Secret Portal:
tr: Giz Kapısı ile ilgili sorunları çözmede işinize yarayabilecek bazı şeyler şunlardır:

source: Make sure you have a Secret Portal Backend Provider installed, like gnome-keyring.
tr: Giz Kapısı Arka Uç Sağlayıcısının kurulduğundan emin olun, örneğin: gnome-keyring.

source: If you prefer to use a Secret Service Provider instead, you need to allow Fractal to interact with it, like this:
tr: Bunun yerine Giz Hizmet Sağlayıcı kullanmayı yeğlerseniz, Fractalʼın bu hizmet sağlayıcı ile etkileşime girmesine izin vermelisiniz:

source: Copy Command
tr: Komutu Kopyala

source: Check that you have a default keyring and that it is unlocked.
tr: Öntanımlı anahtarlığınızın olduğuna ve kilidinin kaldırıldığına emin olun.

source: Check the application logs and your distribution’s documentation for more details.
tr: Daha çok ayrıntı için uygulama günlüklerini ve dağıtımınızın belgelendirmesini gözden geçirin.

source: Could Not Initialize Session
tr: Oturum Başlatılamadı

source: Command copied to clipboard
tr: Komut panoya kopyalandı

source: Login Request From Another Session
tr: Başka Oturumdan Giriş İsteği

source: Verify the new session from the current session.
tr: Geçerli oturumdan yeni oturumu doğrula.

source: Verification Request
tr: Doğrulama İsteği

source: {user} asked to be verified. Verifying a user increases the security of the conversation.
tr: {user} doğrulanmak istedi. Kullanıcının doğrulanması konuşma güvenliğini artırır.

source: Could not decline verification request
tr: Doğrulama isteği reddedilemedi

source: Could not accept verification request
tr: Doğrulama isteği kabul edilemedi

source: The verification was cancelled from the other session.
tr: Doğrulama diğer oturumdan iptal edildi.

source: The verification was cancelled by {user}.
tr: Doğrulama {user} tarafından iptal edildi.

source: The verification process failed because it reached a timeout.
tr: Doğrulama işlemi, zaman aşımına uğradığı için başarısız oldu.

source: You accepted the request from another session.
tr: Başka oturumdan gelen isteği kabul ettiniz.

source: The emoji did not match.
tr: Emoji eşleşmiyor.

source: The numbers did not match.
tr: Sayılar eşleşmedi.

source: An unexpected error happened during the verification process.
tr: Doğrulama süreci sırasında beklenmedik hata oluştu.

source: Verification Cancelled
tr: Doğrulama İptal Edildi

source: Verification Error
tr: Doğrulama Hatası

source: Send New Request
tr: Yeni İstek Gönder

source: Verify Session
tr: Oturumu Doğrula

source: Scan this QR code from the other session.
tr: Bu QR kodunu diğer oturumdan tarayın.

source: Ask {user} to scan this QR code from their session.
tr: {user} kullanıcısına QR kodunu oturumundan taramasını sor.

source: Select a verification method to proceed.
tr: Sürdürmek için doğrulama yöntemi seç.

source: Click on the verification method to proceed.
tr: Sürdürmek için doğrulama yöntemine tıkla.

source: Could not access camera
tr: Kameraya erişilemedi
