Repository: yakushabb/foss-desktop-turkish
Catalog: GNOME/Extra/fractal.main.*.po
Languages: tr

source: Could not leave {room}
tr: {room} odası terk edilemedi.

source: Could not join {room}
tr: {room} odasını katılamadı

source: Could not forget {room}
tr: {room} odası unutulamadı

source: There is a pending invite request
tr: Bekleyen {n} davet isteği var

source: Room _Details
tr: Oda _Ayrıntıları

source: _Invite New Members…
tr: Yeni Üyeleri _Davet Et…

source: _Leave Room
tr: Odayı _Terk Et

source: Re_join Room
tr: Odaya _Yeniden Katıl

source: _Forget Room
tr: Odayı _Unut

source: Room Menu
tr: Oda Menüsü

source: Could Not Load Room
tr: Oda Yüklenemedi

source: Scroll to Bottom
tr: En Alta Kaydır

source: Drop Here to Send
tr: Göndermek İçin Buraya Bırak

source: Seen by 1 member
tr: {n} üye gördü

source: Seen by {name}
tr: {name} gördü

source: This room is encrypted from this point on.
tr: Bu oda şu andan sonra şifrelenmiştir.

source: {sender} invited {user}.
tr: {sender}, {user} kullanıcısını davet etti.

source: An unsupported state event was received.
tr: Desteklenmeyen durum olayı alındı.

source: {user} joined this room.
tr: {user} odaya katıldı.

source: {user} left the room.
tr: {user} odayı terk etti.

source: {sender} banned {user}.
tr: {sender}, {user} kullanıcısını yasakladı.

source: {sender} unbanned {user}.
tr: {sender}, {user} kullanıcısının yasağını kaldırdı.

source: {sender} kicked {user} out.
tr: {sender}, {user} kullanıcısını attı.

source: {user} accepted the invite.
tr: {user} daveti kabul etti.

source: {user} declined the invite.
tr: {user} daveti reddetti.

source: {sender} revoked the invitation for {user}.
tr: {sender}, {user} kullanıcısının davetini iptal etti.

source: {user} requested to be invited to this room.
tr: {user} odaya davet edilmeyi istedi.

source: {user} retracted their request to be invited to this room.
tr: {user} odaya davet edilme isteğini geri çekti.

source: {sender} denied {user}’s request to be invited to this room.
tr: {sender}, {user} kullanıcısının bu odaya davet edilme isteğini reddetti.

source: An unsupported room member event was received.
tr: Desteklenmeyen oda üyesi etkinliği alındı.

source: {previous_user_name} changed their display name to {new_user_name}.
tr: {previous_user_name} görünen adını {new_user_name} olarak değiştirdi.

source: {previous_user_name} removed their display name.
tr: {previous_user_name} görünen adını kaldırdı.

source: {user_id} set their display name to {new_user_name}.
tr: {user_id} görünen adını {new_user_name} olarak belirledi.

source: {user} set their avatar.
tr: {user} profil resmi belirledi.

source: {user} removed their avatar.
tr: {user} profil resmini kaldırdı.

source: {user} changed their avatar.
tr: {user} profil resmini değiştirdi.

source: This conversation started in another room.
tr: Bu konuşma başka bir odada başladı.

source: The conversation starts here.
tr: Konuşma burada başlıyor

source: 1 room change
tr: {n} oda değişikliği

source: Open Room Details
tr: Oda Ayrıntılarını Aç

source: {user} is typing…
tr: {user} yazıyor…

source: {n} member is typing…
tr: {n} üye yazıyor…

source: Could not accept verification
tr: Doğrulama kabul edilemedi

source: Could not decline verification
tr: Doğrulama reddedilemedi

source: {user_name} wants to be verified
tr: {user_name} doğrulanmak istiyor

source: Verification in progress
tr: Doğrulama sürüyor

source: An error occurred while searching for users
tr: Kullanıcı aranırken hata oluştu

source: Direct Chat
tr: Doğrudan Söyleşi

source: New Direct Chat
tr: Yeni Doğrudan Söyleşi

source: Search for people to start a new chat with
tr: Yeni söyleşi başlatmak için kişileri arayın

source: No users matching the search pattern were found
tr: Arama örüntüsüyle eşleşen kullanıcı bulunamadı.

source: Cannot contain “:”
tr: “:” içeremez

source: Cannot contain “#”
tr: “#” içeremez

source: Too long. Use a shorter address.
tr: Çok uzun. Daha kısa bir adres kullanın.

source: The address is already taken.
tr: Adres zaten alınmış.

source: New Room
tr: Yeni Oda

source: Description (Optional)
tr: Açıklama (İsteğe Bağlı)

source: Room Visibility
tr: Oda Görünürlüğü

source: Private
tr: Özel

source: Only invited people can join this room
tr: Yalnızca davet edilmiş kişiler bu odaya katılabilir

source: Public
tr: Genel

source: Anyone can find and join this room
tr: Herkes bu odayı bulabilir ve katılabilir

source: End-to-End Encryption
tr: Uçtan Uca Şifreleme

source: Cannot be disabled later
tr: Sonra devre dışı bırakılamaz

source: _Create Room
tr: Oda _Oluştur

source: Image copied to clipboard
tr: Görüntü panoya kopyalandı

source: _Copy Image
tr: _Görüntüyü Kopyala

source: Media Menu
tr: Ortam Menüsü

source: Fullscreen
tr: Tam Ekran

source: Exit Fullscreen
tr: Tam Ekrandan Çık

source: No crypto identity
tr: Kripto kimliği yok

source: Crypto identity incomplete
tr: Kripto kimliği eksik

source: Account recovery disabled
tr: Hesap kurtarma devre dışı

source: Account recovery incomplete
tr: Hesap kurtarma eksik

source: New _Direct Chat…
tr: Yeni _Doğrudan Söyleşi…

source: _New Room…
tr: _Yeni Oda…

source: _Join Room…
tr: Odaya _Katıl…

source: _Keyboard Shortcuts
tr: _Klavye Kısayolları

source: _About Fractal
tr: Fractal _Hakkında

source: Dec_line
tr: _Reddet

source: _Mark as Read
tr: Okundu İ_mle

source: _Mark as Unread
tr: Okunmadı İ_mle

source: Move to _Favorites
tr: _Gözdelerʼe Taşı

source: Move to _Rooms
tr: _Odalarʼa Taşı

source: Move to Low _Priority
tr: _Düşük Önceliklilere Taşı

source: Mark as _Direct Chat
tr: _Doğrudan Söyleşi Olarak İmle

source: Unmark as _Direct Chat
tr: _Doğrudan Söyleşi İmini Kaldır

source: Sidebar
tr: Kenar Çubuğu

source: Main Menu
tr: Ana Menü

source: Toggle Room Search
tr: Oda Aramayı Aç/Kapat

source: Room Search
tr: Oda Arama

source: Search for a room
tr: Oda ara

source: Room List
tr: Oda Listesi

source: Allows to navigate between rooms
tr: Odalar arasında gezinmeye izin verir

source: Direct chat with {name}
tr: {name} ile doğrudan söyleşi

source: 1 notification
tr: {count} bildirimler

source: Could not move {room} from {previous_category} to {new_category}
tr: {room} odası {previous_category} kategorisinden {new_category} kategorisine taşınamadı

source: Could not mark {room} as direct chat
tr: {room} doğrudan söyleşi olarak imlenemedi

source: Could not unmark {room} as direct chat
tr: {room} doğrudan söyleşi olmaktan çıkartılamadı

source: Join Room as Favorite
tr: Odaya Gözde Olarak Katıl

source: Join Room
tr: Odaya Katıl

source: Join Room as Low Priority
tr: Odaya Düşük Öncelikli Olarak Katıl

source: Reject Invite
tr: Daveti Reddet

source: Move to Rooms
tr: Odalarʼa Taşı

source: Move to Low Priority
tr: Düşük Önceliklilere Taşı

source: Leave Room
tr: Odayı Terk Et

source: Move to Favorites
tr: Gözdelerʼe Taşı

source: Rejoin Room as Favorite
tr: Odaya Yeniden Katıl ve Gözdelere Ekle

source: Rejoin Room
tr: Odaya Yeniden Katıl

source: Rejoin Room as Low Priority
tr: Odaya Yeniden Katıl ve Düşük Önceliklilere Ekle

source: Could not restore previous sessions
tr: Önceki oturumlar geri yüklenemedi

source: An unexpected error happened while accessing the data directory
tr: Veri dizinine erişilirken beklenmedik hata oluştu

# shortcut window
source: General
tr: Genel

# shortcut window
source: Search Room by Address or Link
tr: Adres ya da Bağlantıya Göre Oda Ara

# shortcut window
source: Account Settings
tr: Hesap Ayarları

# shortcut window
source: Open Menu
tr: Menüyü Aç

# shortcut window
source: Keyboard Shortcuts
tr: Klavye Kısayolları

# shortcut window
source: Close Window
tr: Pencereyi Kapat

# shortcut window
source: Quit
tr: Çık

# shortcut window
source: Room List
tr: Oda Listesi

# shortcut window
source: Search Room List
tr: Oda Listesinde Ara

# shortcut window
source: Next Room
tr: Sonraki Oda

# shortcut window
source: Previous Room
tr: Önceki Oda

# shortcut window
source: First Room With Unread Messages
tr: Okunmamış İletili İlk Oda

# shortcut window
source: Next Room With Unread Messages
tr: Okunmamış İletili Sonraki Oda

# shortcut window
source: Previous Room With Unread Messages
tr: Okunmamış İletili Önceki Oda

# shortcut window
source: Room History
tr: Oda Geçmişi

# shortcut window
source: Event Properties
tr: Olay Özellikleri

# shortcut window
source: Close Room
tr: Odayı Kapat

source: Connection timed out.
tr: Bağlantı zaman aşımına uğradı.

source: Could not connect to the homeserver.
tr: Ev sunucusuna bağlanılamadı.

source: Invalid credentials.
tr: Geçersiz kimlik bilgileri.

source: Account deactivated.
tr: Hesap devre dışı bırakıldı.

source: Rate limit exceeded, retry in 1 second.
tr: Oran sınırı aşıldı, {n} saniye sonra yeniden deneyin.

source: Rate limit exceeded, try again later.
tr: Oran sınırı aşıldı, daha sonra yeniden deneyin.

source: Unexpected connection error.
tr: Beklenmedik bağlantı hatası.

source: Could not decrypt the event.
tr: Olay şifresi çözülemedi.

source: Unexpected error.
tr: Beklenmedik hata.

source: Invalid URL.
tr: Geçersiz URL.

source: Could not discover homeserver.
tr: Ev sunucusu keşfedilemedi.

source: Could not open the store.
tr: Depo açılamadı.

source: Could not generate unique session ID
tr: Benzersiz oturum kimliği oluşturulamadı

source: Could not access the session tokens
tr: Oturum jetonlarına erişilemedi

source: Image format not supported
tr: Görüntü biçimi desteklenmiyor

source: image
tr: görüntü

source: audio
tr: ses

source: file
tr: dosya

source: Session
tr: Oturum
