Repository: yakushabb/foss-desktop-turkish
Catalog: GNOME/Extra/highscore.main.*.po
Languages: tr

source: Retro game player
tr: Retro oyun oynatıcı

source: Play retro games
tr: Retro oyunlar oynayın

source: game;videogame;video game;player;retro;
tr: game;videogame;video game;player;retro;oyun;videooyun;video oyun;oynatıcı;eski;

source: No description
tr: Açıklama yok

source: Famicom Disk System
tr: Famicom Disk Sistemi

source: Master System
tr: Ana Sistem

source: Player %u
tr: Oyuncu %u

source: Keyboard
tr: Klavye

source: Touchscreen
tr: Dokunmatik Ekran

source: No Controller
tr: Denetçi Yok

source: Library
tr: Kitaplık

source: Back
tr: Geri

source: _Add to Library
tr: Kitaplığa _Ekle

source: Restore
tr: Geri Yükle

source: Fullscreen
tr: Tam Ekran

source: _Restart
tr: _Yeniden Başlat

source: _Snapshots
tr: _Anlık Görüntüler

source: Show Con_trols
tr: _Denetimleri Göster

source: _Screenshot
tr: _Ekran Görüntüsü

source: _Properties
tr: _Özellikler

source: _Preferences
tr: _Tercihler

source: _Open Game…
tr: Oyun _Aç…

source: _Keyboard Shortcuts
tr: Klavye _Kısayolları

source: _Help
tr: _Yardım

source: _About Highscore
tr: Highscore _Hakkında

source: Failed to save the game: %s
tr: Oyun kaydedilemedi: %s

source: Failed to save before loading: %s
tr: Yüklemeden önce kaydedilemedi: %s

source: Failed to launch URI: %s
tr: URI başlatılamadı: %s

source: Install %s to run the game
tr: Oyunu çalıştırmak için %s kur

source: Install the following firmware to run the game: %s
tr: Oyunu çalıştırmak için şu donanım yazılımını kur: %s

source: Missing Firmware
tr: Eksik Donanım Yazılımı

source: Install _Firmware
tr: _Donanım Yazılımını Kur

source: Unable to run the game
tr: Oyun çalıştırılamadı

source: Failed to start the game: %s
tr: Oyun başlatılamadı: %s

source: Unable to stop core
tr: Çekirdek durdurulamadı

source: Missing Core
tr: Eksik Çekirdek

source: Install %s extension to run the game
tr: Oyunu çalıştırmak için %s uzantısını kur

source: Install _Extension
tr: _Uzantı Kur

source: No %s core found
tr: %s çekirdeği bulunamadı

source: Game Crashed
tr: Oyun Çöktü

source: Failed to load snapshot: %s
tr: Anlık görüntü yüklenemedi: %s

source: %s – Paused
tr: %s – Duraklatıldı

source: Paused
tr: Duraklatıldı

source: Playing %s
tr: %s oynatılıyor

source: Click to View Controls
tr: Denetimleri Görüntülemek İçin Tıkla

source: Failed to open screenshot: %s
tr: Ekran görüntüsü açılamadı: %s

source: Screenshot saved
tr: Ekran görüntüsü kaydedildi

source: Click to open
tr: Açmak için tıkla

source: Failed to save screenshot: %s
tr: Ekran görüntüsü kaydedilemedi: %s

source: _Resume
tr: _Sürdür

source: R_estart
tr: Y_eniden Başlat

source: _Save
tr: _Kaydet

source: _Load
tr: _Yükle

source: _Close
tr: _Kapat

source: Continue
tr: Sürdür

source: Controls can be viewed from menu at any time later
tr: Denetimler her zaman menüden görüntülenebilir

source: Select
tr: Seç

source: Screenshots
tr: Ekran Görüntüleri

source: Not a firmware
tr: Donanım yazılımı değil

source: None
tr: Hiçbiri

source: Auto (%s)
tr: Kendiliğinden (%s)

source: C Buttons
tr: C Düğmeleri

source: Control Pad and L
tr: Denetim Pedi ve L

source: Right Stick
tr: Sağ Çubuk

source: Directional Pad
tr: Yön Pedi

source: 8BitDo 64 Controller
tr: 8BitDo 64 Denetçisi

source: Up C
tr: Yukarı C

source: Down C
tr: Aşağı C

source: Left C
tr: Sol C

source: Right C
tr: Sağ C

source: -Select
tr: -Seç

source: +Start
tr: +Başlat

source: Start
tr: Başlat

source: Z (Left)
tr: Z (Sol)

source: Z (Right)
tr: Z (Sağ)

source: Home
tr: Ev

source: Joystick
tr: Kumanda

source: Left Stick
tr: Sol Çubuk

source: Share
tr: Paylaş

source: Options
tr: Seçenekler

source: Stadia Controller
tr: Stadia Denetçisi

source: Direction Pad
tr: Yön Pedi

source: Menu
tr: Menü

source: Assistant
tr: Yardımcı

source: Capture
tr: Yakala

source: View
tr: Görünüm

source: Left Joystick
tr: Sol Kumanda

source: Right Joystick
tr: Sağ Kumanda

source: QAM
tr: Hızlı Erişim Menüsü

source: Switch Pro Controller
tr: Switch Pro Denetçi

source: Control Pad
tr: Denetim Pedi

source: Unknown
tr: Bilinmeyen

source: Top
tr: Üst

source: Bottom
tr: Alt

source: Left
tr: Sol

source: Right
tr: Sağ

source: Left Shoulder
tr: Sol Omuz

source: Right Shoulder
tr: Sağ Omuz

source: Xbox Guide
tr: XBox Kılavuzu

source: Press the %s button
tr: %s düğmesine bas

source: _Unset
tr: _Ayarlanmamış

source: Move %s
tr: %s Taşı

source: Horizontal
tr: Yatay

source: Move the stick horizontally
tr: Çubuğu yatay oynatır

source: Vertical
tr: Dikey

source: Press
tr: Bas

source: Press the stick
tr: Çubuğa bas

source: Press the %s trigger
tr: %s tetiğine bas

source: Open Menu
tr: Menüyü Aç

source: Face Buttons
tr: Yüz Düğmeleri

source: Pointer
tr: İmleç

source: Enabled
tr: Etkin

source: Name
tr: Ad

source: Type
tr: Tür

source: Invert Navigation
tr: Gezinmeyi Ters Çevir

source: Swap select and cancel buttons
tr: Seç ve İptal düğmelerini yer değiştir

source: Click on the controls to remap them
tr: Denetimleri yeniden eşleştirmek için üzerlerine tıkla

source: Connect the gamepad to remap controls
tr: Denetimleri yeniden eşleştirmek için oyun kumandasını bağla

source: disc %d
tr: disk %d

source: Missing the following media: %s
tr: Şu ortam eksik: %s

source: Unsupported format
tr: Desteklenmeyen biçim

source: Failed to move '%s' to trash: %s
tr: '%s' çöp kutusuna taşınamadı: %s

source: Failed to unstar '%s': %s
tr: '%s' yıldızı kaldırılamadı: %s

source: _Open in New Window
tr: _Yeni Pencerede Aç

source: _Star
tr: _Başlat

source: _Unstar
tr: _Yıldızı Kaldır

source: _Remove from Recent
tr: Son Kullanılanlardan _Kaldır

source: _Move to Trash
tr: Çöpe _Taşı

source: Scanning…
tr: Taranıyor…

source: _Cancel
tr: _İptal

source: Show Sidebar
tr: Kenar Çubuğunu Göster

source: Search
tr: Ara

source: Search games
tr: Oyunları ara

source: Open Library Folder
tr: Kitaplık Klasörünü Aç

source: No Games Found
tr: Oyun Bulunamadı

source: Try a different search
tr: Başka arama dene

source: _Rescan Library
tr: Kitaplığı _Yeniden Tara

source: All Games
tr: Tüm Oyunlar

source: Recently Played
tr: Son Oynananlar

source: Starred
tr: Yıldızlı

source: Firmware Missing
tr: Donanım Yazılımı Eksik

source: Found %u game
tr: %u oyun bulundu

source: Cancelling…
tr: İptal Ediliyor…

source: Game file extensions: %s
tr: Oyun dosyası uzantıları: %s

source: Add some games to your library
tr: Kitaplığınıza kimi oyunlar ekleyin

source: No Recent Games
tr: Son Oyunlar Yok

source: Games will appear here if you play them
tr: Oynadığınız oyunlar burada görünecek

source: No Starred Games
tr: Yıldızlı Oyun Yok

source: Starred games will appear here
tr: Yıldızlı oyunlar burada görünecek

source: Run
tr: Çalıştır

source: ‘%s’ removed from recent
tr: ‘%s’ son kullanılanlardan kaldırıldı

source: ‘%s’ moved to trash
tr: ‘%s’ çöpe taşındı

source: ‘%s’ unstarred
tr: ‘%s’ yıldızı kaldırıldı

source: _Undo
tr: _Geri Al

source: <span font_features='tnum=1'>%d</span> game removed from recent
tr: <span font_features='tnum=1'>%d</span> oyun son kullanılanlardan kaldırıldı

source: <span font_features='tnum=1'>%d</span> game moved to trash
tr: <span font_features='tnum=1'>%d</span> oyun çöpe taşındı

source: <span font_features='tnum=1'>%d</span> game unstarred
tr: <span font_features='tnum=1'>%d</span> oyunun yıldızı kaldırıldı

source: Failed to move to trash: %s
tr: Çöp kutusuna taşınamadı: %s

source: Delete ‘%s’?
tr: ‘%s’ silinsin mi?

source: This game cannot be moved to trash. Permanently delete it instead?
tr: Bu oyun çöp kutusuna taşınamaz. Bunun yerine kalıcı olarak silinsin mi?

source: _Delete
tr: _Sil

source: Joystick Controller
tr: Kumanda Denetçileri

source: Button
tr: Düğme

source: Sega Genesis Controller
tr: Sega Genesis Denetçisi

source: Button 1
tr: 1. Düğme

source: Button 2
tr: 2. Düğme

source: Three-Button Joystick
tr: Üç Düğmeli Kumanda

source: Button 3
tr: 3. Düğme

source: Paddle Controller
tr: Pedal Denetçisi

source: Knob
tr: Topuz

source: Driving Controller
tr: Sürüş Denetçisi

source: Built-in
tr: Yerleşik

source: TV Type
tr: TV Türü

source: Left Difficulty
tr: Sol Zorluk

source: Right Difficulty
tr: Sağ Zorluk

source: Game Select
tr: Oyun Seç

source: Game Reset
tr: Oyunu Sıfırla

source: Switches
tr: Geçişler

source: Color
tr: Renk

source: Black & White
tr: Siyah ve Beyaz

source: Advanced
tr: Gelişmiş

source: Beginner
tr: Acemi

source: Pro-Line Joystick
tr: Pro-Line Kumanda

source: Left Button
tr: Sol Düğme

source: Right Button
tr: Sağ Düğme

source: Light Gun
tr: Hafif Silah

source: Pause Button
tr: Duraklat Düğmesi

source: Select Button
tr: Seç Düğmesi

source: Reset Button
tr: Sıfırla Düğmesi

source: Pause
tr: Duraklat

source: Reset
tr: Sıfırla

source: Lynx boot ROM
tr: Lynx önyükleme ROMʼu

source: A Button
tr: A Düğmesi

source: B Button
tr: B Düğmesi

source: Option 1
tr: Seçenek 1

source: Option 2
tr: Seçenek 2

source: Famicom Disk System BIOS
tr: Famicom Disk Sistemi BIOS

source: Side %c
tr: Yan %c

source: Switch Disk Side
tr: Disk Tarafını Değiştir

source: Requires restart
tr: Yeniden başlatma gerektirir

source: Requires %s
tr: %s gerektirir

source: L Button
tr: L Düğmesi

source: R Button
tr: R Düğmesi

source: Original
tr: Özgün

source: Dark
tr: Koyu

source: Directional Button
tr: Yön Düğmesi

source: Start Button
tr: Başlat Düğmesi

source: Light Phaser
tr: Işık Fazörü

source: FM Audio
tr: FM Ses

source: Sega CD BIOS (US)
tr: Sega CD BIOS (Amerika)

source: Mega-CD BIOS (Japan)
tr: Mega-CD BIOS (Japonya)

source: Mega-CD BIOS (Europe)
tr: Mega-CD BIOS (Avrupa)

source: Button A
tr: Düğme A

source: Button B
tr: Düğme B

source: Button C
tr: Düğme C

source: Control Pad (6-Button)
tr: Denetim Pedi (6 Düğmeli)

source: Button X
tr: Düğme X

source: Button Y
tr: Düğme Y

source: Button Z
tr: Düğme Z

source: Mode Button
tr: Kip Düğmesi

source: Option Button
tr: Seçenek Düğmesi

source: NES Controller
tr: NES Denetçisi

source: Toggle Mic
tr: Mikrofonu Aç/Kapat

source: Arkanoid Controller
tr: Arkanoid Denetçisi

source: Paddle
tr: Kürek

source: Nintendo 64 Controller
tr: Nintendo 64 Denetçisi

source: Control Stick
tr: Denetim Çubuğu

source: Up C Button
tr: Yukarı C Düğmesi

source: Down C Button
tr: Aşağı C Düğmesi

source: Left C Button
tr: Sol C Düğmesi

source: Right C Button
tr: Sağ C Düğmesi

source: Z Button
tr: Z Düğmesi

source: Performance
tr: Başarım

source: Accuracy
tr: Doğruluk

source: Emulation Mode
tr: Öykünme Kipi

source: Accurate mode is unavailable on this device
tr: Doğruluk kipi bu aygıtta kullanılamaz

source: Accessories
tr: Donatılar

source: The game is slowing down, consider switching to performance mode
tr: Oyun yavaşlıyor, başarım kipine geçmeyi düşünün

source: Preferences
tr: Tercihler

source: X Button
tr: X Düğmesi

source: Y Button
tr: Y Düğmesi

source: Shortcuts
tr: Kısayollar

source: Swap Screens
tr: Ekranları Yer Değiştir

source: Screen Layout
tr: Ekran Düzeni

source: Book
tr: Kitap

source: Side by Side
tr: Yan Yana

source: Single Screen
tr: Tek Ekran

source: Separate Windows
tr: Ayrı Pencereler

source: Flip
tr: Çevir

source: Change Screen
tr: Ekranı Değiştir

source: Bottom Screen
tr: Alt Ekran

source: Top Screen
tr: Üst Ekran

source: Direction Key
tr: Yön Anahtarı

source: Button I
tr: Düğme I

source: Button II
tr: Düğme II

source: Run Button
tr: Çalıştır Düğmesi

source: Button III
tr: Düğme III

source: Button IV
tr: Düğme IV

source: Button V
tr: Düğme V

source: Button VI
tr: Düğme VI

source: Use 6 Button Controller
tr: 6 Düğmeli Denetçi Kullan

source: Automatic
tr: Kendiliğinden

source: Digital
tr: Sayısal

source: PlayStation Controller
tr: PlayStation Denetçisi

source: Directional Buttons
tr: Yön Düğmeleri

source: @PS_TRIANGLE@ Button
tr: @PS_TRIANGLE@ Düğmesi

source: @PS_SQUARE@ Button
tr: @PS_SQUARE@ Düğmesi

source: @PS_CIRCLE@ Button
tr: @PS_CIRCLE@ Düğmesi

source: @PS_X@ Button
tr: @PS_X@ Düğmesi

source: L1 Button
tr: L1 Düğmesi

source: L2 Button
tr: L2 Düğmesi

source: R1 Button
tr: R1 Düğmesi

source: R2 Button
tr: R2 Düğmesi

source: L3 Button
tr: L3 Düğmesi

source: R3 Button
tr: R3 Düğmesi

source: PlayStation BIOS (Japan)
tr: PlayStation BIOS (Japonya)

source: PlayStation BIOS (North America)
tr: PlayStation BIOS (Kuzey Amerika)

source: PlayStation BIOS (Europe)
tr: PlayStation BIOS (Avrupa)

source: Analog Mode
tr: Analog Kip

source: Disc %u
tr: Disk %u

source: Switch Disc
tr: Disk Değiştir

source: Button L
tr: Düğme L

source: Button R
tr: Düğme R

source: 3D Control Pad
tr: 3B Denetim Pedi

source: 3D Directional Pad
tr: 3B Yön Pedi

source: Left Trigger
tr: Sol Tetik

source: Right Trigger
tr: Sağ Tetik

source: Sega Saturn BIOS (Japan)
tr: Sega Saturn BIOS (Japonya)

source: Sega Saturn BIOS (International)
tr: Sega Saturn BIOS (Uluslararası)

source: SG-1000 Joystick
tr: SG-1000 Kumanda

source: Super NES Controller
tr: Super NES Denetçisi

source: Left Control Pad
tr: Sol Denetim Pedi

source: Right Control Pad
tr: Sağ Denetim Pedi

source: Stereoscopic Mode
tr: Stereoskopik Kip

source: Left Only
tr: Yalnız Sol

source: Right Only
tr: Yalnız Sağ

source: Red & Blue
tr: Kırmızı ve Mavi

source: Red & Cyan
tr: Kırmızı ve Camgöbeği

source: Gray Colors
tr: Gri Renkler

source: WonderSwan (Landscape)
tr: WonderSwan (Yatay)

source: X1 Button
tr: X1 Düğmesi

source: X2 Button
tr: X2 Düğmesi

source: X3 Button
tr: X3 Düğmesi

source: X4 Button
tr: X4 Düğmesi

source: Y1 Button
tr: Y1 Düğmesi

source: Y2 Button
tr: Y2 Düğmesi

source: Y3 Button
tr: Y3 Düğmesi

source: Y4 Button
tr: Y4 Düğmesi

source: WonderSwan (Portrait)
tr: WonderSwan (Dikey)

source: Rotate Screen
tr: Ekranı Döndür

source: Rotate to Landscape
tr: Yataya Döndür

source: Rotate to Portrait
tr: Dikeye Döndür

source: Snapshots
tr: Anlık Görüntüler

source: Snapshot backups allow saved games to be resumed in Highscore on another device
tr: Anlık görüntü yedekleri, kayıtlı oyunların başka aygıttaki Highscore’da sürdürülmesini sağlar.

source: Create Snapshot Backup
tr: Anlık Görüntü Yedeği Oluştur

source: Restore Snapshot Backup
tr: Anlık Görüntü Yedeğini Geri Yükle

source: Firmware
tr: Donanım Yazılımı

source: Make the firmware you've installed here available to Highscore on another device
tr: Burada kurduğunuz donanım yazılımının başka aygıttaki Highscore’da kullanılmasını sağlar

source: Create Firmware Backup
tr: Donanım Yazılımı Yedeği Oluştur

source: Restore Firmware Backup
tr: Donanım Yazılımı Yedeğini Geri Yükle

source: Save Backup
tr: Yedek Kaydet

source: Select Backup
tr: Yedek Seç

source: No snapshots to back up
tr: Yedeklenecek anlık görüntü yok

source: Highscore Snapshots
tr: Highscore Anlık Görüntüleri

source: Creating Snapshot Backup
tr: Anlık Görüntü Yedeği Oluşturuluyor

source: Backup failed: %s
tr: Yedekleme başarısız oldu: %s

source: Replace Existing Snapshots?
tr: Var Olan Anlık Görüntü Değiştirilsin Mi?

source: Restoring a backup will delete all existing snapshots and cannot be undone. Continue anyway?
tr: Yedeği geri yüklemek var olan tüm anlık görüntüleri silecek ve bu işlem geri alınamaz. Yine de sürdürülsün mü?

source: _Keep Existing Snapshots
tr: Var Olan Anlık Görüntüleri _Koru

source: _Replace Snapshots
tr: Anlık Görüntüleri _Değiştir

source: Restoring Snapshot Backup
tr: Anlık Görüntü Yedeği Geri Yükleniyor

source: Restore failed: %s
tr: Geri yükleme başarısız oldu: %s

source: No firmware to back up
tr: Yedeklenecek donanım yazılımı yok

source: Highscore Firmware
tr: Highscore Donanım Yazılımı

source: Creating Firmware Backup
tr: Donanım Yazılımı Yedeği Oluşturuluyor

source: Failed to show in Files: %s
tr: Dosyalarʼda gösterilemedi: %s

source: Backup Created
tr: Yedek Oluşturuldu

source: Show in Files
tr: Dosyalarʼda Göster

source: Extracting Firmware Backup
tr: Donanım Yazılımı Yedeğini Çıkarılıyor

source: Auto
tr: Kendiliğinden

source: General
tr: Genel

source: Input
tr: Girdi

source: Backup & Restore
tr: Yedekle ve Geri Yükle

source: Drop Firmware to Install
tr: Kurulacak Donanım Yazılımını Bırak

source: _Install Firmware
tr: Donanım Yazılımını _Kur

source: Installed
tr: Kurulu

source: Missing
tr: Eksik

source: Select Firmware
tr: Donanım Yazılımı Seç

source: Replaced existing firmware
tr: Var olan donanım yazılımı değiştirildi

source: Error installing: %s
tr: Kurulum hatası: %s

source: _Reset
tr: _Sıfırla

source: _Forget
tr: _Unut

source: Library Folder
tr: Kitaplık Klasörü

source: Browse…
tr: Göz at…

source: Show Empty Platforms
tr: Boş Platformları Göster

source: Game
tr: Oyun

source: Pause When Inactive
tr: Etkin Değilken Duraklat

source: Load State on Startup
tr: Başlangıçta Durumu Yükle

source: Automatic Saving
tr: Kendiliğinden Kaydetme

source: Take a snapshot every 5 minutes while the game is running
tr: Oyun sürerken her 5 dakikada bir anlık görüntü al

source: Select Library Folder
tr: Kitaplık Klasörü Seç

source: Failed to select library folder: %s
tr: Kitaplık klasörü seçilemedi: %s

source: Controllers
tr: Denetçiler

source: Gamepads
tr: Oyun Kumandaları

source: No Gamepads
tr: Oyun Kumandası Yok

source: On-Screen Gamepad
tr: Ekran Üstü Oyun Kumandası

source: Haptic Feedback
tr: Dokunsal Geri Bildirim

source: Connected
tr: Bağlı

source: Console
tr: Konsol

source: Filter
tr: Süz

source: Settings
tr: Ayarlar

source: Deinterlacing
tr: Görüntü Ayrıştırma

source: Crop Overscan
tr: Aşırı Taramaları Kırp

source: Handheld
tr: Taşınabilir

source: Color Correction
tr: Renk Düzeltme

source: Accessibility
tr: Erişilebilirlik

source: _Blend Frames
tr: Kareleri _Harmanla

source: Simulate screen ghosting to reduce flicker
tr: Titremeyi azaltmak için ekran gölgelemesine öykün

source: TV Settings
tr: TV Ayarları

source: Use Defaults
tr: Öntanımlıları Kullan

source: Signal
tr: Sinyal

source: Brightness
tr: Parlaklık

source: Contrast
tr: Karşıtlık

source: Sharpness
tr: Keskinlik

source: Tint
tr: Ton

source: Only applies to NTSC games
tr: Yalnızca NTSC oyunları için geçerlidir

source: Unavailable when using RGB
tr: RGB kullanılırken kullanılamaz

source: Properties
tr: Özellikler

source: Remove Custom Cover
tr: Özel Kapağı Kaldır

source: Set Custom Cover…
tr: Özel Kapak Belirle…

source: Edit Title…
tr: Başlığı Düzenle…

source: _Controls
tr: _Denetimler

source: Edit Title
tr: Başlığı Düzenle

source: Enter a new title for this game
tr: Oyun için yeni başlık gir

source: _Rename
tr: Yeniden _Adlandır

source: Enter Name
tr: Ad Gir

source: Reset title
tr: Başlığı sıfırla

source: Failed to rename game: %s
tr: Oyun yeniden adlandırılamadı: %s

source: Select Cover
tr: Kapak Seç

source: Image Files
tr: Görüntü Dosyaları

source: Failed to set custom cover: %s
tr: Özel kapak ayarlanamadı: %s

source: Failed to remove custom cover: %s
tr: Özel kapak kaldırılamadı: %s

source: Console Video
tr: Konsol Videosu

source: Handheld Video
tr: Taşınabilir Video

source: Override preferences for %s
tr: %s için tercihleri geçersiz kıl

source: Color Correction Mode
tr: Renk Düzeltme Kipi

source: Use Default
tr: Öntanımlıyı Kullan

source: Close
tr: Kapat

source: No Snapshots
tr: Anlık Görüntü Yok

source: Save a snapshot to start
tr: Başlamak için anlık görüntü kaydet

source: _New Snapshot
tr: _Yeni Anlık Görüntü

source: Autosave
tr: Kendiliğinden Kaydet

source: New Snapshot %s
tr: Yeni Anlık Görüntü %s

source: More
tr: Daha Çok

source: Enter a name for this snapshot
tr: Bu anlık görüntü için ad gir

source: Enter new name for %s
tr: %s için yeni ad gir

source: Rename
tr: Yeniden Adlandır

source: This snapshot was created with a different core
tr: Bu anlık görüntü başka çekirdekle oluşturulmuş

source: This snapshot was created with an older core version
tr: Bu anlık görüntü daha eski çekirdek sürümüyle oluşturulmuş

source: This snapshot was created with different firmware
tr: Bu anlık görüntü başka donanım yazılımıyla oluşturulmuş

source: This snapshot was created with firmware that is missing
tr: Bu anlık görüntü eksik bir donanım yazılımıyla oluşturulmuş

source: Different core
tr: Başka çekirdek

source: Older core version
tr: Eski çekirdek sürümü

source: Different firmware
tr: Başka donanım yazılımı

source: Missing firmware
tr: Eksik donanım yazılımı

source: This snapshot is incompatible:
tr: Anlık görüntü uyumsuz:

source: Yesterday %X
tr: Dün %X

source: Up
tr: Yukarı

source: Down
tr: Aşağı

source: Weave
tr: Dokuma

source: Blend
tr: Harmanla

source: Composite
tr: Kompozit

source: Anti-Aliased
tr: Yumuşatılmış

source: Sharp
tr: Keskin

source: Blurry
tr: Bulanık

source: Smooth
tr: Yumuşat

source: Previous
tr: Önceki

source: All Done
tr: Tümü Bitti

source: Connect your gamepads
tr: Oyun kumandalarınızı bağlayın

source: _Skip
tr: _Atla

source: _Continue
tr: _Sürdür

source: Set Library Folder
tr: Kitaplık Klasörü Ayarla

source: Select a library folder to continue
tr: Sürdürmek için kitaplık klasörü seç

source: _Select
tr: _Seç

source: Supported _Platforms…
tr: Desteklenen _Platformlar…

source: Library Scanned
tr: Kitaplık Tarandı

source: _Change Folder
tr: Klasör _Değiştir

source: Found %u games
tr: %u oyun bulundu

source: Welcome to Highscore
tr: Highscoreʼa Hoş Geldiniz

source: Triangle
tr: Üçgen

source: Square
tr: Kare

source: Circle
tr: Daire

source: %.01lf%% complete
tr: %%%.01lf tamamlandı

source: Launch the game with specified uid
tr: Oyunu belirtilen uid ile başlat

source: Show games with the given filter
tr: Verilen süzgeçteki oyunları göster

source: Show the current version of Highscore
tr: Highscore sürümünü göster

source: [FILE…]
tr: [DOSYA…]

source: Failed to open file: %s
tr: Dosya açılamadı: %s

source: Open Game
tr: Oyun Aç

source: _Add Files
tr: Dosya _Ekle

source: translator-credits
tr: Emin Tufan Çetin <etcetin@gmail.com> Sabri Ünal <yakushabb@gmail.com>

source: _Chat
tr: _Konuşma

source: %s Shader
tr: %s Gölgelendirici

source: By %s
tr: %s tarafından

source: LCD Color Correction Shaders
tr: LCD Renk Düzeltme Gölgelendiricileri

# shortcut window
source: General
tr: Genel

# shortcut window
source: Open Menu
tr: Menüyü Aç

# shortcut window
source: Open Game
tr: Oyun Aç

# shortcut window
source: Show Preferences
tr: Tercihleri Göster

# shortcut window
source: Show Shortcuts
tr: Kısayolları göster

# shortcut window
source: Show Help
tr: Yardımı Göster

# shortcut window
source: Close Current Window
tr: Geçerli Pencereyi Kapat

# shortcut window
source: Quit App
tr: Uygulamadan Çık

source: _Open Game
tr: Oyunu _Aç

source: Failed to add game: %s
tr: Oyun eklenemedi: %s

source: Game Added
tr: Oyun Eklendi
