Repository: yakushabb/foss-desktop-turkish
Catalog: GNOME/Extra/key-rack.main.*.po
Languages: tr

source: Keys
tr: Anahtarlar

source: View and edit your apps’ keys
tr: Uygulamalarınızın anahtarlarını görüntüleyin ve düzenleyin

source: passwords;key;
tr: passwords;key;parolalar;anahtarlar;

source: View and edit passwords
tr: Parolaları görüntüle ve düzenle

source: Key Rack allows you to view, create and edit secrets, such as passwords or tokens, stored by apps. It supports both Flatpak secrets and system-wide keyrings.
tr: Key Rack, uygulamalarca depolanan parolalar ya da jetonlar gibi gizleri görüntülemenizi, oluşturmanızı ve düzenlemenizi sağlar. Hem Flatpak gizlerini hem de sistem geneli anahtarlıklarını destekler.

source: Overview of keyrings and Flatpak apps
tr: Anahtarlıkların ve Flatpak uygulamalarının genel görünümü

source: Details for a secret
tr: Giz için ayrıntılar

# shortcut window
source: General
tr: Genel

# shortcut window
source: Open Search
tr: Aramayı Aç

# shortcut window
source: Show Shortcuts
tr: Kısayolları Göster

# shortcut window
source: Quit
tr: Çık

# shortcut window
source: Keyring
tr: Anahtarlık

# shortcut window
source: Create New Keyring
tr: Yeni Anahtarlık Oluştur

# shortcut window
source: Add Key
tr: Anahtar Ekle

# shortcut window
source: Lock Keyring
tr: Anahtarlığı Kilitle

# shortcut window
source: Unlock Keyring
tr: Anahtarlık Kilidini Aç

# shortcut window
source: Change Keyring Password
tr: Anahtarlık Parolası Değiştir

# shortcut window
source: Delete Keyring
tr: Anahtarlığı Sil

source: Locked element
tr: Kilitli eleman

source: Chrome Safe Storage Password
tr: Chrome Güvenli Depolama Parolası

source: Chrome Dummy Schema
tr: Chrome Boş Şema

source: Saved Web Password
tr: Kayıtlı Web Parolası

source: Web Sync Password
tr: Web Eşitleme Parolası

source: Evolution Data Source Secret
tr: Evolution Veri Kaynağı Gizi

source: Generic Password
tr: Genel Parola

source: GPG Passphrase
tr: GPG Parola metni

source: Disk Encryption Password
tr: Disk Şifreleme Parolası

source: Network Connection Password
tr: Ağ Bağlantısı Parolası

source: Network Password
tr: Ağ Parolası

source: Note
tr: Not

source: Online Account Password
tr: Çevrim İçi Hesap Parolası

source: RDP Credentials
tr: RDP Kimlik Bilgileri

source: VNC Password
tr: VNC Parolası

source: Show Details
tr: Ayrıntıları Göster

source: translator-credits
tr: Sabri Ünal <yakushabb@gmail.com> Emin Tufan Çetin <etcetin@gmail.com>

source: Add New Keyring
tr: Yeni Anahtarlık Ekle

source: System Login Keyring
tr: Sistem Giriş Anahtarlığı

source: User Keyring
tr: Kullanıcı Anahtarlığı

source: Temporary Session Keyring
tr: Geçici Oturum Anahtarlığı

source: Locked
tr: Kilitli

source: Create New Keyring
tr: Yeni Anahtarlık Oluştur

source: A keyring can be used to securely store keys. They can be locked or unlocked independently of other keyrings using an individual password.
tr: Bir anahtarlık, anahtarları güvenli depolamak için kullanılabilir. Bireysel parola kullanılarak diğer anahtarlıklardan bağımsız kilitlenebilir ya da açılabilirler.

source: Name
tr: Ad

source: Set Password
tr: Parola Belirle

source: Straight rows of keys are easy to guess
tr: Düz tuş sıralarını öngörmek kolaydır

source: Short keyboard patterns are easy to guess
tr: Kısa klavye örüntülerini öngörmek kolaydır

source: Repeated keys are easy to guess
tr: Yinelenen tuşları öngörmek kolaydır

source: Repeated patterns are easy to guess
tr: Yinelenen örüntüleri öngörmek kolaydır

source: This is one of the 10 most commonly used passwords
tr: Bu, en sık kullanılan 10 paroladan biri

source: This is one of the 100 most commonly used passwords
tr: Bu, en sık kullanılan 100 paroladan biri

source: This is a common password
tr: Bu, yaygın bir parola

source: This is similar to a commonly used password
tr: Bu, yaygın kullanılan bir parolaya benziyor

source: This contains a easy to guess sequence
tr: Bu, öngörülmesi kolay dizi içeriyor

source: Recent years are easy to guess
tr: Son yılları öngörmek kolaydır

source: A word by itself is easy to guess
tr: Tek başına sözcüğü öngörmek kolaydır

source: Dates are often easy to guess
tr: Tarihleri öngörmek genellikle kolaydır

source: Names and surnames by themselves are easy to guess
tr: Ad ve soyadları tek başına öngörmek kolaydır

source: Common names and surnames are easy to guess
tr: Yaygın ad ve soyadları öngörmek kolaydır

source: Use a few words and avoid common phrases
tr: Birkaç sözcük kullanın ve yaygın ifadelerden kaçının

source: No need for symbols, digits or uppercase letters
tr: Simgelere, rakamlara ya da büyük harflere gerek yok

source: Add another word or two
tr: Bir ya da iki sözcük daha ekleyin

source: Capitalization doesn't help very much
tr: Büyük harf kullanımı pek yardımcı olmuyor

source: All uppercase is almost as easy to guess as all lowercase
tr: Tümü büyük ya da tümü küçük harfleri öngörmek kolaydır

source: Reversed words aren't much harder to guess
tr: Ters çevrilmiş sözcükleri öngörmek zor değildir

source: Predictable substitutions don't help very much
tr: Öngörülebilir vurgu değişikliği pek yardımcı olmuyor

source: Use a longer keyboard pattern with more turns
tr: Daha çok dönüş içeren daha uzun bir klavye örüntüsü kullanın

source: Avoid repeated words and characters
tr: Yinelenen sözcüklerden ve karakterlerden kaçının

source: Avoid using sequences
tr: Dizileri kullanmaktan kaçının

source: Avoid using recent years
tr: Son yılları kullanmaktan kaçının

source: Avoid years that are associated with you
tr: Sizinle ilişkili yıllardan kaçının

source: Avoid dates and years that are associated with you
tr: Sizinle ilişkili tarih ve yıllardan kaçının

source: This looks like a safe password!
tr: Güvenli parolaya benziyor!

source: Add Key
tr: Anahtar Ekle

source: Description
tr: Açıklama

source: Password
tr: Parola

source: Add
tr: Ekle

source: Username
tr: Kullanıcı Adı

source: Application
tr: Uygulama

source: Connection UUID
tr: Bağlantı UUIDʼsi

source: Database Path
tr: Veri Tabanı Yolu

source: Device ID
tr: Aygıt Kimliği

source: Domain
tr: Etki Alanı

source: Explanation
tr: Açıklama

source: Online Account Identity
tr: Çevrim İçi Hesap Kimliği

source: Homeserver
tr: Ev Sunucusu

source: ID
tr: Kimlik

source: Keyring
tr: Anahtarlık

source: Profile
tr: Profil

source: Protocol
tr: İletişim Kuralı

source: Repository ID
tr: Depo Kimliği

source: Server
tr: Sunucu

source: Setting Key
tr: Ayar Anahtarı

source: Setting Name
tr: Ayar Adı

source: Version
tr: Sürüm

source: Copy Property
tr: Özelliği Kopyala

source: Delete Key?
tr: Anahtar Silinsin Mi?

source: This key will be permanently deleted
tr: Bu anahtar kalıcı olarak silinecek

source: Cancel
tr: İptal

source: Delete
tr: Sil

source: _Secret
tr: _Giz

source: Copy Secret
tr: Gizi Kopyala

source: Secret
tr: Giz

source: Show Secret
tr: Gizi Göster

source: Details
tr: Ayrıntılar

source: _Description
tr: _Açıklama

source: Type
tr: Tür

source: D_elete Key…
tr: Anahtarı _Sil…

source: You are about to change the password for the system's keyring. This password is usually the same as your login password to automatically unlock this keyring on login. If the password is changed to something different, the automatic unlocking of the keyring might stop working.
tr: Sistem anahtarlığının parolasını değiştirmek üzeresiniz. Bu parola genellikle oturum açtığınızda bu anahtarlığın kilidini kendiliğinden açmak için oturum açma parolanızla aynıdır. Parola değiştirilirse, anahtarlığın kendiliğinden açılması çalışmayı durdurabilir.

source: Change
tr: Değiştir

source: Delete Keyring?
tr: Anahtarlık Silinsin Mi?

source: All keys in the keyring will be permanently deleted
tr: Anahtarlıktaki tüm anahtarlar kalıcı olarak silinecek

source: This keyring is bound to your user and gets automatically unlocked at login
tr: Bu anahtarlık kullanıcınıza bağlı ve oturum açıldığında kendiliğinden açılır

source: All keys in this temporary keyring are removed again on logout
tr: Bu geçici anahtarlıktaki tüm anahtarlar oturum kapatıldığında kaldırılacak

source: _Change Password
tr: Parola _Değiştir

source: _Lock
tr: _Kilitle

source: _Delete
tr: S_il

source: Keyring Menu
tr: Anahtarlık Menüsü

source: Search
tr: Ara

source: Search keys
tr: Anahtarları ara

source: Keyring is locked
tr: Anahtarlık kilitli

source: Unlock
tr: Kilidi Aç

source: No Keys
tr: Anahtar Yok

source: This keyring does not contain any keys
tr: Anahtarlık herhangi bir anahtar içermiyor

source: Add Key…
tr: Anahtar Ekle…

source: No Keys Found
tr: Anahtar Bulunamadı

source: Try a different search
tr: Başka arama dene

source: App Keys
tr: Uygulama Anahtarları

source: This app does not contain any keys
tr: Uygulama anahtar içermiyor

source: _Keyboard Shortcuts
tr: _Klavye Kısayolları

source: _About Key Rack
tr: Key Rack _Hakkında

source: Main Menu
tr: Ana Menü

source: Search keyrings
tr: Anahtarlıkları ara

source: No Keyrings Found
tr: Anahtarlık Bulunamadı

source: Keyrings
tr: Anahtarlıklar

source: Apps
tr: Uygulamalar

source: Uninstalled Apps
tr: Kaldırılmış Uygulamalar
