Repository: yakushabb/foss-desktop-turkish
Catalog: GNOME/Extra/schemes.main.*.po
Languages: tr

source: Style Variant
tr: Biçem Türü

source: Use the light or dark variant; otherwise follow the system theme.
tr: Açık ya da koyu biçemi kullanın; aksi takdirde sistem temasını izle.

source: Create syntax highlighting schemes
tr: Söz dizimi vurgulama şemaları oluştur

source: Schemes allow you to create syntax highlighting style-schemes for GtkSourceView-based applications such as Builder or Text Editor.
tr: Schemes, Builder ya da Metin Düzenleyici gibi GtkSourceView tabanlı uygulamalar için söz dizimi vurgulama biçem şemaları oluşturmanızı sağlar.

source: Editing a GtkSourceView style-scheme in dark mode
tr: Koyu kipte GtkSourceView biçem şemasını düzenleme

source: Editing a GtkSourceView style-scheme in light mode
tr: Açık kipte GtkSourceView biçem şemasını düzenleme

source: translator-credits
tr: Sabri Ünal <yakushabb@gmail.com>

source: Remove color from palette
tr: Paletten renk kaldır

source: Unset %s
tr: %s Kaldır

source: Background
tr: Arka Plan

source: Foreground
tr: Ön Plan

source: Underline Color
tr: Alt Çizgi Rengi

source: Paragraph Background
tr: Paragraf Arka Planı

source: Bold
tr: Kalın

source: Font Weight
tr: Yazı Tipi Ağırlığı

source: Italic
tr: Eğik

source: Underline
tr: Altı Çizili

source: Strikethrough
tr: Üstü Çizili

source: Font Scale
tr: Yazı Tipi Ölçeği

source: Text
tr: Metin

source: Styling for text
tr: Metin için biçem

source: Selection
tr: Seçim

source: Styling for selected text
tr: Seçili metin için biçem

source: Unfocused Selection
tr: Odaklanmamış Seçim

source: Styling for selected text in an unfocused window
tr: Odaklanmamış penceredeki seçili metin için biçem

source: Cursor
tr: İmleç

source: Styling for insertion cursor
tr: Ekleme imleci için biçem

source: Secondary Cursor
tr: İkincil İmleç

source: Styling for secondary cursors
tr: İkincil imleçler için biçem

source: Right Margin
tr: Sağ Kenar Boşluğu

source: Style for the right margin background
tr: Sağ kenar boşluğu arka planı için biçem

source: Map Overlay
tr: Harita Kaplaması

source: Style for the slider above the overlay map
tr: Kaplama haritasının üzerindeki kaydırıcı için biçem

source: Draw Spaces
tr: Boşlukları Çiz

source: Styling used when drawing spaces
tr: Boşlukları çizerken kullanılan biçem

source: Background Pattern
tr: Arka Plan Örüntüsü

source: Styling used for background patterns
tr: Arka plan örüntüleri için kullanılan biçem

source: Line Numbers
tr: Satır Numaraları

source: Styling for line numbers
tr: Satır numaraları için biçem

source: Line Numbers Border
tr: Çizgi Numaraları Kenarlığı

source: Styling for border between numbers and text
tr: Sayılar ve metin arasındaki kenarlık için biçem

source: Current Line Background
tr: Geçerli Satır Arka Planı

source: Styling for current line background
tr: Geçerli satır arka planı için biçem

source: Current Line Number
tr: Geçerli Satır Numarası

source: Styling for current line number
tr: Geçerli satır numarası için biçem

source: Bracket Match
tr: Parantez Eşleşmesi

source: Styling for bracket matches
tr: Parantez eşleşmeleri için biçem

source: Bracket Mismatch
tr: Parantez Uyuşmazlığı

source: Styling for bracket mismatches
tr: Parantez uyumsuzlukları için biçem

source: Search Match
tr: Arama Eşleşmesi

source: Styling for search matches
tr: Arama eşleşmeleri için biçem

source: Snippet Focus
tr: Parçacık Odağı

source: Styling for the focused snippet
tr: Odaklanmış parçacık için biçem

source: Common Styles
tr: Ortak Biçemler

source: Import Color Palette
tr: Renk Paletini İçe Aktar

source: Import
tr: İçe Aktar

source: Cancel
tr: İptal

source: GIMP Palette (*.gpl)
tr: GIMP Paleti (*.gpl)

source: Save As
tr: Farklı Kaydet

source: Save
tr: Kaydet

source: Style Schemes
tr: Biçem Şemaları

source: Open
tr: Aç

source: General
tr: Genel

source: Scheme Name
tr: Şema Adı

source: A unique name that will be displayed to users within applications. This name may be translated into other languages.
tr: Uygulamalar içinde kullanıcılara gösterilecek benzersiz ad. Bu ad diğer dillere çevrilebilir.

source: Scheme Identifier
tr: Şema Tanımlayıcı

source: A unique identifier for your application. It should be lowercase, may not contain spaces, but may use dashes.
tr: Uygulamanız için benzersiz tanımlayıcı. Küçük harfli olmalı, boşluk içermemelidir, ancak tire kullanabilir.

source: Author
tr: Yazar

source: Description
tr: Açıklama

source: Metadata
tr: Üst Veri

source: Dark Scheme
tr: Koyu Şema

source: If the scheme is intended for dark mode.
tr: Şema koyu kip için tasarlanmışsa.

source: Alternate Scheme Identifier
tr: Şema Tanımlayıcıyı Değiştir

source: Applications may use the metadata provided to enhance users experience such as switching between light and dark modes.
tr: Uygulamalar, açık ve koyu kipler arasında geçiş yapmak gibi kullanıcı deneyimini iyileştirmeyi sağlanan üst verileri kullanabilir.

source: Color Palette
tr: Renk Paleti

source: Import Color Palette…
tr: Renk Paletini İçe Aktar…

source: Load color palette compatible with “The GIMP”
tr: "GIMP" ile uyumlu renk paleti yükle

source: _Import…
tr: İçe _Aktar…

source: Add Color
tr: Renk Ekle

source: Name
tr: Ad

source: Name for the color. It may not start with # and spaces are discouraged.
tr: Renk adı. Bu ad # ile başlamayabilir ve boşluksuz olmalıdır.

source: Color
tr: Renk

source: Name and color code for a new color in the palette. The color code may be in hex, <tt>rgb()</tt>, or <tt>rgba()</tt> format.
tr: Paletteki yeni rengin adı ve renk kodu. Renk kodu hex, <tt>rgb()</tt>, ya da <tt>rgba()</tt> biçiminde olabilir.

source: _Add Color
tr: Renk _Ekle

source: Styles
tr: Biçemler

source: New Window
tr: Yeni Pencere

source: Save _As
tr: _Farklı Kaydet

source: _About Schemes
tr: Schemes _Hakkında

source: Show
tr: Göster

source: Space Characters
tr: Boşluk Karakterleri

source: Enable Snippets
tr: Parçacıkları Etkinleştir

source: None
tr: Yok

source: Grid
tr: Izgara

source: Text Wrapping
tr: Metin Sarma

source: Wrap at Word or Character
tr: Kelime ya da Karakterde Sar

source: Wrap at Word
tr: Kelimede Sar

source: Highlight Current Line
tr: Geçerli Satırı Vurgula

source: Indentation
tr: Girinti

source: Insert Spaces
tr: Boşluk Ekle

source: Spaces Per Tab
tr: Sekme Başına Boşluk

source: Document Type
tr: Belge Türü
