Repository: yakushabb/foss-desktop-turkish
Catalog: GNOME/Extra/tau.master.*.po
Languages: tr

source: GTK frontend for the xi text editor
tr: xi metin editorü için GTK ön yüzü

source: Tau is a GTK frontend for the xi text editor written in Rust. It’s a very fast plain text editor.
tr: Tau, xi metin editörü için Rust ile yazılmış GTK ön yüzüdür. Çok hızlı bir düz metin editörüdür.

source: The Tau text editor
tr: Tau metin editörü

source: Text;Editor;Plaintext;Write;gxi;
tr: Metin;Editör;Düz metin;Yaz;gxi;

source: Launch a new Tau instance
tr: Yeni Tau örneği başlat

source: Xi-Editor’s theme
tr: Xi-Editor teması

source: Sets the theme used for the editing area
tr: Düzenleme alanı temasını ayarlar

source: Draw trailing spaces
tr: Sondaki boşlukları çiz

source: Draw spaces which are at the end of a line
tr: Satır sonundaki boşlukları çiz

source: Draw leading spaces
tr: Baştaki boşlukları çiz

source: Draw spaces which are at the beginning of a line
tr: Satır başındaki boşlukları çiz

source: Draw selected spaces
tr: Seçili boşlukları çiz

source: Draw spaces whenever they are selected
tr: Seçildiklerinde boşlukları çiz

source: Draw all spaces
tr: Tüm boşlukları çiz

source: Draw spaces, no matter the position
tr: Konum ne olursa olsun boşlukları çiz

source: Draw a right hand margin
tr: Sağ kenar boşluğu çiz

source: Draw a right hand margin to limit the text width
tr: Metin genişliğini sınırlamak için sağ kenar boşluğu çiz

source: At what column to display the margin
tr: Kenar boşluğunun hangi sütunda gösterileceği

source: Sets the column at which the margin should be drawn
tr: Kenar boşluğunun çizileceği sütunu ayarlar

source: Whether the current line should be highlighted
tr: Geçerli satırın vurgulanma durumu

source: Sets if the current line should be highlighted, which eases navigation through the document
tr: Belgede gezinmeyi kolaylaştırma amacıyla geçerli satırın vurgulanma durumu ayarlar

source: Sets the height of the window in the next start-up
tr: Sonraki açılışta pencerenin yüksekliğini ayarlar

source: Sets the width of the window in the next start-up
tr: Sonraki açılışta pencerenin genişliğini ayarlar

source: Sets if the window should be maximized during the next start-up
tr: Sonraki açılışta pencerenin büyütülme durumunu ayarlar

source: Tab size
tr: Sekme boyutu

source: Amount of spaces that a tab is wide
tr: Sekmenin boşluk olarak genişliği

source: Insert spaces instead of tabs
tr: Sekme yerine boşluk ekle

source: Whether spaces should be inserted instead of tabs
tr: Sekmeler yerine boşlukların yerleştirilme durumu

source: Treat indentation with spaces like tabs
tr: Boşluklu girintilere sekme gibi davran

source: If “translate-tabs-to-spaces” is true, Backspace will delete multiple spaces, up to the previous tab stop
tr: Eğer “translate-tabs-to-spaces” değeri doğru olarak ayarlanmışsa, Backspace tuşu önceki sekme durağına dek olan birden çok boşluğu siler

source: Automatically match document’s indentation on newlines
tr: Belgenin girintilerini yeni satırlarla kendiliğinden eşleştir

source: The font used for editing
tr: Düzenleme için kullanılacak yazı tipi

source: Wrap lines at the end of the document
tr: Belgenin sonunda satırları kaydır

source: Draw trailing tabs
tr: Sondaki sekmeleri çiz

source: Draw tabs which are at the end of a line
tr: Satır sonundaki sekmeleri çiz

source: Draw leading tabs
tr: Baştaki sekmeleri çiz

source: Draw tabs which are at the beginning of a line
tr: Satır başındaki sekmeleri çiz

source: Draw selected tabs
tr: Seçili sekmeleri çiz

source: Draw tabs whenever they are selected
tr: Seçildiklerinde sekmeleri çiz

source: Draw all tabs
tr: Tüm sekmeleri çiz

source: Draw all tabs, no matter the position
tr: Konum ne olursa olsun sekmeleri çiz

source: Draw the cursor
tr: İmleci çiz

source: Whether to draw the cursor
tr: İmlecin çizilme durumu

source: Syntax specific settings
tr: Söz dizimine özgü ayarlar

source: A JSON string containing syntax specific settings (e.g. tab width of 2 for YAML)
tr: Söz dizimine özgü ayarları içeren JSON dizgesi (ör. YAML için 2 sekme genişliği)

source: Save when Tau moves out of focus
tr: Tau odak dışına çıktığında kaydet

source: Automatically save all open files when Tau moves out of focus
tr: Tau odak dışına çıktığında tüm açık dosyaları kendiliğinden kaydet

source: Show line count
tr: Satır sayısını göster

source: Whether or not to show the line count in the editing pane
tr: Düzenleme bölmesinde satır sayısının gösterilme durumu

source: Open files
tr: Dosyaları aç

source: List of file paths open in the current or most recent session
tr: Geçerli veya en son oturumda açılan dosya yollarının listesi

source: Restore session
tr: Oturumu geri yükle

source: Whether or not to restore last session on start-up
tr: Son oturumun başlangıçta geri yüklenip yüklenmeyeceği

source: Full path in title bar
tr: Başlık çubuğunda tam yol

source: Whether or not to display full path instead of file name in Tau's title bar.
tr: Tau başlık çubuğunda dosya adı yerine tam yolun gösterilip gösterilmeyeceği.

source: Show terminal
tr: Uçbirimi göster

source: Whether or not to show an integrated terminal in Tau's editing pane
tr: Tau düzenleme bölmesinde entegre uçbirimin gösterilme durumu

source: Path to the shell executable
tr: Çalıştırılabilir kabuk dosyasına giden yol

source: The path to the shell you want to use.
tr: Kullanmak istediğiniz kabuğun yolu.

source: Cut
tr: Kes

source: Copy
tr: Kopyala

source: Paste
tr: Yapıştır

source: Undo
tr: Geri Al

source: Redo
tr: Yinele

source: Select All
tr: Tümünü Seç

source: Enable automatic indentation
tr: Kendiliğinden girintilemeyi etkinleştir

source: Find
tr: Bul

source: Find and select all search matches
tr: Tüm arama eşleşmelerini bul ve seç

source: Switch between Search and Search-and-Replace
tr: Ara ve Ara-ve-Değiştir arasında geçiş yap

source: Show or hide search options such as case sensitivity
tr: Büyük/küçük harf duyarlılığı gibi bulma seçeneklerini göster veya gizle

source: Replace
tr: Değiştir

source: Replace All
tr: Tümünü Değiştir

source: Regular expressions
tr: Düzenli ifadeler

source: Case sensitive
tr: Büyük-küçük harfe duyarlı

source: Match whole word only
tr: Yalnızca tüm sözcüğü eşleştir

source: No Results
tr: Sonuç Yok

# shortcut window
source: Documents
tr: Belgeler

# shortcut window
source: Create new document
tr: Yeni belge oluştur

# shortcut window
source: Open a document
tr: Belge aç

# shortcut window
source: Save the document
tr: Belgeyi kaydet

# shortcut window
source: Save the document as…
tr: Belgeyi farklı kaydet…

# shortcut window
source: Close the document
tr: Belgeyi kapat

# shortcut window
source: Navigation
tr: Gezinti

# shortcut window
source: Cycle tab history backward
tr: Sekme geçmişinde geri hareket et

# shortcut window
source: Cycle tab history forward
tr: Sekme geçmişinde ileri hareket et

# shortcut window
source: Go to line
tr: Satıra git

# shortcut window
source: Toggle fullscreen
tr: Tam ekranı aç/kapat

# shortcut window
source: Find
tr: Bul

# shortcut window
source: Find the next match
tr: Sonraki eşleşmeyi bul

# shortcut window
source: Find the previous match
tr: Önceki eşleşmeyi bul

# shortcut window
source: Find and replace
tr: Bul ve değiştir

# shortcut window
source: Find all matches
tr: Tüm eşleşmeleri bul

# shortcut window
source: Close the find window
tr: Bul penceresini kapat

# shortcut window
source: Editing
tr: Düzenleme

# shortcut window
source: Highlight the next occurrence of the current selection
tr: Geçerli seçimin sonraki örneğini vurgula

# shortcut window
source: Delete the current selection
tr: Geçerli seçimi sil

# shortcut window
source: Delete an entire word
tr: Tam bir sözcüğü sil

# shortcut window
source: Outdent the current selection
tr: Geçerli seçimin girintilemesini azalt

# shortcut window
source: Move to start of the line
tr: Satırın başına ilerle

# shortcut window
source: Move to start of the document
tr: Belgenin başına ilerle

# shortcut window
source: Move to end of the line
tr: Satırın sonuna ilerle

# shortcut window
source: Move to end of the document
tr: Belgenin sonuna ilerle

# shortcut window
source: Move up for the height of the view
tr: Görünümün yüksekliğince yukarı ilerle

# shortcut window
source: Move down for the height of the view
tr: Görünümün yüksekliğince aşağı ilerle

# shortcut window
source: Enable/Disable the cursor
tr: İmleci etkinleştir/pasifleştir

# shortcut window
source: Copy and Paste
tr: Kopyala ve Yapıştır

# shortcut window
source: Copy the current selection
tr: Geçerli seçimi kopyala

# shortcut window
source: Paste what's currently in the clipboard
tr: Panodakini yapıştır

# shortcut window
source: Cut the current selection
tr: Geçerli seçimi kes

# shortcut window
source: Undo and Redo
tr: Geri Al ve Yinele

# shortcut window
source: Undo
tr: Geri al

# shortcut window
source: Redo
tr: Yinele

# shortcut window
source: Selections
tr: Seçimler

# shortcut window
source: Select all
tr: Tümünü seç

# shortcut window
source: Select all occurences of the current selection
tr: Geçerli seçimin tüm oluşlarını seç

# shortcut window
source: Move up and select everything from current cursor position
tr: Yukarı ilerle ve geçerli imleç konumundan önceki her şeyi seç

# shortcut window
source: Move down and select everything from current cursor position
tr: Aşağı ilerle ve geçerli imleç konumundan sonraki her şeyi seç

# shortcut window
source: Move left and select everything from current cursor position
tr: Sola ilerle ve geçerli imleç konumundan önceki her şeyi seç

# shortcut window
source: Move left and select the next word
tr: Sola ilerle ve sonraki sözcüğü seç

# shortcut window
source: Move right and select everything from current cursor position
tr: Sağa ilerle ve geçerli imleç konumundan sonraki her şeyi seç

# shortcut window
source: Move right and select the next word
tr: Sağa ilerle ve sonraki sözcüğü seç

# shortcut window
source: Move to start of the line and select
tr: Satırın başına ilerle ve seç

# shortcut window
source: Move to start of the document and select
tr: Belgenin başına ilerle ve seç

# shortcut window
source: Move to end of the line and select
tr: Satırın sonuna ilerle ve seç

# shortcut window
source: Move to end of the document and select
tr: Belgenin sonuna ilerle ve seç

# shortcut window
source: Move up for the height of the view and select
tr: Görünümün yüksekliğince yukarı ilerle ve seç

# shortcut window
source: Move down for the height of the view and select
tr: Görünümün yüksekliğince aşağı ilerle ve seç

source: Preferences
tr: Tercihler

source: View
tr: Görünüm

source: Preferences related to the View’s look
tr: Görünümle ilgili tercihler

source: Display right hand margin
tr: Sağ kenar boşluğu göster

source: Highlight the current line
tr: Geçerli satırı vurgula

source: Show full path in title bar
tr: Başlık çubuğunda tam yolu göster

source: Restore last opened files on start-up
tr: Son açılan dosyaları başlangıçta geri yükle

source: Wrap lines at the end of the view
tr: Görünümün sonunda satırları kaydır

source: Theme configuration
tr: Tema yapılandırması

source: Syntax configuration
tr: Söz dizimi yapılandırması

source: Syntax selection
tr: Söz dizimi seçimi

source: Syntax-specific tab size
tr: Söz dizimine özgü sekme boyutu

source: Apply syntax configuration settings
tr: Söz dizimi yapılandırma ayarlarını uygula

source: Editor
tr: Düzenleyici

source: Indention
tr: Girintileme

source: Automatic indentation
tr: Kendiliğinden girintile

source: Delete spaces up to the previous tab stop
tr: Önceki sekme durağına dek boşlukları sil

source: File saving
tr: Dosya kaydetme

source: Save files when the Tau goes out of focus
tr: Tau odak dışına çıktığında dosyaları kaydet

source: Terminal
tr: Uçbirim

source: Show the embedded terminal on startup
tr: Gömülü uçbirimi başlangıçta göster

source: What shell to start
tr: Hangi kabuk başlatılacak

source: Highlighting spaces
tr: Boşluk vurgulayış

source: Don't draw spaces
tr: Boşlukları çizme

source: Highlighting tabs
tr: Sekme vurgulayış

source: Don't draw tabs
tr: Sekmeleri çizme

source: Font configuration
tr: Yazı tipi yapılandırması

source: Save As…
tr: Farklı Kaydet…

source: Save All
tr: Tümünü Kaydet

source: Find…
tr: Bul…

source: Replace…
tr: Değiştir…

source: Go To Line…
tr: Satıra Git…

source: Show Terminal
tr: Uçbirimi Göster

source: Toggle Fullscreen
tr: Tam Ekrana Geç

source: Help
tr: Yardım

source: Keyboard Shortcuts
tr: Klavye Kısayolları

source: About Tau
tr: Tau Hakkında

source: Open
tr: Aç

source: Save
tr: Kaydet

source: Untitled
tr: Başlıksız

source: Line
tr: Satır

source: Column
tr: Sütun

source: Plain Text
tr: Düz Metin

source: Tab Size
tr: Sekme Boyutu

source: GTK frontend for the xi text editor, written in Rust
tr: Tau, xi metin düzenleyici için Rust ile yazılmış GTK ön yüzü

source: translator-credits
tr: Sabri Ünal <libreajans@gmail.com> Emin Tufan Çetin <etcetin@gmail.com>

source: Welcome to Tau's terminal.
tr: Tau uçbirimine hoş geldiniz.

source: Start a new instance of the application
tr: Uygulamanın yeni örneğini başlat

source: Couldn’t get Documents directory to autosave unnamed file. Please make sure “XDG_DATA_DIR” or similar is set.
tr: Adsız dosyanın kendiliğinden kaydedileceği Belgeler dizini alınamadı. “XDG_DATA_DIR” ve benzeri değerlerin ayarlandığından emin olun.

source: Save unsaved changes
tr: Kaydedilmemiş değişiklikleri kaydet

source: Close Without Saving
tr: Kaydetmeden Kapat

source: Cancel
tr: İptal

source: Open a file to edit
tr: Dosyayı düzenlemek için aç

source: Couldn’t open file
tr: Dosya açılamadı

source: Save file
tr: Dosyayı kaydet

source: Couldn’t save file
tr: Dosya kaydedilemedi

source: Couldn’t find the xi-syntect-plugin. As such these settings won’t work in the current session.
tr: xi-syntect-plugin bulunamadı. Bu nedenle, bu ayarlar geçerli oturumda çalışmayacak.
