Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/amarok._desktop_.po
Languages: tr

# Name
source: Track Change
tr: Parça Değişimi

# Comment
source: Amarok changed to a new track
tr: Amarok yeni bir parçaya geçti

# Name
source: Message
tr: İleti

# Comment
source: Amarok issued an uncategorized text message
tr: Amarok kategorilenmemiş bir metin iletisi oluşturdu

# Name
source: Add as Podcast to Amarok
tr: Amarok’a Pod Yayını Olarak Ekle

# Name
source: Append to Playlist
tr: Parça Listesine Ekle

# Name
source: Append & Play
tr: Parça Listesine Ekle ve Çal

# Name
source: Queue Track
tr: Parçayı Kuyruğa Ekle

# Name
source: Play Audio CD with Amarok
tr: Ses CD’sini Amarok ile Çal

# Name
source: Info
tr: Bilgiler

# GenericName
source: Audio Player
tr: Müzik Çalar

# Comment
source: Amarok - Rediscover Your Music!
tr: Müziğinizi yeniden keşfedin

# X-KDE-Keywords
source: music,podcast
tr: müzik,podcast,pod yayını

# Comment
source: A scripted service that lets you search, stream and download free, public domain, audio books from Librivox.org
tr: Librivox.org sitesinden ücretsiz, kamuya açık alandan, ses kitapları aramanızı, göndermenizi veya indirmenizi sağlayan bir betik hizmeti.

# Name
source: Cool Streams
tr: Güzel Akışlar

# Comment
source: A script that sets up a service with a few cool internet radio stations
tr: Birkaç güzel internet radyo istasyonu ile hizmet kuran bir betik

# Name
source: Amarok Script Console
tr: Amarok Betik Konsolu

# Comment
source: Amarok Script Console
tr: Amarok betik konsolu
