Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/calligra._desktop_.po
Languages: tr

# Name
source: Laptop
tr: Dizüstü

# Name
source: Layer 2 Remote Switch
tr: Layer 2 Uzak Anahtar

# Name
source: Layer 3 Switch
tr: Layer 3 Anahtar

# Name
source: Lightweight AP
tr: Hafif AP

# Name
source: LocalDirector
tr: YerelYönetici

# Name
source: Location server
tr: Konum sunucusu

# Name
source: Lock and Key
tr: Kilit ve Anahtar

# Name
source: Lock
tr: Kilit

# Name
source: Mac Woman
tr: Mac Kadın

# Name
source: Sitting Woman right
tr: Oturan Kadın sağ

# Name
source: Man blue
tr: Adam mavi

# Name
source: Man
tr: Adam

# Name
source: Man gold
tr: Adam altın

# Name
source: Man red
tr: Adam kırmızı

# Name
source: Man/Woman
tr: Adam/Kadın

# Name
source: MAS Gateway
tr: MAS Ağ Geçidi

# Name
source: Medium Building blue
tr: OrtaBoy Bina mavi

# Name
source: Medium Building
tr: OrtaBoy Bina

# Name
source: Medium Building subdued
tr: OrtaBoy Bina pasif

# Name
source: MGX 8000 Series Voice Gateway
tr: MGX 8000 Serisi Ses Geçidi

# Name
source: Microphone
tr: Mikrofon

# Name
source: MicroWebserver
tr: MikroWebsunucu

# Name
source: Mobile Access IP Phone
tr: Mobil Erişim IP Telefon

# Name
source: Mobile Access Router
tr: Mobil Erişim Yönlendirici

# Name
source: MoH server (Music on Hold)
tr: MoH sunucu (Bekletme Müziği)

# Name
source: Monitor
tr: Monitör

# Name
source: Multi-Fabric Server Switch
tr: Multi-Bileşenli Sunucu Anahtar

# Name
source: Multilayer Remote Switch
tr: Çok Katmanlı Uzaktan Anahtar

# Name
source: Multilayer switch
tr: Çok katmanlı anahtar

# Name
source: Multilayer Switch with Silicon
tr: Silikonlu Çok Katmanlı Anahtar

# Name
source: Multilayer Switch with Silicon subdued
tr: Silikonlu Çok Katmanlı Pasif Anahtar

# Name
source: MultiSwitch Device
tr: ÇokluAnahtar Aygıtı

# Name
source: NetFlow router
tr: NetFlow yönlendirici

# Name
source: Network Management
tr: Ağ Yönetimi

# Name
source: Optical Amplifier
tr: Optik Amfi

# Name
source: Optical Cross-Connect
tr: Optik Çapraz Bağlantı

# Name
source: Optical Fiber
tr: Optik Fiber

# Name
source: Optical Services Router
tr: Optik Hizmetler Yönlendiricisi

# Name
source: Optical Transport
tr: Optik Taşıma

# Name
source: Pager
tr: Sayfalayıcı

# Name
source: PBX Switch
tr: PBX Anahtarı

# Name
source: PC Adapter Card
tr: PC Bağdaştırıcı Kartı

# Name
source: PC Card
tr: PC Kartı

# Name
source: PC Man
tr: PC Adam

# Name
source: PC Man left
tr: PC Adam sol

# Name
source: PC Router Card
tr: PC Yönlendirici Kartı

# Name
source: PC Software
tr: PC Yazılımı

# Name
source: PC with Router-Based Software
tr: Yönlendirici-Tabanlı Yazılımlı PC

# Name
source: Phone 2
tr: Telefon 2

# Name
source: Phone Appliance
tr: Telefon Aracı

# Name
source: Phone
tr: Telefon

# Name
source: Phone Ethernet
tr: Telefon Ethernet

# Name
source: Phone/Fax
tr: Telefon/Faks

# Name
source: Phone Feature
tr: Telefon Özelliği

# Name
source: PIX Firewall
tr: PIX Güvenlik Duvarı

# Name
source: PIX Firewall Left
tr: PIX Güvenlik Duvarı Sol

# Name
source: Printer
tr: Yazıcı

# Name
source: Programmable Switch
tr: Programlanabilir Anahtar

# Name
source: Protocol Translator
tr: Protokol Dönüştürücüsü

# Name
source: Radio Tower
tr: Radyo Kulesi

# Name
source: Relational Database
tr: İlişkisel Veritabanı

# Name
source: Repeater
tr: Yineleyici

# Name
source: Router in building
tr: Binada yönlendirici

# Name
source: Router subdued
tr: Yönlendirici bastırılmış

# Name
source: Router with Firewall
tr: Güvenlik Duvarlı Yönlendirici

# Name
source: Router with Silicon Switch
tr: Silikon Anahtarlı Yönlendirici

# Name
source: Route Switch Processor
tr: Yönlendirici İşlemcisi

# Name
source: Route Switch Processor with Si
tr: Si ile Yönlendirici İşlemcisi

# Name
source: Running man
tr: Koşan adam

# Name
source: Running man subdued
tr: Bastırılmış koşan adam

# Name
source: Running woman
tr: Koşan kadın

# Name
source: Satellite
tr: Uydu

# Name
source: Satellite dish
tr: Uydu anteni

# Name
source: SC2200 (Signalling Controller)
tr: SC2200 (Sinyal Denetleyicisi)

# Name
source: Scanner
tr: Tarayıcı

# Name
source: Security appliance
tr: Güvenlik aygıtı

# Name
source: Server Switch
tr: Sunucu Anahtarı

# Name
source: Server with PC Router
tr: PC Yönlendiricili Sunucu

# Name
source: Service Control
tr: Hizmet Denetimi

# Name
source: SIP Proxy server
tr: SIP vekil sunucu

# Name
source: Sitting woman
tr: Oturan kadın

# Name
source: Small Business
tr: Küçük İş

# Name
source: Small hub
tr: Küçük hub

# Name
source: Softphone
tr: Yazılım telefonu

# Name
source: Software based server
tr: Yazılım tabanlı sunucu

# Name
source: SONET MUX
tr: SONET Uçbirim Çoklayıcı

# Name
source: Speaker
tr: Hoparlör

# Name
source: SSL Terminator
tr: SSL Sonlandırıcı

# Name
source: Standing Man
tr: Ayakta Adam

# Name
source: STB (set top box)
tr: STB

# Name
source: Storage array
tr: Depolama dizilişi

# Name
source: Storage Router
tr: Depolama Yönlendiricisi

# Name
source: Storage Solution Engine
tr: Depolama Çözüm Motoru

# Name
source: SUN workstation
tr: SUN iş istasyonu

# Name
source: Supercomputer
tr: Süper bilgisayar

# Name
source: SVX (interchangeable with End office)
tr: SVX

# Name
source: Switch Processor
tr: Anahtar İşlemcisi

# Name
source: System controller
tr: Sistem denetleyici

# Name
source: Tape array
tr: Kaset dizilişi

# Name
source: TDM router
tr: TDM yönlendirici

# Name
source: Telecommuter
tr: Telefonla çalışan

# Name
source: Telecommuter house
tr: Telefonla çalışan evi

# Name
source: Telecommuter house/router
tr: Telefonla çalışan evi/yönlendirici

# Name
source: Telecommuter house subdued
tr: Telefonla çalışan evi pasif

# Name
source: Terminal
tr: Uçbirim

# Name
source: Terminal Server
tr: Uçbirim Sunucusu

# Name
source: Truck
tr: Kamyon

# Name
source: Turret
tr: Küçük kule

# Name
source: uMG series
tr: uMG serisi

# Name
source: Unity server
tr: Unity sunucusu

# Name
source: Universal Gateway
tr: Evrensel Ağ Geçidi

# Name
source: University
tr: Üniversite

# Name
source: Video camera
tr: Video kamera

# Name
source: Video Camera right
tr: Video Kamera sağ

# Name
source: Virtual Layer Switch
tr: Sanal Katman Anahtarı

# Name
source: Voice commserver
tr: Ses İletişim Sunucusu

# Name
source: Voice ATM Switch
tr: Ses ATM Anahtarı

# Name
source: Voice router
tr: Ses yönlendiricisi

# Name
source: Voice switch 2
tr: Ses anahtarı 2

# Name
source: VPN concentrator
tr: VPN yoğunlaştırıcı

# Name
source: VPN Gateway
tr: VPN Ağ Geçidi

# Name
source: Virtual switch controller (VSC 3000)
tr: Sanal anahtar denetleyici (VSC 3000)

# Name
source: Wavelength router
tr: Dalga boyu yönlendiricisi

# Name
source: Web browser
tr: Web tarayıcısı

# Name
source: Web cluster
tr: Web kümesi

# Name
source: Wi-Fi Tag
tr: Wi-Fi Etiketi

# Name
source: Wireless Bridge
tr: Kablosuz Köprü

# Name
source: Wireless Connectivity
tr: Kablosuz Bağlantı

# Name
source: Wireless
tr: Kablosuz

# Name
source: Wireless Location Appliance
tr: Kablosuz Konum Aracı

# Name
source: Wireless router
tr: Kablosuz yönlendirici

# Name
source: Wireless Transport
tr: Kablosuz Taşıma

# Name
source: WLAN controller
tr: WLAN denetleyici

# Name
source: Woman blue
tr: Mavili kadın

# Name
source: Woman
tr: Kadın

# Name
source: Woman gold
tr: Sarılı kadın

# Name
source: Woman red
tr: Kırmızılı kadın

# Name
source: Workgroup director
tr: Çalışma grubu yöneticisi

# Name
source: Workgroup Fibre Channel intelligent switch
tr: Çalışma Grubu Fiber Kanal akıllı anahtarı

# Name
source: Workgroup switch
tr: Çalışma grubu anahtarı

# Name
source: Workgroup switch Subdued
tr: Çalışma grubu anahtarı Pasif

# Name
source: Voice switch
tr: Ses anahtarı

# Name
source: Workstation
tr: İş istasyonu

# Name
source: WWW server
tr: WWW sunucusu

# Name
source: Bivalent Vertical Rest
tr: Çift değerli dikey direkler

# Name
source: Aerator
tr: Fan

# Name
source: Backflow Preventer
tr: Geri Akış Önleyicisi

# Name
source: Basin
tr: Leğen

# Name
source: Container
tr: Taşıyıcı

# Name
source: Final-Settling Basin
tr: Son-Durultma Havuzu

# Name
source: Frequency Converter
tr: Frekans Dönüştürücüsü

# Name
source: Gas Bottle
tr: Gaz Şişesi

# Name
source: Horizontal Limiting Line
tr: Yatay Sınırlama Çizgisi

# Name
source: Horizontal Valve
tr: Yatay Vana

# Name
source: Preliminary Clarification Tank
tr: Ön Temizleme Tankı

# Name
source: Soil
tr: Toprak

# Name
source: Vertical Limiting Line
tr: Dikey Sınırlama Çizgisi

# Name
source: Vertical Propeller
tr: Dikey Pervane

# Name
source: Civil
tr: Sivil

# Name
source: Horizontal Compressor
tr: Yatay Sıkıştırıcı

# Name
source: Horizontal Pump
tr: Yatay Pompa

# Name
source: Horizontal Rest
tr: Yatay Dinlenme

# Name
source: Reference Line
tr: Kaynak Çizgisi

# Name
source: Vertical Compressor
tr: Dikey Sıkıştırıcı

# Name
source: Vertical Pump
tr: Dikey Pompa

# Name
source: Vertical Rest
tr: Dikey Dinlenme

# Name
source: Water Level
tr: Su Düzeyi

# Name
source: lamp
tr: lamba

# Name
source: Contact
tr: İletişim

# Name
source: relay
tr: röle

# Name
source: out
tr: basit çıktı değişkeni

# Name
source: outj
tr: jump-çıktı değişkeni

# Name
source: outnot
tr: if not-çıktı değişkeni

# Name
source: outrcep
tr: kapasite-çıktı değişkeni

# Name
source: outr
tr: geri dönüş-çıktı değişkeni

# Name
source: outs
tr: ayarla-çıktı değişkeni

# Name
source: sout
tr: enerji-tasarruflu, basit çıktı değişkeni

# Name
source: soutnot
tr: enerji-tasarruflu, negatif çıktı değişkeni

# Name
source: soutr
tr: enerji-tasarruflu, yeniden ayarlama çıktı değişkeni

# Name
source: souts
tr: enerji-tasarruflu, ayarlama çıktı değişkeni

# Name
source: b-integrator
tr: b-birleştiricisi

# Name
source: b-minus
tr: b-eksi

# Name
source: b-sens
tr: sensör-aşağı

# Name
source: Cybernetics
tr: Sibernetik

# Name
source: empty-func
tr: boş-işlev

# Name
source: factor-0to-1
tr: sabit faktörü 0dan-1e

# Name
source: factor-0to1
tr: sabit faktörü 0dan1e

# Name
source: factor-greater1
tr: sabit faktörü 1den büyük

# Name
source: factor-smaller-1
tr: sabit faktörü -1den küçük

# Name
source: full-wave-rectifier
tr: tam-dalga-doğrultucu

# Name
source: half-wave-rectifier
tr: yarım-dalga-doğrultucu

# Name
source: l-integrator
tr: sol entegre eden

# Name
source: l-minus
tr: sol girdi çıkarılarak toplam

# Name
source: lpf
tr: alçak geçiren filtre

# Name
source: l-sens
tr: sensör-sol

# Name
source: negative-shift
tr: negatif-kayma

# Name
source: positive-shift
tr: pozitif-kayma

# Name
source: product
tr: çarpım

# Name
source: r-integrator
tr: sağ-entegre eden

# Name
source: r-minus
tr: sağ girdi çıkarılarak toplam

# Name
source: r-sens
tr: sensör-sağ

# Name
source: saturation
tr: doygunluk

# Name
source: sigmoid
tr: S-şeklinde karakteristik

# Name
source: sine
tr: sinüs

# Name
source: sum
tr: toplam

# Name
source: t-integrator
tr: integratör-yukarı girdi

# Name
source: t-minus
tr: üst girdi soyularak toplam

# Name
source: t-sens
tr: sensör-üst

# Name
source: add h
tr: yatay toplayıcı

# Name
source: add v
tr: dikey toplayıcı

# Name
source: and h
tr: yatay VE kapısı

# Name
source: and v
tr: dikey VE kapısı

# Name
source: buff h
tr: yatay tampon kapısı

# Name
source: buff v
tr: dikey tampon kapısı

# Name
source: Digital
tr: Sayısal

# Name
source: conn
tr: bağ

# Name
source: inv h
tr: yatay NOT kapısı

# Name
source: inv v
tr: dikey NOT kapısı

# Name
source: mux h
tr: yatay çoklayıcı

# Name
source: mux v
tr: dikey çoklayıcı

# Name
source: nand h
tr: yatay NAND kapısı

# Name
source: nand v
tr: dikey NAND kapısı

# Name
source: nor h
tr: yatay NOR kapısı

# Name
source: nor v
tr: dikey NOR kapısı

# Name
source: or h
tr: yatay OR kapısı

# Name
source: or v
tr: dikey OR kapısı

# Name
source: reg h
tr: yatay regülatör

# Name
source: reg v
tr: dikey regülatör

# Name
source: xnor h
tr: yatay XNOR kapısı

# Name
source: xnor v
tr: dikey XNOR kapısı

# Name
source: xor h
tr: yatay XOR kapısı

# Name
source: xor v
tr: dikey XOR kapısı

# Name
source: And Operator
tr: VE Operatörü

# Name
source: Edpc
tr: Olaya dayalı süreç zinciri

# Name
source: Function
tr: İşlev

# Name
source: Or Operator
tr: VEYA Operatörü

# Name
source: Organisation Unit
tr: Organizasyon Birimi

# Name
source: XOR Operator
tr: XOR Operatörü

# Name
source: ckt-breaker
tr: devre kesici

# Name
source: generator
tr: üreteç

# Name
source: isolator
tr: yalıtıcı

# Name
source: transformer
tr: dönüştürücü

# Name
source: connpoint
tr: bağlantı noktası

# Name
source: Electric
tr: Elektrik

# Name
source: command
tr: komut

# Name
source: contact f
tr: kapalı devre

# Name
source: contact o
tr: açık devre

# Name
source: intpos f
tr: kapalı anahtar

# Name
source: intpos o
tr: açık anahtar

# Name
source: vcommand
tr: dkomut

# Name
source: vcontact f
tr: kapalı devre, dik

# Name
source: vcontact o
tr: açık devre, dik

# Name
source: vintpos f
tr: kapalı anahtar, dik

# Name
source: vintpos o
tr: açık anahtar, dik

# Name
source: vlamp
tr: dikey lamba

# Name
source: vrelay
tr: dikey röle

# Name
source: ampermeter
tr: ampermetre

# Name
source: antenna
tr: anten

# Name
source: bell
tr: zil

# Name
source: button
tr: düğme

# Name
source: capacitor
tr: kapasitör

# Name
source: capacitor electrolytic
tr: kondansatör elektrolitik

# Name
source: Electronic
tr: Elektronik

# Name
source: contact
tr: bağlantı

# Name
source: contact pair
tr: bağlantı çifti

# Name
source: crystal
tr: kristal

# Name
source: diac
tr: iki yönlü diyot anahtarlama

# Name
source: di gate
tr: diyot kapısı

# Name
source: diode inverse
tr: diyot ters

# Name
source: diode schottky
tr: diyot schottky

# Name
source: diode tunnel
tr: diyot tünel

# Name
source: diode zener
tr: zener diyodu

# Name
source: engine
tr: motor

# Name
source: ground
tr: toprak

# Name
source: headphone
tr: kulaklık

# Name
source: inductor
tr: indüktör

# Name
source: led display
tr: led monitör

# Name
source: microphone
tr: mikrofon

# Name
source: photo emitting part
tr: ışık yayan diyot

# Name
source: photo sensitive part
tr: ışık duyarlı diyot

# Name
source: port in
tr: girdi portu

# Name
source: port inout
tr: girdi/çıktı portu

# Name
source: port out
tr: çıktı portu

# Name
source: potentiometer
tr: potansiyometre (gerilim ölçer)

# Name
source: source current
tr: kaynak akımı

# Name
source: source
tr: kaynak

# Name
source: source substitution
tr: kaynak ikamesi

# Name
source: source voltage alternating
tr: kaynak gerilim alternatif

# Name
source: source voltage
tr: kaynak gerilim

# Name
source: source voltage direct
tr: kaynak gerilimi doğrudan

# Name
source: transistor bipolar npn 1
tr: NPN transistör

# Name
source: transistor bipolar npn 2
tr: NPN transistör 2

# Name
source: transistor bipolar pnp 1
tr: PNP transistör

# Name
source: transistor bipolar pnp 2
tr: PNP transistör 2

# Name
source: transistor jfe n
tr: transistör N-JFET

# Name
source: transistor jfe p
tr: transistör P-JFET

# Name
source: transistor misfe c n
tr: transistör N-IGFET

# Name
source: transistor misfe c p
tr: transistör P-IGFET

# Name
source: transistor misfe i n
tr: transistör N-MOSFET

# Name
source: transistor misfe i p
tr: transistör P-MOSFET

# Name
source: transistor single pn
tr: PN transistör

# Name
source: triac
tr: çift transistör

# Name
source: tyristor diode
tr: tristör diyot

# Name
source: tyristor triode
tr: tristör triyot

# Name
source: vacuum diode
tr: vakum diyot

# Name
source: vacuum pentode
tr: vakum pentot

# Name
source: vacuum triode
tr: vakum triyot

# Name
source: variable linear part
tr: değişken doğrusal eleman

# Name
source: variable nonlinear part
tr: değişken doğrusal olmayan elema

# Name
source: varicap
tr: tuning diyot

# Name
source: voltmeter
tr: voltmetre

# Name
source: Afghanistan
tr: Afganistan

# Name
source: Albania
tr: Arnavutluk

# Name
source: Algeria
tr: Cezayir

# Name
source: Andorra
tr: Andora

# Name
source: Angola
tr: Angora

# Name
source: Antarctica
tr: Antartika

# Name
source: Antigua And Barbuda
tr: Antigua ve Barbuda

# Name
source: Argentina
tr: Arjantin

# Name
source: Armenia
tr: Ermenistan

# Name
source: Australia
tr: Avustralya

# Name
source: Austria
tr: Avusturya

# Name
source: Azerbaijan
tr: Azerbaycan

# Name
source: Bahamas
tr: Bahamalar

# Name
source: Bahrain
tr: Bahreyn

# Name
source: Bangladesh
tr: Bangladeş

# Name
source: Belarus
tr: Beyaz Rusya

# Name
source: Belgium
tr: Belçika

# Name
source: Bolivia
tr: Bolivya

# Name
source: Bosnia And Herzegovina
tr: Bosna Hersek

# Name
source: Brazil
tr: Brezilya

# Name
source: Brunei Darussalam
tr: Brunei Sultanlığı

# Name
source: Bulgaria
tr: Bulgaristan

# Name
source: Cambodia
tr: Kamboçya

# Name
source: Cameroon
tr: Kamerun

# Name
source: Canada
tr: Kanada

# Name
source: Central African Republic
tr: Orta Afrika Cumhuriyeti

# Name
source: Chad
tr: Çad

# Name
source: Chile
tr: Şili

# Name
source: China Hong Kong
tr: Çin Hong Kongu

# Name
source: China Macao
tr: Çin Macaosu

# Name
source: China (PRC)
tr: Çin (PRC)

# Name
source: China (ROC)
tr: Çin (ROC)

# Name
source: Flags
tr: Bayraklar

# Name
source: Colombia
tr: Kolombiya

# Name
source: Comoros
tr: Komor

# Name
source: Congo Brazzaville
tr: Kongo Cumhuriyeti

# Name
source: Congo Kinshasa
tr: Demokratik Kongo Cumhuriyeti

# Name
source: Costa Rica
tr: Kostarika

# Name
source: Cote d'Ivoire
tr: Fildişi Sahili

# Name
source: Croatia
tr: Hırvatistan

# Name
source: Cuba
tr: Küba

# Name
source: Cyprus
tr: Kıbrıs

# Name
source: Czechia
tr: Çekya

# Name
source: Denmark
tr: Danimarka

# Name
source: Djibouti
tr: Cibuti

# Name
source: Dominica
tr: Dominik

# Name
source: Dominican Republic
tr: Dominik Cumhuriyeti

# Name
source: Ecuador
tr: Ekvador

# Name
source: Egypt
tr: Mısır

# Name
source: Equatorial Guinea
tr: Ekvator Ginesi

# Name
source: Eritrea
tr: Eritre

# Name
source: Estonia
tr: Estonya

# Name
source: Ethiopia
tr: Etiyopya

# Name
source: European Union
tr: Avrupa Birliği

# Name
source: Finland
tr: Finlandiya

# Name
source: France
tr: Fransa

# Name
source: Gambia
tr: Gambiya

# Name
source: Georgia
tr: Gürcistan

# Name
source: Germany
tr: Almanya

# Name
source: Ghana
tr: Gana

# Name
source: Greece
tr: Yunanistan

# Name
source: Guinea
tr: Gine

# Name
source: Guyana
tr: Guana

# Name
source: Hungary
tr: Macaristan

# Name
source: Iceland
tr: İzlanda

# Name
source: India
tr: Hindistan

# Name
source: Indonesia
tr: Endonezya

# Name
source: Iraq
tr: Irak

# Name
source: Ireland
tr: İrlanda

# Name
source: Israel
tr: İsrail

# Name
source: Italy
tr: İtalya

# Name
source: Jamaica
tr: Jameika

# Name
source: Japan
tr: Japonya

# Name
source: Jordan
tr: Ürdün

# Name
source: Kazakhstan
tr: Kazakistan

# Name
source: Kuwait
tr: Kuveyt

# Name
source: Kyrgyzstan
tr: Kırgızistan

# Name
source: Latvia
tr: Letonya

# Name
source: Lebanon
tr: Lübnan

# Name
source: Lesotho
tr: Lesoto Krallığı

# Name
source: Liberia
tr: Liberya

# Name
source: Libyan Arab Jamahiriya
tr: Libya Arap Cumhuriyeti

# Name
source: Liechtenstein
tr: Lihtenştayn

# Name
source: Lithuania
tr: Litvanya

# Name
source: Luxembourg
tr: Lüksemburg

# Name
source: Macedonia
tr: Makedonya

# Name
source: Madagascar
tr: Madagaskar

# Name
source: Malawi
tr: Malavi

# Name
source: Malaysia
tr: Malezya

# Name
source: Maldives
tr: Maldivler

# Name
source: Marshall Islands
tr: Marşal Adaları

# Name
source: Mauritania
tr: Moritanya

# Name
source: Mexico
tr: Meksika

# Name
source: Micronesia
tr: Miktonezya

# Name
source: Mongolia
tr: Moğolistan

# Name
source: Montenegro
tr: Karadağ

# Name
source: Morocco
tr: Fas

# Name
source: Mozambique
tr: Mozambik

# Name
source: Namibia
tr: Namibya

# Name
source: Netherlands Antilles
tr: Hollanda Antilleri

# Name
source: Netherlands
tr: Hollanda

# Name
source: New Zealand
tr: Yeni Zellanda

# Name
source: Nicaragua
tr: Nikaragua

# Name
source: Niger
tr: Nijerya

# Name
source: Nigeria
tr: Nijerya

# Name
source: North Korea
tr: Kuzey Kore

# Name
source: Norway
tr: Norveç

# Name
source: Olympic
tr: Olimpik

# Name
source: Oman
tr: Umman

# Name
source: Palestine
tr: Filistin

# Name
source: Papua New Guinea
tr: Papua Yeni Gine

# Name
source: Philippines
tr: Filipinler

# Name
source: Poland
tr: Polonya

# Name
source: Portugal
tr: Portekiz

# Name
source: Qatar
tr: Katar

# Name
source: Romania
tr: Romanya

# Name
source: Russian Federation
tr: Rusya Federasyonu

# Name
source: Rwanda
tr: Ruanda

# Name
source: Saudi Arabia
tr: Suudi Arabistan

# Name
source: Serbia
tr: Sırbistan

# Name
source: Singapore
tr: Singapur

# Name
source: Slovakia
tr: Slovakya

# Name
source: Slovenia
tr: Slovenya

# Name
source: Solomon Islands
tr: Solomon Adaları

# Name
source: Somalia
tr: Somali

# Name
source: South Africa
tr: Güney Afrika

# Name
source: South Korea
tr: Güney Kore

# Name
source: Spain
tr: İspanya

# Name
source: Switzerland
tr: İsviçre

# Name
source: Suriname
tr: Surinam

# Name
source: Sweden
tr: İsveç

# Name
source: Syrian Arab Republic
tr: Suriya Arap Cumhuriyeti

# Name
source: Tajikistan
tr: Tacikistan

# Name
source: Tanzania
tr: Tanzanya

# Name
source: Thailand
tr: Tayland

# Name
source: Timor-Leste
tr: Doğu Timor

# Name
source: Tunisia
tr: Tunus

# Name
source: Turkey
tr: Türkiye

# Name
source: Turkmenistan
tr: Türkmenistan

# Name
source: Ukraine
tr: Ukrayna

# Name
source: United Arab Emirates
tr: Birleşik Arap Emirlikleri

# Name
source: United Kingdom
tr: Büyük Britanya

# Name
source: United Nations
tr: Birleşmiş Milletler

# Name
source: United States
tr: Amerika Birleşik Devletleri

# Name
source: Uzbekistan
tr: Özbekistan

# Name
source: Vatican
tr: Vatikan

# Name
source: Venezuela
tr: Venezuella

# Name
source: Wake Island
tr: Wake Adası

# Name
source: Western Sahara
tr: Batı Sahra

# Name
source: Zimbabwe
tr: Zimbabve

# Name
source: Alternative External Entity
tr: Alternatif Harici Öge

# Name
source: Gane and Sarson
tr: Gane ve Sarson

# Name
source: Data Store
tr: Veri Deposu

# Name
source: External Entity
tr: Harici Öge

# Name
source: Jigsaw
tr: Yapboz

# Name
source: part iiii
tr: parça iiii

# Name
source: part iiio
tr: parça iiio

# Name
source: part iioi
tr: parça iioi

# Name
source: part iioo
tr: parça iioo

# Name
source: part ioii
tr: parça ioii

# Name
source: part ioio
tr: parça ioio

# Name
source: part iooi
tr: parça iooi

# Name
source: part iooo
tr: parça iooo

# Name
source: part oiii
tr: parça oiii

# Name
source: part oiio
tr: parça oiio

# Name
source: part oioi
tr: parça oioi

# Name
source: part oioo
tr: parça oioo

# Name
source: part ooii
tr: parça ooii

# Name
source: part ooio
tr: parça ooio

# Name
source: part oooi
tr: parça oooi

# Name
source: part oooo
tr: parça oooo

# Name
source: ACL
tr: EKL

# Name
source: Blacklight
tr: Siyah Işık

# Name
source: Blinders
tr: Körleştiriciler

# Name
source: Lights
tr: Işıklar

# Name
source: ERS
tr: Eliptik reflektör ile farlar

# Name
source: Fresnel
tr: Fresnel lens ile far

# Name
source: Moving head
tr: Hareketli kafa

# Name
source: PAR
tr: PAR Işık

# Name
source: PAR floor
tr: Far standı

# Name
source: Pebble Convex lantern
tr: PC spot

# Name
source: Striplight
tr: Tüp lambası

# Name
source: Stroboscope light
tr: Strobe ışığı

# Name
source: Structure
tr: Yapı

# Name
source: And
tr: Ve

# Name
source: Buffer
tr: Tampon

# Name
source: Logic
tr: Mantık

# Name
source: Connector
tr: Bağlayıcı

# Name
source: Inverter
tr: Çevirici

# Name
source: Or
tr: Veya

# Name
source: Associator
tr: İlişkilendirici

# Name
source: Channel Network
tr: Kanal Ağı

# Name
source: Converter
tr: Dönüştürücü

# Name
source: Decider
tr: Karar Verici

# Name
source: Decoder
tr: Kod Çözücü

# Name
source: Decode Subsystem
tr: KodÇözme Altsistemi

# Name
source: Distributor
tr: Dağıtıcı

# Name
source: Encoder
tr: Kodlayıcı

# Name
source: Encode Subsystem
tr: Kodlama Altsistemi

# Name
source: Extruder
tr: Uzatıcı

# Name
source: Ingestor
tr: Pikap
