Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/calligra._desktop_.po
Languages: tr

# Name
source: Internal Transducer
tr: Dahili Sinyal Üretici

# Name
source: Input Transducer
tr: Girdi Sinyal Vericisi

# Name
source: Memory
tr: Bellek

# Name
source: ME Storage
tr: ME Depolama Aygıt

# Name
source: Output Transducer
tr: Çıktı Sinyal Vericisi

# Name
source: Producer
tr: Üretici

# Name
source: Reproducer
tr: Çoğaltıcı

# Name
source: Supporter
tr: Destekleyen

# Name
source: Timer
tr: Sayaç

# Name
source: Block1
tr: Blok1

# Name
source: Block2
tr: Blok2

# Name
source: Block3
tr: Blok3

# Name
source: Block4
tr: Blok4

# Name
source: Block5
tr: Blok5

# Name
source: Block6
tr: Blok6

# Name
source: Block7
tr: Blok7

# Name
source: Car1
tr: Araba1

# Name
source: Car2
tr: Araba2

# Name
source: Map
tr: Harita

# Name
source: Corner1
tr: Köşe 1

# Name
source: Corner2
tr: Köşe 2

# Name
source: Crossroads
tr: Kavşak

# Name
source: Elevated
tr: Yükseltilmiş

# Name
source: Factory
tr: Fabrika

# Name
source: FootBridge
tr: Yaya Köprüsü

# Name
source: OneWay
tr: Tek Yön

# Name
source: RedCar
tr: Kırmızı Araba

# Name
source: River
tr: Nehir

# Name
source: Road1
tr: Yol1

# Name
source: Roof1
tr: Çatı1

# Name
source: StraightRoad1
tr: Düz Yol1

# Name
source: T-Junction
tr: T-Kavşak

# Name
source: Train1
tr: Tren 1

# Name
source: Train2
tr: Tren 2

# Name
source: Tree1
tr: Ağaç 1

# Name
source: Misc
tr: Çeşitli

# Name
source: expended node
tr: katlanmamış düğüm

# Name
source: expansible node
tr: açılabilir düğüm

# Name
source: File
tr: Dosya

# Name
source: Folder
tr: Klasör

# Name
source: Demultiplexer
tr: Azlayıcı

# Name
source: Large Extension Node
tr: Büyük Uzantı Düğümü

# Name
source: Multiplexer
tr: Çoklayıcı

# Name
source: Node Center
tr: Düğüm Merkezi

# Name
source: Small Extension Node
tr: Küçük Uzantı Düğümü

# Name
source: Tactical Satellite Communications Terminal
tr: Taktiksel Uydu Bağlantı Uçbirimi

# Name
source: Network
tr: Ağ

# Name
source: General Computer (Tower)
tr: Genel Bilgisayar (Dikey)

# Name
source: An external DAT drive
tr: Harici DAT sürücüsü

# Name
source: Digitizing Board
tr: Sayısallaştırma Panosu

# Name
source: Storage
tr: Depolama

# Name
source: A Diskette
tr: Disket

# Name
source: WAN Connection
tr: WAN Bağlantısı

# Name
source: General Monitor (With Stand)
tr: Genel Monitör (Ayaklı)

# Name
source: A Mobile Phone
tr: Cep Telefonu

# Name
source: Modular Switch
tr: Modüler Anahtar

# Name
source: A Workstation Monitor
tr: İş İstasyonu Monitörü

# Name
source: Patch Panel
tr: Yama Panosu

# Name
source: A Bigtower PC
tr: Büyük Kasalı PC

# Name
source: A Desktop PC
tr: Masaüstü Bilgisayar

# Name
source: A Miditower PC
tr: Orta Kasalı PC

# Name
source: A Minitower PC
tr: Küçük Kasalı PC

# Name
source: Plotter
tr: Çizici

# Name
source: General Printer
tr: Genel Yazıcı

# Name
source: RJ45 Wall-Plug
tr: RJ45 duvar-fişi

# Name
source: Router Symbol
tr: Yönlendirici Sembolü

# Name
source: scEAD Wall-Plug
tr: scEAD duvar-fişi

# Name
source: An amplifier speaker
tr: Bir amplifikatör hoparlör

# Name
source: A speaker
tr: Hoparlör

# Name
source: Switch ATM Symbol
tr: Anahtar ATM Sembolü

# Name
source: Switch Symbol
tr: Anahtar Sembolü

# Name
source: A Telephone
tr: Telefon

# Name
source: A Workstation
tr: Bir İş istasyonu

# Name
source: A ZIP Disk
tr: Zip Disk

# Name
source: Variable Attenuator
tr: Değişken Zayıflatıcı

# Name
source: Beam
tr: Işın

# Name
source: Circulator
tr: Devir ettirici

# Name
source: Optics
tr: Optik

# Name
source: Coupler
tr: Çoğaltıcı

# Name
source: Coupler (vertical)
tr: Çoğaltıcı (dikey)

# Name
source: Detector (vertical)
tr: Detektör (dikey)

# Name
source: DFB Laser
tr: DFB Lazer

# Name
source: DFB Laser (vertical)
tr: DFB Lazer (dikey)

# Name
source: EDFA (vertical)
tr: EDFA (dikey)

# Name
source: Fibre
tr: Fiber

# Name
source: Fibre (vertical)
tr: Fiber (dikey)

# Name
source: Isolator
tr: Yalıtkan

# Name
source: Isolator (vertical)
tr: Yalıtkan (dikey)

# Name
source: LPG (vertical)
tr: LPG (dikey)

# Name
source: MZ Modulator
tr: MZ Modülatör

# Name
source: MZ Modulator (vertical)
tr: MZ Modülatör (dikey)

# Name
source: Phase Modulator
tr: Faz Modülatör

# Name
source: Phase Modulator (vertical)
tr: Faz Modülatör (dikey)

# Name
source: Polarisation Control
tr: Polarizasyon Denetimi

# Name
source: Polarisation Control (vertical)
tr: Polarizasyon Denetimi (dikey)

# Name
source: Oscilloscope
tr: Salınımölçer

# Name
source: Spectrum
tr: Tayf

# Name
source: Tuneable Coupler
tr: Ayarlanabilir Çoğaltıcı

# Name
source: Wave
tr: Dalga

# Name
source: Pneumatic
tr: Havalı

# Name
source: comelec1
tr: elektrik1 denetimi

# Name
source: comelec2
tr: elektrik2 denetimi

# Name
source: commusc
tr: kas denetimi

# Name
source: compb
tr: düğme denetimi

# Name
source: compilh
tr: hidrolik denetimi

# Name
source: compilp
tr: havalı denetim

# Name
source: compush
tr: itici denetim

# Name
source: comspr
tr: yay denetimi

# Name
source: DEJack
tr: İki uzak silindir

# Name
source: drain
tr: hava çıkış memesi

# Name
source: press
tr: genel basınç kaynağı

# Name
source: presshy
tr: Hidrolik basınç kaynağı

# Name
source: presspn
tr: havalı basınç kaynağı

# Name
source: SEIJack
tr: Tek yönlü tekli silindir

# Name
source: SEOJack
tr: Tek yönlü tek kulllanımlık silindir

# Name
source: Racks
tr: Raflar

# Name
source: Equipment 10U
tr: Ekipman 10U

# Name
source: Equipment 11U
tr: Ekipman 11U

# Name
source: Equipment 12U
tr: Ekipman 12U

# Name
source: Equipment 1U
tr: Ekipman 1U

# Name
source: Equipment 2U
tr: Ekipman 2U

# Name
source: Equipment 3U
tr: Ekipman 3U

# Name
source: Equipment 4U
tr: Ekipman 4U

# Name
source: Equipment 5U
tr: Ekipman 5U

# Name
source: Equipment 6U
tr: Ekipman 6U

# Name
source: Equipment 7U
tr: Ekipman 7U

# Name
source: Equipment 8U
tr: Ekipman 8U

# Name
source: Equipment 9U
tr: Ekipman 9U

# Name
source: Power Strip BS 7
tr: Çoklu soket BS 7

# Name
source: Power Strip Schuko 8
tr: Çoklu soket schuko 8

# Name
source: Power Strip UTE 8
tr: Çoklu soket UTE 8

# Name
source: Label Anchors 42U
tr: Etiket sabitleyici 42U

# Name
source: place
tr: konum

# Name
source: place marquee
tr: yer işareti

# Name
source: transition
tr: geçiş

# Name
source: timed transition
tr: zamanlı geçiş

# Name
source: Renewable Energy
tr: Yenilenebilir Enerji

# Name
source: Cup Anemometer
tr: Fincan Anemometre

# Name
source: Data Logger
tr: Veri Kaydedici

# Name
source: Wind Measurement Tower
tr: Rüzgâr Ölçüm Kulesi

# Name
source: Solar Module
tr: Güneş Modülü

# Name
source: Temperature and Humidity Sensor
tr: Sıcaklık ve Nem Algılayıcısı

# Name
source: Wind Turbine
tr: Rüzgâr Türbini

# Name
source: Wind Vane
tr: Rüzgâr Gülü

# Name
source: appearance
tr: görünüş

# Name
source: callback
tr: geriçağırma

# Name
source: camera
tr: kamera

# Name
source: Scenegraph
tr: Skenograf

# Name
source: component
tr: bileşen

# Name
source: field
tr: alan

# Name
source: group
tr: grup

# Name
source: light
tr: hafif

# Name
source: manipulator
tr: manipülatör

# Name
source: metric
tr: metrik

# Name
source: nodekit
tr: bağgrubu

# Name
source: property
tr: özellik

# Name
source: realtimeglobalfield
tr: gerçekzamanlıgenelalan

# Name
source: separator
tr: ayırıcı

# Name
source: shape
tr: şekil

# Name
source: soselection
tr: sahne seçimi

# Name
source: subgraph
tr: alt grafik

# Name
source: switch
tr: anahtar

# Name
source: transform
tr: dönüşüm

# Name
source: Block
tr: Blok

# Name
source: Comment
tr: Yorum

# Name
source: Function Header
tr: İşlev Başlığı

# Name
source: InOut
tr: GirdiÇıktı

# Name
source: Macro
tr: Makro

# Name
source: Note
tr: Not

# Name
source: Receive
tr: Al

# Name
source: Return
tr: Dönmek

# Name
source: Save
tr: Kaydet

# Name
source: Send
tr: Gönder

# Name
source: Service
tr: Hizmet

# Name
source: State
tr: Durum

# Name
source: Stop
tr: Durdur

# Name
source: Client Application
tr: İstemci Uygulaması

# Name
source: Dataserver
tr: Veri Sunucusu

# Name
source: Log Transfer Manager/Rep Agent
tr: Sistem Günlüğü Aktarma Yöneticisi/Çoğaltma Aracı

# Name
source: Replication Server
tr: Çoğaltma Sunucusu

# Name
source: Replication Server Manager
tr: Çoğaltma Sunucu Yöneticisi

# Name
source: Stable Queue
tr: Kararlı Kuyruk

# Name
source: Value Stream Mapping
tr: Değer Akışı Haritalama

# Name
source: Happy Face
tr: Mutlu Yüz

# Comment
source: Calligra Application
tr: Calligra Uygulaması

# Name
source: Calligra Deferred Loading Plugin
tr: Calligra Gecikmeli Yükleme Eklentisi

# Comment
source: Calligra Filter
tr: Calligra Süzgeci

# Comment
source: Calligra Component
tr: Calligra Bileşeni

# Name
source: Calligra Sheets
tr: Calligra Tablolar

# GenericName
source: Spreadsheet
tr: Hesap Tablosu

# Comment
source: Write spreadsheet documents
tr: Hesap tabloları oluşturun

# Name
source: Balance Sheet
tr: Hesap Çizelgesi

# Name
source: Business
tr: İş

# Name
source: Expense Report
tr: Gider Raporu

# Name
source: Invoice
tr: Bildirim

# Name
source: Packing Slip
tr: Paket

# Name
source: Price Quotation
tr: Fiyat Kotasyonları

# Name
source: General
tr: Genel

# Name
source: Student ID Card
tr: Öğrenci Kimlik Kartı

# Name
source: Blank Worksheet
tr: Boş Çalışma Sayfası

# Name
source: BMI Calculator
tr: BMI Hesap Makinesi

# Comment
source: Simple Body Mass Index Calculator
tr: Basit Vücut Kütle Endeksi Hesaplayıcı

# Name
source: Credit Card Tracker
tr: Kredi Kartı Takipçisi

# Name
source: Home and Family
tr: Ev ve Aile

# Name
source: Menu Plan
tr: Menü Yerleşimi

# Name
source: Vacation Checklist
tr: İzin Takibi

# Comment
source: Plugin for Calligra Sheets
tr: Calligra Tablolar için eklenti

# Comment
source: GUI functionality for Sheets
tr: Tablolar’ın grafik kullanıcı arayüzü

# Name
source: Calligra Stage
tr: Calligra Sahne

# GenericName
source: Presentation
tr: Sunum

# Comment
source: Write presentation documents
tr: Sunum belgeleri oluşturun

# Comment
source: Page effect plugin for Calligra Stage
tr: Calligra Sahne için sayfa efekti eklentisi

# Comment
source: Shape animation plugin for Calligra Stage
tr: Calligra Sahne için şekil canlandırması eklentisi

# Comment
source: Tool for Calligra Stage
tr: Calligra Sahne Araç

# Name
source: Empty
tr: Boş

# Comment
source: Empty presentation
tr: Boş sunu

# Name
source: Empty 16:10
tr: Boş 16:10

# Comment
source: Empty presentation 10:16
tr: Boş sunu 10:16

# Name
source: Blue Orange Vector
tr: Mavi Turuncu Vektör

# Comment
source: Blue Orange Vector
tr: Mavi Turuncu Vektör

# Name
source: Burning Desire
tr: Ateşli Arzu

# Comment
source: Burning Desire
tr: Ateşli Arzu

# Comment
source: Business
tr: İş

# Name
source: Cohere
tr: Yapışık

# Comment
source: Cohere designed presentation template
tr: Yapışık tasarımlı sunum şablonu

# Name
source: Curious Penguin
tr: Meraklı Penguen

# Comment
source: Curious Penguin
tr: Meraklı Penguen

# Name
source: Templates
tr: Şablonlar

# Name
source: Flood Light
tr: Taşan Işık

# Comment
source: Flood Light
tr: Akış Işığı

# Name
source: KDE Events
tr: KDE Olaylar

# Comment
source: KDE Events
tr: KDE Olaylar

# Name
source: Rounded Square
tr: Yuvarlatılmış Kare

# Comment
source: Rounded Square
tr: Yuvarlatılmış Kare

# Name
source: Simple Waves
tr: Basit Dalgalar

# Comment
source: Simple Waves
tr: Basit Dalgalar

# Name
source: Skyline
tr: Ufuk Çizgisi

# Comment
source: Skyline Monotone
tr: Ufuk Çizgisi Tekdüze

# Name
source: Skyline Wide
tr: Ufuk Çizgisi Geniş

# Comment
source: Skyline Monotone Wide
tr: Ufuk Çizgisi Tekdüze Geniş

# Comment
source: Skyline Morning
tr: Ufuk Çizgisi Sabah

# Comment
source: Skyline Morning Wide
tr: Ufuk Çizgisi Sabah Geniş

# Comment
source: Skyline Night
tr: Ufuk Çizgisi Gece

# Comment
source: Skyline Night Wide
tr: Ufuk Çizgisi Gece Geniş

# Name
source: Strange Far Hills
tr: Garip Uzak Tepeler

# Comment
source: Strange Far Hills
tr: Garip Uzak Tepeler

# Name
source: Screen
tr: Ekran

# GenericName
source: Word Processor
tr: Sözcük İşlemcisi

# Comment
source: Write documents
tr: Belgeler oluşturun

# Name
source: Blank Document
tr: Boş Belge

# Comment
source: Creates a blank A4 document, with a small page margin.
tr: Küçük sayfa kenarlıklarıyla boş bir A4 belgesi oluşturur

# Name
source: Colorful Document
tr: Renkli Belge

# Comment
source: A two-column template with stylishly colored headers and footers
tr: Üst başlık ve dipnotları süslüce renklendirilmiş bir iki sütunlu şablon.

# Name
source: Blank Documents
tr: Boş Belgeler

# Name
source: Fax Template
tr: Faks Şablonu

# Comment
source: A template to quickly create a facsimile communication
tr: Tez bir faks bağlantısı yaratmak için bir şablon

# Name
source: Professional Letter
tr: Profesyonel Mektup

# Comment
source: Creates a blank document with wide margins for professional looking documents
tr: Profesyonel görünümlü belgeler için geniş kenar boşluklu boş bir belge oluşturur
