Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/calligra._desktop_.po
Languages: tr

# Comment
source: Extensions for Braindump
tr: Braindump için uzantılar

# GenericName
source: Notes and idea gathering
tr: Not ve Fikir Toplayıcısı

# Name
source: Illustration Document...
tr: İllüstrasyon Belgesi...

# Comment
source: New Karbon document:
tr: Yeni Karbon belgesi:

# Name
source: Presentation Document...
tr: Sunum Belgesi...

# Comment
source: New Stage presentation document:
tr: Yeni Sahne sunum belgesi:

# Name
source: Spread Sheet Document...
tr: Hesap Tablosu Belgesi...

# Comment
source: New Sheets document:
tr: Yeni Tablolar belgesi

# Name
source: Text Document...
tr: Metin Belgesi...

# Comment
source: New Words document:
tr: Yeni Sözcükler belgesi

# GenericName
source: Document Viewer
tr: Belge Görüntüleyicisi

# Name
source: Print with Karbon...
tr: Karbon ile Yazdır...

# Name
source: Print with Calligra Sheets...
tr: Calligra Tablolar ile Yazdır...

# Name
source: Print with Calligra Stage...
tr: Calligra Sahne ile Yazdır...

# Name
source: Print with Calligra Words...
tr: Calligra Sözcükler ile Yazdır...

# Name
source: Calligra Words
tr: Calligra Sözcükler

# GenericName
source: Word Processing and Presentation
tr: Sözcük İşleme ve Sunum

# Comment
source: Docker for Karbon
tr: Karbon için Docker

# Comment
source: GUI functionality for Karbon
tr: Karbon için Arayüz işlevi

# GenericName
source: Scalable Graphics
tr: Ölçeklenebilir Grafikler

# Comment
source: Create scalable vector drawings
tr: Ölçeklendirilebilir vektör çizimler oluşturun

# Name
source: Basic
tr: Temel

# Name
source: Empty Document
tr: Boş Belge

# Comment
source: Creates an empty document
tr: Boş bir belge oluşturun

# Comment
source: Office Suite
tr: Ofis Paketi

# Name
source: Filter effect definition
tr: Süzgeç efekt tanımı

# Comment
source: Definition of a flake filter effect
tr: Bir pul süzgeci efekti tanımı

# Name
source: Shape border definition
tr: Şekil kenarlığı tanımlaması

# Comment
source: Definition of a flake shape border
tr: Bir pul şekli kenarlığı tanımı

# Name
source: Flake Plugin
tr: Flake Eklentisi

# Comment
source: A plugin that contains a set of a shape and a tool
tr: Bir şekil ve bir aracı içeren bir eklenti

# Name
source: Flake device definition
tr: Flake aygıt tanımlaması

# Comment
source: Definition of flake devices
tr: Izgara aygıtlarının tanımı

# Name
source: Shape definition
tr: Şekil tanımlaması

# Comment
source: Definition of a flake shape object
tr: Izgara şekilli nesnenin tanımı

# Name
source: Flake tool definition
tr: Flake araç tanımlaması

# Comment
source: Definition of flake tools
tr: Flake araçlarının tanımlaması

# Name
source: Presentation Event Action Plugin
tr: Sunum Olay Durumu Eklentisi

# Comment
source: A plugin that contains a presentation event action
tr: Sunum olay durumu içeren bir eklenti

# Name
source: Script Event Action Plugin
tr: Betik Olay Durumu Eklentisi

# Comment
source: A plugin that contains a script event action
tr: Betik olay durumunu içeren bir eklenti

# Name
source: Calligra Docker Plugin
tr: Calligra Docker Eklentisi

# Comment
source: A plugin that contains a so called 'dockwidget'
tr: Sözde “dockwidget” içeren bir eklenti

# Comment
source: Tool for Calligra Page Applications
tr: Calligra Sayfa uygulaması için araç

# Comment
source: A module implementing a complete colorspace for use with Pigment Color Manipulation System
tr: Pigment Rengi ile kullanmak için tüm renk uzayını oluşturan bir modül

# Comment
source: A module implementing an extension to a colorspace of the Pigment Color Manipulation System
tr: Pigment Rengi ile kullanmak için renk uzayını oluşturan bir modül

# Name
source: Semantic item definition
tr: Anlamsal öge tanımlaması

# Comment
source: Definition of a semantic item object
tr: Bir anlamsal öge nesnesinin tanımı

# Name
source: Inline Text Object Plugin
tr: Satır Metni Nesnesi Eklentisi

# Comment
source: Definition of a text object
tr: Bir metin nesnesinin tanımı

# Name
source: Text Editing plugin for the Calligra text tool
tr: Calligra metin aracı için metin düzenleme eklentisi

# Comment
source: Definition of a text-editing plugin
tr: Metin düzenleme eklentisi tanımı

# Name
source: Chevron
tr: Ters V

# Name
source: Down Arrow
tr: Aşağı Ok

# Name
source: Left Arrow
tr: Sol Ok

# Name
source: Notched Left Arrow
tr: Çentikli Sol Ok

# Name
source: Left-Right Arrow
tr: Sol-Sağ Ok

# Name
source: Left-Right-Up Arrow
tr: Sol-Sağ-Yukarı Ok

# Name
source: Left-Up Arrow
tr: Sol-Yukarı Ok

# Name
source: Pentagon
tr: Beşgen

# Name
source: Quad Arrow
tr: Dörtlü Ok

# Name
source: Right Arrow
tr: Sağ Ok

# Name
source: Notched Right Arrow
tr: Çentikli Sağ Ok

# Name
source: Turn-Up Arrow
tr: Yukarı Dönen Ok

# Name
source: Up Arrow
tr: Yukarı Ok

# Name
source: Up-Down Arrow
tr: Yukarıdan Aşağı Ok

# Name
source: Up-Down-Left Arrow
tr: Yukarıdan Aşağı Sola Ok

# Name
source: Perfect Circle
tr: Mükemmel Çember

# Name
source: Quarter Circle
tr: Çeyrek Çember

# Name
source: Assorted
tr: Çeşitli

# Name
source: Maltese Cross
tr: Malta Haçı

# Name
source: Swiss Cross
tr: Haç

# Name
source: Diamond
tr: Elmas

# Name
source: Heart
tr: Kalp

# Name
source: Heptagon
tr: Yedigen

# Name
source: Hexagon
tr: Altıgen

# Name
source: Quarter Moon
tr: Çeyrek Ay

# Name
source: Octogon
tr: Sekizgen

# Name
source: Horizontal Parallelogram
tr: Yatay Paralelkenar

# Name
source: Vertical Parallelogram
tr: Dikey Paralelkenar

# Name
source: Perfect Square
tr: Tam Kare

# Name
source: Curved Four Point Star
tr: Eğimli Dört Noktalı Yıldız

# Name
source: Four Point Star
tr: Dört Noktalı Yıldız

# Name
source: Five Point Star
tr: Beş Noktalı Yıldız

# Name
source: Six Point Star
tr: Altı Noktalı Yıldız

# Name
source: Seven Point Star
tr: Yedi Noktalı Yıldız

# Name
source: Curved Eight Point Star
tr: Eğimli Sekiz Noktalı Yıldız

# Name
source: Eight Point Star
tr: Sekiz Noktalı Yıldız

# Name
source: Sharp Eight Point Star
tr: Keskin Sekiz Noktalı Yıldız

# Name
source: Sun
tr: Güneş

# Name
source: Trapezoid
tr: Yamuk

# Name
source: Isosceles Triangle
tr: İkizkenar Üçgen

# Name
source: Right Angle Triangle
tr: Sağ Açılı Üçgen

# Name
source: Card
tr: Kart

# Name
source: Basic Flowchart
tr: Temel Akış Şeması

# Name
source: Database
tr: Veritabanı

# Name
source: Data
tr: Veri

# Name
source: Decision
tr: Karar

# Name
source: Delay
tr: Ertele

# Name
source: Direct Data
tr: Doğrudan Veri

# Name
source: Display
tr: Görüntüle

# Name
source: Document
tr: Belge

# Name
source: Internal Storage
tr: İç Depolama

# Name
source: Loop Limit
tr: Döngü Sınırı

# Name
source: Manual Input
tr: Manuel Girdi

# Name
source: Manual Operation
tr: El ile İşlem

# Name
source: Off-page Reference
tr: Kapalı Sayfa Referansı

# Name
source: Paper Tape
tr: Kâğıt Bant

# Name
source: Parallel Mode
tr: Paralel Kipi

# Name
source: Predefined Process
tr: Öntanımlı Süreç

# Name
source: Preparation
tr: Hazırlama

# Name
source: Process
tr: Süreç

# Name
source: Sequential Data
tr: Sıralı Veriler

# Name
source: Start 1
tr: Başlat 1

# Name
source: Start 2
tr: Başlat 2

# Name
source: Stored Data
tr: Depolanan Veriler

# Name
source: Terminator
tr: Sonlandırıcı

# Name
source: Activity-Looping
tr: Etkinlik Döngüsü

# Name
source: Ad-Hoc-Collapsed-Sub-Process
tr: Kendiliğinden Çöken Alt Süreç

# Name
source: Collapsed-Sub-Process
tr: Çöken Alt Süreç

# Name
source: Compensation-Collapsed-Sub-Process
tr: Düzeltme-Çöken-Alt-Süreç

# Name
source: Compensation
tr: Geri Alma

# Name
source: Data-Object
tr: Veri Nesnesi

# Name
source: End-Event-Cancel
tr: Son Etkinlik İptal

# Name
source: End-Event-Compensation
tr: Son Etkinlik Düzeltme

# Name
source: End-Event
tr: Son Etkinlik

# Name
source: End-Event-Error
tr: Son Etkinlik Hata

# Name
source: End-Event-Link
tr: Son Etkinlik Bağlantı

# Name
source: End-Event-Message
tr: Son Etkinlik İleti

# Name
source: End-Event-Multiple
tr: Son Etkinlik Çoklu

# Name
source: End-Event-Terminate
tr: Son Etkinlik Sonlandır

# Name
source: Gateway-Complex
tr: Ağ Geçidi Kompleksi

# Name
source: Gateway
tr: Geçit

# Name
source: Gateway-Exclusive-XOR-Data-Based
tr: Ağ Geçidi Harici XOR Veri Tabanlı

# Name
source: Gateway-Exclusive-XOR-Event-Based
tr: Ağ Geçidi Harici XOR Olay Tabanlı

# Name
source: Gateway-Inclusive-OR
tr: Ağ Geçidi Dahili OR

# Name
source: Gateway-Parallel-AND
tr: Ağ Geçidi Paralel AND

# Name
source: Group
tr: Grup

# Name
source: Intermediate-Event-Cancel
tr: Orta Düzey Olay İptal

# Name
source: Intermediate-Event-Compensation
tr: Orta Düzey Olay Düzeltme

# Name
source: Intermediate-Event
tr: Orta Düzey Olay

# Name
source: Intermediate-Event-Error
tr: Orta Düzey Olay Hata

# Name
source: Intermediate-Event-Link
tr: Orta Düzey Olay Bağlantı

# Name
source: Intermediate-Event-Message
tr: Orta Düzey Olay İleti

# Name
source: Intermediate-Event-Multiple
tr: Orta Düzey Olay Çoklu

# Name
source: Intermediate-Event-Rule
tr: Orta Düzey Olay Kural

# Name
source: Intermediate-Event-Timer
tr: Orta Düzey Olay Sayacı

# Name
source: Looping-Collapsed-Sub-Process
tr: Döngü Çöken Alt Süreç

# Name
source: Multiple-Instance-Collapsed-Sub-Process
tr: Çoklu Örnek Çöken Alt Süreç

# Name
source: Multiple-Instance-Task
tr: Çoklu Örnek Görev

# Name
source: Start-Event
tr: Başlat Etkinlik

# Name
source: Start-Event-Link
tr: Başlat Etkinlik Bağlantı

# Name
source: Start-Event-Message
tr: Başlat Etkinlik İleti

# Name
source: Start-Event-Multiple
tr: Başlat Etkinlik Çoklu

# Name
source: Start-Event-Rule
tr: Başlat Etkinlik Kural

# Name
source: Start-Event-Timer
tr: Etkinlik Başlat Sayacı

# Name
source: Task
tr: Görev

# Name
source: Text-Annotation
tr: Metin Bilgi Notu

# Name
source: Transaction
tr: İşlem

# Name
source: Circle Diagonal Quarters Filled
tr: Köşegen Çeyrekleri Dolu Daire

# Name
source: Building Site
tr: İnşaat Alanı

# Name
source: Concrete Mixer
tr: Beton Karıştırıcısı

# Name
source: Horizontal Fence
tr: Yatay Çit

# Name
source: Vertical Fence
tr: Dikey Çit

# Name
source: Pre-Silo
tr: Çimento-ambarı

# Name
source: Proportioning Batcher
tr: Oranlama Toplu İşlemcisi

# Name
source: Road Crossroads
tr: Yol Kesişimi

# Name
source: Horizontal Road
tr: Yatay Yol

# Name
source: Road Rotated Tee
tr: Döndürülmüş T şeklinde Yol

# Name
source: Road Tee
tr: T şeklinde Yol

# Name
source: Road Turn
tr: Yol Dönüşü

# Name
source: Vertical Road
tr: Dikey Yol

# Name
source: Horizontal Slope
tr: Yatay Eğim

# Name
source: Vertical Slope
tr: Dikey Eğim

# Name
source: Horizontal Wall
tr: Yatay Duvar

# Name
source: Vertical Wall
tr: Dikey Duvar

# Name
source: Central Data Processing
tr: Merkezi Veri İşleme

# Name
source: Litter
tr: Çöp

# Name
source: Router
tr: Yönlendirici

# Name
source: ServerRack2USlow
tr: ServerRack2UYavaş

# Name
source: ServerRack2UVerySlow
tr: ServerRack2UÇokYavaş

# Name
source: ServerRack3USlowDensity
tr: ServerRack3UYavaşYoğunluk

# Name
source: ServerRack4URightCapacity
tr: ServerRack4UDoğruSığa

# Name
source: ServerRack4USlowCapacity
tr: ServerRack4UYavaşSığa

# Name
source: ServerRack4UVeryRightCapacity
tr: ServerRack4UÇokDoğruSığa

# Name
source: ServerRack5URightDensity
tr: ServerRack5UDoğruYoğunluk

# Name
source: TelephoneExchange
tr: Santral

# Name
source: ACgen
tr: Alternatif Akım Üreticisi

# Name
source: aircooler
tr: havatazeleyici

# Name
source: airforced
tr: havadestekli

# Name
source: airinduced
tr: havaemici

# Name
source: autoclave
tr: otoklav

# Name
source: bigtraycol
tr: büyük çekmece kolonu

# Name
source: centrifuge
tr: santrifüj

# Name
source: coil
tr: bobin

# Name
source: coilv
tr: yataybobin

# Name
source: ChemEng
tr: KimMüh

# Name
source: compr
tr: kompresör

# Name
source: coveredtank
tr: kapalıdepo

# Name
source: cyclone
tr: siklon

# Name
source: displa
tr: dönerpompa

# Name
source: doublepipe
tr: çiftboru

# Name
source: ejector
tr: çıkarıcı

# Name
source: filter
tr: süzgeç

# Name
source: fixedroof
tr: sabit tavan

# Name
source: floatingroof
tr: yüzer tavan

# Name
source: flowfan
tr: akışlı fan

# Name
source: fluidcont
tr: sıvı teması tankı

# Name
source: furnace
tr: fırın

# Name
source: gasholder
tr: GazTutucu

# Name
source: kettle
tr: su ısıtıcısı

# Name
source: knockout
tr: yıkma

# Name
source: measure
tr: ölçmek

# Name
source: mixer
tr: karıştırıcı

# Name
source: plate
tr: tabak

# Name
source: pneum
tr: basınçlı hava hattı

# Name
source: pneumv
tr: Basınçlı hava hattı dikey

# Name
source: pnuemv
tr: Basınçlı hava hattı dikey

# Name
source: pump
tr: pompa

# Name
source: reactor
tr: reaktör

# Name
source: recipr
tr: pistonlu komprasör

# Name
source: regval
tr: düzenleyici valf

# Name
source: regvalv
tr: düzenleyici valf dikey

# Name
source: SaT-fixedtube
tr: IsıDeğiştirici-sabitboru

# Name
source: SaT-floatinghead
tr: IsıDeğiştirici-derecelibaşlık

# Name
source: sealedtank
tr: mühürlüdepo

# Name
source: settling
tr: yerleşme

# Name
source: spray
tr: sprey

# Name
source: spraydrier
tr: spraykurutucu

# Name
source: storagesphere
tr: depolama alanı

# Name
source: tank
tr: depo

# Name
source: traycol
tr: çekmece kolonu

# Name
source: val
tr: valf

# Name
source: valv
tr: valf dikey

# Name
source: vessel
tr: damar

# Name
source: wcool
tr: susoğut

# Name
source: wcoolv
tr: susoğuty

# Name
source: 30-degree-bend
tr: 30-derece-büküm

# Name
source: beaker
tr: deney şişesi

# Name
source: buechner-funnel
tr: buechner-huni

# Name
source: burette
tr: büret

# Name
source: clamp
tr: kelepçe

# Name
source: clamp-extra-large
tr: çok-büyük-kelepçe

# Name
source: clamp-front
tr: ön-kelepçe

# Name
source: clamp-large
tr: büyük-kelepçe

# Name
source: Chemistry Lab
tr: Kimya Lab

# Name
source: column-reflux
tr: sütun-reflü

# Name
source: column-reflux-red-blue
tr: sütun-reflü-kırmızı-mavi

# Name
source: column-reflux-red
tr: sütun-reflü-kırmızı

# Name
source: condenser-black
tr: kondansatör-siyah

# Name
source: condenser-blue
tr: kondansatör-mavi

# Name
source: condenser
tr: kondansatör

# Name
source: condenser-green
tr: kondanstör-yeşil

# Name
source: condenser-liebig-vertical
tr: kondansatör-liebig-dikey

# Name
source: condenser-orange
tr: kondansatör-turuncu

# Name
source: condenser-pale-blue
tr: kondansatör-soluk-mavi

# Name
source: condenser-red
tr: kondansatör-kırmızı

# Name
source: ryan -Erlenmeyer Flask
tr: Erlenmeyer Kabı

# Name
source: funnel
tr: huni

# Name
source: gooseneck
tr: deveboynu

# Name
source: lab-stand
tr: laboratuvar standı

# Name
source: lab-stand-front
tr: laboratuvar ön standı

# Name
source: ring
tr: halka

# Name
source: ring-front
tr: Ön Halka

# Name
source: sep-funnel
tr: ayırma-hunisi

# Name
source: sep-funnel-three-phases
tr: üç-fazlı-ayırma-hunisi

# Name
source: sep-funnel-two-phases
tr: iki fazlı ayırma hunisi

# Name
source: stirbar
tr: manyetik çubuk

# Name
source: stirplate
tr: manyetik tabaka

# Name
source: stirplate-front
tr: manyetik tabaka-ön

# Name
source: Circuit2
tr: Devre 2

# Name
source: Diagonal Capacitor
tr: Diyagonal Kapasitör

# Name
source: Diagonal Diode
tr: Diyagonal Diyot

# Name
source: Diagonal Inductor (European)
tr: Diyagonal İndüktör (Avrupa)

# Name
source: Diagonal Inductor
tr: Diyagonal Endüktör

# Name
source: Diagonal Led (European)
tr: Diyagonal Led (Avrupa)

# Name
source: Diagonal Polarized Capacitor
tr: Diyagonal Polarize Kapasitör

# Name
source: Diagonal Resistor (European)
tr: Çapraz Direnç (Avrupa)

# Name
source: Diagonal Resistor
tr: Çapraz Direnç

# Name
source: Diagonal Zener Diode
tr: Diyagonal Zener Diyot

# Name
source: Horizontal Ammeter
tr: Yatay Ampermetre

# Name
source: Horizontal Polarized Capacitor
tr: Yatay polarize Kapasitör

# Name
source: Horizontal Voltmeter
tr: Yatay Voltmetre

# Name
source: Horizontal LED
tr: Yatay LED

# Name
source: Vertical LED
tr: Dikey LED

# Name
source: Optoisolator
tr: Optoizolatör

# Name
source: Ramp Wave
tr: Köpüren Dalga

# Name
source: Relay
tr: Röle

# Name
source: Sine Wave
tr: Sinüs Dalga

# Name
source: Square Wave
tr: Kare Dalga

# Name
source: Triangle Wave
tr: Üçgen Dalga

# Name
source: Vertical Ammeter
tr: Dikey Ampermetre

# Name
source: Vertical Polarized Capacitor
tr: Dikey Polarize Kapasitör

# Name
source: Vertical Voltmeter
tr: Dikey Voltmetre

# Name
source: Circuit
tr: Devre

# Name
source: Ground
tr: Toprak

# Name
source: Horizontal Capacitor
tr: Yatay Kapasitör

# Name
source: Horizontal Diode
tr: Yatay Diyot

# Name
source: Horizontal Fuse (European)
tr: Yatay Sigorta (Avrupa)

# Name
source: Horizontal Inductor (European)
tr: Yatay İndüktör (Avrupa)

# Name
source: Horizontal Inductor
tr: Yatay Endüktör

# Name
source: Horizontal Jumper
tr: Yatay Jumper

# Name
source: Horizontal Led (European)
tr: Yatay Led (Avrupa)

# Name
source: Horizontal Powersource (European)
tr: Yatay Güç Ünitesi (Avrupa)

# Name
source: Horizontal Resistor (European)
tr: Yatay Direnç (Avrupa)

# Name
source: Horizontal Resistor
tr: Yatay Direnç

# Name
source: Horizontal Zener Diode
tr: Yatay Zener Diyot

# Name
source: Lamp (European)
tr: Lamba (Avrupa)

# Name
source: Microphone (European)
tr: Mikrofon (Avrupa)

# Name
source: NMOS Transistor (European)
tr: NMOS Transistör (Avrupa)

# Name
source: NPN Transistor
tr: NPN Transistör

# Name
source: PMOS Transistor (European)
tr: PMOS Transistör (Avrupalı)

# Name
source: PNP Transistor
tr: PNP Transistör

# Name
source: Speaker (European)
tr: Hoparlör (Avrupa)

# Name
source: Vertical Capacitor
tr: Dikey Kapasitör

# Name
source: Vertical Diode
tr: Dikey Diyot

# Name
source: Vertical Fuse (European)
tr: Dikey Sigorta (Avrupa)

# Name
source: Vertical Inductor (European)
tr: Dikey İndüktör (Avrupa)

# Name
source: Vertical Inductor
tr: Dikey İndüktör

# Name
source: Vertical Led (European)
tr: Dikey Led (Avrupa)

# Name
source: Vertical Powersource (European)
tr: Dikey Güç Ünitesi (Avrupa)

# Name
source: Vertical Resistor (European)
tr: Dikey Direnç (Avrupa)

# Name
source: Vertical Resistor
tr: Dikey Direnç

# Name
source: Vertical Zener Diode
tr: Dikey Zener Diyot

# Name
source: 3174 (desktop) cluster controller
tr: 3174 (masaüstü) küme denetleyicisi

# Name
source: 3X74 (floor) cluster controller
tr: 3X74 (zemin) küme denetleyicisi

# Name
source: Workgroup 5000
tr: Çalışma grubu 5000

# Name
source: Workgroup 5002
tr: Çalışma grubu 5002

# Name
source: Workgroup 5500
tr: Çalışma grubu 5500

# Name
source: 7500ARS (7513) Router
tr: 7500ARS (7513) Yönlendirici

# Name
source: 7505 Router
tr: 7505 Yönlendirici

# Name
source: 7507 Router
tr: 7507 Yönlendirici

# Name
source: Access Gateway
tr: Erişim Ağ Geçidi

# Name
source: AccessPoint
tr: Erişim Noktası

# Name
source: Access server
tr: Erişim Sunucusu

# Name
source: Androgynous Person
tr: Cinsiyetsiz Kişi

# Name
source: Antenna
tr: Anten

# Name
source: ASIC Processor
tr: ASIC İşlemci

# Name
source: ATM Fast Gigabit Etherswitch
tr: ATM Fast Gigabit Ethernet Anahtarı

# Name
source: ATM Router
tr: ATM Yönlendirici

# Name
source: ATM Switch
tr: ATM Anahtarı

# Name
source: ATM Tag Switch Router
tr: ATM Tag Anahtar Yönlendirici

# Name
source: Automatic Protection Switching
tr: Otomatik Koruma Anahtarlaması

# Name
source: BBFW media
tr: BBFW ortamı

# Name
source: Branch office blue
tr: Alt grup ofis mavisi

# Name
source: Branch office
tr: Alt grup ofisi

# Name
source: Branch office subdued
tr: Alt grup ofisi pasif

# Name
source: Breakout box
tr: Kaçış kutusu

# Name
source: Bridge
tr: Köprü

# Name
source: Broadband router
tr: Genişbant yönlendirici

# Name
source: Cable Modem
tr: Kablo Modem

# Name
source: CallManager
tr: ÇağrıYöneticisi

# Name
source: Car
tr: Araba

# Name
source: Carrier Routing System
tr: Taşıyıcı Yönlendirme Sistemi

# Name
source: Catalyst Access Gateway
tr: Catalyst Erişim Ağ Geçidi

# Name
source: CDM Content Distribution Manager
tr: CDM İçerik Dağıtım Yöneticisi

# Name
source: Cellular phone
tr: Cep telefonu

# Name
source: Centri Firewall
tr: Centri Güvenlik Duvarı

# Name
source: Channelized Pipe
tr: Kanallı Boru

# Name
source: CiscoWorks workstation
tr: CiscoWorks iş istasyonu

# Name
source: Class 4/5 switch
tr: Sınıf 4/5 anahtarı

# Name
source: Communications server
tr: İletişim sunucusu

# Name
source: Concatenated Payload
tr: Birleştirilmiş Yük

# Name
source: Content Engine (Cache Director)
tr: İçerik Motoru (Önbellek Yöneticisi)

# Name
source: Content Service Router
tr: İçerik Hizmet Yönlendiricisi

# Name
source: Content Switch module
tr: İçerik Anahtarı modülü

# Name
source: Content Switch
tr: İçerik Anahtarı

# Name
source: Content Service Switch 1100
tr: İçerik Hizmet Anahtarı 1100

# Name
source: Content Transformation Engine (CTE)
tr: İçerik Dönüşüm Motoru (CTE)

# Name
source: Data Center Switch
tr: Veri Merkezi Anahtarı

# Name
source: Data Center Switch Reversed
tr: Veri Merkezi Ters Anahtarı

# Name
source: Data Switch Processor
tr: Veri Anahtarı İşlemcisi

# Name
source: Detector
tr: Algılayıcı

# Name
source: Digital Cross-Connect
tr: Sayısal Çapraz-Bağlayıcı

# Name
source: Director-class Fibre Channel intelligent switch
tr: Yönetmen-sınıfı Fiber Kanal akıllı anahtarı

# Name
source: Directory Server
tr: Dizin Sunucusu

# Name
source: Diskette
tr: Disket

# Name
source: Disk subsystem
tr: Disk Alt Sistemi

# Name
source: Distributed Director
tr: Dağıtık Yönetici

# Name
source: Dot-Dot
tr: Nokta-Nokta

# Name
source: Dual Mode AccessPoint
tr: İki Kipli Erişim Noktası

# Name
source: DWDM Filter
tr: DWDM Süzgeci

# Name
source: Edge Label Switch Router with NetFlow
tr: NetFlow içeren “Edge Label Switch Router”

# Name
source: End Office
tr: Ofis Sonu

# Name
source: Fax
tr: Faks

# Name
source: FC Storage
tr: FC Depolama

# Name
source: FDDI Ring
tr: FDDI Halka

# Name
source: File cabinet
tr: Dosya kabini

# Name
source: File Engine
tr: Dosya Motoru

# Name
source: File Server
tr: Dosya Sunucusu

# Name
source: Firewall
tr: Güvenlik duvarı

# Name
source: Firewall horizontal
tr: Yatay güvenlik duvarı

# Name
source: Firewall subdued
tr: Güvenlik duvarı bastırıldı

# Name
source: Front End Processor
tr: Ön Uç İşlemcisi

# Name
source: Firewall Service Module
tr: Güvenlik Duvarı Modülü

# Name
source: General appliance
tr: Genel aygıt

# Name
source: Generic Building blue
tr: Genel mavi bina

# Name
source: Generic Building
tr: Genel bina

# Name
source: Generic Building subdued
tr: Bastırılmış genel bina

# Name
source: Generic gateway
tr: Genel ağ geçidi

# Name
source: Generic processor
tr: Genel işlemci

# Name
source: Generic softswitch
tr: Genel yazılım anahtarı

# Name
source: Gigabit Switch Router (ATM Tag)
tr: Gigabit Anahtar Yönlendirici (ATM Etiketi)

# Name
source: Government Building
tr: Hükümet Binası

# Name
source: Guard
tr: Gözetim

# Name
source: Handheld
tr: El Bilgisayarı

# Name
source: Headphones
tr: Kulaklık

# Name
source: Home office
tr: Ev Ofisi

# Name
source: Host
tr: Makina

# Name
source: House blue
tr: Ev mavi

# Name
source: House
tr: Ev

# Name
source: Hub subdued
tr: Hub pasif

# Name
source: IAD router
tr: IAD yönlendirici

# Name
source: IBM mainframe with FEP
tr: IBM mainframe FEP

# Name
source: IBM Tower
tr: IBM Kule

# Name
source: IntelliSwitch Stack
tr: IntelliSwitch Yığın

# Name
source: IOS Firewall
tr: IOS Güvenlik Duvarı

# Name
source: IP Old-style
tr: Eski biçemli IP

# Name
source: IP Phone
tr: IP Telefon

# Name
source: IP Softphone
tr: IP yazılımsal telefon

# Name
source: IP Telephony Router
tr: IP Telefon Yönlendiricisi

# Name
source: IPTV broadcast server
tr: IPTV yayın sunucusu

# Name
source: IPTV content manager
tr: IPTV içerik yöneticisi

# Name
source: iSCSI switch
tr: iSCSI anahtarı

# Name
source: ISDN switch
tr: ISDN anahtarı

# Name
source: Key
tr: Anahtar

# Name
source: ATM Tag Sw Gigabit Router
tr: ATM Tag Sw Gigabit Yönlendirici

# Name
source: LAN2LAN Switch
tr: LAN2LAN Anahtar

# Name
source: LAN to LAN
tr: LAN’dan LAN’a
