Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/discover._desktop_.po
Languages: tr

# Name
source: Discover
tr: Keşfet

# Comment
source: Install and remove apps and add-ons
tr: Uygulamalar veya eklentiler kurun veya kaldırın

# GenericName
source: Software Center
tr: Yazılım Merkezi

# Keywords
source: program;software;store;repository;package;add;install;uninstall;remove;update;apps;applications;games;flatpak;snap;addons;add-ons;firmware;
tr: program;yazılım;depo;paket;ekle;kur;kaldır;güncelle;uygulama;uygulamalar;oyunlar;flatpak;snap;eklentiler;gömülü yazılım;donanım yazılımı;aygıt yazılımı;cihaz yazılımı;dükkan;mağaza;bakkal;store;shop;

# Name
source: See Available Updates
tr: Kullanılabilir Güncellemeleri Gör

# Name
source: Package management
tr: Paket Yönetimi

# Description
source: Install/remove/upgrade packages
tr: Paketler kur/kaldır/yükselt

# Name
source: Snap login action
tr: Snap oturum açma eylemi

# Description
source: Allows snap front-ends to log in
tr: Snap ön uçlarının oturum açmasına izin verir

# Comment
source: Discover
tr: Keşfet

# Name
source: Updates Are Available
tr: Güncellemeler Kullanılabilir

# Comment
source: Updates Available
tr: Güncellemeler kullanılabilir

# Name
source: Successful Offline Update
tr: Başarılı Çevrimdışı Güncelleme

# Comment
source: System updated successfully
tr: Sistem başarıyla güncellendi

# Name
source: Failed Offline Update
tr: Başarısız Çevrimdışı Güncelleme

# Comment
source: System update failed
tr: Sistem güncellemesi başarısız oldu

# Name
source: Repair Started
tr: Onarım Başlatıldı

# Name
source: Repaired Successfully
tr: Başarıyla Onarıldı

# Name
source: Repair Failed
tr: Onarım Başarısız

# Comment
source: Repair failure after offline update
tr: Çevrimdışı güncellemeden sonra onarım hatası

# Name
source: Restart is Required
tr: Yeniden Başlatma Gerekiyor

# Name
source: Upgrade available
tr: Yükseltme Kullanılabilir
