Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/frameworkintegration._desktop_.po
Languages: tr

# Comment
source: System Notifications
tr: Sistem bildirimleri

# Name
source: Trash: Emptied
tr: Çöp Kutusu: Boşaltıldı

# Comment
source: The trash has been emptied
tr: Çöp kutusu boşaltıldı

# Name
source: Textcompletion: Rotation
tr: Metin Tamamlama: Döndürme

# Comment
source: The end of the list of matches has been reached
tr: Eşleşme listesinin sonuna ulaşıldı

# Name
source: Textcompletion: No Match
tr: Metin Tamamlama: Eşleşme yok

# Comment
source: No matching completion was found
tr: Eşleşen tamamlama bulunamadı

# Name
source: Textcompletion: Partial Match
tr: Metin Tamamlama: Kısımsal Eşleşme

# Comment
source: There is more than one possible match
tr: Birden fazla eşleşme var

# Name
source: Fatal Error
tr: Onulmaz Hata

# Comment
source: There was a serious error causing the program to exit
tr: Uygulamadan çıkılacak kadar önemli bir hata oluştu

# Name
source: Notification
tr: Bildirim

# Comment
source: Something special happened in the program
tr: Uygulamada bazı özel durumlar oluştu

# Name
source: Warning
tr: Uyarı

# Comment
source: There was an error in the program which may cause problems
tr: Uygulamada sorunlara neden olabilecek bir hata oluştu

# Name
source: Catastrophe
tr: Felaket

# Comment
source: A very serious error occurred, at least causing the program to exit
tr: En azından uygulamadan çıkılacak kadar önemli bir hata oluştu

# Name
source: Application Crash
tr: Uygulama Çökmesi

# Comment
source: An application just closed unexpectedly
tr: Bir uygulama beklenmedik şekilde kapandı

# Name
source: Login
tr: Oturum Aç

# Comment
source: A new session is starting
tr: Yeni bir oturum başlatılıyor

# Name
source: Logout
tr: Oturumu Kapat

# Comment
source: Session is exiting
tr: Oturumdan çıkılıyor

# Name
source: Logout Canceled
tr: Oturumu Kapatma İptal Edildi

# Comment
source: Plasma logout was canceled
tr: Plasma oturumu kapatımı iptal edildi

# Name
source: Print Error
tr: Yazdırma Hatası

# Comment
source: A print error has occurred
tr: Bir yazdırma hatası oluştu

# Name
source: Information Message
tr: Bilgilendirme İletisi

# Comment
source: An information message is being shown
tr: Bir bilgilendirme iletisi gösterildi

# Name
source: Warning Message
tr: Uyarı İletisi

# Comment
source: A warning message is being shown
tr: Bir uyarı iletisi gösterildi

# Name
source: Critical Message
tr: Kritik İleti

# Comment
source: A critical message is being shown
tr: Kritik bir ileti gösterildi

# Name
source: Question
tr: Soru

# Comment
source: A question is being asked
tr: Bir soru soruldu

# Name
source: Beep
tr: Bip Sesi

# Comment
source: Sound bell
tr: Ses zili

# Name
source: Widget failed to install
tr: Araç Takımı Kurulamadı

# Comment
source: A widget could not be installed
tr: Bir araç takımı kurulamadı

# Name
source: Widget deleted
tr: Araç Takımı Silindi

# Comment
source: A widget has been deleted
tr: Bir araç takımı silindi

# Name
source: Device plugged in
tr: Aygıt Takıldı

# Comment
source: A device was plugged in
tr: Bir aygıt takıldı

# Name
source: Device unplugged
tr: Aygıt Çıkarıldı

# Comment
source: A device was unplugged
tr: Bir aygıt çıkarıldı
