Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/kaddressbook._desktop_.po
Languages: tr

# Name
source: KAddressbook import file
tr: K Adres Defteri içe aktarma dosyası

# Comment
source: KAddressBook running in file import mode
tr: K Adres Defteri, dosya içe aktarma kipinde çalışıyor

# Name
source: KAddressBook View
tr: K Adres Defteri Görünümü

# Comment
source: Display contact specified by URL
tr: URL tarafından belirtilen kişiyi görüntüle

# Name
source: KAddressBook
tr: K Adres Defteri

# GenericName
source: Contact Manager
tr: Kişi Yöneticisi

# Name
source: New Contact...
tr: Yeni Kişi…

# Name
source: Example big title
tr: Örnek Büyük Başlık

# Description
source: Example big title grantlee printing theme
tr: Örnek büyük başlık, grantlee yazdırma teması

# Name
source: Default
tr: Öntanımlı

# Description
source: Default grantlee printing theme
tr: Öntanımlı grantlee yazdırma teması

# Name
source: Full Information
tr: Tam Bilgi

# Description
source: Display All Information
tr: Tüm Bilgiyi Görüntüle

# Description
source: Default kaddressbook theme.
tr: Öntanımlı K Adres Defteri teması.
