Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/kaidan._desktop_.po
Languages: tr

# GenericName
source: Jabber IM Client
tr: Jabber İstemcisi

# Comment
source: A QtQuick Jabber client
tr: Bir QtQuick Jabber istemcisi

# Keywords
source: chat;messaging;im;jabber;xmpp;qt;network;
tr: sohbet;iletileşme;mesajlaşma;jabber;qt;ağ;

# Comment
source: A user-friendly XMPP client for every device
tr: Her aygıt için kullanıcı dostu bir XMPP istemcisi

# Name
source: New Message
tr: Yeni İleti

# Comment
source: New message received
tr: Yeni ileti alındı

# Name
source: New Subsequent Message
tr: Yeni İzleyen İleti

# Comment
source: New message received in quick succession to a previous one from the same chat
tr: Aynı sohbetteki bir önceki iletiye yanıt olarak tez bir ileti alındı

# Name
source: Request to share personal data
tr: Kişisel Veri Paylaşma İsteği

# Comment
source: A contact asks for receiving personal data
tr: Bir kişi, kişisel veri alma isteğinden bulunuyor
