Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/kclock._desktop_.po
Languages: tr

# Name
source: Clock
tr: Saat

# Name
source: Timer finished
tr: Sayaç Bitti

# Comment
source: Your timer has finished!
tr: Sayaç bitti!

# Name
source: Alarm
tr: Çalar Saat

# Name
source: Timer running
tr: Sayaç Çalışıyor

# Comment
source: A timer is running
tr: Çalışan bir sayaç var

# Name|plasma runner
source: Clock
tr: Saat

# Comment
source: Find timers and start/stop them
tr: Sayaçları bul ve onları başlat/durdur

# X-Plasma-Runner-Syntax-Descriptions
source: Finds timers whose name match :q:,Lists all timers and allows to start/stop them.,Lists all alarms and allows to enable/disable them.
tr: Adı :q: ile eşleşen sayaçları bul,Tüm sayaçları listeler ve onları başlatmaya/durdurmaya olanak tanır.,Tüm çalar saatleri listeler ve onları etkinleştirmeye/devre dışı bırakmaya olanak tanır.

# Comment
source: A simple clock application in Kirigami.
tr: Kirigami ile yazılmış yalın bir saat uygulaması

# Comment
source: Set alarms and timers, use a stopwatch, and manage world clocks
tr: Çalar saatler ve sayaçlar kurun, kronometreyi kullanın ve dünya saatlerini yönetin

# Keywords
source: kclock;timer;stopwatch;alarm;timezone;time zone;world clock;
tr: kclock;sayaç;kronometre;alarm;çalar saat;zaman dilimi;dünya saati;

# Name
source: Timers
tr: Sayaçlar

# Name
source: Stopwatch
tr: Kronometre

# Name
source: Alarms
tr: Çalar Saatler
