Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/kde-inotify-survey._desktop_.po
Languages: tr

# Name
source: inotify Helper
tr: inotify Yardımcısı

# Name
source: Increase Inotify Instance Limit for all Users
tr: Tüm Kullanıcılar için Inotify Örnek Sınırını Artır

# Description
source: Increase Inotify Instance Limit for all Users
tr: Tüm Kullanıcılar için Inotify Örnek Sınırını Artır

# Name
source: Increase Inotify Watch Limit for all Users
tr: Tüm Kullanıcılar için Inotify İzleme Sınırını Artır

# Description
source: Increase Inotify Watch Limit for all Users
tr: Tüm Kullanıcılar için Inotify İzleme Sınırını Artır

# Comment
source: Warnings about inotify capacity problems
tr: Inotify sığa sorunları hakkında uyarılar

# Name
source: Inotify Instances Capacity Low
tr: Inotify Örnekleri Sığası Düşük

# Comment
source: Available amount of inotify instances is low
tr: Kullanılabilir inotify örnekleri miktarı düşük

# Name
source: Inotify Watch Capacity Low
tr: Inotify İzleme Sığası Düşük

# Comment
source: Available amount of inotify watches is low
tr: Kullanılabilir inotify izleme miktarı düşük
