Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/kdeconnect-kde._desktop_.po
Languages: tr

# Name
source: KDE Connect
tr: KDE Bağlan

# GenericName
source: Device Synchronization
tr: Aygıt Eşzamanlama

# Comment
source: Make all your devices one
tr: Tüm aygıtlarınızı birleştirin

# Name
source: Send via KDE Connect
tr: KDE Bağlan ile gönder

# Name
source: KDE Connect Indicator
tr: KDE Bağlan Göstergesi

# Comment
source: Display information about your devices
tr: Aygıtlarınız hakkında bilgi görüntüleyin

# Comment
source: Notifications from your devices
tr: Aygıtınızdan bildirimler

# Name
source: Pairing Request
tr: Eşleşme İsteği

# Comment
source: Pairing request received from a device
tr: Bir aygıttan alınan eşleştirme isteği

# Name
source: Incoming Call
tr: Gelen Arama

# Comment
source: Someone is calling you
tr: Biri sizi arıyor

# Name
source: Missed Call
tr: Yanıtsız Arama

# Comment
source: You have a missed call
tr: Yanıtsız aramanız var

# Name
source: Battery Low
tr: Pil Zayıf

# Comment
source: Your battery is in low state
tr: Pilinizin düzeyi düşük

# Name
source: Ping Received
tr: Ping Alındı

# Comment
source: Ping received
tr: Ping alındı

# Name
source: Generic Notification
tr: Genel Bildirim

# Comment
source: Notification received
tr: Bildirim alındı

# Name
source: Remote Lock Successful
tr: Uzaktan Kilit Başarılı

# Comment
source: Remote lock successful
tr: Uzaktan kilitleme başarılı

# Name
source: Remote Lock Failure
tr: Uzaktan Kilit Başarısız

# Comment
source: Remote lock failed
tr: Uzaktan kilitleme başarısız

# Name
source: Text Received
tr: Metin Alındı

# Comment
source: Received some text
tr: Metin alındı

# Name
source: KDE Connect SMS
tr: KDE Bağlan SMS

# GenericName
source: Text Messaging
tr: SMS İletileri

# Comment
source: Read and send SMS messages on connected devices
tr: Bağlı aygıtlarda SMS iletilerini okuyun ve gönderin
