Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/kdevelop._desktop_.po
Languages: tr

# Comment
source: KDevelop
tr: K Geliştir

# Name
source: Debugger
tr: Hata Ayıklayıcısı

# Name
source: Breakpoint Hit
tr: Kesme Noktasına Gelindi

# Comment
source: A Breakpoint has been hit by the debugger
tr: Hata ayıklayıcısı tarafından bir kesme noktasına gelindi

# Name
source: Breakpoint Error
tr: Kesme Noktası Hatası

# Comment
source: An error was reported by the debugger
tr: Hata ayıklayıcısı tarafından bir hata bildirildi

# Name
source: Watchpoint Hit
tr: İzleme Noktasına Gelindi

# Comment
source: A Watchpoint has been hit by the debugger
tr: Hata ayıklayıcısı tarafından bir izleme noktasına gelindi

# Name
source: KDevelop
tr: K Geliştir

# GenericName
source: Integrated Development Environment
tr: Tümleşik Geliştirme Ortamı

# Name
source: Open a Session
tr: Oturum Aç

# Name
source: KDevelop (Pick Session)
tr: K Geliştir (Oturum Seç)

# GenericName
source: Integrated Development Environment (Pick Session to start with)
tr: Tümleşik Geliştirme Ortamı (Başlatmak için bir oturum seçin)

# Comment
source: Simple CMake-based C application
tr: Yalın bir CMake tabanlı C uygulaması

# Comment
source: Simple Meson-based C application
tr: Yalın bir Meson tabanlı C uygulaması

# Name
source: Simple KDevelop Plugin
tr: Yalın K Geliştir Eklentisi

# Comment
source: Generate a general KDevelop plugin, using CMake and C++
tr: CMake ve C++ kullanan genel bir K Geliştir eklentisi üret

# Comment
source: Simple CMake-based C++ application
tr: Basit bir CMake tabanlı C++ uygulaması

# Name
source: CMake Qt6 Quick Application
tr: CMake Qt6 Quick Uygulaması

# Comment
source: Generate a CMake & Qt6 Quick based application (crossplatform compatible)
tr: CMake ve Qt6 Quick tabanlı bir arayüz uygulaması üret (çapraz platform uyumlu)

# Name
source: CMake Qt6 Widgets Application
tr: CMake Qt6 Widgets Uygulaması

# Comment
source: Generate a CMake & Qt6 Widgets based application (crossplatform compatible)
tr: CMake ve Qt6 Widgets tabanlı bir uygulaması üret (çapraz platform uyumlu)

# Comment
source: Simple Meson-based C++ application
tr: Yalın bir Meson tabanlı C++ uygulaması

# Name
source: QMake Qt5 QWidgets GUI Application
tr: QMake Qt5 QWidgets Grafik Uygulaması

# Comment
source: Generate a QMake/Qt5 based GUI application (crossplatform compatible)
tr: QMake/Qt5 tabanlı bir arayüz uygulaması üret (çapraz platform uyumlu)

# Name
source: QtQuick 2 Application
tr: QtQuick 2 Uygulaması

# Comment
source: A Qt5 and QML2 basic application using QMake
tr: QMake kullanan basit Qt5 ve QML2 uygulaması

# Name
source: Empty
tr: Boş

# Comment
source: A project to fill with your ideas
tr: Fikirlerinizle dolduracağınız bir proje

# Name
source: KDevelop File Template
tr: K Geliştir Dosya Şablonu

# Comment
source: Setup for KDevelop File Template which is packaged using CMake
tr: CMake kullanılarak paketlenen bir K Geliştir Dosya Şablonu ayarı

# Comment
source: A simple GObject subclass
tr: Basit bir GObject alt sınıfı

# Name
source: Header
tr: Üstbilgi

# Name
source: Implementation
tr: Gerçekleme

# Name
source: GObject with private pointer
tr: Özel işaretçili GObject

# Comment
source: A GObject subclass with a private pointer
tr: Özel bir işaretçi ile GObject alt sınıfı

# Name
source: GObject with properties
tr: Özellikler ile GObject

# Comment
source: A GObject subclass with a private pointer and properties
tr: Bir özel işaretçi ve özellikleri ile bir GObject alt sınıfı

# Name
source: Basic
tr: Yalın

# Comment
source: Basic C++ Class
tr: Yalın C++ Sınıfı

# Name
source: Private Pointer
tr: Özel İşaretçi

# Comment
source: C++ Class with a private D-pointer
tr: Özel bir D işaretçili C++ Sınıfı

# Name
source: Public Header
tr: Genel Üstbilgi

# Name
source: Private Header
tr: Özel Üstbilgi

# Comment
source: Basic Python Class
tr: Temel Python Sınıfı

# Name
source: Definition
tr: Tanım

# Name
source: QAbstractItemModel pimpl subclass
tr: QAbstractItemModel pimpl alt sınıfı

# Comment
source: QAbstractItemModel subclass with private implementation
tr: Özel gerçeklemeli QAbstractItemModel alt sınıfı

# Name
source: QAbstractItemModel subclass
tr: QAbstractItemModel alt sınıfı

# Comment
source: QAbstractItemModel subclass with properties
tr: Özelliklerle QAbstractItemModel alt sınıfı

# Name
source: Dialog (pimpl) with a UI File
tr: Kullanıcı arayüzü dosyasıyla bir iletişim kutusu (pimpl)

# Comment
source: QDialog subclass with a separate Qt Designer file and private implementation
tr: Ayrı bir Qt Designer dosyası ve özel gerçekleme ile QDialog alt sınıfı

# Name
source: User Interface
tr: Kullanıcı Arayüzü

# Name
source: Dialog with a UI File
tr: Kullanıcı arayüzü dosyasıyla iletişim kutusu

# Comment
source: QDialog subclass with a separate Qt Designer file
tr: Ayrı bir Qt Designer dosyasıyla QDialog alt sınıfı

# Name
source: QObject pimpl subclass
tr: QObject pimpl alt sınıfı

# Comment
source: QObject subclass with private implementation
tr: Gizli gerçeklemeli QObject alt sınıfı

# Name
source: QObject subclass
tr: QObject alt sınıfı

# Comment
source: QObject subclass with properties
tr: Özelliklerle QObject alt sınıfı

# Name
source: QObject interface class
tr: QObject arayüz sınıfı

# Comment
source: QObject interface class with properties
tr: Özelliklerle QObject arayüzü alt sınıfı

# Name
source: Implicitly shared class
tr: Örtük paylaşılan sınıf

# Comment
source: Class with a private QSharedData member
tr: Bir özel QSharedData üyeli sınıf

# Name
source: Widget with a UI File
tr: Kullanıcı arayüzü dosyasıyla araç takımı

# Comment
source: QWidget subclass with a separate Qt Designer file
tr: Ayrı bir Qt Designer dosyasıyla QWidget alt sınıfı

# Name
source: Widget (pimpl) with a UI File
tr: Kullanıcı arayüzü dosyasıyla araç takımı (pimpl)

# Comment
source: QWidget subclass with a separate Qt Designer file and private implementation
tr: Ayrı bir Qt Designer dosyası ve özel gerçekleme ile QWidget alt sınıfı

# Name
source: CMake Module with pkg-config
tr: pkg-config ile CMake Modülü

# Comment
source: CMake module for finding a library using pkg-config
tr: pkg-config kullanan bir kitaplık bulmak için CMake modülü

# Name
source: Module
tr: Modül

# Name
source: Qt Resource Collection File
tr: Qt Özkaynak Koleksiyonu Dosyası

# Comment
source: A simple version with one prefix and one file.
tr: Bir önek ve bir dosya ile temel bir sürüm.

# Comment
source: A unit test using the CppUTest library
tr: CppUTest kitaplığını kullanan bir birim testi

# Comment
source: A unit test using the Google Test library
tr: Google Test kitaplığını kullanan birim testi

# Name
source: Test Suite
tr: Test Süiti

# Comment
source: A unit test suite using the QTest library without a graphical user interface
tr: Grafiksel kullanıcı arayüzü olmadan QTest kitaplığı kullanan birim testi paketi

# Name
source: A test for KDevPlatform
tr: KDevPlatform için bir test

# Comment
source: A unit test using the QTest library with KDevPlatform test helpers
tr: KDevPlatform test yardımcılarıyla QTest kitaplığı kullanan birim testi

# Comment
source: A unit test using the PHPUnit framework
tr: PHPUnit çatısı kullanan bir birim testi

# Comment
source: A unit test using the PyUnit framework
tr: PyUnit çatısı kullanan bir birim testi

# Name
source: KDevelop Plugin
tr: K Geliştir Eklentisi

# Name
source: Application Templates (SDK)
tr: Uygulama Şablonları (SDK)

# Name
source: KDevelop (Fetch Bazaar Project)
tr: K Geliştir (Bazaar Projesi Getir

# Comment
source: A Dockerfile is a text document that contains all the commands a user could call on the command line to assemble an image
tr: Dockerfile, kullanıcının bir kalıp oluşturması için komut satırında ayarlayabileceği tüm komutları içeren bir metin belgesidir

# Name
source: File Templates (SDK)
tr: Dosya Şablonları (SDK)

# Name
source: Flatpak Builder Manifest
tr: Flatpak Yapıcısı Bildirgesi

# Comment
source: A file to configure how a project is built by flatpak
tr: Bir projenin Flatpak tarafından nasıl yapılandırılacağını belirten dosya

# Name
source: KDevelop (Fetch git Project)
tr: K Geliştir (Git Projesi Getir)

# Name
source: API Documentation (QtHelp)
tr: API Belgelendirmesi (QtHelp)

# Name
source: KDevelop (Fetch Subversion Project)
tr: K Geliştir (Subversion Projesi Getir)
