Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/kiss._desktop_.po
Languages: tr

# Name
source: KDE Initial System Setup
tr: KDE İlk Kullanım Ayarları

# Comment
source: Run the initial system setup for KDE
tr: KDE için ilk sistem ayarlarını yapın

# Name
source: Create New User Autostart Hook
tr: Yeni Kullanıcı Kendiliğinden Başlatma Kancası Oluştur

# Description
source: Create an autostart hook for the newly created user
tr: Yeni oluşturulan kullanıcı için bir kendiliğinden başlatma kancası oluşturun

# Name
source: Disable Systemd Unit
tr: Systemd Birimini Devre Dışı Bırak

# Description
source: Disable the systemd unit for the initial system setup
tr: İlk sistem ayarları için systemd birimini devre dışı bırakın

# Name
source: Remove Autologin
tr: Kendiliğinden Oturum Açmayı Kaldır

# Description
source: Remove SDDM autologin configuration
tr: SDDM kendiliğinden oturum açma yapılandırmasını kaldırın

# Name
source: Set New User Home Directory Ownership
tr: Yeni Kullanıcı Ana Klasör Sahipliğini Ayarla

# Description
source: Set ownership of the new users home directory to the newly created user
tr: Yeni kullanıcının ana klasör sahipliğini yeni oluşturulan kullanıcıya verin

# Name
source: Set New User Temporary Autologin
tr: Yeni Kullanıcı Geçici Kendliğinden Oturum Açmayı Ayarla

# Description
source: Set SDDM temporary autologin configuration for the newly created user
tr: Yeni oluşturulan kullanıcı için SDDM geçici kendiliğinden oturum açma yapılandırmasını ayarlayın
