Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/kleopatra._desktop_.po
Languages: tr

# Name
source: Kleopatra Decrypt/Verify Files
tr: Kleopatra Dosyaların Şifrelemesini Aç/Doğrula

# Name
source: Decrypt/Verify File
tr: Dosyaların Şifrelemesini Aç/Doğrula

# Comment
source: Certificate Manager and Unified Crypto GUI
tr: Sertifika Yöneticisi ve Birleşik Şifreleme Arayüzü

# Name
source: Kleopatra Sign/Encrypt Files
tr: Kleopatra Dosyaları İmzala/Şifrele

# Name
source: Sign/Encrypt File…
tr: Dosyayı İmzala/Şifrele…

# Name
source: Encrypt File…
tr: Dosyayı Şifrele…

# Name
source: Sign File…
tr: Dosyayı İmzala…

# Name
source: Kleopatra Sign/Encrypt Folders
tr: Kleopatra Klasörleri İmzala/Şifrele

# Name
source: Archive, Sign & Encrypt Folder
tr: Klasörü Arşivle, İmzala ve Şifrele

# Name
source: Archive & Encrypt Folder
tr: Klasörü Arşivle ve Şifrele

# GenericName
source: Certificate manager and cryptography app
tr: Sertifika Yöneticisi ve Şifreleme Uygulaması

# Name
source: GnuPG Log Viewer
tr: GnuPG Günlüğü Görüntüleyicisi

# Comment
source: Viewer for GnuPG daemon and application logs
tr: GnuPG ardalan süreci ve uygulama günlükleri için görüntüleyici
