Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/kmines._desktop_.po
Languages: tr

# Name
source: KMines
tr: K Mayın Tarlası

# GenericName
source: Minesweeper-like Game
tr: Mayın Tarlası Oyunu

# Comment
source: Minesweeper-like Game
tr: Mayın tarlası benzeri Oyun

# Name
source: Classic
tr: Klasik

# Description
source: Classic theme for KMines
tr: K Mayın Tarlası için klasik tema.

# Description
source: A dark, high contrast theme for KMines.
tr: K Mayın Tarlası için koyu, yüksek karşıtlıklı bir tema.

# Name
source: Clean Blue Dark
tr: Temiz Koyu Mavi

# Description
source: A light, high contrast theme for KMines.
tr: K Mayın Tarlası için açık, yüksek karşıtlıklı bir tema.

# Name
source: Clean Blue
tr: Temiz Mavi

# Name
source: Default
tr: Öntanımlı

# Description
source: KMines Oxygen theme
tr: K Mayın Tarlası Oksijen teması

# Name
source: Graveyard Mayhem
tr: Mezarlık Kargaşası

# Description
source: A spooky theme for KMines. Don't get caught by the zombies in the graveyard!
tr: K Mayın Tarlası için hayalet dolu bir tema. Mezarlıkta zombilere yakalanmayın sakın!

# Name
source: Gardens of Danger
tr: Tehlike Bahçeleri

# Description
source: A funny theme for KMines
tr: K Mayın Tarlası için eğlenceli bir tema

# Name
source: Cig Waste No. 2
tr: İzmarit No 2

# Description
source: The cleaning of the Earth begins
tr: Yeryüzünün temizliği başlıyor
