Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/kmix._desktop_.po
Languages: tr

# GenericName
source: Sound Mixer
tr: Ses Karıştırıcısı

# Name
source: KMix
tr: K Miks

# Name
source: Restore Mixer Settings
tr: Karıştırıcı Ayarlarını Geri Yükle

# Comment
source: Sound Mixer
tr: Ses Karıştırıcısı

# Name
source: Audio Device Fallback
tr: Ses Aygıtı Yedeği

# Comment
source: Automatic fallback if the preferred device is unavailable
tr: Yeğlenen aygıt kullanılamıyorsa otomatik sonraki alternatif

# Name
source: Audio Device Connected
tr: Ses Aygıtı Takıldı

# Comment
source: A sound device was connected
tr: Bir ses aygıtı takıldı

# Name
source: Audio Device Disconnected
tr: Ses Aygıtı Çıkarıldı

# Comment
source: A sound device was disconnected
tr: Bir ses aygıtı çıkarıldı

# Comment
source: Control sound volumes
tr: Ses düzeylerini denetler

# Name
source: Restore Mixer Volumes
tr: Karıştırıcı Ses Düzeylerini Geri Yükle

# Name
source: Mixer DataEngine
tr: Karıştırıcı Veri Sağlayıcısı
