Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/kmoretools._desktop_.po
Languages: tr

# GenericName
source: Linux file search, instant results as you type
tr: Linux dosya araması, yazdığınızda hemen sonuç verir

# Name
source: Catfish File Search
tr: Catfish Dosya Araması

# GenericName
source: File search
tr: Dosya araması

# Comment
source: Search the file system
tr: Dosya sistemini arayın

# GenericName
source: Streaming/Recording Software
tr: Akış/Kayıt Yazılımı

# Comment
source: Free and Open Source Streaming/Recording Software
tr: Özgür ve Açık Kaynaklı Akış/Kayıt Yazılımı

# GenericName
source: Animated GIF recorder
tr: Canlandırılmış GIF kaydedicisi

# Comment
source: Record short animated GIF images from your screen
tr: Ekranınızdan kısa canlandırılmış GIF görselleri kaydedin

# GenericName
source: German<=>English Dictionary
tr: Almanca<=>İngilizce Sözlük

# GenericName
source: Partition hard disks (a YaST module)
tr: Sabit diskleri bölüntüleyin (bir YaST modülü)

# Name
source: Font Management
tr: Yazıtipi Yönetimi

# Comment
source: Font Installation, Preview and Removal
tr: Yazıtipi Kurulumu, Önizleme ve Kaldırma

# X-KDE-Keywords
source: font,fonts,installer,truetype,type1,bitmap
tr: font,yazıtipi,kur,truetype,type1,bitmap,biteşlem,yazı tipi

# Comment
source: A font manager
tr: Bir yazıtipi yöneticisi

# GenericName
source: Font Manager
tr: Yazıtipi Yöneticisi

# Comment
source: A file search application focusing on performance and advanced features
tr: Başarıma ve gelişmiş özelliklere odaklanan bir dosya arama uygulaması

# Keywords
source: search;fsearch;files;folders;music;video;documents;find;tool;everything;
tr: search;fsearch;ara;dosyalar;klasörler;müzik;video;belgeler;bul;araç;her şey;tümü;hepsi;görsel;resim;

# GenericName
source: Git repository viewer
tr: Git deposu görüntüleyicisi

# Comment
source: Git repository viewer
tr: Git deposu görüntüleyicisi

# Comment
source: The highly caffeinated Git GUI
tr: Yüksek dozda kafein almış Git grafik arayüzü

# Name
source: Git Cola (View History)
tr: Git Cola (Geçmişi Görüntüle)

# Comment
source: Git repository browser
tr: Git deposu tarayıcısı

# Name
source: Search for Files...
tr: Dosyaları Ara...

# Comment
source: Locate documents and folders on this computer by name or content
tr: Bu bilgisayardaki belgeleri ve klasörleri ada veya içeriğe göre bul

# GenericName
source: Partition Editor
tr: Bölüntü Düzenleyicisi

# Comment
source: Create, reorganize, and delete partitions
tr: Bölüntüleri oluştur, organize et ve sil

# Keywords
source: Partition;
tr: Bölüntü;Bölüm;

# GenericName
source: Character Map
tr: Karakter Eşlem

# Name
source: GNOME Character Map
tr: GNOME Karakter Haritası

# Comment
source: Insert special characters into documents
tr: Belgelere özel karakterler ekleyin

# Keywords
source: font;unicode;
tr: yazıtipi;font;unicode;

# Comment
source: Screenshot manager
tr: Ekran görüntüsü yöneticisi

# GenericName
source: Screenshot manager
tr: Ekran görüntüsü yöneticisi

# Comment
source: Show System Processes
tr: Sistem Süreçlerini Göster

# GenericName
source: Process Viewer
tr: Süreç Görüntüleyicisi

# Keywords
source: system;process;task;
tr: sistem;süreç;işlem;görev;iş;

# Comment
source: Screen capture and editor
tr: Ekran yakalama ve düzenleme

# GenericName
source: German-English Translator
tr: Almanca-İngilizce Çevirmen

# Comment
source: Translator
tr: Çevirmen

# GenericName
source: Clocks
tr: Saatler

# Comment
source: Clocks for world times, plus alarms, stopwatch and a timer
tr: Dünya saatleri, alarmlar, kronometre ve sayaç

# Keywords
source: time;timer;alarm;world clock;stopwatch;time zone;
tr: zaman;saat;sayaç;alarm;dünya saati;kronometre;zaman dilimi;zaman dilimi;saat dilimi;

# Name
source: Filelight
tr: Dosya Feneri

# GenericName
source: Disk Usage Statistics
tr: Disk Kullanımı İstatistikleri

# Comment
source: View disk usage information
tr: Disk kullanımı bilgisini görüntüle

# GenericName
source: Character Selector
tr: Karakter Seçicisi

# Name
source: KCharSelect
tr: K Karakter Seç

# Name
source: KDiskFree
tr: K Boş Alan

# GenericName
source: View Disk Usage
tr: Disk Kullanımını Görüntüle

# Name
source: KFind
tr: K Bul

# GenericName
source: Find Files/Folders
tr: Dosyaları/Klasörleri Bul

# Comment
source: Clicks the mouse for you, reducing the effects of RSI
tr: RSI etkisini azaltmak için fareye sizin yerinize tıklar

# Name
source: KMouseTool
tr: K Fare Aracı

# GenericName
source: Automatic Mouse Click
tr: Otomatik Fare Tıklaması

# GenericName
source: System Monitor
tr: Sistem Monitörü

# Comment
source: Monitor running processes and system performance
tr: Çalışan süreçleri izle ve sistem başarımını ölç

# Name
source: KSystemLog
tr: K Sistem Günlüğü

# Comment
source: System log viewer tool
tr: Sistem günlüğü görüntüleme aracı

# GenericName
source: System Log Viewer
tr: Sistem Günlüğü Görüntüleyicisi

# GenericName
source: Countdown Launcher
tr: Geri Sayım Başlatıcısı

# Name
source: KTimer
tr: K Sayaç

# Name
source: KDE Partition Manager
tr: KDE Bölüntü Yöneticisi

# Comment
source: Manage disks, partitions and file systems
tr: Diskleri, bölüntüleri ve dosya sistemlerini yönet

# Comment
source: List and preview available icons
tr: Kullanılabilir simgeleri listele ve önizle

# GenericName
source: Icon Browser
tr: Simge Tarayıcı

# Name
source: Cuttlefish
tr: Mürekkepbalığı

# GenericName
source: Screenshot Capture Utility
tr: Ekran Görüntüsü Yakalama İzlencesi

# Name
source: Capture Entire Desktop
tr: Tüm Masaüstünü Yakala

# Name
source: Capture Current Monitor
tr: Geçerli Monitörü Yakala

# Name
source: Capture Active Window
tr: Etkin Pencereyi Yakala

# Name
source: Capture Rectangular Region
tr: Dörtgen Alanı Yakala

# Comment
source: git repository browser
tr: git deposu tarayıcısı

# GenericName
source: Screenshot Tool
tr: Ekran Görüntüsü Aracı

# Comment
source: Capture, edit and share screenshots
tr: Ekran görüntüleri yakala, düzenle ve paylaş

# Comment
source: A feature-rich screen recorder that supports X11 and OpenGL
tr: X11 ve OpenGL destekleyen, çok özellikli bir ekran kaydedicisi

# Keywords
source: screen recorder;screencast;live streaming;
tr: ekran kaydedici;kaydedicisi;ekran yayını;yayım;canlı yayın;

# Comment
source: screencast
tr: ekran yayını

# Keywords
source: Audio;Video;Recorder;Screencast;
tr: ses;video;kayıt;ekran yayını;yayın;

# Name
source: Task Manager
tr: Görev Yöneticisi

# Comment
source: Easy to use task manager
tr: Kullanımı kolay görev yöneticisi

# GenericName
source: Task Manager
tr: Görev Yöneticisi
