Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/kmymoney._desktop_.po
Languages: tr

# Name
source: Breeze Dark
tr: Esinti Koyu

# Comment
source: Breeze Dark by the KDE VDG
tr: Esinti Koyu — KDE VDG tarafından

# Name
source: Breeze
tr: Esinti

# Comment
source: Breeze by the KDE VDG
tr: Esinti — KDE VDG tarafından

# Name
source: KMyMoney
tr: K Param

# GenericName
source: Personal Finance Manager
tr: Kişisel Finans Yöneticisi

# Comment
source: Personal Finance Manager
tr: Kişisel Finans Yöneticisi

# Comment
source: IBAN and BIC information as published by Deutsche Bundesbank, Frankfurt am Main, Deutschland.
tr: Deutsche Bundesbank, Frankfurt am Main, Deutschland tarafından yayınlanan IBAN ve BIC bilgileri.

# Name
source: A database for institution names and iban to bic rules
tr: Kurum adları ve IBAN’dan BIC’e kuralları için bir veritabanı

# Name
source: Swiss IBAN and BIC
tr: İsviçre IBAN ve BIC

# Comment
source: Make information about swiss IBANs and BICs available.
tr: İsviçre IBAN’ları ve BIC’leri hakkında bilgi sağlayın.

# Comment
source: Contains the BIC and name of all target2 participants
tr: Tüm target2 katılımcılarının BIC’ini ve adını içerir
