Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/knotes._desktop_.po
Languages: tr

# Comment
source: Notes Agent
tr: Not Aracısı

# Name
source: Received a note
tr: Bir Not Alındı

# Name
source: Notes Agent
tr: Not Aracı

# Comment
source: Adds notes received via network and handles note alarm notifications
tr: Ağ üzerinden alınan notlar ekler ve not uyarı bildirimlerini işler

# Name
source: KNotes Printing Theme
tr: Knotes Yazdırma Teması

# GenericName
source: Popup Notes
tr: Açılır Notlar

# Name
source: KNotes
tr: K Notlar

# Name
source: New Note
tr: Yeni Not

# Name
source: Note with background color
tr: Arka Plan Renkli Not

# Description
source: Theme which use note background color
tr: Not arka plan rengini kullanan tema

# Name
source: Big Title
tr: Büyük Başlık

# Description
source: KNote printing theme with big title
tr: Büyük başlıklı KNote yazdırma teması

# Name
source: Default
tr: Öntanımlı

# Description
source: Default knotes printing theme
tr: Öntanımlı K Notlar yazdırma teması
