Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/konsole._desktop_.po
Languages: tr

# Name
source: Bell in Focused Session
tr: Odaklı Oturumda Zil

# Comment
source: Bell emitted within a focused session
tr: Odaklanan oturum ile zil çal

# Name
source: Bell in Non-Focused Session
tr: Odaksız Oturumda Zil

# Comment
source: Bell emitted within a non-focused session
tr: Odaklanılmamış oturumda zil

# Name
source: Activity in Non-Focused Monitored Session
tr: Odaksız İzlenen Oturumda Etkinlik

# Comment
source: Activity detected in a non-focused monitored session
tr: Odaklanılmamış izlenen oturumda etkinlik algılandı

# Name
source: Activity in Monitored Session
tr: İzlenen Oturumda Etkinlik

# Comment
source: Activity detected in a monitored session
tr: İzlenen oturumda etkinlik algılandı

# Name
source: Silence in Non-Focused Monitored Session
tr: Odaksız İzlenen Oturumda Sessizlik

# Comment
source: Silence detected in a non-focused monitored session
tr: Odaklanılmamış izlenen oturumda durgunluk algılandı

# Name
source: Silence in Monitored Session
tr: İzlenen Oturumda Sessizlik

# Comment
source: Silence detected in a monitored session
tr: İzlenen oturumda durgunluk algılandı

# Name
source: Process finished in Non-Focused Monitored Session
tr: Odaksız İzlenen Oturumdaki Süreç Tamamlandı

# Comment
source: Process finished in a non-focused monitored session
tr: Odaklanılmamış, izlenen bir oturumda süreç tamamlandı

# Name
source: Process finished in Monitored Session
tr: İzlenen Oturumda İşlem Tamamlandı

# Comment
source: Process finished in a monitored session
tr: İşlem izlenen bir oturumda tamamlandı

# Name
source: Session Finished With Non-Zero Status
tr: Oturum Sıfır Olmayan Durumla Bitti

# Comment
source: A session has exited with non-zero status
tr: Bir oturum sıfırdan farklı durum ile sonlandı

# Name
source: Process Triggered a Notification in a Focused Session
tr: Süreç, Odaklı Oturumda Bildirim Tetikledi

# Comment
source: Notification emitted by a process in a focused session
tr: Odaklanan bir oturumda, bir süreç tarafından bildirim verildi

# Name
source: Process Triggered a Notification in a Non-Focused Session
tr: Süreç, Odaksız turumda Bildirim Tetikledi

# Comment
source: Notification emitted by a process in a non-focused session
tr: Odaklanılmamış bir oturumda, bir süreç tarafından bir bildirim verildi

# Name
source: Shell prompt triggered a notification in a non-focused session
tr: Kabuk İstemi, Odaksız Oturumda Bildirim Tetikledi

# Comment
source: Shell prompt triggered a notification in a non-focused session
tr: Kabuk istemi, odaklanılmamış bir oturumda bir bildirim tetikledi

# Name
source: Shell prompt triggered a notification
tr: Kabuk İstemi Bildirim Tetikledi

# Comment
source: Shell prompt triggered a notification
tr: Kabuk istemi bir bildirim tetikledi

# Name
source: Terminal Emulator
tr: Uçbirim Öykünücüsü

# Comment
source: Command line access
tr: Komut satırı erişimi

# Name
source: Run In Konsole
tr: Konsole’da Çalıştır

# Comment
source: Run within Konsole
tr: Konsol İçinde Çalıştır

# Keywords
source: terminal;console;script;run;execute;command;command-line;commandline;cli;bash;sh;shell;zsh;cmd;command prompt
tr: uçbirim;terminal;konsol;betik;yürüt;komut;komut-satırı;komut satırı;cli;bash;sh;kabuk;shell;zsh;cmd;komut istemi;çalıştır;yürüt;run;execute;cmd;command

# GenericName
source: Terminal
tr: Uçbirim

# Name
source: Open a New Window
tr: Yeni Pencere Aç

# Name
source: Open a New Tab
tr: Yeni Sekme Aç
