Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/konversation._desktop_.po
Languages: tr

# Name
source: Big Bullets
tr: Büyük İmler

# Comment
source: "Big Bullets" by Dario Abatianni
tr: Dario Abatianni tarafından “Büyük İmler”

# Name
source: Christmas Theme
tr: Noel Teması

# Comment
source: "Christmas Theme" by Kenichiro Takahashi
tr: Keniçiro Takahaşi tarafından “Noel Teması”

# Name
source: Classic Theme
tr: Klasik Tema

# Comment
source: "LED" by Dario Abatianni
tr: Dario Abatianni tarafından “LED”

# Name
source: Default Theme (Dark variant)
tr: Öntanımlı Tema (Koyu Varyant)

# Comment
source: "Breeze" by Uri Herrera
tr: Uri Herrera tarafından “Esinti”

# Name
source: Default Theme
tr: Öntanımlı Tema

# Name
source: Oxygen Theme
tr: Oksijen Teması

# Comment
source: "Oxygen" by Nuno Pinheiro
tr: Nuno Pinheiro tarafından oluşturulan “Oksijen”

# Name
source: KDE 3 Default Theme
tr: KDE3 Öntanımlı Teması

# Comment
source: "Simplistic" by Shintaro Matsuoka
tr: Shintaro Matsuoka tarafından “Basitlik”

# Name
source: Smiling Theme
tr: Gülümseyen Tema

# Comment
source: "Smiling" stolen from Kopete by John Tapsell
tr: John Tapsell tarafından Kopete uygulamasının “Gülümseyen” yüzleri

# Name
source: Square Theme
tr: Kare Teması

# Comment
source: "SQUARE" by Kenichiro Takahashi
tr: Keniçiro Takahaşi tarafından “KARE”

# Name
source: New message
tr: Yeni İleti

# Comment
source: New message arrived in a channel
tr: Kanala yeni ileti geldi

# Name
source: Nick written
tr: Takma Ad Yazıldı

# Comment
source: Someone wrote your nick in a message
tr: Birisi iletisinde sizin takma adınızı yazdı

# Name
source: Highlight triggered
tr: Vurgu Tetiklendi

# Comment
source: Someone triggered a highlight
tr: Birisi bir vurguyu tetikledi

# Name
source: Private message
tr: Özel İleti

# Comment
source: You received a private message
tr: Bir özel ileti aldınız

# Name
source: Nick changed
tr: Takma Ad Değişti

# Comment
source: Someone changed their nick
tr: Birileri takma adlarını değiştirdi

# Name
source: Incoming file
tr: Gelen Dosya

# Comment
source: Someone wants to transmit a file to you over DCC
tr: Birisi size DCC üzerinden dosya göndermek istiyor

# Name
source: DCC transfer error
tr: DCC Aktarım Hatası

# Comment
source: An error occurred in a DCC transfer
tr: DCC aktarımında bir hata oluştu

# Name
source: DCC transfer complete
tr: DCC Aktarımı Tamamlandı

# Comment
source: A DCC transfer successfully completed
tr: Bir DCC aktarımı başarılı bir biçimde tamamlandı

# Name
source: Nick joined channel
tr: Kişi Kanala Katıldı

# Comment
source: New nick joined a channel
tr: Kanala yeni bir kişi katıldı

# Name
source: Nick left channel
tr: Kişi kanaldan ayrıldı

# Comment
source: A nick left a channel
tr: Bir kişi kanaldan ayrıldı

# Name
source: Mode change
tr: Kip Değişikliği

# Comment
source: A user or channel mode was changed
tr: Bir kullanıcı veya kanal kipi değiştirildi

# Name
source: Nick online
tr: Kişi Çevrimiçi

# Comment
source: A user on your watched nicks list has come online
tr: İzlenen takma adlar listenizdeki bir kullanıcı çevrimiçi oldu

# Name
source: Query
tr: Sohbet

# Comment
source: Someone started a conversation (query) with you
tr: Birisi sizinle sohbet başlattı

# Name
source: Kick
tr: Kovma

# Comment
source: Someone kicked you out of a channel
tr: Birisi sizi bir kanaldan kovdu

# Name
source: Connection failure
tr: Bağlantı Hatası

# Comment
source: Failed to connect to server
tr: Sunucuya bağlanılamadı

# Name
source: You joined a channel
tr: Bir Kanala Katıldınız

# Comment
source: You joined a channel
tr: Bir kanala katıldınız

# Name
source: DCC Chat
tr: DCC Sohbeti

# Comment
source: Someone started a DCC chat with you
tr: Birisi sizinle DCC sohbeti başlattı

# GenericName
source: IRC Client
tr: IRC İstemcisi
