Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/kphotoalbum._desktop_.po
Languages: tr

# Name
source: KPhotoAlbum
tr: K Fotoğraf Albümü

# GenericName
source: Photo Album
tr: Fotoğraf Albümü

# Name
source: Open in RAW editor
tr: RAW Düzenleyicisinde Aç

# Comment
source: Send RAW files to external editor on command line
tr: RAW dosyaları komut satırından bir dış düzenleyiciye gönderin

# Name
source: KPhotoAlbum Blue
tr: K Fotoğraf Albümü Mavi

# Description
source: Straight lines, square boxes and two fresh crisp shades of blue.
tr: Düz çizgiler, kare kutular ve mavinin iki taze tonu.

# Description
source: This theme uses JavaScript heavily to provide smooth photo gallery. Naturally images can be navigated without JavaScript support similarly as with the dark theme. The main window provides a thumbnail view with smallest image (by default) on right. The largest generated images can be viewed either with manual navigation or slide show. This theme works best with rather small images that can fully fit to the screen.
tr: Bu tema, pürüzsüz fotoğraf galerisi sağlamak için yoğun bir şekilde JavaScript kullanır. Doğal olarak görsellerde, karanlık temada olduğu gibi JavaScript desteği olmadan gezinilebilir. Ana pencere, sağda en küçük görselle (öntanımlı olarak) bir küçük görsel görünümü sağlar. Oluşturulan en büyük görseller, el ile gezinme veya slayt gösterisi ile görüntülenebilir. Bu tema, ekrana tam olarak sığabilecek oldukça küçük görsellerde en iyi sonucu verir.

# Description
source: This theme uses darkish colors and provides basic gallery quite similar to other themes in KPhotoAlbum. Possibility to navigate images with keyboard is added if JavaScript support is enabled.
tr: Bu tema koyu renkler kullanır ve K Fotoğraf Albümü’ndeki diğer temalara oldukça benzeyen temel bir galeri sağlar. JavaScript desteği etkinleştirilmişse görsellerde klavye ile gezinme olanağı eklenir.

# Name
source: KPhotoAlbum Grey
tr: K Fotoğraf Albümü Gri

# Description
source: Clean theme with square boxes and two shades of dark grey which keeps the emphasis on your pictures.
tr: Resimlerinize vurgu yapan kare kutular ve koyu grinin iki tonuyla temiz tema.

# Description
source: PicBelow has all its description texts above the image, ensuring that this info is not missed by those who cannot scroll.\n This theme is based upon Dark v1.0.1 by Miika Turkia and similarly allows keyboard navigation.\n Colors are grey on a deep dark red background.
tr: PicBelow’un tüm açıklama metinleri görselin üzerinde yer alır ve bu bilgilerin saramayanlar tarafından kaçırılmamasını sağlar. Bu tema, Miika Turkia’nın Dark v1.0.1 sürümünü temel alır ve benzer şekilde klavyede gezinmeye izin verir. Renkler çok koyu kırmızı zemin üzerine gridir.

# Name
source: Rounded
tr: Yuvarlatılmış

# Description
source: This theme uses rounded boxes with a non-intrusive pastel pink background. Descriptions are centered below the image.
tr: Bu tema, müdahaleci olmayan pastel pembe bir arka plana sahip yuvarlak kutular kullanır. Açıklamalar görselin altında ortalanmıştır.
