Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/kpublicalerts._desktop_.po
Languages: tr

# Name
source: Public Alerts
tr: Acil Durum İkazları

# Comment
source: Weather and emergency alerts.
tr: Hava durumu ve acil durum ikazları.

# Comment
source: Emergency and weather alerts.
tr: Acil durum ve hava durumu ikazları.

# Name
source: Extreme Alert
tr: Üst Düzey İkaz

# Comment
source: Extraordinary threat to life or property.
tr: Cana veya mala yönelik olağanüstü tehdit

# Name
source: Severe Alert
tr: Önemli İkaz

# Comment
source: Significant threat to life or property.
tr: Cana veya mala yönelik önemli tehdit

# Name
source: Moderate Alert
tr: Orta Düzey İkaz

# Comment
source: Possible threat to life or property.
tr: Cana veya mala yönelik olası tehdit

# Name
source: Minor Alert
tr: Düşük Düzeyli İkaz

# Comment
source: Minimal or no threat to life or property.
tr: Cana veya mala az veya olmayan tehdit
