Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/ksudoku._desktop_.po
Languages: tr

# GenericName
source: Sudoku Game
tr: Sudoku Oyunu

# Comment
source: KSudoku, Sudoku game & more by KDE
tr: K Sudoku, KDE için sudoku oyunu & fazlası

# Description
source: 4x4 shape puzzle
tr: 4 × 4 şekilli bulmaca

# Description
source: 6x6 puzzle with rectangular blocks
tr: Dikdörtgen bloklu 6 × 6 bulmaca

# Description
source: Jigsaw variant shaped like an Aztec pyramid
tr: Aztek piramiti şeklinde Bulmaca şekilli çeşidi

# Name
source: Double Roxdoku
tr: Çift Roxdoku

# Description
source: Three-dimensional puzzle with two interlocking 3x3x3 cubes
tr: İkili 3 × 3 × 3 küple 3 boyutlu bulmaca

# Name
source: Jigsaw
tr: Yapboz

# Description
source: Jigsaw shape puzzle
tr: Yapboz bulmacası

# Name
source: Tiny Killer
tr: Mini Öldürücü

# Description
source: 4x4 Sudoku, but cages must add to totals shown
tr: 4 × 4 Sudoku, ama kafesler gösterilen toplamlara eklenmek zorunda

# Name
source: Killer Sudoku
tr: Öldürücü Sudoku

# Description
source: Classic Sudoku, but cages must add to totals shown
tr: Klasik Sudoku, ama kafesler gösterilen toplamlara eklenmek zorunda

# Description
source: Size 4x4 grid, with calculated cages
tr: 4 × 4 ızgara, kafesler hesaplanmış

# Name
source: Mathdoku - Settable Size
tr: Mathdoku - Ayarlanabilir Boyut

# Description
source: Size 3x3 to 9x9 grid, with calculated cages
tr: 3 × 3 ve 9 × 9 arası ızgara boyutlu, hesaplanmış kafesli

# Name
source: Nonomino 9x9
tr: Nonomino 9 × 9

# Description
source: Jigsaw variant with irregularly shaped Nonomino blocks
tr: Nonomino blokları ile düzensiz şekillenmiş bulmaca çeşidi

# Name
source: Pentomino 5x5
tr: Pentomino 5 × 5

# Description
source: Jigsaw variant with irregularly shaped Pentomino blocks
tr: Pentomino blokları ile düzensiz şekillenmiş bulmaca çeşidi

# Name
source: Roxdoku Twin
tr: Roxdoku İkiz

# Description
source: Three-dimensional puzzle with two 3x3x3 cubes which share a corner
tr: Bir köşeyi paylaşan iki 3 × 3 × 3 küple 3 boyutlu bulmaca

# Name
source: Samurai
tr: Samuray

# Description
source: Samurai shape puzzle
tr: Samuray şekilli bulmaca

# Name
source: Samurai Roxdoku
tr: Samuray Roxdoku

# Description
source: Samurai three-dimensional puzzle with nine 3x3x3 cubes
tr: Dokuz 3 × 3 × 3 küple 3 boyutlu Samuray bulmacası

# Description
source: Sohei puzzle with four overlapping 9x9 squares
tr: Dörtlü birbirine geçmiş olan 9 × 9 kareli Sohei bulmacası

# Name
source: Tetromino 4x4
tr: Tetromino 4 × 4

# Description
source: Jigsaw with Tetromino blocks (Tetris pieces)
tr: Tetromino bloklu bulmaca (Tetris parçaları)

# Description
source: A smaller samurai puzzle
tr: Daha ufak bir samurai bulmacası

# Name
source: Windmill
tr: Yel Değirmeni

# Description
source: Windmill puzzle with five overlapping 9x9 squares
tr: Beşli birbirine geçmiş olan 9 × 9 kareli yel değirmeni bulmacası

# Description
source: XSudoku shape puzzle
tr: XSudoku şekilli bulmaca

# Name
source: Abstraction
tr: Soyutlama

# Description
source: A ksudoku theme with abstract artwork.
tr: Soyuta resimlerle bir ksudoku teması

# Name
source: ksudoku_egyptian
tr: ksudoku_mısırlı

# Description
source: KSudoku egyptian style theme
tr: Ksudoku Eski Mısır stili tema

# Description
source: KSudoku Scribble theme for KDE 4
tr: KDE4 için K Sudoku Scrible teması
