Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/kwin._desktop_.po
Languages: tr

# Name
source: KWin Kill Helper
tr: KWin Öldürme Yardımcısı

# Comment
source: Prompts whether to kill an unresponsive window
tr: Yanıt vermeyen bir pencereyi öldürüp öldürmek istemediğinizi sorar

# Name
source: Desktop Effects
tr: Masaüstü Efektleri

# Name
source: Window Manager Scripts
tr: Pencere Yöneticisi Betikleri

# Name
source: Task Switcher Styles
tr: Görev Değiştiricisi Biçemleri

# Comment
source: KWin Window Manager
tr: KWin Pencere Yöneticisi

# Name
source: Graphics Reset
tr: Grafik Sıfırlama

# Comment
source: A graphics reset event occurred
tr: Bir grafik sıfırlama olayı oluştu

# Name
source: Xwayland Crash
tr: Xwayland Çöktü

# Comment
source: Xwayland has crashed
tr: Xwayland çöktü

# Name|plasma runner
source: Windows
tr: Pencereler

# Comment
source: List windows and desktops and switch them
tr: Pencereleri ve masaüstlerini listeleyin ve aralarında geçiş yapın

# X-Plasma-Runner-Syntax-Descriptions
source: Finds windows whose name or window application match :q:. It is possible to interact with the windows by using one of the following keywords: activate\\, close\\, min(imize)\\, max(imize)\\, fullscreen\\, shade\\, keep above and keep below.,Finds windows which are on desktop named :q:,Switch to desktop named :q:,Lists all windows and allows to activate them.,Lists all other desktops and allows to switch to them.
tr: Adı veya uygulaması :q: ile eşleşen pencereleri bulur. Aşağıdaki anahtar sözcüklerden birini kullanarak pencerelerle etkileşmek olanaklıdır: etkinleştir\\, kapat\\, küçült\\, büyüt\\, tam ekran\\, panjuru kapat\\, üzerinde tut ve altında tut.,:q: adlı masaüstünde bulunan pencereleri bulur, :q: adlı masaüstüne geçer,tüm pencereleri listeler ve etkinleştirmeye izin verir.,tüm diğer masaüstlerini listeler ve onlara geçmeye için verir.
