Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/libksysguard._desktop_.po
Languages: tr

# Name
source: System monitor Sensor Display Styles
tr: Sistem Monitörü Algılayıcı Görüntüleme Biçemleri

# Name
source: System monitor Sensor Presets
tr: Sistem Monitörü Algılayıcı Önayarları

# Name
source: Kill or stop etc a process
tr: Süreç Durdur veya Sonlandır

# Description
source: Sends a given signal to a given process
tr: Belirli bir sürece belirli bir sinyali gönderir

# Name
source: Change the priority of a process
tr: Süreç Önceliğini Değiştir

# Description
source: Change the niceness of a given process
tr: Verilen sürecin önceliğini değiştirir

# Name
source: Change IO Scheduler and priority
tr: G–Ç Zamanlayıcısını ve Önceliği Değiştir

# Description
source: Change how the read and writes of a given process are prioritized
tr: Verilen sürecin okuma/yazmalarının nasıl önceliklendirildiğini değiştirin

# Name
source: Change CPU Scheduler and priority
tr: İşlemci Zamanlayıcısını ve Önceliği Değiştir

# Description
source: Change which CPU scheduler is to schedule the running of a given process
tr: Verilen sürecin hangi işlemci zamanlayıcısı tarafından zamanlanacağını değiştirin
