Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/libkleo._desktop_.po
Languages: tr

# Name
source: TAR (PGP®-compatible)
tr: TAR (PGP® uyumlu)

# Name
source: TAR (with bzip2 compression)
tr: TAR (bzip2 sıkıştırmalı)

# Name
source: Expired
tr: Süresi dolmuş

# Description
source: Certificates that are invalid because they have expired (except disabled ones)
tr: Süreleri dolduğu için geçersiz olan sertifikalar (devre dışı olanlar dışında)

# Name
source: Revoked
tr: Yürürlükten kaldırılmış

# Description
source: Certificates that are invalid because they have been revoked (except disabled ones)
tr: Yürürlükten kaldırıldıkları için geçersiz olan sertifikalar (devre dışı olanlar dışında)

# Name
source: Trusted Root Certificates
tr: Güvenilir kök sertifikalar

# Description
source: S/MIME root certificates that are trusted
tr: Güvenilen S/MIME kök sertifikaları

# Name
source: Not Trusted Root Certificates
tr: Güvenilmeyen kök sertifikalar

# Description
source: S/MIME root certificates that are not trusted
tr: Güvenilmeyen S/MIME kök sertifikalar

# Name
source: For Qualified Signatures
tr: Yetkilendirilmiş imzalar için

# Description
source: Certificates usable for qualified signatures
tr: Kalifiye imzalar için kullanılabilir sertifikalar

# Name
source: On Smart Card
tr: Akıllı kartta

# Description
source: Certificates stored on smart cards (except disabled ones)
tr: Akıllı kartlarda depolanan sertifikalar (devre dışı olanlar dışında)

# Description
source: OpenPGP certificates (except disabled ones)
tr: OpenPGP sertifikaları (devre dışı olanlar dışında)

# Description
source: S/MIME certificates
tr: S/MIME sertifikaları

# Name
source: VS-NfD Compliant
tr: VS-NfD uyumlu

# Description
source: Certificates that are VS-NfD compliant (except disabled ones)
tr: VS-NfD uyumlu sertifikalar (devre dışı olanlar dışında)

# Name
source: Not VS-NfD Compliant
tr: VS-NfD uyumlu değil

# Description
source: Certificates that are not VS-NfD compliant (except disabled ones)
tr: VS-NfD uyumlu olmayan sertifikalar (devre dışı olanlar dışında)

# Name
source: Not VS-NfD Compliant (Expired)
tr: VS-NfD uyumlu değil (süresi dolmuş)

# Description
source: Expired certificates (if VS-NfD compliance mode is active, except disabled ones)
tr: Süresi dolmuş sertifikalar (VS-NfD uyumluluk kipi etkinse, devre dışı olanlar dışında)

# Name
source: Not VS-NfD Compliant (Revoked)
tr: VS-NfD uyumlu değil (yürürlükten kaldırılmış)

# Description
source: Revoked certificates (if VS-NfD compliance mode is active, except disabled ones)
tr: Yürürlükten kaldırılmış sertifikalar (VS-NfD uyumluluk kipi etkinse, devre dışı olanlar dışında)

# Name
source: Disabled
tr: Devre dışı

# Description
source: Certificates that are disabled
tr: Devre dışı bırakılan sertifikalar

# Name
source: My Own
tr: Kendiminkiler

# Description
source: My own certificates
tr: Kendi sertifikalarım
