Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/merkuro._desktop_.po
Languages: tr

# Name
source: Merkuro Calendar
tr: Merkuro Takvim

# GenericName
source: Calendar
tr: Takvim

# Keywords
source: Kalendar, Merkuro, Events, Tasks, Reminders
tr: Kalendar, Merkuro, Etkinlikler, Görevler, Anımsatıcılar

# Comment
source: Manage your tasks and events with Calendar
tr: Takvim ile görevlerinizi ve etkinliklerinizi yönetin

# Name
source: Merkuro Contacts
tr: Merkuro Kişiler

# GenericName
source: Address Book
tr: Adres Defteri

# Comment
source: Manage your contacts with Merkuro Contacts
tr: Merkuro Kişiler ile kişilerinizi yönetin

# Comment
source: Merkuro-Mail
tr: Merkuro Posta

# Name
source: A resource is broken
tr: Özkaynak Bozuk

# Comment
source: A resource change its state to broken
tr: Bir özkaynak durumunu bozuk olarak değiştirdi

# Name
source: Merkuro Mail
tr: Merkuro Posta

# GenericName
source: EMail Client
tr: E-posta İstemcisi

# Comment
source: Manage your e-mails with Merkuro Mail
tr: Merkuro Posta ile e-postalarınızı yönetin

# GenericName
source: Personal Information Manager
tr: Kişisel Bilgi Yöneticisi
