Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/neochat._desktop_.po
Languages: tr

# GenericName
source: Matrix Client
tr: Matrix İstemcisi

# Comment
source: Chat on Matrix
tr: Matrix üzerinde sohbet edin

# Comment
source: A client for matrix, the decentralized communication protocol
tr: Merkezi olmayan iletişim protokolü Matrix için bir istemci

# Name
source: New message
tr: Yeni İleti

# Comment
source: There is a new message
tr: Yeni bir ileti var

# Name
source: New Invitation
tr: Yeni Davet

# Comment
source: There is a new invitation to a room
tr: Bir odaya yeni bir davetiye var

# Name
source: Share
tr: Paylaş

# Comment
source: The result of sharing a piece of content
tr: Bir parça içerik paylaşımının sonucu

# Comment
source: Find rooms in NeoChat
tr: NeoChat’te odalar bulun
