Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/plasma-mobile._desktop_.po
Languages: tr

# Name
source: Plasma Mobile
tr: Plasma Cep

# Comment
source: Plasma Mobile by KDE
tr: KDE tarafından yapılan Plasma Cep

# Name
source: Plasma Mobile (Development)
tr: Plasma Cep (Geliştirme)

# Name
source: Waydroid Management
tr: Waydroid Yönetimi

# Name
source: Initialize Waydroid
tr: Waydroid’i İlklendir

# Description
source: Allow initialization of Waydroid
tr: Waydroid’in ilklendirilmesine olanak tanıyın

# Name
source: Fetch Android ID for Google Services
tr: Google Hizmetleri için Android Kimliği Al

# Description
source: Allow get Android ID of Waydroid container to activate Google services
tr: Google hizmetlerini etkinleştirmek için Waydroid kapsayıcısının Android kimliğini almasına olanak tanıyın

# Name
source: Reset Waydroid
tr: Waydroid’i Sıfırla

# Description
source: Allow delete waydroid folder
tr: Waydroid klasörünü silmeye izin verin

# Name
source: Date and Time Control Module
tr: Tarih ve Zaman Denetim Modülü

# Name
source: Save the date/time settings
tr: Tarih ve Saat Ayarlarını Kaydet

# Description
source: System policies prevent you from saving the date/time settings.
tr: Sistem politikaları, tarih ve saat ayarlarını kaydetmenizi engelliyor.

# Name
source: Set flashlight brightness
tr: Fener Parlaklığını Ayarla

# Description
source: Allow set brightness on led device
tr: LED aygıt parlaklığını ayarlamaya olanak tanıyın

# Name
source: Captured
tr: Yakalanan

# Comment
source: Captured
tr: Yakalandı
