Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/plasma-systemmonitor._desktop_.po
Languages: tr

# Title
source: New Base Page
tr: Yeni Taban Sayfa

# Title
source: New Test Page
tr: Yeni Sınama Sayfası

# Title
source: Old Base Page
tr: Eski Taban Sayfa

# Title
source: Old Test Page
tr: Eski Sınama Sayfası

# Title
source: Replace Page
tr: Sayfayı Değiştir

# Title
source: Base Page
tr: Taban Sayfa

# Title
source: Local Page
tr: Yerel Sayfa

# Title
source: Local Replaced Page
tr: Yerel Değiştirilmiş Sayfa

# Name
source: System Monitor
tr: Sistem Monitörü

# X-KDE-Keywords
source: Memory,RAM,cpu,disk,gpu,network
tr: Bellek,RAM,cpu,disk,gpu,ağ

# GenericName
source: System Monitor
tr: Sistem Monitörü

# Comment
source: Monitor app and system resource usage
tr: Uygulama ve sistem özkaynak kullanımını izleyin

# Keywords
source: task;manager;process;cpu;memory;
tr: görev;yönetici;süreç;işlemci;cpu;bellek;

# Title
source: Applications
tr: Uygulamalar

# Title
source: History
tr: Geçmiş

# Title
source: Memory
tr: Bellek

# Title
source: Network
tr: Ağ

# Title
source: History (Old Version)
tr: Geçmiş (Eski Sürüm)

# Title
source: false
tr: yanlış

# Title
source: Networks
tr: Ağlar

# Title
source: System
tr: Sistem

# Title
source: Network Rates
tr: Ağ Hız Verisi

# Title
source: Overview (Old Version)
tr: Genel Görünüm (Eski Sürüm)

# Title
source: Network & System
tr: Ağ ve Sistem

# Title
source: Disks
tr: Diskler

# Title
source: Swap
tr: Takas

# Title
source: Overview
tr: Genel Görünüm

# Title
source: Processes
tr: Süreçler

# Name
source: Pages
tr: Sayfalar
