Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/powerdevil._desktop_.po
Languages: tr

# Name
source: Get current battery charge limit
tr: Geçerli Pil Şarj Sınırını Al

# Description
source: Authenticate to see the current battery charge limit.
tr: Geçerli pil şarj sınırını görmek için kimliğinizi doğrulayın.

# Name
source: Set battery charge limit
tr: Pil Şarj Sınırı Ayarla

# Description
source: Authenticate to set the battery charge limit.
tr: Pil şarj sınırını ayarlamak için kimliğinizi doğrulayın.

# Name
source: Check battery conservation mode
tr: Pil Tasarrufu Kipini Denetle

# Description
source: Authenticate to check the current state of battery conservation mode.
tr: Pil tasarrufu kipinin geçerli durumunu denetlemek için kimliğinizi doğrulayın.

# Name
source: Set battery conservation mode
tr: Pil Tasarrufu Kipini Ayarla

# Description
source: Authenticate to set the battery conservation mode.
tr: Pil tasarrufu kipini ayarlamak için kimliğinizi doğrulayın.

# Name
source: Get maximum brightness value
tr: En Yüksek Parlaklık Değerini Al

# Description
source: Authenticate to see the maximum brightness level.
tr: En yüksek parlaklık değerini görmek için kimliğinizi doğrulayın.

# Name
source: Get brightness
tr: Parlaklığı Al

# Description
source: Authenticate to see the brightness level.
tr: Parlaklık değerini görmek için kimliğinizi doğrulayın.

# Name
source: Set brightness
tr: Parlaklığı Ayarla

# Description
source: Authenticate to set the brightness level.
tr: Parlaklık değerini ayarlamak için kimliğinizi doğrulayın.

# Name
source: Get syspath
tr: syspath’i Al

# Description
source: Authenticate to see the syspath.
tr: syspath’i görmek için kimliğinizi doğrulayın.

# Name
source: Check for existence of discrete GPU
tr: Ayrı GPU’nun Varlığı Denetle

# Description
source: Authenticate to check for the existence of a discrete GPU.
tr: Ayrı bir GPU’nun varlığını denetlemek için kimliğinizi doğrulayın.

# Name
source: Power Management
tr: Güç Yönetimi

# Comment
source: Battery, Display and CPU power management and notification
tr: Pil, Görüntü ve İşlemci güç yönetimi ve bildirimleri

# Comment
source: Power Management System
tr: Güç Yönetimi Sistemi

# Name
source: Warning
tr: Uyarı

# Comment
source: Used for warning notifications
tr: Uyarı bildirimleri için kullanılır

# Name
source: Notification
tr: Bildirim

# Comment
source: Used for standard notifications
tr: Standart bildirimler için kullanılır

# Name
source: Critical notification
tr: Kritik Bildirim

# Comment
source: Notifies a critical event
tr: Kritik bir durumu bildirir

# Name
source: Battery Low
tr: Pil Düşük

# Comment
source: Battery has reached low level
tr: Pil düşük düzeye indi

# Name
source: Battery Critical
tr: Pil Kritik

# Comment
source: Battery has reached critical level. This notification triggers a countdown before doing the configured action, hence it is strongly advised to leave it on.
tr: Pil kritik düzeye indi. Bu bildirim yapılandırılmış bir işlemi gerçekleştirecek bir sayacı tetikler; bu nedenle olduğu gibi bırakmanız önerilir.

# Name
source: Charge Complete
tr: Şarj Doldu

# Comment
source: The battery is fully charged
tr: Piliniz tümüyle şarj edildi.

# Name
source: Peripheral Battery Low
tr: Çevre Birimi Pili Düşük

# Comment
source: The battery in a connected device, such as mouse or keyboard, is low
tr: Fare veya klavye gibi bağlı bir aygıttaki pil düşük

# Name
source: Power source connected
tr: Güç Kaynağı Bağlandı

# Comment
source: The power source has been connected
tr: Güç kaynağı bağlandı

# Name
source: Power source disconnected
tr: Güç Kaynağı Bağlantısı Kesildi

# Comment
source: The power source has been disconnected
tr: Güç kaynağı bağlantısı kesildi
