Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/rsibreak._desktop_.po
Languages: tr

# Name
source: RSIBreak
tr: RSI Molası

# GenericName
source: Help prevent repetitive strain injury
tr: Yineleyici İncinme Önleyicisi

# Comment
source: Makes sure you rest now and then
tr: Arada sırada dinlenmenizi sağlar

# Comment
source: RSIBreak
tr: RSI Molası

# Name
source: Breaks
tr: Molalar

# Name
source: Start of a short break
tr: Kısa Mola Başlangıcı

# Comment
source: When a short break starts
tr: Kısa bir mola başladığında

# Name
source: End of a short break
tr: Kısa Mola Sonu

# Comment
source: When a short break ends
tr: Kısa bir mola bittiğinde

# Name
source: Start of a long break
tr: Uzun Mola Başlangıcı

# Comment
source: When a long break starts
tr: Uzun bir mola başladığında

# Name
source: End of a long break
tr: Uzun Mola Sonu

# Comment
source: When a long break ends
tr: Uzun bir mola bittiğinde

# Name
source: Regarding timers
tr: Zamanlayıcılar Hakkında

# Name
source: When the short timer has been reset
tr: Kısa Geri Sayım Bittiğinde

# Name
source: When the timers have been reset
tr: Zamanlayıcılar Sıfırlandığında
