Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/ruqola._desktop_.po
Languages: tr

# Name
source: Ruqola
tr: Roka

# GenericName
source: Rocket.Chat client
tr: Rocket.Chat İstemcisi

# Comment
source: Notification
tr: Bildirim

# Name
source: Off the record ended
tr: Kayıt Dışı Sohbet Bitti

# Name
source: Off the record denied
tr: Kayıt Dışı Sohbet Reddedildi

# Name
source: Ask to create Otr
tr: Kayıt Dışı Sohbet İsteği

# Name
source: Messages Exported
tr: İletiler Dışa Aktarıldı

# Name
source: A Notification Arrived
tr: Bildirim Alındı

# Name
source: Incoming Video Conference Call
tr: Gelen Video Konferans Çağrısı

# Name
source: Invalid invite token
tr: Geçersiz davet jetonu

# Name
source: New Account Added
tr: Yeni Hesap Eklendi
