Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/sddm-kcm._desktop_.po
Languages: tr

# Name
source: Save Settings
tr: Ayarları Kaydet

# Description
source: Save Settings in SDDM
tr: SDDM içinde ayarları kaydedin

# Name
source: Install an SDDM theme
tr: SDDM Teması Kur

# Description
source: Extract a zip file containing an SDDM theme to the SDDM theme location
tr: SDDM temasını içeren bir zip dosyasını SDDM tema konumuna çıkarın

# Name
source: Uninstall an SDDM theme
tr: SDDM Temasını Kaldır

# Description
source: Remove a previously installed SDDM theme
tr: Daha önce kurulmuş bir SDDM temasını kaldırın

# Name
source: Synchronize Settings
tr: Ayarları Eşzamanla

# Description
source: Synchronize user settings with SDDM settings
tr: Kullanıcı ayarlarını SDDM ayarları ile eşzamanlayın

# Name
source: Reset Settings
tr: Ayarları Sıfırla

# Description
source: Reset SDDM settings to factory default state
tr: SDDM ayarlarını fabrika ayarlarına sıfırlayın

# Name
source: Login Screen
tr: Oturum Açma Ekranı
