Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/desktop/tokodon._desktop_.po
Languages: tr

# GenericName
source: Browse the Fediverse
tr: Fediverse Uygulaması

# Comment
source: Client for the Mastodon
tr: Mastodon için istemci

# Comment
source: A client for Mastodon, the decentralized social media
tr: Merkezi olmayan sosyal ağ, Mastodon için istemci

# Name
source: Favorite
tr: Favorile

# Comment
source: Someone favorited your post
tr: Birisi gönderinizi favoriledi

# Name
source: Boost
tr: Boostla

# Comment
source: Someone boosted your post
tr: Birisi gönderinizi boostladı

# Name
source: Follow
tr: Takip Et

# Comment
source: Someone followed you
tr: Birisi sizi takip etti

# Name
source: Follow Request
tr: Takip İsteği

# Comment
source: Someone requested to followed you
tr: Birisi size takip isteği gönderdi

# Comment
source: Someone mentioned you
tr: Birisi sizden söz etti

# Name
source: Update
tr: Güncelle

# Comment
source: Someone edited a post
tr: Birisi bir gönderiyi düzenledi

# Name
source: Poll
tr: Anket

# Comment
source: Someone's poll ended
tr: Birisinin anketi sona erdi

# Name
source: Status
tr: Durum

# Comment
source: Someone posted a new status
tr: Birisi yeni bir durum gönderdi

# Name
source: Annual Report
tr: Yıllık Rapor

# Comment
source: Unveil your year's highlights and memorable moments on the Fediverse!
tr: Mastodon’da geçtiğimiz yılın önemli noktalarını ve unutulmaz anlarını ortaya çıkarın!

# Name
source: Other
tr: Diğer

# Comment
source: Notifications that do not fit in other categories
tr: Başka kategorilere uymayan bildirimler
