Repository: yakushabb/foss-desktop-turkish
Catalog: GNOME/Circle/AudioSharing.main.*.po
Languages: tr

source: Gnome;GTK;audio;sharing;sound;
tr: Gnome;GTK;audio;sharing;sound;ses;paylaşım;

source: Share your computer audio
tr: Bilgisayarınızın sesini paylaşın

source: With Audio Sharing you can share your current computer audio playback in the form of an RTSP stream. This stream can then be played back by other devices, for example using VLC.
tr: Ses Paylaşımı ile bilgisayarınızın kayıttan yürüttüğü sesi RTSP akışı biçiminde paylaşabilirsiniz. Bu akış, sonrasında diğer aygıtlarca, örneğin VLC kullanılarak oynatılabilir.

source: By sharing the audio as a network stream, you can also use common devices that are not intended to be used as audio sinks (eg. smartphones) to receive it. For example, there are audio accessories that are not compatible with desktop computers (e.g. because the computer does not have a Bluetooth module installed). With the help of this app, the computer audio can be played back on a smartphone, which is then connected to the Bluetooth accessory.
tr: Sesi ağ akışı olarak paylaşarak, ses alıcı amacıyla kullanılmayan yaygın aygıtları da (ör. akıllı telefonlar) alıcı olarak kullanabilirsiniz. Örneğin, bilgisayarda Bluetooth modülü olmadığından masaüstü bilgisayarlarla uyumsuz ses aksesuarları vardır. Bu uygulama yardımıyla, bilgisayar sesi sonrasında Bluetooth aksesuarına bağlanan akıllı telefonda çalınabilir.

source: Connect to the audio stream by scanning the QR code or copying the address
tr: QR kodunu tarayarak ya da adresi kopyalayarak ses akışına bağlan

source: Menu
tr: Menü

source: _Copy to Clipboard
tr: Panoya _Kopyala

source: You are currently sharing your audio. You can access it from other devices in the same network by scanning the QR code or entering the displayed address in a playback app that supports RTSP streams. This device can be muted, the audio will still be shared. To stop sharing, simply close this window.
tr: Şu anda sesinizi paylaşıyorsunuz. Aynı ağdaki diğer aygıtlardan, QR kodunu tarayarak ya da gösterilen adresi RTSP akışlarını destekleyen oynatıcıya girerek erişebilirsiniz. Bu aygıtın sesi kapatılsa bile paylaşım sürecektir. Paylaşımı durdurmak için bu pencereyi kapatmalısınız.

source: Unable to Share Audio
tr: Ses Paylaşılamadı

source: Open _Help <sup>↗</sup>
tr: _Yardımı Aç <sup>↗</sup>

source: _About Audio Sharing
tr: Ses Paylaşımı _Hakkında

source: A client has established a connection
tr: İstemci bağlantı kurdu

source: Audio playback from this device gets shared.
tr: Bu aygıttan ses çalma paylaşıldı.

source: translator-credits
tr: Sabri Ünal <yakushabb@gmail.com> Emin Tufan Çetin <etcetin@gmail.com>

source: Donate
tr: Bağış Yap

source: Copied address to clipboard
tr: Adres panoya kopyalandı
