Repository: yakushabb/foss-desktop-turkish
Catalog: GNOME/Circle/chess-clock.main.*.po
Languages: tr

source: Chess Clock
tr: Satranç Saati

source: chess;game;clock;timer;
tr: chess;game;clock;timer;satranç;oyun;saat;zamanlayıcı;

source: Time games of over-the-board chess
tr: Zamanlı satranç oyunu saati

source: Chess Clock is a simple application to provide time control for over-the-board chess games. Intended for mobile use, players select the time control settings desired for their game, then the black player taps their clock to start white's timer. After each player's turn, they tap the clock to start their opponent's, until the game is finished or one of the clocks reaches zero.
tr: Satranç Saati, yüz yüze oynanan satranç oyunlarına zaman denetimi sağlayan basit bir uygulamadır. Mobil kullanım için tasarlanmıştır, oyuncular oyunları için istedikleri zaman denetim ayarlarını seçer, ardından siyah oyuncu beyazın zamanlayıcısını başlatmak için saate dokunur. Her oyuncunu sırası geldiğinde, rakibinin zamanlayıcısını başlatmak için saate dokunur, oyun tamamlanana dek ya da saatlerden biri sıfıra ulaşana dek sürer.

source: The main screen, showing timers for the white and black players of a chess game
tr: Satranç oyununun beyaz ve siyah oyuncularının zamanlayıcılarını gösteren ana ekran

source: The time control selection screen
tr: Zaman seçim ekranı

source: The main screen in a portrait aspect ratio, showing one timer rotated 180 degrees
tr: Dikey en boy oranındaki ana ekran, 180 derece döndürülmüş zamanlayıcıyı gösteriyor

source: One minute per side, plus zero seconds per turn
tr: Her oyuncu için 1 dakika ve her tur için 0 saniye

source: Two minutes per side, plus one second per turn
tr: Her oyuncu için 2 dakika ve her tur için 1 saniye

source: Five minutes per side, plus zero seconds per turn
tr: Her oyuncu için 5 dakika ve her tur için 0 saniye

source: Five minutes per side, plus three seconds per turn
tr: Her oyuncu için 5 dakika ve her tur için 3 saniye

source: Ten minutes per side, plus zero seconds per turn
tr: Her oyuncu için 10 dakika ve her tur için 0 saniye

source: Ten minutes per side, plus five seconds per turn
tr: Her oyuncu için 10 dakika ve her tur için 5 saniye

source: Thirty minutes per side, plus zero seconds per turn
tr: Her oyuncu için 30 dakika ve her tur için 0 saniye

source: Thirty minutes per side, plus twenty seconds per turn
tr: Her oyuncu için 30 dakika ve her tur için 20 saniye

source: Main time minutes
tr: Ana zaman dakikası

source: Main time seconds
tr: Ana zaman saniyesi

source: Increment seconds
tr: Saniyeyi artır

# shortcut window
source: Game
tr: Oyun

# shortcut window
source: New Time Control
tr: Yeni Zaman Denetimi

# shortcut window
source: Restart Timer
tr: Zamanlayıcıyı Yeniden Başlat

# shortcut window
source: General
tr: Genel

# shortcut window
source: Open Main Menu
tr: Ana Menüyü Aç

# shortcut window
source: Show Shortcuts
tr: Kısayolları Göster

# shortcut window
source: Close Window
tr: Pencereyi Kapat

# shortcut window
source: Quit
tr: Çık

# a11y
source: Select time controls
tr: Zaman denetimlerini seç

source: Welcome to Chess Clock
tr: Satranç Saati’ne Hoş Geldiniz

source: Select time controls below to get started
tr: Başlamak için aşağıdan zaman denetimi seçin

source: Time control method
tr: Zaman denetim yöntemi

source: Increment
tr: Artır

source: Bronstein delay
tr: Bronstein gecikmesi

source: Simple delay
tr: Basit gecikme

source: Start Game
tr: Oyunu Başlat

source: Main Menu
tr: Ana Menü

source: Toggle Pause
tr: Durdur/Başlat

# a11y
source: Player white timer
tr: Beyaz oyuncu zamanlayıcısı

# a11y
source: Player black timer
tr: Siyah oyuncu zamanlayıcısı

source: _New Time Control
tr: _Yeni Zaman Denetimi

source: _Restart Timer
tr: Zamanlayıcıyı _Yeniden Başlat

source: _Mute Alert Sound
tr: Alarm Sesini _Kapat

source: _Keyboard Shortcuts
tr: _Klavye Kısayolları

source: _About Chess Clock
tr: Satranç Saati _Hakkında

source: translator-credits
tr: Sabri Ünal <yakushabb@gmail.com> Emin Tufan Çetin <etcetin@gmail.com>

source: Player white timer
tr: Beyaz oyuncu zamanlayıcısı

source: Player black timer
tr: Siyah oyuncu zamanlayıcısı
