Repository: yakushabb/foss-desktop-turkish
Catalog: GNOME/Circle/hieroglyphic.main.*.po
Languages: tr

source: Search through over 1000 different LaTeX symbols by sketching
tr: Çizerek 1000ʼden çok LaTeX simgesi arasında arama yap

source: GTK;Tools;LaTeX;TeX;Symbols;
tr: Hieroglyphic;GTK;Tools;LaTeX;TeX;Symbols;Araçlar;Simgeler;Hiyeroglif;

source: Whether to show a small nudge towards the contribution dialog
tr: Katkı iletişim penceresine küçük bir bağ gösterilmesi

source: Whether to contribute recognized strokes
tr: Tanınan vuruşların katkı olarak iletilmesi

source: Find LaTeX symbols
tr: LaTeX simgelerini bul

source: If you work with LaTeX, you know it's difficult to memorize the names of all the symbols. Hieroglyphic allows you to search through over 1000 different LaTeX symbols by sketching.
tr: LaTeX ile çalışıyorsanız tüm simgelerin adlarını ezberlemenin zor olduğunu bilirsiniz. Hiyeroglif, 1000ʼden çok LaTeX simgesi arasında çizim yaparak arama yapmanızı sağlar.

source: Main Window
tr: Ana Pencere

source: Placeholder
tr: Yer Tutucu

source: Improve Hieroglyphic
tr: Hieroglyphic’i İyileştir

source: Help make Hieroglyphic better at identifying symbols for everyone
tr: Herkesin simgeleri daha iyi tanımlaması için Hieroglyphic’e yardımcı olun

source: Contribute Symbols
tr: Simgelere Katkı Ver

source: Submit recognized drawings to Hieroglyphic’s dataset
tr: Tanınan çizimleri Hieroglyphic veri kümesine gönderin

source: Copy
tr: Kopyala

source: No Symbols
tr: Simge Yok

source: Start by drawing a symbol
tr: Simge çizerek başla

source: All Symbols
tr: Tüm Simgeler

source: _Clear
tr: _Temizle

source: About Hieroglyphic
tr: Hieroglyphic Hakkında

source: translator-credits
tr: Sabri Ünal <yakushabb@gmail.com>

source: Copied “{}”
tr: “{}” kopyalandı!
