Repository: yakushabb/foss-desktop-turkish
Catalog: GNOME/Circle/warp.main.*.po
Languages: tr

source: Fast and secure file transfer
tr: Hızlı ve güvenli dosya aktarımı

source: Gnome;GTK;Wormhole;Magic-Wormhole;
tr: Gnome;GTK;Wormhole;Magic-Wormhole;solucan deliği;büyülü solucan deliği;

source: Warp allows you to securely send files to each other via the internet or local network by exchanging a word-based code.
tr: Warp, sözcük tabanlı kod değiş tokuşuyla internet veya yerel ağdan güvenle dosya göndermeyi sağlar.

source: The best transfer method will be determined using the “Magic Wormhole” protocol which includes local network transfer if possible.
tr: En iyi aktarım yöntemi, oluyorsa yerel ağ aktarımını da içeren “Magic Wormhole” (Büyülü Solucan Deliği) iletişim kuralını kullanılarak belirlenecektir.

source: Features
tr: Özellikler

source: Send files between multiple devices
tr: Birden çok aygıt arasında dosya gönder

source: Every file transfer is encrypted
tr: Her dosya aktırımı şifrelenir

source: Directly transfer files on the local network if possible
tr: Oluyorsa dosyaları doğrudan yerel ağdan aktar

source: An internet connection is required
tr: İnternet bağlantısı gereklidir

source: QR Code support
tr: QR Kod desteği

source: Compatibility with the Magic Wormhole command line client and all other compatible apps
tr: Magic Wormhole komut satırı istemcisi ve diğer tüm uyumlu uygulamalarla uyumluluk

source: Main Window
tr: Ana Pencere

source: Transmit Code
tr: Aktarım Kodu

source: Accept File Transfer
tr: Dosya Aktarımını Kabul Et

source: Receiving File
tr: Dosya Alınıyor

source: File Transfer Complete
tr: Dosya Aktarımı Tamamlandı

# shortcut window
source: General
tr: Genel

# shortcut window
source: Show Help
tr: Yardımı Göster

# shortcut window
source: Show Shortcuts
tr: Kısayolları Göster

# shortcut window
source: Show Preferences
tr: Tercihleri Göster

# shortcut window
source: Quit
tr: Çık

# shortcut window
source: File Transfer
tr: Dosya Aktarımı

# shortcut window
source: Send File
tr: Dosya Gönder

# shortcut window
source: Send Folder
tr: Klasör Gönder

# shortcut window
source: Receive File
tr: Dosya Al

source: One second left
tr: {} saniye kaldı

source: One minute left
tr: {} dakika kaldı

source: One hour left
tr: {} saat kaldı

source: One day left
tr: {} gün kaldı

source: Copied Code to Clipboard
tr: Kod Panoya Kopyalandı

source: Copied Link to Clipboard
tr: Bağlantı Panoya Kopyalandı

source: Copied Error to Clipboard
tr: Hata Panoya Kopyalandı

source: No error available
tr: Hata yok

source: Creating Archive
tr: Arşiv Oluşturuluyor

source: Compressing folder “{}”
tr: “{}” klasörü sıkıştırılıyor

source: Connecting
tr: Bağlanılıyor

source: Requesting file transfer
tr: Dosya aktarımı isteniyor

source: Ready to send “{}”.
tr: “{}” gönderilmeye hazır.

source: The receiver needs to enter or scan this code to begin the file transfer.
tr: Dosya aktarımını başlatmak için alıcı bu kodu girmeli veya taramalıdır.

source: The QR code is compatible with the following apps: {}.
tr: QR kod şu uygulamalarla uyumludur: {}.

source: You have entered a custom rendezvous server URL in preferences. Please verify the receiver also uses the same rendezvous server.
tr: Tercihlerde özel randevu sunucusu URLʼsi girdiniz. Alıcının da aynı randevu sunucusunu kullandığından emin olun.

source: Click the QR code to copy the link to the clipboard.
tr: Bağlantıyı panoya kopyalamak için QR koduna tıklayın.

source: Connecting to peer with code “{}”
tr: “{}” koduyla eşe bağlanıyor

source: Connected to Peer
tr: Eşe Bağlandı

source: Preparing to send file
tr: Dosya göndermeye hazırlanıyor

source: Preparing to receive file
tr: Dosya almaya hazırlanıyor

source: Your peer wants to send you “{0}” (Size: {1}). Do you want to download this file? The default action will save the file to your Downloads folder.
tr: Eşiniz size “{0}” (Boyut: {1}) dosyasını göndermek istiyor. Bu dosyayı indirmek istiyor musunuz? Öntanımlı eylem, dosyayı İndirilenler klasörünüze kaydeder.

source: Ready to Receive File
tr: Dosya Almaya Hazır

source: A file is ready to be transferred. The transfer needs to be acknowledged.
tr: Dosya aktarılmaya hazır. Aktarımın onaylanması gerekiyor.

source: File “{}” via local network direct transfer
tr: Doğrudan yerel ağdan aktarılan “{}” dosyası

source: File “{}” via direct transfer
tr: Doğrudan aktarılan “{}” dosyası

source: File “{0}” via relay {1}
tr: {1} rölesiyle “{0}” dosyası

source: File “{}” via relay
tr: Röleyle “{}” dosyası

source: File “{}” via Unknown connection method
tr: Bilinmeyen bağlantı yöntemiyle “{}” dosyası

source: Sending File
tr: Dosya Gönderiliyor

source: Successfully sent file “{}”
tr: “{}” dosyası gönderimi başarılı

source: File has been saved to the selected folder as “{}”
tr: Dosya, seçilen klasöre “{}” olarak kaydedildi

source: File has been saved to the Downloads folder as “{}”
tr: Dosya, İndirilenler klasörüne “{}” olarak kaydedildi

source: File Transfer Failed
tr: Dosya Aktarımı Başarısız

source: The file transfer failed: {}
tr: Dosya aktarımı başarısız: {}

source: Specified file / directory does not exist
tr: Belirtilen dosya / dizin yok

source: Error parsing rendezvous server URL. An invalid URL was entered in the settings.
tr: Randevu sunucusu URLʼsi ayrıştırılırken hata oluştu. Ayarlara geçersiz URL girilmiş.

source: Error parsing transit URL. An invalid URL was entered in the settings.
tr: Aktarım sunucusu URLʼsi ayrıştırılırken hata oluştu. Ayarlara geçersiz URL girilmiş.

source: Invalid path selected: {}
tr: Geçersiz yol seçildi: {}

source: {} File - Size: {}
tr: {} Dosya - Boyut: {}

source: Save As
tr: Farklı Kaydet

source: Copy Transmit Link
tr: Aktarım Bağlantısını Kopyala

source: Your Transmit Code
tr: Aktarım Kodunuz

source: Copy Transmit Code
tr: Aktarım Kodunu Kopyala

source: Accept File Transfer?
tr: Dosya Aktarımı Kabul Edilsin Mi?

source: Save to Downloads Folder
tr: İndirilenler Klasörüne Kaydet

source: _Accept
tr: _Kabul Et

source: Sa_ve As…
tr: F_arklı Kaydet…

source: File Transfer Successful
tr: Dosya Aktarımı Başarılı

source: _Open File
tr: Dosya _Aç

source: _Show in Folder
tr: _Klasörde Göster

source: Co_py Error Message
tr: Hata İletisini Ko_pyala

source: _Cancel
tr: İ_ptal

source: Unable to use transfer link: another transfer already in progress
tr: Aktarım bağlantısı kullanılamaz: başka aktarım sürüyor

source: Sending a File
tr: Dosya Gönderiliyor

source: Receiving a File
tr: Dosya Alınıyor

source: Camera access denied. Open Settings and allow Warp to access the camera.
tr: Kamera erişimi reddedildi. Ayarlarʼı açın ve Warpʼın kamerayaya erişmesine izin verin.

source: Failed to start the camera: {}
tr: Kamera başlatılamadı: {}

source: Error
tr: Hata

source: Could not use the camera portal: {}
tr: Kamera kapısı kullanılamadı: {}

source: Could not start the device provider: {}
tr: Aygıt sağlayıcısı başlatılamadı: {}

source: No Camera Found
tr: Kamera Bulunamadı

source: Connect a camera to scan QR codes
tr: QR kodlarını taramak için kamera bağlayın

source: Scan QR Code
tr: QR Kodunu Tara

source: _Retry
tr: _Yeniden Dene

source: _Troubleshooting
tr: _Sorun Giderme

source: Downloads dir missing. Please set XDG_DOWNLOAD_DIR
tr: İndirilenler dizini bulunamadı. Lütfen XDG_DOWNLOADS_DIR değerini ayarlayın

source: Licensed under the <a href="{}">{}</a>.
tr: <a href="{}">{}</a> ile lisanslanmıştır.

source: Licensed under the {}.
tr: {} ile lisanslanmıştır.

source: Changing the rendezvous server URL needs to be done on both sides of the transfer. Only enter a server URL you can trust. Leaving these entries empty will use the app defaults: Rendezvous Server: “{0}” Transit Server: “{1}”
tr: Randevu sunucusu URLʼsinin değiştirilmesi, aktarımın her iki ucunda da yapılmalıdır. Yalnızca güvenebileceğiniz sunucu URLʼsi girin. Bu girdiler boş bırakıldığında uygulama öntanımlıları kullanır. Randevu Sunucusu: “{0}” Aktarım Sunucusu: “{1}”

source: Preferences
tr: Tercihler

source: Network
tr: Ağ

source: Code Words
tr: Kod Sözcükleri

source: The code word count determines the security of the transfer. A short code is easy to remember but increases the risk of someone else guessing the code. As a code may only be guessed once, the risk is very small even with short codes. A length of 4 is very secure.
tr: Kod sözcüğü sayısı, aktarımın güvenliğini belirler. Kısa kod kolayca anımsanır ancak başkasının kodu öngörme riskini de artırır. Kod yalnızca bir kez öngörülebileceğinden, kısa kodlarda bile risk çok küçüktür. 4 sözcüklük uzunluk çok güvenlidir.

source: Code Word Count
tr: Kod Sözcük Sayısı

source: Server URLs
tr: Sunucu URLʼleri

source: Rendezvous Server URL
tr: Randevu Sunucusu URLʼleri

source: Transit Server URL
tr: Aktarım Sunucusu URLʼsi

source: Welcome
tr: Hoş Geldiniz

source: Welcome to Warp
tr: Warpʼa Hoş Geldiniz

source: Next
tr: Sonraki

source: Introduction
tr: Tanıtım

source: Warp makes file transfer simple. To get started, both parties need to install Warp on their devices. After selecting a file to transmit, the sender needs to tell the receiver the displayed transmit code. This is preferably done via a secure communication channel. When the receiver has entered the code, the file transfer can begin. For more information about Warp, open the Help section from the Main Menu.
tr: Warp, dosya aktarımını basitleştirir. Başlamak için her iki aygıta Warp kurulmalıdır. Gönderilecek dosya seçildiğinde, gönderici görünen aktarım kodunu alıcıya söylemelidir. Bu tercihen güvenli iletişim kanalıyla yapılır. Alıcı, kodu girdiğinde dosya aktarımı başlayacaktır. Warp ile ilgili daha çok bilgi için Ana Menüden Yardım sayfalarına bakın.

source: Get Started Using Warp
tr: Warp Kullanmaya Başla

source: Error loading config file “{0}”, using default config. Error: {1}
tr: “{0}” yapılandırma dosyası yüklenemedi, öntanımlı ayar kullanılıyor. Hata: {1}

source: Error saving configuration file: {}
tr: Yapılandırma dosyası kaydedilirken hata: {}

source: translator-credits
tr: Sabri Ünal <yakushabb@gmail.com> Emin Tufan Çetin <etcetin@gmail.com>

source: Select File to Send
tr: Gönderilecek Dosya Seç

source: Select Folder to Send
tr: Gönderilecek Klasör Seç

source: “{}” appears to be an invalid Transmit Code. Please try again.
tr: “{}” geçersiz Aktarım Kodu gibi görünüyor. Lütfen yeniden deneyin.

source: Sending files with a preconfigured code is not yet supported
tr: Önceden yapılandırılmış kodla dosya gönderimi henüz desteklenmiyor

source: _Preferences
tr: _Tercihler

source: _Keyboard Shortcuts
tr: _Klavye Kısayolları

source: _Help
tr: _Yardım

source: _About Warp
tr: Warp _Hakkında

source: Inserted code from clipboard
tr: Kod, panodan eklendi

source: Abort File Transfer?
tr: Dosya Aktarımı Durdurulsun Mu?

source: Do you want to abort the current file transfer?
tr: Geçerli dosya aktarımını durdurmak istiyor musunuz?

source: _Continue
tr: _Sürdür

source: _Abort
tr: _Durdur

source: Unable to Open File
tr: Dosya Açılamadı

source: _Close
tr: _Kapat

source: Main Menu
tr: Ana Menü

source: _Send
tr: _Gönder

source: Send File
tr: Dosya Gönder

source: Select or drop the file or directory to send
tr: Gönderilecek dosyayı/dizini seç veya sürükleyip bırak

source: Select _File…
tr: _Dosya Seç…

source: Select F_older…
tr: _Klasör Seç…

source: _Receive
tr: _Al

source: Receive File
tr: Dosya Al

source: Enter the transmit code from the sender
tr: Göndericiden gelen aktarım kodunu girin

source: Receive _File
tr: _Dosya Al

source: File Transfer
tr: Dosya Aktarımı

source: Failed to open downloads folder.
tr: İndirilenler klasörü açılamadı.

source: The URI format is invalid
tr: URI biçimi geçersiz

source: The code does not match the required format
tr: Kod gerekli biçimle eşleşmiyor

source: Unknown URI version: {}
tr: Bilinmeyen URI sürümü: {}

source: The URI parameter “rendezvous” contains an invalid URL: “{}”
tr: “rendezvous” URI parametresi geçersiz URL içeriyor: “{}”

source: The URI parameter “role” must be “follower” or “leader” (was: “{}”)
tr: “role” URI parametresi, “follower” veya “leader” olmalıdır (olan: “{}”)

source: Unknown URI parameter “{}”
tr: Bilinmeyen URI parametresi “{}”

source: An error occurred
tr: Hata oluştu

source: Corrupt or unexpected message received
tr: Bozuk ya da beklenmedik ileti alındı

source: The rendezvous server will not allow further connections for this code. A new code needs to be generated.
tr: Randevu sunucusu, bu kod için daha çok bağlantıya izin vermiyor. Yeni kod oluşturulmalıdır.

source: The rendezvous server removed the code due to inactivity. A new code needs to be generated.
tr: Randevu sunucusu, durgunluk nedeniyle kodu kaldırdı. Yeni kod oluşturulmalıdır.

source: The rendezvous server responded with an unknown message: {}
tr: Randevu sunucusu bilinmeyen iletiyle yanıtladı: {}

source: Error connecting to the rendezvous server. You have entered a custom rendezvous server URL in preferences. Please verify the URL is correct and the server is working.
tr: Randevu sunucusuna bağlanırken hata oluştu. Tercihlerde özel randevu sunucusu URLʼsi girdiniz. URLʼnin doğru olduğundan ve sunucunun çalıştığından emin olun.

source: Error connecting to the rendezvous server. Please try again later / verify you are connected to the internet.
tr: Randevu sunucusuna bağlanırken hata oluştu. Lütfen daha sonra yeniden deneyin / internete bağlı olduğunuzdan emin olun.

source: Encryption key confirmation failed. If you or your peer didn't mistype the code, this is a sign of an attacker guessing passwords. Please try again some time later.
tr: Şifreleme anahtarı doğrulaması başarısız. Siz veya eşiniz kodu yanlış yazmadıysanız, bu, saldırganın parolaları öngördüğünün belirtisidir. Lütfen bir süre sonra yeniden deneyin.

source: Cannot decrypt a received message
tr: Alınan iletinin şifresi çözülemiyor

source: An unknown error occurred
tr: Bilinmeyen hata oluştu

source: The specified code must not be empty
tr: Belirtilen kod boş olmamalıdır

source: The code must contain at least one “-”
tr: Kod en az bir “-” içermelidir

source: The first segment of a code must be a number
tr: Kodun ilk bölümü sayı olmalıdır

source: Code too weak. It can be guessed with an average of {} try.
tr: Kod çok zayıf. Ortalama {} deneme ile öngörülebilir.

source: Code too short. The text after the “-” must be at least {} character long.
tr: Kod çok kısa. “-” iminden sonraki metin en az {} karakter olmalıdır.

source: Code too weak
tr: Kod çok zayıf

source: File / Directory not found
tr: Dosya / Dizin bulunamadı

source: Permission denied
tr: İzin reddedildi

source: Canceled
tr: İptal edildi

source: Portal service response: Permission denied
tr: Kapı hizmeti yanıtı: İzin reddedildi

source: The portal service has failed: {}
tr: Kapı hizmeti başarısız: {}

source: Error communicating with the portal service via zbus: {}
tr: Kapı hizmetiyle zbus üzerinden iletişim kurulurken hata: {}

source: Portal error: {}
tr: Kapı hatası: {}

source: Transfer was not acknowledged by peer
tr: Aktarım eşçe onaylanmadı

source: The received file is corrupted
tr: Alınan dosya bozuk

source: The file contained a different amount of bytes than advertised! Sent {} bytes, but should have been {}
tr: Dosya, söylenenden başka miktarda bayt içeriyordu! {} bayt gönderildi, ancak {} olmalıydı

source: The other side has cancelled the transfer
tr: Karşı taraf aktarımı iptal etti

source: The other side has rejected the transfer
tr: Karşı taraf aktarımı reddetti

source: Something went wrong on the other side: {}
tr: Karşı tarafta bir şeyler yanlış gitti: {}

source: Error while establishing file transfer connection
tr: Dosya aktarım bağlantısı kurulurken hata

source: Unknown file transfer error
tr: Bilinmeyen dosya aktarım hatası

source: An unknown error occurred while creating a zip file: {}
tr: Zip dosyası oluşturulurken bilinmeyen hata oluştu: {}

source: An unexpected error occurred. Please report an issue with the error message.
tr: Beklenmedik hata oluştu. Lütfen hata iletisiyle ilgili sorun bildirin.
