Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/amarok._json_.po
Languages: tr

# Name
source: Albums
tr: Albümler

# Name
source: Analyzer
tr: Çözümleyici

# Name
source: Current Track
tr: Geçerli Parça

# Name
source: Lyrics
tr: Şarkı Sözleri

# Name
source: Photos
tr: Fotoğraflar

# Name
source: Similar Artists
tr: Benzer Sanatçılar

# Name
source: Wikipedia
tr: Vikipedi

# Name
source: AudioCd Collection
tr: Ses CD’si Koleksiyonu

# Name
source: DAAP Collection
tr: DAAP Koleksiyonu

# Name
source: MySQL Collection
tr: MySQL Koleksiyonu

# Name
source: iPod, iPad & iPhone Collection
tr: iPod, iPad ve iPhone Koleksiyonu

# Name
source: Media Device Collection
tr: Ortam Aygıtı Koleksiyonu

# Name
source: MTP Collection
tr: MTP Koleksiyonu

# Name
source: Playdar Collection
tr: Playdar Koleksiyonu

# Name
source: Universal Mass Storage Collection
tr: Evrensel Yığın Depolaması Koleksiyonu

# Name
source: MySQLe Storage
tr: MySQLe Depolaması

# Name
source: MySQLServer Storage
tr: MySQL Sunucu Depolaması

# Name
source: Amarok 2.x Importer
tr: Amarok 2.x İçe Aktarıcısı

# Name
source: Banshee Importer
tr: Banshee İçe Aktarıcısı

# Name
source: Clementine Importer
tr: Clementine İçe Aktarıcısı

# Name
source: Amarok 1.4 (FastForward) Importer
tr: Amarok 1.4 (FastForward) İçe Aktarıcısı

# Name
source: Apple iTunes Importer
tr: Apple iTunes İçe Aktarıcısı

# Name
source: Rhythmbox Importer
tr: Rhythmbox İçe Aktarıcısı

# Name
source: Cool Streams
tr: Güzel Akışlar

# Name
source: Amarok Script Console
tr: Amarok Betik Konsolu

# Name
source: Ampache Service Config
tr: Ampache Hizmeti Yapılandırması

# Name
source: gpodder.net Service Config
tr: gpodder.net Hizmeti Yapılandırması

# Name
source: Last.fm Service Config
tr: Last.fm Hizmeti Yapılandırması

# Name
source: MagnatuneStore Service Config
tr: MagnatuneStore Hizmeti Yapılandırması

# Name
source: Magnatune Store
tr: Magnatune Mağazası

# Name
source: MP3tunes Service Config
tr: MP3tunes Hizmeti Yapılandırması

# Name
source: Podcast Directory
tr: Pod Yayını Dizini

# Description
source: Album cover manager for Amarok
tr: Amarok için albüm kapak görseli yöneticisi

# Description
source: Analyzer applet for Amarok
tr: Amarok için çözümleyici uygulamacığı

# Description
source: Current track applet for Amarok
tr: Amarok için şu anda çalan parça uygulamacığı

# Description
source: Lyrics applet for Amarok
tr: Amarok için şarkı sözü uygulamacığı

# Description
source: Photos applet for Amarok
tr: Amarok için fotoğraflar uygulamacığı

# Description
source: Last.fm similar artists applet for Amarok
tr: Amarok için Last.fm benzer sanatçılar uygulamacığı

# Description
source: Wikipedia applet for Amarok
tr: Amarok için Vikipedi uygulamacığı

# Description
source: QML base package for amarok context area
tr: Amarok bağlam alanı için QML temel paketi

# Description
source: AudioCd collection plugin for Amarok
tr: Amarok için ses CD’si koleksiyonu eklentisi

# Description
source: DAAP collection plugin for Amarok
tr: Amarok için DAAP koleksiyonu eklentisi

# Description
source: Collection plugin for Amarok
tr: Amarok için koleksiyon eklentisi

# Description
source: Plugin to use iPod-like devices as collections in Amarok
tr: Amarok için iPod benzeri aygıtları koleksiyon olarak kullanma eklentisi

# Description
source: Media Device collection plugin for Amarok
tr: Amarok için ortam aygıtı koleksiyonu eklentisi

# Description
source: MTP collection plugin for Amarok
tr: Amarok için MTP koleksiyonu eklentisi

# Description
source: Music that Playdar can find
tr: Playdar’ın bulabileceği müzik

# Description
source: Storage plugin for Amarok
tr: Amarok için depolama eklentisi

# Description
source: Import statistics from Amarok 2.x database
tr: İstatistikleri Amarok 2.x veritabanından içe aktar

# Description
source: Import statistics from Banshee database
tr: İstatistikleri Banshee veritabanından içe aktar

# Description
source: Import statistics from Clementine database
tr: İstatistikleri Clementine veritabanından içe aktar

# Description
source: Import statistics from Amarok 1.4 database
tr: İstatistikleri Amarok 1.4 veritabanından içe aktar

# Description
source: Import statistics from Apple iTunes database
tr: İstatistikleri Apple iTunes veritabanından içe aktar

# Description
source: Import statistics from Rhythmbox database
tr: İstatistikleri Rhythmbox veritabanından içe aktar

# Description
source: A scripted service that lets you search, stream and download free, public domain, audio books from Librivox.org
tr: Librivox.org sitesinden ücretsiz, kamuya açık alandan, ses kitapları aramanızı, göndermenizi veya indirmenizi sağlayan bir betik hizmeti.

# Description
source: A script that sets up a service with a few cool internet radio stations
tr: Birkaç güzel internet radyo istasyonu ile hizmet kuran bir betik

# Description
source: Amarok Script Console
tr: Amarok Betik Konsolu

# Description
source: Sets up the ampache server(s) to connect to
tr: Bağlanılacak ampache sunucularını ayarlar

# Description
source: Listen to music from an Ampache server
tr: Bir Ampache sunucusundan müzik dinle

# Description
source: Configure gpodder.net Credentials
tr: gpodder.net üyelik ayarlarını yapılandır

# Description
source: Podcast Service
tr: Pod Yayını Hizmeti

# Description
source: Listen to and download music uploaded by independent artists
tr: Bağımsız sanatçılar tarafından yüklenmiş müzikleri dinle ve indir

# Description
source: Set up Last.fm username and password
tr: Last.fm kullanıcı adı ve parolasını ayarlar

# Description
source: A service that integrates Last.fm functionality into Amarok
tr: Last.fm işlevlerini Amarok ile tümleştiren bir hizmet

# Description
source: Configure Magnatune store settings and memberships credentials
tr: Magnatune mağaza ve üyelik ayarlarını yapılandır

# Description
source: Preview and buy music from the non-evil Magnatune record label
tr: Kötü amaçlı olmayan Magnatune plak şirketinden etiketinden müzik önizle ve satın al

# Description
source: Configure mp3tunes credentials
tr: MP3tunes kimlik bilgilerini yapılandır

# Description
source: Browse and listen to the music stored in your MP3tunes account
tr: MP3tunes hesabınızdaki müzikleri incele ve dinle

# Description
source: Browse and subscribe to a huge list of podcasts
tr: Geniş bir pod yayını listesine göz at ve üye ol
