Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/calligra._json_.po
Languages: tr

# Name
source: Quickstates Plugin
tr: Quickstates Eklentisi

# Name
source: State Shape
tr: Şekil Durumu

# Name
source: ODP Backend
tr: ODP Arka Ucu

# Name
source: ODT Backend
tr: ODT Arka Ucu

# Name
source: Calligra Document Info Properties Page
tr: Calligra Belge Bilgisi Özellikleri Sayfası

# Name
source: Images (OpenDocument, MS Visio, WordPerfect, ...)
tr: Görseller (OpenDocument, MS Visio, WordPerfect, …)

# Name
source: OpenDocument, Microsoft Office Documents
tr: OpenDocument, Microsoft Office Belgeleri

# Name
source: Karbon EPS Import Filter
tr: Karbon EPS İçe Aktarma Süzgeci

# Name
source: Karbon JPEG/PNG Export Filter
tr: Karbon JPEG/PNG Dışa Aktarma Süzgeci

# Name
source: Karbon 1.x Import Filter
tr: Karbon 1.x İçe Aktarma Süzgeci

# Name
source: Karbon PDF Import Filter
tr: Karbon PDF İçe Aktarma Süzgeci

# Name
source: Karbon SVG Export Filter
tr: Karbon SVG Dışa Aktarma Süzgeci

# Name
source: Karbon SVG Import Filter
tr: Karbon SVG İçe Aktarma Süzgeci

# Name
source: Karbon WMF Export Filter
tr: Karbon WMF Dışa Aktarma Süzgeci

# Name
source: Karbon WMF Import Filter
tr: Karbon WMF İçe Aktarma Süzgeci

# Name
source: Karbon WPG Import Filter
tr: Karbon WPG İçe Aktarma Süzgeci

# Name
source: Karbon WVG Export Filter
tr: Karbon WMG Dışa Aktarma Süzgeci

# Name
source: Karbon XAML Import Filter
tr: Karbon XAML İçe Aktarma Süzgeci

# Name
source: Karbon XFig Import Filter
tr: Karbon XFig İçe Aktarma Süzgeci

# Name
source: Flow Visio Import Filter
tr: Flow Visio İçe Aktarma Süzgeci

# Name
source: Flow WPG Import Filter
tr: Flow WPG İçe Aktarma Süzgeci

# Name
source: KSpread Applix Spreadsheet Import Filter
tr: KSpread Applix Hesap Tablosu İçe Aktarma Süzgeci

# Name
source: CSV Import Filter for KSpread
tr: KSpread için CSV İçe Aktarma Süzgeci

# Name
source: CSV Export Filter for Calligra Sheets
tr: Calligra Tablolar için Dışa Aktarma Süzgeci

# Name
source: KSpread dBASE Import Filter
tr: KSpread dBASE İçe Aktarma Süzgeci

# Name
source: KSpread Microsoft Excel Export Filter
tr: KSpread Microsoft Excel Dışa Aktarma Süzgeci

# Name
source: KSpread Microsoft Excel Import Filter
tr: KSpread Microsoft Excel İçe Aktarma Süzgeci

# Name
source: GNUMERIC Import Filter for KSpread
tr: KSpread için GNUMERIC İçe Aktarma Süzgeci

# Name
source: GNUmeric Export Filter for KSpread
tr: KSpread için GNUMERIC Dışa Aktarma Süzgeci

# Name
source: HTML Import Filter for KSpread
tr: KSpread için HTML İçe Aktarma Süzgeci

# Name
source: HTML Export Filter for KSpread
tr: KSpread için HTML Dışa Aktarma Süzgeci

# Name
source: KSpread LATEX Export Filter
tr: KSpread LaTeX Dışa Aktarma Süzgeci

# Name
source: OpenOffice.org Calc Import Filter for KSpread
tr: KSpread için Apache OpenOffice Calc İçe Aktarma Süzgeci

# Name
source: OpenOffice.org Calc Export Filter for KSpread
tr: KSpread için Apache OpenOffice Calc Dışa Aktarma Süzgeci

# Name
source: Quattro Pro Import Filter for KSpread
tr: KSpread için Quattro Pro İçe Aktarma Süzgeci

# Name
source: MS Excel 2007 Import Filter for KSpread
tr: KSpread için MS Excel 2007 İçe Aktarma Süzgeci

# Name
source: Stage Apple Keynote Import Filter
tr: Sahne Apple Keynote İçe Aktarma Süzgeci

# Name
source: Filter to export KPR files to ODP
tr: KPR Dosyalarını ODP Olarak Dışa Aktarmak için Süzgeç

# Name
source: Microsoft PowerPoint Import Filter for Stage
tr: Sahne için Microsoft PowerPoint İçe Aktarma Süzgeci

# Name
source: PPT Backend
tr: PPT Arka Ucu

# Name
source: MS PowerPoint 2007 Import Filter for Stage
tr: Sahne için MS PowerPoint 2007 İçe Aktarma Süzgeci

# Name
source: PPTX Backend
tr: PPTX Arka Ucu

# Name
source: Words Applixword Import Filter
tr: Sözcükler Applixword İçe Aktarma Süzgeci

# Name
source: Words ASCII Import Filter
tr: Sözcükler ASCII İçe Aktarma Süzgeci

# Name
source: Words ASCII Export Filter
tr: Sözcükler ASCII Dışa Aktarma Süzgeci

# Name
source: MS Word DOCX Export Filter
tr: MS Word DOCX Dışa Aktarma Süzgeci

# Name
source: MS Word 2007 Import Filter for Words
tr: Sözcükler için MS Word 2007 İçe Aktarma Süzgeci

# Name
source: DOCX Backend
tr: DOCX Arka Ucu

# Name
source: ODT to Epub2 Export Filter
tr: ODT–Epub2 Dışa Aktarma Süzgeci

# Name
source: ODT to HTML Export Filter
tr: ODT–HTML Dışa Aktarma Süzgeci

# Name
source: ODT to Mobi Export Filter
tr: ODT–Mobi Dışa Aktarma Süzgeci

# Name
source: Words MS Word-ODF Import Filter
tr: Sözcükler MS Word–ODF İçe Aktarma Süzgeci

# Name
source: DOC Backend
tr: DOC Arka Ucu

# Name
source: Words RTF Import Filter
tr: Sözcükler RTF İçe Aktarma Süzgeci

# Name
source: RTF Backend
tr: RTF Arka Ucu

# Name
source: Words Wiki Export Filter
tr: Sözcükler Viki Dışa Aktarma Süzgeci

# Name
source: Words WordPerfect Import Filter
tr: Sözcükler WordPerfect İçe Aktarma Süzgeci

# Name
source: WPD Backend
tr: WPD Arka Ucu

# Name
source: Calligra Scalable Graphics Component
tr: Calligra Ölçeklenebilir Grafik Bileşeni

# Name
source: Karbon Flatten Path plugin
tr: Karbon Yolu Düzleştir Eklentisi

# Name
source: Karbon Refine Path plugin
tr: Karbon Yolu Rafine Et Eklentisi

# Name
source: Karbon Round Corners plugin
tr: Karbon Köşeleri Yuvarla Eklentisi

# Name
source: Karbon Whirl Pinch plugin
tr: Karbon Çimdikleyip Döndür Eklentisi

# Name
source: Basic Flakes
tr: Temel Tanecikler

# Name
source: Page Application Background Tool
tr: Sayfa Uygulaması Arka Plan Aracı

# Name
source: Artistic Text Shape
tr: Sanatsal Metin Şekli

# Name
source: Chart Shape
tr: Çizelge Şekli

# Name
source: LCMS Color Management Engine for Pigment
tr: Pigment için LCMS Renk Yönetimi İşletkesi

# Name
source: Comment Shape
tr: Yorum Şekli

# Name
source: Default Flake Tools
tr: Öntanımlı Tanecik Araçları

# Name
source: Calligra Dockers plugin
tr: Calligra Dockers Eklentisi

# Name
source: Formula Shape
tr: Formül Şekli

# Name
source: Karbon Tools
tr: Karbon Araçları

# Name
source: Music Shape
tr: Müzik Şekli

# Name
source: Path Shapes
tr: Yol Şekilleri

# Name
source: Picture Shape
tr: Resim Şekli

# Name
source: Plugin Shape
tr: Eklenti Şekli

# Name
source: RDF Contact Plugin
tr: RDF Kişi Eklentisi

# Name
source: RDF Calendar Event Plugin
tr: RDF Takvim Etkinliği Eklentisi

# Name
source: RDF Location Plugin
tr: RDF Konum Eklentisi

# Name
source: Filter Effects
tr: Süzgeç Efektleri

# Name
source: Template Shape
tr: Şablon Şekli

# Name
source: 3D Scene Shape
tr: 3B Sahne Şekli

# Name
source: Calligra Stencils Docker plugin
tr: Calligra Stensil Docker Eklentisi

# Name
source: Autocorrection plugin
tr: Kendiliğinden Düzeltme Eklentisi

# Name
source: Change case plugin
tr: Harf Biçimini Değiştir Eklentisi

# Name
source: SpellCheck plugin
tr: Yazım Denetimi Eklentisi

# Name
source: Thesaurus Tool
tr: Eşanlamlılar Sözlüğü Aracı

# Name
source: Text Shape
tr: Metin Şekli

# Name
source: Text Variables
tr: Metin Değişkenleri

# Name
source: Static Vector Shape
tr: Durağan Vektör Şekli

# Name
source: Video Shape
tr: Video Şekli

# Name
source: Web Shape
tr: Web Şekli

# Name
source: Bit Operation Functions
tr: Bit İşlemi İşlevleri

# Name
source: Conversion Functions
tr: Dönüştürme İşlevleri

# Name
source: Database Functions
tr: Veritabanı İşlevleri

# Name
source: DateTime Functions
tr: Tarih ve Zaman İşlevleri

# Name
source: Engineering Functions
tr: Mühendislik İşlevleri

# Name
source: Financial Functions
tr: Finansal İşlevler

# Name
source: Information Functions
tr: Bilgi İşlevleri

# Name
source: Logic Functions
tr: Mantık İşlevleri

# Name
source: Math Functions
tr: Matematik İşlevleri

# Name
source: Reference Functions
tr: Başvuru İşlevleri

# Name
source: Statistical Functions
tr: İstatistiksel İşlevler

# Name
source: Text Functions
tr: Metin İşlevleri

# Name
source: Trigonometry Functions
tr: Trigonometri İşlevleri

# Name
source: Calligra Spreadsheet Component
tr: Calligra Hesap Tablosu Bileşeni

# Name
source: Calendar Tool
tr: Takvim Aracı

# Name
source: Sheets Solver Plugin
tr: Tablolar Çözücü Eklentisi

# Name
source: Spreadsheet Shape
tr: Çalışma Sayfası Şekli

# Name
source: Calligra Stage Component
tr: Calligra Sahne Bileşeni

# Name
source: Animation Tool
tr: Canlandırma Aracı

# Name
source: Presentation Event Actions
tr: Sunum Olayı Eylemi

# Name
source: Bar Wipe
tr: Çubuk Sil

# Name
source: Clock wipe
tr: Saat Sil

# Name
source: Edge wipe
tr: Kenar Sil

# Name
source: Exploding Page
tr: Patlayan Sayfa

# Name
source: Fade
tr: Soldur

# Name
source: Iris Wipe
tr: İris Sil

# Name
source: Matrix wipe
tr: Matrix Sil

# Name
source: Slide Wipe
tr: Slayt Sil

# Name
source: Space Rotation
tr: Uzay Dönüşü

# Name
source: Swap Effect
tr: Takas Efekti

# Name
source: Jiggle and Wiggle
tr: Salla ve Kıpırdat

# Name
source: Presentation Variables
tr: Sunum Değişkenleri

# Name
source: Calligra Word Processing Component
tr: Calligra Sözcük İşleme Bileşeni

# Description
source: OpenDocument Presentation file renderer
tr: OpenDocument Sunum dosyası sunucusu

# Description
source: OpenDocument Text file renderer
tr: OpenDocument Metin dosyası sunucusu

# Description
source: PPT file renderer
tr: PPT dosyası sunucu

# Description
source: PPTX file renderer
tr: PPTX dosyası sunucu

# Description
source: DOCX file renderer
tr: DOCX dosyası sunucu

# Description
source: DOC file renderer
tr: DOC dosyası sunucu

# Description
source: RTF file renderer
tr: RTF dosyası sunucu

# Description
source: WordPerfect Document file renderer
tr: WordPerfect Document dosyası sunucu

# Description
source: A plugin to map contact items between document and RDF database
tr: Belge ve RDF veritabanı arasında kişi ögelerini eşlemlemek için bir eklenti

# Description
source: A plugin to map calendar event items between document and RDF database
tr: Belge ve RDF veritabanı arasında takvim etkinliği ögelerini eşlemlemek için bir eklenti

# Description
source: A plugin to map location items between document and RDF database
tr: Belge ve RDF veritabanı arasında konum ögelerini eşlemlemek için bir eklenti

# Description
source: Show Related Words
tr: İlgili sözcükleri göster

# Description
source: Inserts a calendar into a cell range.
tr: Bir hücre erimine bir takvim ekler.

# Description
source: Bar Wipe Page Effect
tr: Çubuk Sil Sayfa Efekti

# Description
source: Clock wipe Page Effects
tr: Saat Sil Sayfa Efektleri

# Description
source: Edge Wipe Page Effects
tr: Kenar Sil Sayfa Efektleri

# Description
source: Exploding Page Page Effect
tr: Patlayan Sayfa Sayfa Efekti

# Description
source: Fade Effect
tr: Soldur Efekti

# Description
source: Iris Wipe Page Effects
tr: İris Sil Sayfa Efektleri

# Description
source: Matrix wipe Page Effects
tr: Matrix Sil Sayfa Efektleri

# Description
source: Slide Wipe Page Effect
tr: Slayt Sil Sayfa Efekti

# Description
source: Space Rotation Page Effect
tr: Uzay Döndür Sayfa Efekti

# Description
source: Swap Page Effect
tr: Sayfa Takası Efekti

# Description
source: Jiggle and Wiggle that Shape!
tr: Şekli sallayın ve kıpırdatın!

# Copyright
source: Copyright 2010-2016 Sven Langkamp, Friedrich W. H. Kossebau
tr: Telif hakkı 2010–2016 Sven Langkamp, Friedrich W. H. Kossebau

# Copyright
source: Copyright 2012-2016 Sven Langkamp, Friedrich W. H. Kossebau
tr: Telif hakkı 2012–2016 Sven Langkamp, Friedrich W. H. Kossebau

# Authors Name
source: The KSpread Team
tr: KSpread Takımı
