Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/cantor._json_.po
Languages: tr

# Name
source: AdvancedPlot
tr: GelişmişGrafik

# Name
source: Differentiate
tr: Farklılaştır

# Name
source: Import Package
tr: Paketi İçe Aktar

# Name
source: Integrate
tr: Bütünleştir

# Name
source: Create Matrix
tr: Matris Oluştur

# Name
source: Eigenvalues
tr: Eigen değerleri

# Name
source: Eigenvectors
tr: Eigen Vektörleri

# Name
source: Invert Matrix
tr: Matrisi Tersine Çevir

# Name
source: Plot2d
tr: 2B Çizim

# Name
source: Plot3d
tr: 3B Çizim

# Name
source: RunScript
tr: Betiği Çalıştır

# Name
source: Solve
tr: Çözümle

# Name
source: KAlgebra
tr: K Cebir

# Name
source: Documentation
tr: Belgelendirme

# Name
source: File Browser
tr: Dosya Tarayıcısı

# Name
source: Help
tr: Yardım

# Name
source: Table Of Contents
tr: İçindekiler

# Name
source: Variables
tr: Değişkenler

# Description
source: An Assistant dialog to simplify calculating derivatives of expressions
tr: İfadelerin türevlerini hesaplamayı kolaylaştırmak için kullanılan yardımcı penceresi

# Description
source: An Assistant dialog to import a specific package (or library or module) to Cantor workspace
tr: Cantor çalışma alanına özel bir paket (veya kitaplık/modül) içe aktarmak için bir yardımcı penceresi

# Description
source: An Assistant dialog to simplify calculation of integrals
tr: İfadelerin integrallerini hesaplamayı kolaylaştıran yardımcı penceresi

# Description
source: An Assistant dialog to simplify entering of matrices
tr: Matris girişini kolaylaştıran yardımcı penceresi

# Description
source: An Assistant dialog to simplify calculating of Eigenvalues
tr: Eigen Değerleri hesaplamayı kolaylaştıran yardımcı penceresi

# Description
source: An Assistant dialog to simplify calculating of EigenVectors
tr: Eigen Vektörleri hesaplamayı kolaylaştıran yardımcı penceresi

# Description
source: An Assistant dialog to simplify inverting of matrices
tr: Ters matris almayı kolaylaştıran yardımcı penceresi

# Description
source: An Assistant dialog to simplify plotting of 2D functions
tr: 2 boyutlu işlevleri çizdirmeyi kolaylaştıran yardımcı penceresi

# Description
source: An Assistant dialog to simplify plotting of 3D functions
tr: 3 boyutlu işlevleri çizdirmeyi kolaylaştıran yardımcı penceresi

# Description
source: An Assistant for running an external Script file
tr: Harici betik çalıştırma penceresi

# Description
source: An Assistant dialog to simplify solving of equations
tr: Eşitlikleri çözmeye yardımcı olan yardımcı penceresi

# Description
source: Julia backend for Cantor
tr: Cantor için Julia arka ucu

# Description
source: KAlgebra backend for Cantor. Lets you use the same language you use in the KAlgebra application in Cantor worksheets.
tr: Cantor için K Cebir arka ucu. K Cebir uygulaması içinde Cantor çalışma sayfalarında kullanılan dille aynı dili kullanmanıza izin verir.

# Description
source: Backend for luajit
tr: Luajit için arka uç

# Description
source: Backend for the Maxima Computer Algebra System
tr: Maxima Computer Algebra System için arka uç

# Description
source: Backend for GNU Octave
tr: GNU Octave için arka uç

# Description
source: Backend for Python Scientific Programming
tr: Python Bilimsel Programlaması için arka uç

# Description
source: An Assistant for plotting with the Qalculate backend.
tr: Qalculate arka ucu ile bir grafik yardımcısı.

# Description
source: Qalculate backend for Cantor. Gives you the advanced features of Qalculate
tr: Cantor için Qalculate arka ucu. Qalculate gelişmiş özelliklerini sunar.

# Description
source: Backend for The R Project for Statistical Computing
tr: İstatistiksel hesaplama için R Project arka ucu

# Description
source: Backend for the Sage Mathematics Software
tr: Sage Matematik Yazılımı için arka uç

# Description
source: Backend for the Scilab Scientific Programming Environment
tr: Scilab Bilimsel Programlama Ortamı için arka uç

# Description
source: An Assistant for Cantor
tr: Cantor için bir yardımcı

# Description
source: A Backend for Cantor
tr: Cantor için bir arka uç

# Description
source: A Plugin for Cantor's Panel
tr: Cantor’un paneli için bir eklenti

# Description
source: A panel to display the official documentation of various backends
tr: Çeşitli arka uçların belgelendirmelerini görüntülemek için bir panel

# Description
source: A panel for working with files inside Cantor
tr: Cantor içinde dosyalarla çalışmak için bir panel

# Description
source: A panel to display help
tr: Yardımı görüntülemek üzere bir panel

# Description
source: A panel for showing worksheet structure
tr: Çalışma sayfası yapısını gösteren bir panel

# Description
source: A panel to manage the variables of a session
tr: Bir oturumun değişkenleri yönetmek için bir panel
