Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/kate._json_.po
Languages: tr

# Name
source: Backtrace Browser
tr: Geri İz Tarayıcısı

# Name
source: Bookmarks
tr: Yer İmleri

# Name
source: Close Except/Like
tr: Dışındakileri/Benzerleri Kapat

# Name
source: CMake Completion
tr: CMake Tamamlama

# Name
source: Color Picker
tr: Renk Seçicisi

# Name
source: Compiler Explorer
tr: Derleyici Gezgini

# Name
source: External Tools
tr: Dış Araçlar

# Name
source: File System Browser
tr: Dosya Sistemi Tarayıcısı

# Name
source: Documents Tree
tr: Belgeler Ağacı

# Name
source: Formatting
tr: Biçimlendirme

# Name
source: Kate Debugger
tr: Kate Hata Ayıklayıcısı

# Name
source: Build & Run
tr: Yap ve Çalıştır

# Name
source: SQL Plugin
tr: SQL Eklentisi

# Name
source: Keyboard Macros
tr: Klavye Makroları

# Name
source: Terminal
tr: Uçbirim

# Name
source: LaTeX completion
tr: LaTeX Tamamlama

# Name
source: LSP Client
tr: LSP İstemcisi

# Name
source: Open Link
tr: Bağlantı Aç

# Name
source: Document Preview
tr: Belge Önizlemesi

# Name
source: Project Plugin
tr: Proje Eklentisi

# Name
source: Colored Brackets
tr: Renkli Ayraçlar

# Name
source: Search & Replace
tr: Ara ve Değiştir

# Name
source: Scripts & Snippets
tr: Betikler ve Parçacıklar

# Name
source: Symbol Viewer
tr: Sembol Görüntüleyicisi

# Name
source: Document Switcher
tr: Belge Değiştiricisi

# Name
source: File Templates
tr: Dosya Şablonları

# Name
source: Text Filter
tr: Metin Süzgeci

# Name
source: XML Validation
tr: XML Doğrulama

# Name
source: XML Completion
tr: XML Tamamlama

# Description
source: C/C++ Backtrace navigation tool view
tr: C/C++ Geri iz dolaşım araç görünümü

# Description
source: Display and navigate bookmarks
tr: Yer imlerini görüntüleyin ve onlara bakın

# Description
source: Close group of documents based on a common path or file extension
tr: Aynı yol veya dosya uzantısı temelli belge grubunu kapat

# Description
source: Code completion for CMake files
tr: CMake dosyaları için kod tamamlama

# Description
source: Adds an inline Color preview/picker to colors in the text (e.g. #FFFFFF, white)
tr: Metindeki renklere satır içi renk önizleyici/seçici ekler (örn. #FFFFFF, beyaz)

# Description
source: View generated asm for C/C++ code
tr: C/C++ kodu için oluşturulmuş ASM görüntüleyin

# Description
source: Runs ESLint on current file
tr: Geçerli dosyada ESLint’i çalıştırır

# Description
source: External Tools
tr: Dış Araçlar

# Description
source: File system browser tool view
tr: Dosya sistemi tarayıcısı araç görünümü

# Description
source: Displays the open documents in a file tree
tr: Açık belgeleri bir dosya ağacında görüntüler

# Description
source: Plugin for formatting code
tr: Kod biçimlendirme için eklenti

# Description
source: Provides debugger integration
tr: Hata ayıklayıcı tümleştirmesi sağlar

# Description
source: Adds an inline git-blame preview at the end of the line
tr: Satır sonuna bir satır içi git-blame önizleyicisi ekler

# Description
source: Build, parse output and run applications
tr: Uygulamaları yap, çıktıyı ayrıştır ve uygulamaları çalıştır

# Description
source: Look up definitions/declarations with CTags
tr: CTags ile tanımlara/beyanlara bakın

# Description
source: Execute query on SQL databases
tr: SQL veritabanlarında sorgu çalıştırın

# Description
source: Record and play keyboard macros (i.e., keyboard action sequences)
tr: Klavye makroları kaydedin ve oynatın (örn. klavye eylem sıralamaları)

# Description
source: Have a terminal at the ready, using KDE's Konsole widget
tr: KDE’nin Konsole araç takımını kullanarak elinizin altında bir uçbirim bulundurun

# Description
source: LaTeX syntax for unicode symbols
tr: Unicode semboller için LaTeX sözdizimi

# Description
source: Language Server Protocol Client
tr: Dil Sunucusu Protokolü İstemcisi

# Description
source: Highlight and open links (via CTRL-click)
tr: Bağlantıları vurgulayın ve açın (Kontrol+tık ile)

# Description
source: Preview the document in the target format
tr: Belgeyi hedef biçimde önizleyin

# Description
source: Integration with Git and other source control systems
tr: Git ve diğer sürüm denetim sistemleriyle tümleşim

# Description
source: Colored brackets for readability
tr: Okunabilirlik için renkli ayraçlar

# Description
source: Run SQL-like queries using RBQL
tr: RBQL kullanarak SQL tarzı sorgular çalıştırın

# Description
source: Replicode (constructivist AI language and runtime)
tr: Replicode (yapıcı AI dili ve çalıştırıcısı)

# Description
source: Search and replace in documents, folders, or projects
tr: Projelerde, klasörlerde ve belgelerde bulun ve değiştirin

# Description
source: Create or download code snippets and editor scripts
tr: Kod parçacıkları ve düzenleyici betikleri oluşturun veya indirin

# Description
source: Extract and show reference symbols from source
tr: Kaynaktan başvuru sembollerini çıkarın ve gösterin

# Description
source: Quick document switching with Alt+Tab behavior
tr: Seçenek+Sekme davranışı ile tez belge değiştirme

# Description
source: Project and file templates
tr: Proje ve dosya şablonları

# Description
source: TMPL_PLUGIN_UI_NAME_TMPL description
tr: TMPL_PLUGIN_UI_NAME_TMPL açıklaması

# Description
source: Process text using terminal commands
tr: Metni uçbirim komutları kullanarak işleyin

# Description
source: Validates XML files using xmllint
tr: XML dosyalarını xmllint kullanarak doğrular

# Description
source: Lists XML elements, attributes, attribute values and entities allowed by DTD
tr: XML ögelerini, özniteliklerini, öznitelik değerlerini ve DTD tarafından izin verilen varlıkları listeler
