Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/kdeconnect-kde._json_.po
Languages: tr

# Name
source: Send file via KDE Connect
tr: KDE Bağlan ile Dosya Gönder

# Name
source: KDE Connect
tr: KDE Bağlan

# Name
source: Battery monitor
tr: Pil monitörü

# Name
source: Bigscreen voice control
tr: Büyük Ekran sesle denetim

# Name
source: Clipboard
tr: Geçici taşıma panosu

# Name
source: Connectivity monitor
tr: Bağlantı monitörü

# Name
source: Contacts
tr: Kişiler

# Name
source: Ring my phone
tr: Telefonu çaldır

# Name
source: Find this device
tr: Bu aygıtı bul

# Name
source: LockDevice
tr: AygıtıKilitle

# Name
source: ModemManager Telephony integration
tr: ModemManager Telephony tümleştirmesi

# Name
source: Virtual input
tr: Sanal giriş

# Name
source: Multimedia control receiver
tr: Çoklu ortam denetimi alıcısı

# Name
source: Receive notifications
tr: Bildirimleri al

# Name
source: Pause media during calls
tr: Aramalar sırasında ortamı duraklat

# Name
source: Presenter
tr: Sunucu

# Name
source: Host remote commands
tr: Sunucu uzaktan komutları

# Name
source: RemoteControl
tr: UzaktanKumanda

# Name
source: Remote keyboard from the desktop
tr: Masaüstünden uzak klavye

# Name
source: Remote system volume
tr: Uzak sistem bölümü

# Name
source: Run commands
tr: Komutlar çalıştırın

# Name
source: Inhibit screensaver
tr: Ekran koruyucuyu engelle

# Name
source: Send notifications
tr: Bildirim gönder

# Name
source: Remote filesystem browser
tr: Uzak dosya sistemi tarayıcısı

# Name
source: Share and receive
tr: Paylaş ve al

# Name
source: System volume
tr: Sistem sesi

# Name
source: Telephony integration
tr: Telefon tümleştirmesi

# Name
source: Virtual Monitor
tr: Sanal Ekran

# Description
source: Send file to other device using KDE Connect
tr: KDE Bağlan’ı kullanarak dosyayı başka bir aygıta gönder

# Description
source: Manage connected devices
tr: Bağlı aygıtları yönetin

# Description
source: Show your phone battery next to your computer battery
tr: Bilgisayar pilinizin yanında telefon pil durumunu göster

# Description
source: Send voice commands to your TV running Plasma Bigscreen
tr: Plasma Büyük ekran kullanan televizyonlara ses komutları gönder

# Description
source: Share the clipboard between devices
tr: Aygıtlar arasında panoyu paylaştır

# Description
source: Show your phone's network signal strength
tr: Telefonun ağ sinyal gücünü göster

# Description
source: Synchronize Contacts from the Connected Device to the Desktop
tr: Bağlı Aygıttaki Kişileri Masaüstüne Eşzamanla

# Description
source: Find your lost phone by making it play an alarm sound
tr: Bir alarm sesi çalarak kayıp telefonları bul

# Description
source: Find this device by making it play an alarm sound
tr: Bu aygıtı, bir alarm sesi çaldırarak bul

# Description
source: Locks your systems
tr: Sistemleri kilitler

# Description
source: Show notifications for incoming calls
tr: Gelen aramalar için bildirimleri göster

# Description
source: Use your phone as a touchpad and keyboard
tr: Telefonu dokunmatik yüzey ve klayve olarak kullan

# Description
source: Remote control your music and videos
tr: Müziği ve videoyu uzaktan denetle

# Description
source: Control MPRIS services
tr: MPRIS hizmetlerini denetle

# Description
source: Show device's notifications on this computer and keep them in sync
tr: Aygıtın bildirimlerini bilgisayarda göster ve eşzamanlı tut

# Description
source: Pause music/videos during a phone call
tr: Arama sırasında müzikleri/videoları duraklat

# Description
source: Send and receive pings
tr: Ping gönder ve al

# Description
source: Use your mobile device to point to things on the screen
tr: Ekrandaki şeylere işaret etmek için taşınabilir aygıtı kullan

# Description
source: Trigger commands predefined on the remote device
tr: Uzak aygıta önceden tanımlanmış komutları tetikle

# Description
source: Control Remote systems
tr: Uzak sistemleri denetle

# Description
source: Use your keyboard to send key-events to your paired device
tr: Eşleşmiş aygıta önemli etkinlikler göndermek için klavyeyi kullan

# Description
source: Control the volume of the connected device
tr: Bağlı aygıtın ses düzeyini denetle

# Description
source: Execute console commands remotely
tr: Uzaktan konsol komutları yürüt

# Description
source: Inhibit the screensaver when the device is connected
tr: Aygıt bağlandığında ekran koruyucuyu engelle

# Description
source: Broadcast this computer's notifications, so they can be shown on other devices.
tr: Bu bilgisayarın bildirimlerini yayınla, böylece diğer aygıtlarda gösterilebilirler.

# Description
source: Browse the remote device filesystem using SFTP
tr: Uzak aygıt dosya sistemine SFTP kullanarak göz at

# Description
source: Receive and send files, URLs or plain text easily
tr: Dosyaları, URL’leri ve düz metinleri kolayca al ve gönder

# Description
source: Send and receive SMS
tr: SMS gönder ve al

# Description
source: Control the system volume from your phone
tr: Sistem sesini telefondan denetle

# Description
source: Use your devices as virtual monitors
tr: Aygıtları sanal ekranlar olarak kullan
