Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/kdepim-addons._json_.po
Languages: tr

# Name
source: Evolution1 Importer
tr: Evolution1 İçe Aktarıcısı

# Name
source: Evolution2 Importer
tr: Evolution2 İçe Aktarıcısı

# Name
source: Geary Importer
tr: Geary İçe Aktarıcısı

# Name
source: MailApp Importer
tr: MailApp İçe Aktarıcısı

# Name
source: OE Importer
tr: OE İçe Aktarıcısı

# Name
source: Opera Importer
tr: Opera İçe Aktarıcısı

# Name
source: PMail Importer
tr: PMail İçe Aktarıcısı

# Name
source: TheBat Importer
tr: TheBat İçe Aktarıcısı

# Name
source: Import/Export CSV
tr: CSV İçe/Dışa Aktar

# Name
source: Import Export GMX
tr: GMX İçe/Dışa Aktar

# Name
source: Import/Export LDAP Contacts
tr: LDAP Kişilerini İçe/Dışa Aktar

# Name
source: Import/Export LDIF
tr: LDIF İçe/Dışa Aktar

# Name
source: Import/Export vCard
tr: vCard İçe/Dışa Aktar

# Name
source: Import/Export Windows Contact
tr: Windows Kişilerini İçe/Dışa Aktar

# Name
source: Check Gravatar
tr: Gravatar Denetle

# Name
source: Merge Contacts
tr: Kişileri Birleştir

# Name
source: Search Duplicate Contacts
tr: Yinelenen Kişileri Ara

# Name
source: Send Mail
tr: Posta Gönder

# Name
source: Send vCards
tr: VCard Gönder

# Name
source: Confirm Before Deleting Emails
tr: E-postaları Silmeden Önce Onayla

# Name
source: Open External Composer
tr: Dış Düzenleyiciyi Aç

# Name
source: AI Chat
tr: Yapay Zekâ Sohbeti

# Name
source: Ask IA
tr: Yapay Zekâya Sor

# Name
source: Autocorrection
tr: Otomatik Düzeltme

# Name
source: AutoGenerate Quick Answer
tr: Tez Yanıtı Kendiliğinden Üret

# Name
source: Change Case
tr: Büyük Küçük Harf Değiştir

# Name
source: Insert Email
tr: E-posta Ekle

# Name
source: Insert Short URL
tr: Kısa URL Ekle

# Name
source: Insert Special Character
tr: Özel Karakter Ekle

# Name
source: Insert Non Breaking Space
tr: Aralıksız Boşluk Ekle

# Name
source: Snippet
tr: Parçacık

# Name
source: Share Text
tr: Metni Paylaş

# Name
source: Zoom Text
tr: Metni Yakınlaştır/Uzaklaştır

# Name
source: Automatic Add Contacts
tr: Kişileri Otomatik Ekle

# Name
source: Check Before Send
tr: Göndermeden Önce Denetle

# Name
source: Confirm Address
tr: Adresi Onayla

# Name
source: French Grammar Checker
tr: Fransızca Gramer Denetleyicisi

# Name
source: Grammar Checker (LanguageTool)
tr: Gramer Denetleyicisi (LanguageTool)

# Name
source: GnuPG System
tr: GnuPG Sistemi

# Name
source: Akonadi Database Manager
tr: Akonadi Veritabanı Yöneticisi

# Name
source: Antivirus
tr: Antivirüs

# Name
source: Folder Size Check
tr: Klasör Boyutu Denetimi

# Name
source: Expert Plugin
tr: Uzman Eklenti

# Name
source: SendMail Mail Transport
tr: SendMail Posta İletimi

# Name
source: Translator
tr: Çeviren

# Name
source: DKIM Checker
tr: DKIM Denetleyicisi

# Name
source: Expire Trash Folder
tr: Çöp Klasörünün Süresini Geçir

# Name
source: Folder Settings
tr: Klasör Ayarları

# Name
source: Open Url With
tr: URL’yi Şununla Aç

# Name
source: Scam Settings
tr: Aldatma Ayarları

# Name
source: Brief Header Style
tr: Kısa Üstbilgi Biçimi

# Name
source: Fancy Header Style
tr: Süslü Üstbilgi Biçimi

# Name
source: Grantlee Header Style
tr: Grantlee Üstbilgi Biçimi

# Name
source: Long Header Style
tr: Uzun Üstbilgi Biçimi

# Name
source: Standards Header Style
tr: Standartlar Üstbilgi Biçimi

# Name
source: Expand URL
tr: URL Genişlet

# Name
source: AI
tr: Yapay Zekâ

# Name
source: Create Event
tr: Etkinlik Oluştur

# Name
source: Create Todo
tr: Yapılacak Ögesi Oluştur

# Name
source: External Script
tr: Harici Betik

# Name
source: Calendar Events
tr: Takvim Etkinlikleri

# Name
source: Email Address Akonadi Requester for Template Parser library
tr: Şablon Ayrıştırıcı Kitaplığı için Akonadi İsteyicisi E-posta Adresi

# Name
source: Do Not Track
tr: İzleme

# Description
source: This plugin allows you to import/export CSV.
tr: Bu eklenti, CSV içe/dışa aktarmanıza olanak tanır.

# Description
source: This plugin allows you to import/export GMX.
tr: Bu eklenti, GMX içe/dışa aktarmanıza olanak tanır.

# Description
source: This plugin allows you to import/export LDAP contacts.
tr: Bu eklenti, LDAP kişilerini içe/dışa aktarmanıza olanak tanır.

# Description
source: This plugin allows you to import/export LDIF.
tr: Bu eklenti, LDIF içe/dışa aktarmanıza olanak tanır.

# Description
source: This plugin allows you to import/export vCards.
tr: Bu eklenti, vCard içe/dışa aktarmanıza olanak tanır.

# Description
source: This plugin allows you to import/export Windows Contacts.
tr: Bu eklenti, Windows kişilerini içe/dışa aktarmanıza olanak tanır.

# Description
source: This plugin allows you to check the Gravatar images.
tr: Bu eklenti, Gravatar görsellerini denetlemenize olanak tanır.

# Description
source: This plugin allows you to merge contacts.
tr: Bu eklenti, kişileri birleştirmenize olanak tanır.

# Description
source: This plugin allows you to search duplicate contacts.
tr: Bu eklenti, yinelenen kişileri aramanıza olanak tanır.

# Description
source: This plugin allows you to send email directly to selected contacts.
tr: Bu eklenti, seçili kişilere doğrudan eposta göndermenize olanak tanır.

# Description
source: This plugin allows you to send vCard from selected contacts.
tr: Bu eklenti, seçili kişilerden vCard yollamanıza olanak tanır.

# Description
source: This plugin allows you to check if we want to delete specific email
tr: Bu eklenti, belirli bir e-postayı silmek isteyip istemediğinizi denetlemenize olanak tanır.

# Description
source: This plugin allows you to generate html from markdown language
tr: Bu eklenti, Markdown dilinden HTML üretmenize olanak tanır.

# Description
source: This plugin allows you to use an external composer.
tr: Bu eklenti, harici bir düzenleyici kullanmanıza olanak tanır.

# Description
source: This plugin opens AI chat.
tr: Bu eklenti, yapay zekâ sohbetini açar.

# Description
source: This plugin allows you to ask AI.
tr: Bu eklenti, yapay zekâya soru sormanıza olanak tanır.

# Description
source: This plugin allows you to autocorrect all text in composer or selected text.
tr: Bu eklenti, seçili metinde veya düzenleyicideki tüm metni kendiliğinden düzeltmenize olanak tanır.

# Description
source: This plugin allows to generate quick answer.
tr: Bu eklenti, tez bir yanıt üretmenize olanak tanır.

# Description
source: This plugin allows you to change the case of the selected text.
tr: Bu eklenti, seçili metnin büyük/küçük harf türünü değiştirmenize olanak verir.

# Description
source: This plugin allows you to select email and insert it in composer.
tr: Bu eklenti, bir e-posta seçmenizi ve onu oluşturucuya eklemenize olanak verir.

# Description
source: This plugin allows you to generate a shorter URL.
tr: Bu eklenti, daha kısa bir URL üretmenize olanak tanır.

# Description
source: This plugin allows you to insert special character in composer.
tr: Bu eklenti, düzenleyicide özel karakter eklemenize olanak tanır.

# Description
source: This plugin allows you to add non breaking space. It's useful in french language.
tr: Bu eklenti, boşluksuz boşluk karakteri koymanıza olanak tanır. Fransız dilinde kullanışlıdır.

# Description
source: This plugin allows you to insert special text as attachment name, emails etc.
tr: Bu eklenti, özel bir metni ek adı, e-postası olarak eklemenize olanak tanır.

# Description
source: This plugin allows you to share text.
tr: Bu eklenti, metin paylaşmanıza olanak tanır.

# Description
source: This plugin allows you to change zoom factor in composer.
tr: Bu eklenti, düzenleyicideki yakınlaştırma katsayısını değiştirmenize olanak verir.

# Description
source: This plugin allows you to add automatically email address to addressbook.
tr: Bu eklenti, eposta adreslerini kendiliğinden adres defterine eklemenize olanak tanır.

# Description
source: This plugin allows you to check message settings before sending.
tr: Bu eklenti, gönderimden önce ileti ayarlarınızı denetlemenize olanak tanır.

# Description
source: This plugin allows you to check mail before to send it
tr: Bu eklenti, gönderimden önce postanızı denetlemenize olanak tanır.

# Description
source: This plugin allows you to check grammar in french only.
tr: Bu eklenti, Fransızca gramer denetlemesi yapmanıza izin verir.

# Description
source: This plugin allows you to check grammar using LanguageTool.
tr: Bu eklenti, LanguageTool kullanarak gramer denetlemesi yapmanıza olanak verir.

# Description
source: Configuration of GnuPG System options
tr: GnuPG Sistemi seçeneklerinin yapılandırması

# Description
source: This plugin allows you to manage Akonadi database.
tr: Bu eklenti, Akonadi veritabanını yönetmenize izin verir.

# Description
source: This plugin allows you to configure Anti Spam in KMail.
tr: Bu eklenti, K Posta içinde Anti Spam yapılandırmanıza olanak tanır.

# Description
source: This plugin allows you to configure Anti Virus in KMail.
tr: Bu eklenti, K Posta içinde Anti Virüs yapılandırmanıza olanak tanır.

# Description
source: This plugin allows you to check folders size.
tr: Bu eklenti, klasör boyutlarını denetlemenize olanak tanır.

# Description
source: This plugin activates some expert actions.
tr: Bu ekletnti, kimi uzman eylemlerini etkinleştirir.

# Description
source: This plugin allows you to translate text.
tr: Bu eklenti, metni çevirmenize olanak tanır.

# Description
source: This plugin allows you to configure dkim support.
tr: Bu eklenti, DKIM desteğini yapılandırmanıza olanak tanır.

# Description
source: This plugin allows you to configure expire trash folder for each accounts.
tr: Bu eklenti, her bir hesap için çöp klasörü süre geçimi yapılandırmanıza olanak tanır.

# Description
source: This plugin allows you to configure folder settings.
tr: Bu eklenti, klasör ayarlarını yapılandırmanıza olanak tanır.

# Description
source: This plugin allows you to configure gravatar support.
tr: Bu eklenti, Gravatar desteğini yapılandırmanıza olanak tanır.

# Description
source: This plugin allows you to configure which apps used for specific url.
tr: Bu eklenti, belirli URL’lerin hangi uygulamalar tarafından kullanılacağını yapılandırmanıza olanak tanır.

# Description
source: This plugin allows you to configure scam settings.
tr: Bu eklenti, aldatma ayarlarını yapılandırmanıza olanak tanır.

# Description
source: This plugin reduces mail header to strict minimum.
tr: Bu eklenti, posta üstbilgisini olabildiğince ufak hale getirir.

# Description
source: This plugin provides you a fancy mail header style.
tr: Bu eklenti, süslü posta üstbilgisi biçimi sağlar.

# Description
source: This plugin allows you to use a Grantlee-based mail header style.
tr: Bu eklenti, Grantlee tabanlı posta üstbilgisi biçimini kullanımına olanak tanır.

# Description
source: This plugin allows you to show all headers from mail.
tr: Bu eklenti, postadaki tüm üstbilgiyi görmenize olanak tanır.

# Description
source: This plugin defines the standard mail header style.
tr: Bu eklenti, standart posta üstbilgisi biçimi tanımlar.

# Description
source: This plugin expands URL.
tr: Bu eklenti, URL’leri genişletir.

# Description
source: This plugin allows using AI.
tr: Bu eklenti, yapay zekâ kullanmanıza olanak tanır.

# Description
source: This plugin allows you to translate selected text.
tr: Bu eklenti, seçili metni çevirmenize olanak tanır.

# Description
source: This plugin allows you to create an event from a message.
tr: Bu eklenti, bir iletiden etkinlik oluşturmanıza olanak tanır.

# Description
source: This plugin allows you to create a todo from a message.
tr: Bu eklenti, bir iletiden yapılacak ögesi oluşturmanıza olanak tanır.

# Description
source: This plugin allows you to use an external script against the message viewer.
tr: Bu eklenti, ileti görüntüleyicide harici bir betik kullanmanıza olanak tanır.

# Description
source: Show your events from KDE calendar applications and Online Accounts
tr: KDE takvim uygulamalarından ve çevrimiçi hesaplardan etkinliklerinizi gösterin

# Description
source: This plugin allows you to block advertising.
tr: Bu eklenti, reklâmları engellemenize olanak tanır.

# Description
source: This plugin adds support for "do not track".
tr: Bu eklenti, “beni izleme” için destek ekler.
