Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/kdevelop._json_.po
Languages: tr

# Name
source: KDevelop Sessions
tr: K Geliştir Oturumları

# Name
source: Android Support
tr: Android Desteği

# Name
source: New Project Wizard
tr: Yeni Proje Sihirbazı

# Name
source: AStyle Formatter Backend
tr: Astyle Biçimlendiricisi Arka Ucu

# Name
source: Bazaar Support
tr: Bazaar Desteği

# Name
source: C++ Support
tr: C++ Desteği

# Name
source: Clang-Tidy Support
tr: Clang-Tidy Desteği

# Name
source: Class Browser
tr: Sınıf Tarayıcısı

# Name
source: Clazy Support
tr: Clazy Desteği

# Name
source: CMake Project Builder
tr: CMake Projesi Yapıcısı

# Name
source: CMake Documentation
tr: CMake Belgelendirmesi

# Name
source: CMake Project Manager
tr: CMake Proje Yöneticisi

# Name
source: Code Utilities
tr: Kod İzlenceleri

# Name
source: Code Browser
tr: Kod Tarayıcısı

# Name
source: Cppcheck Support
tr: Cppcheck Desteği

# Name
source: Craft runtime
tr: Craft çalıştırma ortamı

# Name
source: Custom Build System
tr: Özel Yapı Sistemi

# Name
source: Custom Defines And Includes Manager
tr: Özel “Define”lar ve “Include”lar Yöneticisi

# Name
source: Custom Makefile Project Manager
tr: Özel Makefile Proje Yöneticisi

# Name
source: Custom Script Formatter Backend
tr: Özel Betik Biçimlendiricisi Arka Ucu

# Name
source: Docker Support
tr: Docker Desteği

# Name
source: Most-Recently-Used Document Switcher
tr: Son Kullanılan Belgeleri Seçici

# Name
source: Document View
tr: Belge Görünümü

# Name
source: Execute Programs
tr: Uygulamaları Yürüt

# Name
source: Plasmoid Launcher
tr: Plasmoid Başlatıcısı

# Name
source: Execute Scripts
tr: Betikleri Yürüt

# Name
source: External Scripts
tr: Dış Betikler

# Name
source: KDE File Manager Integration
tr: KDE Dosya Yöneticisi Tümleştirmesi

# Name
source: File Templates Configuration
tr: Dosya Şablon Yapılandırması

# Name
source: Flatpak Support
tr: Flatpak Desteği

# Name
source: GDB Support
tr: GDB Desteği

# Name
source: Generic Project Manager
tr: Genel Proje Yöneticisi

# Name
source: GitHub Provider
tr: GitHub Sağlayıcısı

# Name
source: Git Support
tr: Git Desteği

# Name
source: Find/Replace In Files
tr: Dosyalarda Bul ve Değiştir

# Name
source: Heaptrack Support
tr: Heaptrack Desteği

# Name
source: Konsole Integration
tr: Konsole Tümleştirmesi

# Name
source: LLDB Support
tr: LLDB Desteği

# Name
source: Make Project Builder
tr: Make Projesi Yapıcısı

# Name
source: Man Pages
tr: Kılavuz Sayfaları

# Name
source: Meson Project Manager
tr: Meson Projesi Yöneticisi

# Name
source: Ninja Project Builder
tr: Ninja Projesi Yapıcısı

# Name
source: Hex Editor
tr: Hex Düzenleyicisi

# Name
source: Open With
tr: Birlikte Aç

# Name
source: Outline
tr: Ana Hat

# Name
source: Patch Review
tr: Yama Gözden Geçirmesi

# Name
source: Perforce Support
tr: Perforce Desteği

# Name
source: Problem Reporter View
tr: Sorun Bildirici Görünümü

# Name
source: Project Filter
tr: Proje Süzgeci

# Name
source: Project Manager View
tr: Proje Yöneticisi Görünümü

# Name
source: QMake Project Builder
tr: QMake Proje Yapıcısı

# Name
source: QMake Project Manager
tr: QMake Proje Yöneticisi

# Name
source: QML Support
tr: QML Desteği

# Name
source: Qt Documentation
tr: Qt Belgelendirmesi

# Name
source: Quick Open
tr: Tez Aç

# Name
source: Scratchpad
tr: Karalama Defteri

# Name
source: Source Formatter
tr: Kaynak Biçimlendiricisi

# Name
source: Output View
tr: Çıktı Görünümü

# Name
source: Subversion Support
tr: Subversion Desteği

# Name
source: Switch to Buddy
tr: Dosta Geçiş Yap

# Name
source: Unit Test View
tr: Birim Testi Görünümü

# Name
source: VCS Integration
tr: Sürüm Denetimi Sistemi Tümleştirmesi

# Name
source: KDevelop Welcome Page
tr: K Geliştir Karşılama Sayfası

# Description
source: List and launch KDevelop sessions
tr: K Geliştir oturumlarını listeleyin ve başlatın

# Description
source: Matches KDevelop Sessions
tr: K Geliştir oturumlarıyla eşleşir

# Description
source: Exposes Android runtimes
tr: Android çalışma zamanlarını açığa çıkarır

# Description
source: Application Wizard
tr: Uygulama Sihirbazı

# Description
source: A plugin for formatting of sourcecode according to a specified set of rules
tr: Belirli kurallara göre kaynak kodları biçimlendirmeye yarayan bir eklenti

# Description
source: This plugin integrates Bazaar to KDevelop
tr: Bu eklenti, Bazaar uygulamasını K Geliştir ile tümleştirir

# Description
source: C/C++ Language Support (Clang-based)
tr: C/C++ Dil Desteği (Clang tabanlı)

# Description
source: clang-tidy provides an extensible framework for diagnosing and fixing typical programming errors, like style violations, interface misuse, or bugs that can be deduced via static analysis. https://clang.llvm.org/extra/clang-tidy/
tr: clang-tidy, biçem ve arayüz yanlış kullanımları veya durgun çözümleme ile bulunabilecek tipik programlama hatalarını tanılamak ve düzeltmek için geniş bir çatı sağlar. https://clang.llvm.org/extra/clang-tidy/

# Description
source: This plugin provides a browsable model of the currently parsed classes and other items.
tr: Bu eklenti, geçerli ayrıştırılmış sınıfların ve diğer ögelerin taranabilir bir modelini sağlar.

# Description
source: This plugin integrates Clazy to KDevelop
tr: Bu eklenti, Clazy’yi K Geliştir ile tümleştirir

# Description
source: Builds CMake Projects
tr: CMake Projelerini Yapar

# Description
source: Allows KDevelop to provide CMake documentation
tr: K Geliştir uygulamasının CMake belgelendirmesi sağlamasına izin verir

# Description
source: Allows KDevelop to manage CMake-based projects
tr: K Geliştir uygulamasının CMake temelli projeleri yönetmesine izin verir

# Description
source: Collection of various utilities that increase productivity while programming.
tr: Programlama sırasında verimliliği artıran çeşitli izlenceler koleksiyonu.

# Description
source: This plugin shows information about the current language context in a side view, and highlights relevant declarations and uses.
tr: Bu eklenti yan görünümde geçerli dil bağlamıyla ilgili bilgi gösterir ve ilgili tanımlamaları ve kullanımları vurgular.

# Description
source: This plugin integrates Cppcheck (static analysis tool) to KDevelop
tr: Bu eklenti, Cppcheck uygulamasını (durgun çözümleme aracı) K Geliştir ile tümleştirir

# Description
source: Exposes KDE Craft environment as a runtime
tr: KDE Craft ortamını bir çalışma zamanı olarak açığa çıkarır

# Description
source: Allows to use custom buildsystems for KDevelop projects
tr: K Geliştir projeleri için özel yapı sistemlerinin kullanılmasına izin verir

# Description
source: Configure which macros and include directories/files will be added to the parser during project parsing.
tr: Hangi makroların ve “include” dizinlerinin/dosyalarının ayrıştırma sürecinde ayrıştırıcıya ekleneceğini yapılandırın.

# Description
source: Imports and edits custom make projects
tr: Özel make projelerini içe aktarır ve düzenler

# Description
source: A plugin for formatting C files using custom scripts
tr: C dosyalarını özel betikler kullanarak biçimlendirmek için bir eklenti

# Description
source: Exposes Docker runtimes
tr: Docker çalışma zamanlarını açığa çıkarır

# Description
source: A most-recently-used document switcher for KDevPlatform.
tr: KDevPlatform için son kullanılan belgeleri seçici bir eklenti.

# Description
source: This plugin displays a graphical view of all documents currently loaded and separates them by mimetype.
tr: Bu eklenti, şu anda yüklenmiş olan tüm belgeleri grafiksel bir görünümde gösterir ve MIME türlerine göre ayırır.

# Description
source: This plugin allows running of programs with no instrumentor, ie. natively by the current host.
tr: Bu eklenti, programların ek araç olmadan çalıştırılabilmesini sağlar, örn. geçerli istemci ile yerel olarak.

# Description
source: Lets you view a plasmoid
tr: Bir Plasmoid görüntülemenize izin verir

# Description
source: This plugin allows running of scripts.
tr: Bu eklenti, betiklerin çalıştırılmasını sağlar.

# Description
source: Run external scripts or applications to manipulate the editor contents or do other arbitrary actions.
tr: Düzenleyici içeriğini değiştirmek veya diğer keyfi eylemler için dış betikler veya uygulamalar çalıştır.

# Description
source: This plugin brings a filemanager to KDevelop.
tr: Bu eklenti K Geliştir için bir dosya yöneticisi sağlar.

# Description
source: Manages templates for source files
tr: Kaynak dosyaları için şablonları yönetir

# Description
source: Exposes Flatpak runtimes
tr: Flatpak çalışma zamanlarını açığa çıkarır

# Description
source: This plugin provides a frontend for GDB, a source-level debugger for C, C++ and more.
tr: Bu eklenti, C, C++ ve daha fazlası için bir kaynak düzeyinde hata ayıklayıcısı olan GDB için bir ön uç sağlar.

# Description
source: Allow KDevelop to manage generic projects
tr: K Geliştir uygulamasının genel projeleri yönetmesine izin ver

# Description
source: This plugin helps to obtain projects from GitHub
tr: Bu eklenti, Github’tan projeler almanıza yardımcı olur

# Description
source: This plugin integrates Git to KDevelop
tr: Bu eklenti, Git uygulamasını K Geliştir ile tümleştirir

# Description
source: Allows fast searching of multiple files using patterns or regular expressions. And allow to replace it too.
tr: Dizgiler veya düzenli ifadeler kullanarak birden çok dosyada tez aramaya izin verir. Başka ögelerle değiştirme de olanaklıdır.

# Description
source: This plugin integrates Heaptrack to KDevelop
tr: Bu eklenti, Heaptrack uygulamasını K Geliştir ile tümleştirir

# Description
source: This plugin provides KDevelop with an embedded konsole for quick and easy command line access.
tr: Bu eklenti, tez ve kolay komut satırı erişimi için K Geliştir’e gömülü bir uçbirim sağlar.

# Description
source: This plugin provides a frontend for LLDB, a next generation, high-performance C/Obj-C/C++ debugger.
tr: Bu eklenti, gelecek kuşak, yüksek başarımlı C/Obj-C/C++ hata ayıklayıcısı olan LLDB için ön uç sağlar.

# Description
source: KDevelop Make Builder
tr: K Geliştir Make Yapıcısı

# Description
source: This plugin provides Manual Pages integration
tr: Bu eklenti, Kılavuz Sayfaları tümleştirmesi sağlar

# Description
source: Imports and edits Meson projects
tr: Meson projelerini içe aktarır ve düzenler

# Description
source: KDevelop Ninja Builder
tr: K Geliştir Ninja Yapıcısı

# Description
source: Enables viewing and editing of the raw data of files (Okteta-based)
tr: Dosyaların ham verisini okuma ve düzenlemeyi sağlar (Oktet tabanlı)

# Description
source: This plugin allows one to open files with associated external applications.
tr: Bu eklenti, ilişkilendirilmiş dış uygulamalar ile dosyalar açmayı sağlar.

# Description
source: This plugin provides a view to show the outline of the currently open document.
tr: Bu eklenti, geçerli açık belgenin ana hattını görüntülemek için bir görünüm sağlar.

# Description
source: This plugin allows reviewing patches directly in the editor.
tr: Bu eklenti, yamaların doğrudan düzenleyici içerisinde gözden geçirilmesine izin verir.

# Description
source: Provides Integration with Perforce Version Control System
tr: Perforce Sürüm Denetimi Sistemi ile Tümleştirme Sağlar

# Description
source: This plugin shows errors in source code.
tr: Bu eklenti, kaynak kodundaki hataları gösterir.

# Description
source: Configure which files and folders inside the project folder should be included or excluded.
tr: Proje klasörü içindeki hangi dosya ve klasörlerin içerileceğini veya dışlanacağını yapılandırın.

# Description
source: Lets you manage the project contents.
tr: Proje içeriğini yönetmenizi sağlar.

# Description
source: Builds QMake Projects
tr: QMake Projelerini Yapar

# Description
source: Imports and edits QMake projects
tr: QMake projelerini içe aktarır ve düzenler

# Description
source: QML/JS language support (based on qmljs from QtCreator)
tr: QML/JS dil desteği (QtCreator’dan qmljs tabanlı)

# Description
source: This plugin provides QtHelp integration
tr: Bu eklenti, QtHelp tümleştirmesi sağlar

# Description
source: This plugin allows quick access to project files and language-items like classes/functions.
tr: Bu eklenti, proje dosyalarına ve sınıflar/işlevler gibi dil ögelerine tez erişim sağlar.

# Description
source: Scratchpad lets you quickly run and experiment with code without a full project, and even store todos.
tr: Karalama Defteri, kod ile bir proje açmaya gerek kalmadan çalışma ve deneyler yapmanıza ve yapılacakları depolamanıza izin verir.

# Description
source: Configure which style should be used for formatting of the sourcecode in a project.
tr: Bir projedeki kaynak kodun biçimlendirilmesi için hangi biçemin kullanılması gerektiğini yapılandırın.

# Description
source: Provides a text output tool view for other plugins to use, to show things like compiler messages.
tr: Derleyici iletileri gibi şeyleri göstermek için diğer eklentilere bir metin çıktısı görünümü sağlar.

# Description
source: This plugin integrates Subversion to KDevelop.
tr: Bu eklenti, Subversion ile K Geliştir uygulamasını tümleştirir.

# Description
source: Allows switching between buddy documents like implementation and header file.
tr: Uygulama ve başlık dosyası gibi ilişkili belgeler arasında geçişe izin verir.

# Description
source: Lets you see and run unit tests.
tr: Birim testlerini görmenizi ve çalıştırmanızı sağlar.

# Description
source: This plugin provides integration between the projects and their VCS infrastructure
tr: Bu eklenti, projeler ile VCS altyapıları arasında tümleştirme sağlar

# Description
source: Provides the welcome page visible in an empty session
tr: Boş oturumlarda görünen karşılama sayfasını sağlar
