Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/kinfocenter._json_.po
Languages: tr

# X-KDE-Keywords
source: about,info,information,distribution,distro,system,kernel,qt,kde,version
tr: hakkında,bilgi,dağıtım,distro,sistem,kernel,çekirdek,qt,kde,sürüm,versiyon

# X-KDE-Keywords
source: Pipewire,Audio,PulseAudio,pactl
tr: pipewire,ses,pulseaudio,pactl

# X-KDE-Keywords
source: lsblk,block device,partition,disk,drive,hdd,ssd,nvme
tr: lsblk,blok aygıtı,bölüntü,bölüm,disk,sürücü,hdd,ssd,nvme

# X-KDE-Keywords
source: cpu,amd,intel,arm,instructions,cores,architecture,byte order
tr: cpu,amd,intel,arm,yönergeled,çekirdek,mimari,bayt,bayt sırası

# X-KDE-Keywords
source: EDID,Graphics
tr: EDID,grafikler,grafik

# X-KDE-Keywords
source: OpenGL,DRI,3D,VideoCard,Hardware Acceleration,Graphics,EGL
tr: opengl,dri,3d,3b,video kartı,donanım hızlandırması,donanım ivmelendirmesi,grafik,grafikler,egl

# X-KDE-Keywords
source: Battery,Energy,Statistics,History,Power
tr: pil,batarya,enerji,istatistik,geçmiş,güç,kayıt

# X-KDE-Keywords
source: firmware,security,hsi,secureboot,fwupd,bootguard,lockdown
tr: firmware,donanım yazılımı,hsi,güvenlik,secure boot,fwupd,bootguard,lockdown,kilit

# X-KDE-Keywords
source: OpenGL,DRI,GLX,3D,VideoCard,Hardware Acceleration,Graphics,X,X11,Xserver,X-Server,XFree86,Display
tr: opengl,dri,glx,3d,3b,video kartı,donanım hızlandırması,donanım ivmelendirmesi,x,x11,x sunucusu,xserver,x-server,xfree86,ekran,görüntü

# X-KDE-Keywords
source: Interrupts,IRQ,System Information
tr: yarıda kesmeler,irq,sistem bilgisi

# X-KDE-Keywords
source: Memory,RAM,dmidecode
tr: bellek,memory,ram,dmidecode

# X-KDE-Keywords
source: network,nic,ip,ip address,mac,inet,eth,wlan,wifi
tr: ağ,nic,ip,ip adresi,mac,inet,eth,wlan,wifi,wi-fi

# X-KDE-Keywords
source: OpenCL,VideoCard,Hardware Acceleration,Graphics
tr: opencl,video kartı,donanım hızlandırması, donanım ivmelendirmesi,grafik

# X-KDE-Keywords
source: PCI,PCI-Devices,PCI-Bus,System Information
tr: pci,pci aygıtları,pci cihazları,pci veri yolu,sistem bilgisi

# X-KDE-Keywords
source: SMB,SAMBA,Windows network,LAN,System Information
tr: smb,samba,windows ağı,lan,sistem bilgisi

# X-KDE-Keywords
source: lm_sensors,sensors,temp,temperature,volt,voltage,sensors,fan,fan speed,monitoring,amp,amps,current,power
tr: lm_sensors,sensors,temp,temperature,volt,voltage,sensors,fan,fan speed,monitoring,amp,amps,current,power,sensörler,algılayıcılar,sıcaklık,voltaj,fan hızı,izleme,amper,akım,cereyan,ceryan,güç

# X-KDE-Keywords
source: USB,devices,viewer,control
tr: usb,aygıt,cihaz,görüntüleyici,denetim,kontrol

# X-KDE-Keywords
source: Vulkan,VideoCard,Hardware Acceleration,Graphics
tr: vulkan,video kartı,donanım hızlandırması,donanım ivmelendirmesi,grafik

# X-KDE-Keywords
source: Wayland,Compositor,Display,System Information
tr: wayland,bileşikleştirici,bileştirici,görüntü,ekran,sistem bilgisi

# X-KDE-Keywords
source: X,X-Server,XServer,XFree86,Display,VideoCard,System Information
tr: x, x sunucusu,x-server,xserver,xfree86,ekran,görüntü,video kartı,sistem bilgisi

# Name
source: About this System
tr: Sistem Hakkında

# Name
source: Audio
tr: Ses

# Name
source: Block Devices
tr: Blok Aygıtları

# Name
source: Energy
tr: Enerji

# Name
source: Firmware Security
tr: Donanım Yazılımı Güvenliği

# Name
source: Interrupts
tr: Yarıda Kesmeler

# Name
source: Window Manager
tr: Pencere Yöneticisi

# Name
source: Memory
tr: Bellek

# Name
source: Network Interfaces
tr: Ağ Arayüzleri

# Name
source: Samba Status
tr: Samba Durumu

# Name
source: Sensors
tr: Algılayıcılar

# Name
source: USB Devices
tr: USB Aygıtları

# Name
source: X-Server
tr: X Sunucusu

# Description
source: Information About This System
tr: Bu Sistem Hakkında Bilgi

# Description
source: Audio Device Information
tr: Ses Aygıtı Bilgisi

# Description
source: Block Devices
tr: Blok Aygıtlar

# Description
source: Advanced CPU Information
tr: Gelişmiş CPU Bilgisi

# Description
source: Extended Display Identification Data
tr: Genişletilmiş Ekran Tanımlama Verisi

# Description
source: EGL information
tr: EGL Bilgisi

# Description
source: Energy Consumption Statistics
tr: Enerji Tüketimi İstatistikleri

# Description
source: Firmware Security Information
tr: Donanım Yazılımı Güvenliği Bilgisi

# Description
source: GLX information
tr: GLX Bilgisi

# Description
source: Interrupt information
tr: Yarıda Kesmeler Bilgisi

# Description
source: KWin Support information
tr: KWin Destek Bilgisi

# Description
source: Memory Information
tr: Bellek Bilgisi

# Description
source: Network interface information
tr: Ağ Arayüzleri Bilgisi

# Description
source: OpenCL API information
tr: OpenCL API'si Bilgisi

# Description
source: PCI information
tr: PCI Bilgisi

# Description
source: Samba status monitor
tr: Samba Durumu İzleyicisi

# Description
source: Sensors
tr: Algılayıcılar

# Description
source: USB devices attached to this computer
tr: Bu Bilgisayara Bağlı USB Aygıtları

# Description
source: Vulkan graphics API information
tr: Vulkan Grafik API'si Bilgisi

# Description
source: Information about the Wayland Compositor
tr: Wayland Bileşikleştiricisi Bilgisi

# Description
source: X-Server information
tr: X Sunucusu Bilgisi
