Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/kio-extras._json_.po
Languages: tr

# Name
source: Link Files to Activities
tr: Dosyaları Etkinliklere Bağlantıla

# Name
source: Search Folder Updater
tr: Arama Klasörü Güncelleyicisi

# Name
source: Connection Preferences
tr: Bağlantı Tercihleri

# Name
source: Proxy
tr: Vekil

# Name
source: Proxy Verifier
tr: Vekil Doğrulayıcısı

# Name
source: Trash
tr: Çöp Kutusu

# Name
source: Web Search Keywords
tr: Web Araması Anahtar Sözcükleri

# Name
source: KDE MTP daemon
tr: KDE MTP ardalan süreci

# Name
source: Forget items from Recent Documents and Recent Locations
tr: Son Belgeler ve Son Konumlar’daki ögeleri unut

# Name
source: SMB Watcher
tr: SMB İzleyicisi

# Name
source: Audio files
tr: Ses Dosyaları

# Name
source: Comic Books
tr: Çizgi Romanlar

# Name
source: Cursor Files
tr: İmleç Dosyaları

# Name
source: Folders
tr: Klasörler

# Name
source: DjVu Files
tr: DjVu Dosyaları

# Name
source: eBooks
tr: eKitaplar

# Name
source: EXR Images
tr: EXR Görselleri

# Name
source: Images (GIF, PNG, BMP, ...)
tr: Görseller (GIF, PNG, BMP, …)

# Name
source: JPEG Images
tr: JPEG Görselleri

# Name
source: Krita Documents
tr: Krita Belgeleri

# Name
source: Office Documents
tr: Office Belgeleri

# Name
source: SVG Images
tr: SVG Görselleri

# Name
source: Text Files
tr: Metin Dosyaları

# Name
source: Microsoft Windows Executables
tr: Microsoft Windows Yürütülebilirleri

# Name
source: Microsoft Windows Images
tr: Microsoft Windows Görselleri

# Description
source: Allows automatic updates of Search Folders
tr: Arama Klasörlerinin otomatik güncellenmesine izin ver

# Description
source: Configure generic network preferences
tr: Genel ağ tercihlerini yapılandırın

# Description
source: Configure the proxy servers used
tr: Vekil sunucuların kullanımını yapılandır

# Description
source: Verifies proxy setup is performing as expected
tr: Vekil sunucu kurulumunun beklendiği gibi çalışıp çalışmadığını doğrular

# Description
source: Configure trash settings
tr: Çöp kutusu ayarlarını yapılandır

# Description
source: Configure Web search keywords
tr: Web araması anahtar sözcüklerini yapılandır

# Description
source: TODO
tr: YAPILACAKLAR

# Description
source: Monitors directories on the smb:/ protocol for changes
tr: smb:/ protokolündeki dizinleri değişiklikler için izler

# X-KDE-Keywords
source: iopref,netpref,network preferences,ftp
tr: iopref,netpref,ağ tercihleri,ağ ayarları,ftp,network

# X-KDE-Keywords
source: Proxy,Proxy server,Firewall,Squid
tr: vekil,proksi,proxy,vekil sunucu,proksi sunucusu,proxy sunucusu,güvenlik duvarı,firewall,squid

# X-KDE-Keywords
source: trash
tr: çöp kutusu,çöp sepeti,geri dönüşüm kutusu

# X-KDE-Keywords
source: Web Search Keywords,Web Search,Search,Keyword,Web Shortcuts,Browsing,WWW,Internet,Internet Filters,Network,Search Engines,Shortcuts
tr: web araması anahtar sözcükleri,web araması anahtar kelimeleri,web araması,arama,ara,anahtar sözcük,anahtar kelime,web kısayolları,tarama,sörf,www,internet,internet süzgeçleri,ağ,arama motorları,kısayollar

# recentlyused ExtraNames
source: Application
tr: Uygulama
