Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/kmuddy._json_.po
Languages: tr

# Name
source: Profile Converter
tr: Profil Dönüştürücüsü

# Name
source: Mapper
tr: Eşlemleyici

# Name
source: External Scripting
tr: Dış Betik Yazımı

# Name
source: Strings
tr: Diziler

# Name
source: Test
tr: Sınama

# Name
source: Variable Triggers
tr: Değişken Tetikleyicileri

# Name
source: Variable Viewer
tr: Değişken Görüntüleyicisi

# Description
source: Converts profiles from older KMuddy versions
tr: Profilleri eski KMuddy sürümlerinden dönüştürür

# Description
source: Implements a mapper
tr: Bir eşlemlendirici gerçekler

# Description
source: Implements support for external scripting
tr: Dış betikler yazımı için destek gerçekler

# Description
source: Defines various string manipulation functions
tr: Çeşitli dizi manipülasyon işlevleri tanımlar

# Description
source: Testing Plugin
tr: Sınama eklentileri

# Description
source: Adds support for variable triggers
tr: Değişken tetikleyicileri için destek ekler

# Description
source: Provides an interface for viewing variable values
tr: Değişken değerlerini görüntülemek için bir arayüz sağlar
