Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/kmymoney._json_.po
Languages: tr

# Name
source: Check printing
tr: Çek Yazdırma

# Name
source: CSV Exporter
tr: CSV Dışa Aktarıcısı

# Name
source: CSV Importer
tr: CSV İçe Aktarıcısı

# Name
source: GNC Importer
tr: GNC İçe Aktarıcısı

# Name
source: IBAN/BIC Data
tr: IBAN/BIC Verisi

# Name
source: KBanking
tr: K Bankacılık

# Name
source: OFX Importer
tr: OFX İçe Aktarıcısı

# Name
source: onlinejobpluginmockup
tr: çevrimiçiişeklentimockup

# Name
source: SEPA orders
tr: SEPA Talimatları

# Name
source: QIF Exporter
tr: QIF Dışa Aktarıcısı

# Name
source: QIF Importer
tr: QIF İçe Aktarıcısı

# Name
source: Reconciliation report
tr: Mutabakat Raporu

# Name
source: SQL Storage
tr: SQL Depolama

# Name
source: Budget view
tr: Bütçe Görünümü

# Name
source: Forecast view
tr: Öngörü Görünümü

# Name
source: Online job outbox view
tr: Çevrimiçi İş Giden Kutusu Görünümü

# Name
source: Reports view
tr: Rapor Görünümü

# Name
source: XML Storage
tr: XML Depolama

# Description
source: Provides the capability to print checks
tr: Çekleri yazdırma yeteneği sağlar

# Description
source: Add CSV exporting to KMyMoney
tr: K Param’a CSV dışa aktarma ekleyin

# Description
source: Add CSV importing to KMyMoney
tr: K Param’a CSV içe aktarma ekleyin

# Description
source: Add GnuCash importing to KMyMoney
tr: K Param’a GnuCash içe aktarma ekleyin

# Description
source: Adds predefined IBAN/BIC numbers to KMyMoney
tr: K Param’a önceden tanımlanmış IBAN/BIC numaralarını ekleyinr

# Description
source: Exports schedules to iCalendar files
tr: Planları iCalendar dosyalarına dışa aktarır

# Description
source: Add HBCI/FinTs, OFX and PayPal online banking to KMyMoney
tr: K Param’a HBCI/FinTs, OFX ve PayPal çevrimiçi bankacılığını ekleyin

# Description
source: Add OFX importing to KMyMoney
tr: K Param’a OFX içe aktarma ekleyin

# Description
source: If mapped to an account, it pretends it could handle all onlineTasks (for developers only).
tr: Bir hesapla eşlenirse tüm çevrimiçi görevleri halledebilirmiş gibi görünür (yalnızca geliştiriciler için).

# Description
source: Order types for single european payment area (SEPA) orders
tr: Avrupa tek ödeme bölgesi (SEPA) talimatları için talimat türleri

# Description
source: Add QIF exporting to KMyMoney
tr: K Param’a QIF dışa aktarma ekleyin

# Description
source: Add QIF importing to KMyMoney
tr: K Param’a QIF içe aktarma ekleyin

# Description
source: Creates a report after each reconciliation containing data about the reconciliation process
tr: Her mutabakat sonrası mutabakat süreci ile ilgili veriyi içeren bir rapor oluşturur

# Description
source: Adds SQL storage support to KMyMoney
tr: K Param’a SQL depolama desteği ekleyin

# Description
source: Adds budget view to KMyMoney
tr: K Param’a bütçe görünümü ekleyin

# Description
source: Adds forecast view to KMyMoney
tr: K Param’a öngörü görünümü ekleyin

# Description
source: Adds online job outbox view to KMyMoney
tr: K Param’a çevrimiçi iş giden kutusu görünümü ekleyin

# Description
source: Adds reports view to KMyMoney
tr: K Param’a raporlar görünümü ekleyin

# Description
source: Plugin for Woob
tr: Woob için eklenti

# Description
source: Adds XML storage support to KMyMoney
tr: K Param’a XML depolama desteği ekleyin
