Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/knotes._json_.po
Languages: tr

# Name
source: Actions
tr: Eylemler

# Name
source: Collections
tr: Koleksiyonlar

# Name
source: Display
tr: Görünüm

# Name
source: Editor
tr: Düzenleyici

# Name
source: Misc
tr: Çeşitli

# Name
source: Network
tr: Ağ

# Name
source: Print
tr: Yazdır

# Name
source: New Notes
tr: Yeni Notlar

# Name
source: Popup Notes
tr: Açılır Notlar

# Description
source: Setup actions for notes
tr: Notlar için eylemleri ayarla

# Description
source: Setup collections for notes
tr: Notlar için koleksiyonları ayarla

# Description
source: Setup display for notes
tr: Notların görünümünü ayarla

# Description
source: Setup editor
tr: Düzenleyiciyi ayarla

# Description
source: Notes Summary Setup
tr: Not Özet Yapılandırması

# Description
source: Kontact KNotes Plugin
tr: Kontak K Notlar Eklentisi
