Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/kooka._json_.po
Languages: tr

# Name
source: Application
tr: Uygulama

# Name
source: Copy Image
tr: Görseli Kopyala

# Name
source: Scan Gallery
tr: Galeriyi Tara

# Name
source: Print Image
tr: Görseli Yazdır

# Name
source: Save Image
tr: Görseli Kaydet

# Name
source: Share Image
tr: Görseli Paylaş

# Description
source: Open the scanned image in an application
tr: Taranan görseli bir uygulamada açın

# Description
source: Copy the scanned image to the clipboard
tr: Taranan görseli panoya kopyalayın

# Description
source: Save the scanned image to the scan gallery
tr: Taranan görseli tarama galerisine kaydedin

# Description
source: Print the scanned image
tr: Taranan görseli yazdırın

# Description
source: Save the scanned image
tr: Taranan görseli kaydedin

# Description
source: Share the scanned image
tr: Taranan görseli paylaşın

# Description
source: <emphasis>GOCR</emphasis> (sometimes known as <emphasis>JOCR</emphasis>) is an open source OCR engine, originally started by Joerg&nbsp;Schulenburg and now with a team of active developers.<nl/><nl/>See <link url="http://jocr.sourceforge.net">jocr.sourceforge.net</link> for more information on GOCR.
tr: <emphasis>GOCR</emphasis> (bazen <emphasis>JOCR</emphasis> olarak da bilinir), ilk olarak Jörg&nbsp;Schulenburg tarafından başlatılan ve şu an etkin bir geliştirici takımı tarafından sürdürülen bir açık kaynaklı optik karakter tanıma işletkesidir.<nl/><nl/>GOCR üzerine daha fazla bilgi için <link url="http://jocr.sourceforge.net">jocr.sourceforge.net</link> adresine bakın.

# Description
source: <emphasis>OCRAD</emphasis> is a free software OCR engine by Antonio&nbsp;Diaz, part of the GNU&nbsp;Project.<nl/><nl/>Images for OCR should be scanned in black/white (lineart) mode. Best results are achieved if the characters are at least 20&nbsp;pixels high. Problems may arise, as usual, with very bold or very light or broken characters, or with merged character groups.<nl/><nl/>See <link url="http://www.gnu.org/software/ocrad/ocrad.html">www.gnu.org/software/ocrad/ocrad.html</link> for more information on OCRAD.
tr: <emphasis>OCRAD</emphasis>, Antonio Diaz tarafından geliştirilen ücretsiz ve açık kaynaklı bir optik karakter tanıma işletkesidir ve aynı zamanda GNU&nbsp;Projesi’nin de bir parçasıdır.<nl/><nl/>Optik karakter tanıma için görseller siyah-beyaz olarak taranmalıdır. En iyi sonucun alınabilmesi için karakterlerin en az 20 piksel yüksekliğinde olması gerekir. Çok kalın, çok ince, bozuk karakterler veya birleştirilmiş karakter grupları olduğu takdirde sorunlar olağan olduğu üzere ortaya çıkabilir.<nl/><nl/>OCRAD üzerine daha fazla bilgi için <link url="http://www.gnu.org/software/ocrad/ocrad.html">www.gnu.org/software/ocrad/ocrad.html</link> adresine bakın.

# Description
source: <emphasis>Tesseract</emphasis> is a free software OCR engine, originally developed at HP&nbsp;Labs and now sponsored by Google. It supports multiple languages and scripts (including right-to-left text) and page layout analysis.<nl/><nl/>The best results are achieved if scanned characters are at least 20&nbsp;pixels high. Problems may arise with excessively skewed or rotated images, or if dark borders are present.<nl/><nl/>See <link url="https://github.com/tesseract-ocr/tesseract">github.com/tesseract-ocr/tesseract</link> for more information on Tesseract.
tr: <emphasis>Tesseract</emphasis>, ilk olarak HP Labs bünyesinde geliştirilen ve şu anda Google tarafından fonlanan ücretsiz ve açık kaynaklı bir optik karakter tanıma işletkesidir. Birden çok dili ve sağdan sola yazılanlar da içerilmek üzere birçok yazı sistemini ve sayfa yerleşimi çözümlemesini destekler.<nl/><nl/>En iyi sonucun alınabilmesi için karakterlerin en az 20 piksel yüksekliğinde olması gerekir. Pek yamuk veya döndürülmüş görsellerde veya çok kalın kenarlıklar varsa olağan olduğu üzere sorunlar ortaya çıkabilir.<nl/><nl/>Tesseract üzerine daha fazla bilgi için <link url="https://github.com/tesseract-ocr/tesseract">github.com/tesseract-ocr/tesseract</link> adresine bakın.
