Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/ktorrent._json_.po
Languages: tr

# Name
source: Scheduler
tr: Zamanlayıcı

# Name
source: Download Order
tr: İndirme Sırası

# Name
source: Information Widget
tr: Bilgi Penceresi

# Name
source: IP Filter
tr: IP Süzgeci

# Name
source: Log Viewer
tr: Günlük Görüntüleyicisi

# Name
source: Magnet Generator
tr: Mıknatıs Üreticisi

# Name
source: Media Player
tr: Ortam Oynatıcısı

# Name
source: Scan Folder
tr: Dizin Tara

# Name
source: Scan for lost files
tr: Kayıp dosyaları tara

# Name
source: Search
tr: Ara

# Name
source: Shutdown
tr: Kapat

# Name
source: Statistics
tr: İstatistik

# Name
source: Syndication
tr: Dayanışma

# Description
source: Schedule upload and download limits over a period of a week
tr: Bir haftalık periyotlarla gönderme ve indirme sınırlarını zamanla

# Description
source: Specify the download order of a multi-file torrent
tr: Birden fazla dosyaya sahip bir torrentin indirme sırasını belirle

# Description
source: Displays general information about a torrent in several tabs
tr: Çeşitli sekmelerde bir torrent hakkındaki genel bilgileri göster

# Description
source: Filter IP addresses through a blocklist
tr: Bir engel listesiyle IP adreslerini süzgeçten geçir

# Description
source: Displays the logging output
tr: Günlük kaydı çıktısını görüntüler

# Description
source: Generates magnet links
tr: Mıknatıs bağlantıları üretir

# Description
source: Phonon-based media player
tr: Phonon tabanlı ortam oynatıcısı

# Description
source: Scan folders for torrent files and load them
tr: Klasörleri torrent dosyaları için tara ve bulunan dosyaları yükle

# Description
source: Display files in the selected folder that don't belong to any torrent
tr: Herhangi bir torrente ait olmayan dosyaları seçili klasörde görüntüle

# Description
source: Search for torrents
tr: Torrentler ara

# Description
source: Allows you to shutdown your computer when torrents finish
tr: Torrentler bittiği zaman bilgisayarınızın otomatik olarak kapanmasına izin verir

# Description
source: Shows statistics about torrents in several graphs
tr: Çeşitli grafiklerde torrentlerle ilgili istatistikleri gösterir

# Description
source: Syndication plugin for KTorrent, supporting RSS and Atom feeds
tr: RSS ve Atom kaynakları destekleyen K Torrent için dayanışma eklentisi

# Description
source: Forward ports using UPnP
tr: UPnP kullanarak kapıları yönlendirir

# Description
source: Discover peers on the local network using the Zeroconf protocol
tr: Zeroconf protokolünü kullanarak yerel ağdaki paylaşımcıları bul

# Authors Name
source: Lesly Weyts, Kevin Andre and Joris Guisson
tr: Lesly Weyts, Kevin Andre ve Joris Guisson
