Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/kwin-x11._json_.po
Languages: tr

# X-KDE-Keywords
source: animations,animation speed,transitions,effects,window open close,window open/close,window maximize,window minimize,window full screen,peek at desktop,peek desktop,virtual desktop switching,fade effect,glide effect,scale effect,stretch effect,magic lamp effect,squash effect,eye on screen effect,window aperture effect,slide effect,fading popups effect,sliding popups effect,login effect,logout effect
tr: canlandırmalar,canlandırma hızı,geçişler,efektler,pencere aç,pencere kapat,pencere ekranı kapla,pencere küçült,pencere tam ekran,masaüstüne bak,sanal masaüstü geçişi,solma ekfekti,süzülme efekti,ölçekleme efekti,germe efekti,sihirli lamba efekti,tıkıştırma efekti,göz ekranda efekti,pencere açıklığı efekti,kayma efekti,solan açılır pencereler efekti,kayan açılır pencereler efekti,oturum açma efekti,oturumu kapatma efekti

# X-KDE-Keywords
source: kwin,window,manager,compositing,compositor,effect,3D effects,2D effects,video settings,graphical effects,desktop effects,graphics,latency,vsync,tearing,window thumbnails
tr: kwin,pencere,yönetici,bileşikleştirme,bileşikleştirici,efekt,3b efektler,3d efektler,2d efektler,2b efektler,video ayarları,grafik efektler,masaüstü efektleri,grafikler,gecikme,vsync,yırtılma,pencere küçük görselleri,pencere küçük görseli, pencere küçük resmi,pencere küçük resimleri,küçük görsel,küçük resim

# X-KDE-Keywords
source: kwin,window,manager,border,style,theme,look,feel,layout,button,handle,edge,kwm,decoration,window decorations,titlebar,window buttons,window border,skin,shadow
tr: kwin,pencere,yönetici,kenarlık,biçem,stil,tema,görünüş,his,yerleşim,düzen,düğme,tutaç,tutamak,kenar,kwm,dekorasyon,pencere dekorasyonu,başlık çubuğu,pencere düğmeleri,pencere kenarlığı,tema,gölge

# X-KDE-Keywords
source: desktop,desktops,number,virtual desktop,multiple desktops,pager,pager widget,pager applet,pager settings,indicator,navigation,cube,slide,workspaces
tr: masaüstü,masaüstleri,sayı,numara,sanal masaüstü,çoklu masaüstleri,sayfalayıcı,araç takımı,uygulamacık,ayarlar,gösterge,dolaşım,gezinti,küp,kaydır,çalışma alanları

# X-KDE-Keywords
source: kwin,window,manager,effect,3D effects,2D effects,graphical effects,desktop effects,animations,various animations,window management effects,animations,desktop animations,rendering,render,snap helper effect,track mouse effect,blur effect,fall apart effect,highlight window effect,mouse mark effect,screenshot effect,sheet effect,thumbnail aside effect,translucency,translucency effect,transparency,window geometry effect,wobbly windows effect,startup feedback effect,dialog parent effect,dim inactive effect,dim screen effect,slide back effect,eye candy,candy,cover switch effect,desktop cube effect,desktop cube animation effect,desktop grid effect,background contrast effect,bling,fading,movement,motion,overview windows effect,accessibility,cursor,pointer,mouse,hide cursor,hide cursor effect,hide pointer,hide pointer effect,hide mouse,hide mouse effect
tr: kwin,pencere,yönetici,efekt,3b efektler,3d efektler,2b efektler,2d efektler,grafik efektler,masaüstü efektleri,canlandırma,animasyon,çeşitli animasyon,çeşitli canlandırma,pencere yönetimi efektleri,pencere değiştirme efektleri,masaüstü canlandırmaları,masaüstü animasyonları,sürücüler,sürücü ayarları,sunum,oluşturma,çizim tutturma yardımcısı efekti,fareyi izle efekti,bulanıklaştırma efekti,solma efekti,masaüstü solma efekti,düşme efekti,süzülme efekti,pencereyi vurgula efekti,oturum aç efekti,oturumu kapat efekti,sihirli lamba efekti,küçültme canlandırması,fare işareti efekti,ölçek efekti,ekran görüntüsü efekti,sayfa efekti,kaydırma efekti,kayan açılır pencereler efekti,küçük görsel yana efekti,yarısaydamlık,yarısaydamlık efekti,saydamlık,pencere geometrisi efekti,sallanan pencereler efekti,başlangıç bildirimi efekti,üst iletişim kutusu efekti,etkin olmayan pencereyi karart efekti,geri kaydır efekti,janjan efekti,küp efekti,küp canlandırması,küp animasyonu,masaüstü ızgarası efekti,pencereleri sun efekti,pencereyi yeniden boyutlandır efekti,arka plan karşıtlık efekti,solma,taşıma efekti,erişilebilirlik döşemesi,döşeme düzenleyicisi,imleç,işaretçi,imleci gizle,işaretçiyi gizle,fareyi gizle

# X-KDE-Keywords
source: focus,placement,window behavior,window actions,animation,raise,auto raise,windows,frame,titlebar,doubleclick,desktop,snap,movement,shading,shade,unshade,unshading,activation,activate
tr: odak,yerleşim,pencere davranışı,pencere eylemleri,canlandırma,animasyon,yükselt,çerçeve,başlık çubuğu,çift tık,masaüstü,tuttur,hareket,taşı,panjur,etkinleştir

# X-KDE-Keywords
source: size,position,state,window behavior,windows,specific,workarounds,remember,rules,window rules,apps,applications
tr: boyut,konum,durum,davranış,pencereler,başka yöntem,anımsa,kural,uygulama,app,uygulamalar

# X-KDE-Keywords
source: kwin,window,manager,effect,corner,edge,border,action,switch,desktop,kwin screen edges,desktop edges,screen edges,maximize windows,tile windows,side of screen,screen behavior,switch desktop,virtual desktop,screen corners,borders,screen borders,desktop borders,desktop corners,corners,sticky corners,sticky edges,edge barriers,corner barriers
tr: kwin,pencere,yönetici,efekt,köşe,kenar,kenarlık,eylem,değiştir,masaüstü,kwin ekran kenarları,ekran kenarları,ekranı kapla,simge durumuna küçült,küçült,döşe,ekranın kenarı,ekran davranışı,masaüstü kenarları,yapışkan köşeler,yapışkan kenarlar,kenar bariyerleri,köşe bariyerleri

# X-KDE-Keywords
source: kwin,window,manager,effect,edge,border,action,switch,desktop,desktop edges,screen edges,side of screen,screen behavior,touch screen
tr: kwin,pencere,yönetici,efekt,kenar,kenarlık,eylem,değiştir,masaüstü,masaüstü kenarları,ekran kenarları,ekranın kenarı,ekran davranışı,dokunmatik ekran

# X-KDE-Keywords
source: kwin script,plugins,window manager
tr: kwin betiği,eklentiler,pencere yöneticisi

# X-KDE-Keywords
source: window,windows,switcher,window switcher,switching,window switching,alttab,alt-tab,alt+tab,alt tab,apps changer,application changer,app,task,switch,task switcher
tr: pencere,pencereler,değiştirici,pencere değiştiricisi,değiştirme,alttab,alt-tab,alt+tab,alt tab, uygulama değiştiricisi,uygulama,app,görev,değiştir,görev değiştiricisi,commandtab,command-tab,command+tab,command tab

# Name
source: Animations
tr: Canlandırmalar

# Name
source: Compositor
tr: Bileşikleştirici

# Name
source: Window Decorations
tr: Pencere Dekorasyonları

# Name
source: Virtual Desktops
tr: Sanal Masaüstleri

# Name
source: Desktop Effects
tr: Masaüstü Efektleri

# Name
source: Window Behavior
tr: Pencere Davranışı

# Name
source: Window Rules
tr: Pencere Kuralları

# Name
source: Screen Edges
tr: Ekran Kenarları

# Name
source: Touchscreen Gestures
tr: Dokunmatik Ekran Hareketleri

# Name
source: KWin Scripts
tr: KWin Betikleri

# Name
source: Task Switcher
tr: Görev Değiştiricisi

# Name
source: Background Contrast
tr: Arka Plan Karşıtlığı

# Name
source: Blend Changes
tr: Değişiklikleri Harmanla

# Name
source: Blur
tr: Bulanıklaştır

# Name
source: Colorblindness Correction
tr: Renk Körlüğü Düzeltmesi

# Name
source: Color Picker
tr: Renk Seçicisi

# Name
source: Desktop Change OSD
tr: OSD Masaüstü Değişimi

# Name
source: Dialog Parent
tr: Üst İletişim Kutusu

# Name
source: Dim Inactive
tr: Etkin Olmayanları Karart

# Name
source: Dim Screen for Administrator Mode
tr: Yönetici Kipi için Ekranı Karart

# Name
source: Eye on Screen
tr: Göz Ekranda

# Name
source: Fade
tr: Soldur

# Name
source: Fading popups
tr: Solan açılır pencereler

# Name
source: Fall Apart
tr: Parçalara Ayır

# Name
source: Desaturate Unresponsive Applications
tr: Yanıt Vermeyen Uygulamaları Solgunlaştır

# Name
source: Stretch
tr: Ger

# Name
source: Glide
tr: Süzül

# Name
source: Highlight Window
tr: Pencereyi Vurgula

# Name
source: Invert
tr: Ters Çevir

# Name
source: Login
tr: Oturumu Aç

# Name
source: Logout
tr: Oturumu Kapat

# Name
source: Magic Lamp
tr: Sihirli Lamba

# Name
source: Magnifier
tr: Büyüteç

# Name
source: MinimizeAll
tr: Tümünü Simge Durumuna Küçült

# Name
source: Mouse Click Animation
tr: Fare Tıklama Canlandırması

# Name
source: Mouse Mark
tr: Fare İmi

# Name
source: Output Locator
tr: Çıktı Bulucusu

# Name
source: Overview
tr: Genel Görünüm

# Name
source: Scale
tr: Ölçeklendir

# Name
source: Highlight Screen Edges and Hot Corners
tr: Ekran Kenarlarını ve Sıcak Köşeleri Vurgula

# Name
source: Screenshot
tr: Ekran Görüntüsü

# Name
source: Session Quit
tr: Oturum Çıkışı

# Name
source: Sheet
tr: Sayfa

# Name
source: Show FPS
tr: FPS’yi Göster

# Name
source: Show Paint
tr: Boyamayı Göster

# Name
source: Slide Back
tr: Geri Kaydır

# Name
source: Slide
tr: Kaydır

# Name
source: Sliding popups
tr: Kayan açılır pencereler

# Name
source: Squash
tr: Tıkıştır

# Name
source: Startup Feedback
tr: Başlangıç Geri Bildirimi

# Name
source: Synchronize Skip Switcher with Taskbar
tr: Değiştiricide Gösterilmeyenleri Çubukta da Gösterme

# Name
source: System Bell
tr: Sistem Zili

# Name
source: Thumbnail Aside
tr: Küçük Görsel Kenarda

# Name
source: Tiling Editor
tr: Döşeme Düzenleyicisi

# Name
source: Track Mouse
tr: Fareyi İzle

# Name
source: Translucency
tr: Yarısaydamlık

# Name
source: Video Wall
tr: Video Duvarı

# Name
source: Window Aperture
tr: Pencere Açıklığı

# Name
source: Present Windows
tr: Pencereleri Sun

# Name
source: Wobbly Windows
tr: Oynak Pencereler

# Name
source: Zoom
tr: Yakınlaştır

# Name
source: Thumbnail Grid
tr: Küçük Görsel Izgarası

# Description
source: Configure animation speed and style
tr: Canlandırma hızını ve biçemini yapılandır

# Description
source: Compositor Settings for Desktop Effects
tr: Masaüstü Efektleri için Bileşikleştirici Ayarları

# Description
source: Configure window titlebars and borders
tr: Masaüstü pencere başlık çubukları ve kenarlıklarını yapılandır

# Description
source: Configure navigation, number and layout of virtual desktops
tr: Dolaşımı, sanal masaüstlerinin sayısını ve yerleşimini yapılandır

# Description
source: Configure compositor settings for desktop effects
tr: Masaüstü efektleri için bileşikleştirici ayarlarını yapılandır

# Description
source: Configure window actions and behavior
tr: Pencere eylemlerini ve davranışını yapılandır

# Description
source: Individual Window Behavior
tr: Bireysel Pencere Davranışı

# Description
source: Configure active screen corners and edges
tr: Etkin ekran köşeleri ve kenarlarını yapılandır

# Description
source: Configure touch screen swipe gestures
tr: Dokunmatik ekran süpürme hareketlerini yapılandır

# Description
source: Manage KWin scripts
tr: KWin Betiklerini Yönet

# Description
source: Navigation Through Windows
tr: Pencereler Arası Dolaşım

# Description
source: Improve contrast and readability behind semi-transparent windows
tr: Yarısaydam pencerelerin ardında karşıtlığı ve okunabilirlilği iyileştir

# Description
source: Animates system style changes
tr: Sistem biçemi değişikliklerini canlandırır

# Description
source: Blurs the background behind semi-transparent windows
tr: Yarısaydam pencerelerin ardını bulanıklaştırır

# Description
source: Enhances color perception for color blindness
tr: Renk körlüğü aralığında renk algısını iyileştirir

# Description
source: Supports picking a color
tr: Bir renk seçmeyi destekler

# Description
source: An on screen display indicating the desktop change
tr: Masaüstü değişikliğini belirten bir ekran üzeri görüntüsü

# Description
source: Darkens the parent window of the currently active dialog
tr: Geçerli etkin iletişim kutusunun üst penceresini karartır

# Description
source: Darken inactive windows
tr: Etkin olmayan pencereleri koyulaştır

# Description
source: Darkens the entire screen when requesting root privileges
tr: Yönetici ayrıcalıkları isterken tüm ekranı karartır

# Description
source: Suck windows into the desktop
tr: Pencereleri masaüstüne çek

# Description
source: Fade between virtual desktops when switching
tr: Geçiş yaparken sanal masaüstlerini soldur

# Description
source: Make windows fade in and out when they are shown or hidden
tr: Pencereler gösterilirken veya gizlenirken solarak geçiş yapmalarını sağla

# Description
source: Fade popups in and out
tr: Açılır pencereleri soldur ve belirginleştir

# Description
source: Closed windows fall into pieces
tr: Kapanan pencereler parçalara ayrılırlar

# Description
source: Desaturate windows of unresponsive (frozen) applications
tr: Yanıt vermeyen (donmuş) uygulamaların pencerelerini soldur

# Description
source: Stretch windows going to and leaving full screen mode
tr: Tam ekran kipine giren veya çıkan pencereleri ger

# Description
source: Glide windows as they appear or disappear
tr: Pencereleri görünürken veya kaybolurken süzülmelerini sağla

# Description
source: Highlight the appropriate window when hovering over taskbar entries
tr: Görev çubuğu girdilere arasında gezinirken uygun pencereleri vurgula

# Description
source: Inverts the color of the desktop and windows; activated with a keyboard shortcut
tr: Masaüstünün ve pencerelerin rengini tersine çevir; klavye kısayoluyla etkinleştirilir

# Description
source: Helper Effect for KScreen
tr: KScreen için Yardımcı Etkisi

# Description
source: Fade to the desktop when logging in
tr: Oturum açarken masaüstüne solarak geçiş yap

# Description
source: Fade to the logout screen
tr: Oturumu kapatırken masaüstünden solarak çık

# Description
source: Simulate a magic lamp when minimizing windows
tr: Pencereleri küçültürken sihirli bir lambaya öykün

# Description
source: Magnify the section of the screen that is near the mouse cursor; activated with a keyboard shortcut
tr: Ekranın fare imlecinin yakınında olan kısımlarını büyüt; klavye kısayoluyla etkinleştirilir

# Description
source: Stretch windows when they are maximized or restored
tr: Pencereler ekranı kapladığında veya eski hallerine döndüğünde onları ger

# Description
source: Adds a shortcut to minimize and restore all windows
tr: Tüm pencereleri simge durumuna küçültmek veya eski hallerine dönmeleri için bir kısayol ekler

# Description
source: Creates an animation whenever a mouse button is clicked. This is useful for screenrecordings/presentations. Activated with a keyboard shortcut
tr: Ne zaman bir fare düğmesi tıklansa bir canlandırma oluşturur. Bu ekran kaydı ve sunumlar için yararlıdır; klavye kısayoluyla etkinleştirilir

# Description
source: Allows you to draw lines on the desktop; activated with a keyboard shortcut
tr: Masaüstünde çizgiler çizmenize izin verir; klavye kısayoluyla etkinleştirilir

# Description
source: Show screen names
tr: Ekran adlarını göster

# Description
source: Allows you to overview virtual desktops and windows; activated with a keyboard shortcut
tr: Sanal masaüstlerini ve pencerelerin genel bir görünümünü sağlar; klavye kısayoluyla etkinleştirilir

# Description
source: Make windows scale in and out when they are shown or hidden
tr: Pencereler gösterilirken veya gizlenirken onları ölçekle

# Description
source: Highlights screen edges and corners that trigger actions when touched as the cursor approaches them
tr: İmleç onlara yaklaştıkça dokunulduğunda eylemleri tetikleyen ekran kenarlarını ve köşeleri vurgular

# Description
source: Helper effect for screenshot tools
tr: Ekran görüntüsü araçları için yardımcı etkisi

# Description
source: Keep the desktop background alive during logout until the end
tr: Oturum kapatma sırasında masaüstü arka planını sonuna kadar canlı tut

# Description
source: Make modal dialogs smoothly fly in and out when they are shown or hidden
tr: Kipsel iletişim kutuları gösterilirken veya gizlenirken pürüzsüzce uçmalarını sağlar

# Description
source: Display KWin's performance in the corner of the screen
tr: KWin başarımını pencerenin bir köşesinde görüntüle

# Description
source: Highlight areas of the desktop that have been recently updated; activated with a keyboard shortcut
tr: Masaüstünün yeni güncellenen alanlarını vurgula; klavye kısayoluyla etkinleştirilir

# Description
source: Slide back windows when another window is raised
tr: Başka bir pencere yükseltildiğinde pencereleri geri kaydır

# Description
source: Slide between virtual desktops when switching
tr: Sanal masaüstleri arasında kayarak geçiş yap

# Description
source: Slide Plasma popups in and out
tr: Plasma açılır pencerelerini içeri ve dışarı kaydır

# Description
source: Squash windows when they are minimized
tr: Pencereler simge durumuna küçültüldüğünde onları tıkıştır

# Description
source: Helper effect for startup feedback
tr: Başlangıç geri bildirimi için yardımcı efekti

# Description
source: Hides all windows marked as Skip Taskbar to be also excluded from window switchers (e.g. Alt+Tab)
tr: Görev Çubuğunu Atla olarak imlenen tüm pencerelerin, değiştiricilerden de (örn. Seçenek+Sekme) dışlanmasını sağlar

# Description
source: Provides the bell
tr: Zili çalar

# Description
source: Display window thumbnails on the edge of the screen; activated with a keyboard shortcut
tr: Pencere küçük görsellerini ekranın kenarında görüntüle; klavye kısayoluyla etkinleştirilir

# Description
source: Editor for the tiling areas
tr: Döşeme alanları için düzenleyicisi

# Description
source: Display a mouse cursor locating effect; activated with a keyboard shortcut
tr: Etkinleştirildiğinde bir fare imleci bulma efekti görüntüle; klavye kısayoluyla etkinleştirilir

# Description
source: Make windows translucent under different conditions
tr: Değişik koşullar altında pencereleri yarısaydam yap

# Description
source: Spans fullscreen video player over all attached screens to create a Video Wall
tr: Tam ekran video oynatıcılarını tüm bağlı ekranlara genişleterek bir tür Video Duvarı oluşturur

# Description
source: Move windows into screen corners
tr: Pencereleri ekran kenarlarına taşı

# Description
source: Zoom out until all opened windows can be displayed side-by-side
tr: Tüm açık pencereler yan yana görüntülenebilene dek uzaklaştır

# Description
source: Deform windows while they are moving
tr: Pencereler taşınırken onları deforme et

# Description
source: Magnify the entire desktop; activated with a keyboard shortcut
tr: Tüm masaüstünü büyüt; klavye kısayoluyla etkinleştirilir

# Description
source: A window switcher layout using a small grid of thumbnails
tr: Küçük bir küçük görsel ızgarası kullanan pencere değiştirici yerleşimi

# Authors Name
source: Lubos Lunak, Kai Uwe Broulik, Martin Gräßlin
tr: Luboš Luňák, Kai Uwe Broulik, Martin Gräßlin

# Authors Name
source: Lubos Lunak, Kai Uwe Broulik, Martin Gräßlin, Marco Martin
tr: Luboš Luňák, Kai Uwe Broulik, Martin Gräßlin, Marco Martin
