Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/marble._json_.po
Languages: tr

# Name
source: Marble Part
tr: Bilye Part

# Name
source: World Clock
tr: Dünya Saati

# Name
source: OpenStreetMap with Marble
tr: Bilye ile OpenStreetMap

# Name
source: World Map
tr: Dünya Haritası

# Name
source: GPX Geographic Data
tr: GPX Coğrafi Verisi

# Name
source: GeoJSON Geographic Data
tr: GeoJSON Coğrafi Verisi

# Name
source: KML Geographic Data
tr: KML Coğrafi Verisi

# Name
source: KML Geographic Compressed Data
tr: Sıkıştırılmış KML Coğrafi Verisi

# Name
source: OSM Data
tr: OSM Verisi

# Description
source: Shows the time in different parts of the world
tr: Dünyanın farklı bölgelerindeki zamanı gösterir

# Description
source: Lookup places in OpenStreetMap with Marble
tr: Bilye ile yerlere OpenStreetMap kullanarak bakın

# Description
source: Our beautiful globe as your wallpaper
tr: Güzel yerküremizi duvar kâğıdınız olarak kullanın
