Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/okular._json_.po
Languages: tr

# Name
source: ComicBook Backend
tr: ComicBook Arka Ucu

# Name
source: DjVu Backend
tr: DjVu Arka Ucu

# Name
source: DVI Backend
tr: DVI Arka Ucu

# Name
source: EPub Backend
tr: EPub Arka Ucu

# Name
source: Fax Backend
tr: Faks Arka Ucu

# Name
source: Fiction Book Backend
tr: Kurgu Kitabı Arka Ucu

# Name
source: Image Backend
tr: Resim Arka Ucu

# Name
source: Markdown Backend
tr: Markdown Arka Ucu

# Name
source: Mobipocket Backend
tr: Mobipocket Arka Ucu

# Name
source: PDF Backend
tr: PDF Arka Ucu

# Name
source: PS Backend
tr: PS Arka Ucu

# Name
source: TIFF Backend
tr: TIFF Arka Ucu

# Name
source: Txt Backend
tr: Txt Arka Ucu

# Name
source: XPS Backend
tr: XPS Arka Ucu

# Description
source: A renderer for various comic book formats
tr: Çeşitli çizgi roman biçimleri için bir sunucu

# Description
source: DjVu backend based on DjVuLibre
tr: DjVuLibre tabanlı DjVu arka ucu

# Description
source: A DVI file renderer
tr: Bir DVI dosyası sunucu

# Description
source: An EPub backend
tr: Bir EPub arka ucu

# Description
source: A G3/G4 fax document backend
tr: G3/G4 faks belgesi arka ucu

# Description
source: A renderer for FictionBook eBooks
tr: FictionBook e-kitapları için bir sunucu

# Description
source: A simple image backend
tr: Basit bir görüntü arka ucu

# Description
source: A mobipocket backend
tr: Bir mobipocket arka ucu

# Description
source: A PDF file renderer
tr: PDF dosyası sunucu

# Description
source: A PostScript file renderer based on the Spectre library
tr: Spectre kitaplığına dayalı bir PostScript dosyası sunucu

# Description
source: A TIFF backend
tr: Bir TIFF arka ucu

# Description
source: Txt backend
tr: Txt arka ucu

# Description
source: An XPS backend
tr: Bir XPS arka ucu

# Copyright
source: © 2007-2008 Tobias Koenig
tr: © 2007–2008 Tobias König

# Copyright
source: © 2008 Tobias Koenig
tr: © 2008 Tobias König

# Copyright
source: © 2013 Azat Khuzhin
tr: © 2013 Azat Hujin

# Authors Name
source: Tobias Koenig
tr: Tobias König

# Authors Name
source: Azat Khuzhin
tr: Azat Hujin
