Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/oxygen._json_.po
Languages: tr

# Name
source: Oxygen
tr: Oksijen

# Name
source: Oxygen Window Decoration
tr: Oksijen Pencere Dekorasyonu

# Name
source: Oxygen Widget Style
tr: Oksijen Araç Takımı Biçemi

# Description
source: Theme done in the Oxygen style
tr: Oksijen biçeminde yapılmış tema

# Description
source: Modify the appearance of window decorations
tr: Pencere dekorasyonlarının görünüşünü değiştir

# Description
source: Window decoration using the Oxygen visual style for the Plasma Desktop
tr: Plasma Masaüstü için Oksijen görsel biçemini kullanan pencere dekorasyonu

# Description
source: Modify the appearance of widgets
tr: Araç takımlarının görünüşünü değiştir

# Description
source: Oxygen Desktop Design Language
tr: Oksijen Masaüstü Tasarım Dili

# Authors Name
source: The Oxygen Project
tr: Oksijen Projesi

# Authors Name
source: The Oxygen team
tr: Oksijen Takımı

# X-KDE-Keywords
source: oxygen,decoration
tr: oksijen,oxygen,dekorasyon
