Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/plasma-bigscreen._json_.po
Languages: tr

# Name
source: Plasma Bigscreen Homescreen
tr: Plasma Büyük Ekran Ana Ekranı

# Name
source: Plasma Bigscreen
tr: Plasma Büyük Ekran

# Name
source: Audio
tr: Ses

# Name
source: System
tr: Sistem

# Name
source: Display
tr: Görüntü

# Name
source: KDE Connect
tr: KDE Bağlan

# Name
source: Wallpaper
tr: Duvar Kâğıdı

# Name
source: Web Apps
tr: Web Uygulamaları

# Name
source: Plasma Big Screen
tr: Plasma Büyük Ekran

# Description
source: Bigscreen homescreen with a focus on customizability.
tr: Özelleştirilebilirliğe önem veren bir televizyon ana ekranı.

# Description
source: Homescreen for Plasma based TVs
tr: Plasma tabanlı TV’ler için ana ekran

# Description
source: Manage mediacenter audio devices
tr: Ortam merkezi ses aygıtlarını yapılandır

# Description
source: Look and Feel
tr: Görünüm ve His

# Description
source: Manage Bluetooth devices
tr: Bluetooth aygıtlarını yapılandır

# Description
source: Display Settings
tr: Görüntü Ayarları

# Description
source: Connect and sync your devices
tr: Aygıtlarınızı bağlayın ve eşzamanlayın

# Description
source: Change the system wallpaper
tr: Sistem duvar kâğıdını değiştirin

# Description
source: Create and manage web applications
tr: Web uygulamaları oluşturun ve onları yönetin

# Description
source: Connect to Wi-Fi networks
tr: Wi-Fi ağlarına bağlanın

# Description
source: Plasma Plasma Big Screen look and feel
tr: Plasma Büyük Ekran görünümü ve hissi

# Description
source: Plasma shell for TVs
tr: TV’ler için Plasma kabuğu

# X-KDE-Keywords
source: theme, look, feel
tr: tema, görünüm, his
