Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/plasma-mobile._json_.po
Languages: tr

# Name
source: Folio
tr: Folyo

# Name
source: Halcyon
tr: Halikon

# Name
source: Phone Panel
tr: Telefon Paneli

# Name
source: Phone Task panel
tr: Telefon Görev Panosu

# Name
source: Cellular
tr: Hücresel

# Name
source: Finished
tr: Bitti

# Name
source: Prepare
tr: Hazırlan

# Name
source: System Navigation
tr: Sistem Dolaşımı

# Name
source: Time
tr: Zaman

# Name
source: Information
tr: Bilgi

# Name
source: Shell
tr: Kabuk

# Name
source: Navigation
tr: Dolaşım

# Name
source: Time and Date
tr: Tarih ve Saat

# Name
source: On-Screen Keyboard
tr: Ekran Klavyesi

# Name
source: Waydroid Integration
tr: Waydroid Tümleştirmesi

# Name
source: Plasma Mobile Autodetect APNs
tr: Plasma Cep Erişim Noktası Adlarını Kendiliğinden Algıla

# Name
source: Plasma Mobile Start
tr: Plasma Cep Başlangıç

# Name
source: Mobile Task Switcher
tr: Taşınabilir Görev Değiştiricisi

# Name
source: Convergent Windows
tr: Yakınsak Pencereler

# Name
source: Default Mobile Navigation Panel
tr: Öntanımlı Taşınabilir Dolaşım Paneli

# Name
source: Default Mobile Status Bar
tr: Öntanımlı Taşınabilir Durum Çubuğu

# Name
source: Plasma Mobile Breeze
tr: Plasma Cep Esinti

# Name
source: Airplane Mode
tr: Uçak Kipi

# Name
source: Audio
tr: Ses

# Name
source: Auto Hide Panels
tr: Panelleri Kendiliğinden Gizle

# Name
source: Battery
tr: Pil

# Name
source: Docked Mode
tr: Rıhtımlanmış Kip

# Name
source: Do Not Disturb
tr: Rahatsız Etme

# Name
source: Flashlight
tr: El Feneri

# Name
source: Hotspot
tr: Erişim Noktası

# Name
source: Virtual Keyboard Toggle
tr: Sanal Klavye Aç/Kapat

# Name
source: Screen OSD
tr: Ekran EÜG’si

# Name
source: Mobile Data
tr: Taşınabilir Veri

# Name
source: Night Color
tr: Gece Rengi

# Name
source: Power Menu
tr: Güç Menüsü

# Name
source: Record Screen
tr: Ekranı Kaydet

# Name
source: Screen rotation
tr: Ekran Döndürme

# Name
source: Screenshot
tr: Ekran Görüntüsü

# Name
source: Settings
tr: Ayarlar

# Name
source: Plasma Mobile
tr: Plasma Cep

# Description
source: Mobile homescreen with a focus on customizability.
tr: Özelleştirilebilirlik odaklı taşınabilir ana ekran.

# Description
source: A mobile homescreen focused on simplicity and ease-of-use.
tr: Yalınlığa ve kullanım kolaylığına odaklanmış, taşınabilir bir ana ekran.

# Description
source: Top panel for Plasma Mobile
tr: Plasma Cep için üst panel

# Description
source: Navigation panel for Plasma Mobile
tr: Plasma Cep için dolaşım paneli

# Description
source: Cellular initialstart module for Plasma Mobile
tr: Plasma Cep için hücresel ayar başlangıç modülü

# Description
source: Finished initialstart module for Plasma Mobile
tr: Plasma Cep için başlangıç ayarları modülü ayarlandı

# Description
source: Prepare initialstart module for Plasma Mobile
tr: Plasma Cep için başlangıç ayarları modülünü hazırla

# Description
source: System navigation initialstart module for Plasma Mobile
tr: Plasma Cep için sistem dolaşımı başlangıcı modülü

# Description
source: Time initialstart module for Plasma Mobile
tr: Plasma Cep için zaman ayarları başlangıç modülü

# Description
source: WiFi initialstart module for Plasma Mobile
tr: Plasma Cep için Wi-Fi başlangıç modülü

# Description
source: Software Versions
tr: Yazılım Sürümleri

# Description
source: Configure the system shell
tr: Sistem kabuğunu yapılandırın

# Description
source: Configure System Navigation
tr: Sistem dolaşımını yapılandırın

# Description
source: Timezone, Date Display
tr: Zaman Dilimi; Tarih Gösterimi

# Description
source: On-Screen Keyboard configuration
tr: Ekran Klavyesi yapılandırması

# Description
source: Waydroid configuration
tr: Waydroid yapılandırması

# Description
source: Autodetect cellular APNs in Plasma Mobile
tr: Plasma Cep’teki erişim noktası adlarını kendiliğinden algılayın

# Description
source: Run initial tasks for Plasma Mobile during session startup
tr: Oturum başlangıcı sırasında Plasma Cep başlangıç görevlerini çalıştırın

# Description
source: Allows you to switch between running tasks with a mobile interface.
tr: Bir taşınabilir arayüzden çalışan görevler arasında geçiş yapmanıza izin verir.

# Description
source: Removes window decorations and maximizes windows on the first screen only.
tr: Pencere dekorasyonlarını kaldırır ve pencereleri yalnızca ilk ekranda kaplatır.

# Description
source: Default navigation panel for mobile
tr: Cep için öntanımlı dolaşım paneli

# Description
source: Default status bar for mobile
tr: Cep için öntanımlı durum çubuğu

# Description
source: Plasma for mobile devices
tr: Taşınabilir aygıtlar için Plasma

# Description
source: Airplane mode quick setting for Plasma Mobile
tr: Plasma Cep uçak kipi tez ayarı

# Description
source: Audio quick setting for Plasma Mobile
tr: Plasma Cep ses tez ayarı

# Description
source: Auto Hide Panels quick setting for Plasma Mobile
tr: Plasma Cep panelleri kendiliğinden gizleme tez ayarı

# Description
source: Battery quick setting for Plasma Mobile
tr: Plasma Cep pil tez ayarı

# Description
source: Bluetooth quick setting for Plasma Mobile
tr: Plasma Cep Bluetooth tez ayarı

# Description
source: Quick setting to suspend system sleep for Plasma Mobile
tr: Plasma Cep sistem uykusunu askıya alma tez ayarı

# Description
source: Quick setting to toggle docked mode for Plasma Mobile
tr: Plasma Cep için rıhtımlanmış kip aç/kapat tez ayarı

# Description
source: Quick setting to toggle do not disturb mode for Plasma Mobile
tr: Plasma Cep rahatsız etme kipini aç/kapat tez ayarı

# Description
source: Flashlight quick setting for Plasma Mobile
tr: Plasma Cep el feneri tez ayarı

# Description
source: Hotspot quick setting for Plasma Mobile
tr: Plasm Mobile erişim noktası tez ayarı

# Description
source: Quick setting for keyboard toggle for Plasma Mobile
tr: Plasma Cep klavye aç/kapat tez ayarı

# Description
source: Screen setup OSD quick setting for Plasma Mobile
tr: Plasma Cep ekran ayarları için tez ayar

# Description
source: Location quick setting for Plasma Mobile
tr: Plasma Cep konum tez ayarı

# Description
source: Night color quick setting for Plasma Mobile
tr: Plasma Cep gece rengi tez ayarı

# Description
source: Power menu quick setting for Plasma Mobile
tr: Plasma Cep güç menüsü tez ayarı

# Description
source: Screen recording quick setting for Plasma Mobile
tr: Plasma Cep ekran kaydetme tez ayarı

# Description
source: Screen rotation quick setting for Plasma Mobile
tr: Plasma Cep ekran döndürme tez ayarı

# Description
source: Screenshot quick setting for Plasma Mobile
tr: Plasma Cep ekran görüntüsü tez ayarı

# Description
source: Settings application quick setting for Plasma Mobile
tr: Plasma Cep ayarlar uygulaması tez ayarı

# Description
source: Waydroid quick setting for Plasma Mobile
tr: Plasma Cep Waydroid tez ayarı

# Description
source: Wi-Fi quick setting for Plasma Mobile
tr: Plasma Cep Wi-Fi tez ayarı

# Description
source: Plasma shell for mobile devices
tr: Taşınabilir aygıtlar için Plasma kabuğu

# Authors Name
source: Bhushan Shah
tr: Buşan Şah

# Authors Name
source: KDE Visual Design Group
tr: KDE Görsel Tasarım Grubu

# X-KDE-Keywords
source: info, distro, system
tr: bilgi,dağıtım,distro,sistem

# X-KDE-Keywords
source: system,shell,panel
tr: sistem,kabuk,panel

# X-KDE-Keywords
source: system,shell,panel,navigation,gesture
tr: sistem,kabuk,panel,dolaşım,gezinme,dolaşma,hareket

# X-KDE-Keywords
source: theme, look, feel
tr: tema,görünüm,görünüş,his,bakış

# X-KDE-Keywords
source: onscreen,osk,virtualkeyboard,keyboard
tr: ekran üzeri,ekran,osk,osd,sanal klavye,klavye,düğme
