Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/plasma-workspace._json_.po
Languages: tr

# Name
source: Activity Bar
tr: Etkinlik Çubuğu

# Name
source: Analog Clock
tr: Analog Saat

# Name
source: Global Menu
tr: Global Menü

# Name
source: Calendar
tr: Takvim

# Name
source: Camera Indicator
tr: Kamera Göstergesi

# Name
source: Clipboard
tr: Pano

# Name
source: Disks & Devices
tr: Diskler ve Aygıtlar

# Name
source: Digital Clock
tr: Sayısal Saat

# Name
source: Icon
tr: Simge

# Name
source: Lock/Logout
tr: Kilitle/Oturumu Kapat

# Name
source: Input Method
tr: Giriş Yöntemi

# Name
source: Media Player
tr: Ortam Oynatıcısı

# Name
source: Notifications
tr: Bildirimler

# Name
source: Panel Spacer
tr: Panel Ayırıcısı

# Name
source: Individual Core Usage
tr: Tekil Çekirdek Kullanımı

# Name
source: Total CPU Use
tr: Toplam CPU Kullanımı

# Name
source: Hard Disk Activity
tr: Sabit Disk Etkinliği

# Name
source: Disk Usage
tr: Disk Kullanımı

# Name
source: Memory Usage
tr: Bellek Kullanımı

# Name
source: Network Speed
tr: Ağ Hızı

# Name
source: System Monitor Sensor
tr: Sistem Monitörü Algılayıcısı

# Name
source: System Tray
tr: Sistem Tepsisi

# Name
source: Application menus daemon
tr: Uygulama Menüleri Ardalan Süreci

# Name
source: Application Launcher
tr: Uygulama Başlatıcısı

# Name
source: Standard Menu
tr: Standart Menü

# Name
source: Paste
tr: Yapıştır

# Name
source: Switch Activity
tr: Etkinlik Değiştir

# Name
source: Switch Desktop
tr: Masaüstünü Değiştir

# Name
source: Switch Window
tr: Pencereyi Değiştir

# Name
source: Application Job Information
tr: Uygulama Görev Bilgileri

# Name
source: Run Commands
tr: Komut Çalıştır

# Name
source: Application Notifications
tr: Uygulama Bildirimleri

# Name
source: Date and Time
tr: Tarih ve Zaman

# Name
source: Device Notifications
tr: Aygıt Bildirimleri

# Name
source: Donation Request
tr: Bağış Talebi

# Name
source: Free Space Notifier
tr: Boş Alan Bildiricisi

# Name
source: Location-based System Time Zone
tr: Konum Tabanlı Sistem Zaman Dilimi

# Name
source: Autostart
tr: Kendiliğinden Başlatım

# Name
source: Accent Color
tr: Vurgu Rengi

# Name
source: Colors
tr: Renkler

# Name
source: Default Applications
tr: Öntanımlı Uygulamalar

# Name
source: Cursors
tr: İmleçler

# Name
source: Plasma Style
tr: Plasma Biçemi

# Name
source: User Feedback
tr: Kullanıcı Geri Bildirimi

# Name
source: Fonts
tr: Yazıtipleri

# Name
source: Icons
tr: Simgeler

# Name
source: Font Management
tr: Yazıtipi Yönetimi

# Name
source: Font Files
tr: Yazıtipi Dosyaları

# Name
source: Font Viewer
tr: Yazıtipi Görüntüleyicisi

# Name
source: Global Theme
tr: Global Tema

# Name
source: Global Theme Auto-Switcher
tr: Global Tema Değiştiricisi

# Name
source: Night Light
tr: Gece Işığı

# Name
source: Day-Night Cycle
tr: Gece–Gündüz Döngüsü

# Name
source: Region & Language
tr: Bölge ve Dil

# Name
source: System Sounds
tr: Sistem Sesleri

# Name
source: Application Style
tr: Uygulama Biçemi

# Name
source: Users
tr: Kullanıcılar

# Name
source: Wallpaper
tr: Duvar Kâğıdı

# Name
source: Directory Watcher
tr: Dizin İzleyici

# Name
source: Time Zone
tr: Zaman Dilimi

# Name
source: Media Controller
tr: Ortam Denetimcisi

# Name
source: Breeze Dark
tr: Esinti Koyu

# Name
source: Breeze
tr: Esinti

# Name
source: Breeze Twilight
tr: Esinti Alacakaranlık

# Name
source: Out of Memory Notifier
tr: Bellek Tükendi Bildiricisi

# Name
source: KDE Multimedia Backend
tr: KDE Çoklu Ortam Arka Ucu

# Name
source: Holidays
tr: Tatiller

# Name
source: Software Center
tr: Yazılım Merkezi

# Name
source: Bookmarks
tr: Yer İmleri

# Name
source: Calculator
tr: Hesap Makinesi

# Name
source: Help Runner
tr: Yardım Çalıştırıcısı

# Name
source: Terminate Applications
tr: Uygulamaları Sonlandır

# Name
source: Locations
tr: Konumlar

# Name
source: Places
tr: Yerler

# Name
source: Recent Files
tr: Son Dosyalar

# Name
source: Applications
tr: Uygulamalar

# Name
source: Desktop Sessions
tr: Masaüstü Oturumları

# Name
source: Command Line
tr: Komut Satırı

# Name
source: Web Search Keywords
tr: Web Arama Anahtar Sözcükleri

# Name
source: Drive Ejector
tr: Sürücü Çıkarıcısı

# Name
source: Hardware Detection
tr: Donanım Algılaması

# Name
source: Session Shortcuts
tr: Oturum Kısayolları

# Name
source: Status Notifier Manager
tr: Durum Bildirim Yöneticisi

# Name
source: Plain Color
tr: Düz Renk

# Name
source: Image
tr: Görsel

# Name
source: Slideshow
tr: Slayt Gösterisi

# Name
source: Set as
tr: Ayarla

# Description
source: Tab bar to switch activities
tr: Etkinlikleri değiştirmek için sekme çubuğu

# Description
source: A clock with hands
tr: İbreli bir saat

# Description
source: Global menubar in your Plasma Desktop
tr: Plasma Masaüstü’nüzde global menü çubuğu

# Description
source: Month display with your appointments and events
tr: Randevularınız ve etkinliklerinizle birlikte ay görünümü

# Description
source: Shows whether any camera is currently used by an app
tr: Herhangi bir uygulama tarafından kullanılan kamera olup olmadığını gösterir

# Description
source: Provides access to the clipboard history
tr: Pano geçmişine erişim sağlar

# Description
source: Notifications and access for devices
tr: Aygıt erişimi ve bildirimler

# Description
source: Time displayed in a digital format
tr: Sayısal biçimde gösterilen saat

# Description
source: A generic icon
tr: Genel bir simge

# Description
source: Lock the screen or log out
tr: Ekranı kilitleyin veya oturumu kapatın

# Description
source: Manage your input methods
tr: Giriş yöntemlerinizi yönetin

# Description
source: Media player controls
tr: Ortam oynatıcısı denetimleri

# Description
source: Display notifications and jobs
tr: Görevleri ve bildirimleri görüntüleyin

# Description
source: Reserve empty spaces within the panel.
tr: Panelde boş alanlar ayırın.

# Description
source: System monitor widget that shows usage of individual CPU cores
tr: Tekil CPU çekirdeklerini gösteren sistem monitörü araç takımı

# Description
source: System monitor widget that shows the total CPU usage
tr: Toplam CPU kullanımını gösteren sistem monitörü araç takımı

# Description
source: An applet that monitors hard disk throughput and input/output
tr: Sabit disk girişini/çıkışını izleyen bir uygulamacık

# Description
source: System monitor widget that shows the usage of the root partition
tr: Kök bölüntünün kullanımını gösteren sistem monitörü araç takımı

# Description
source: System monitor widget that shows physical memory usage
tr: Fiziksel bellek kullanımını gösteren sistem monitörü araç takımı

# Description
source: System monitor widget that shows the download and upload data rate
tr: Veri indirme ve karşıya yükleme hızını gösteren sistem monitörü araç takımı

# Description
source: Displays a configurable chart of a system monitor sensor
tr: Sistem monitörü algılayıcısının yapılandırılabilir bir grafiğini görüntüler

# Description
source: Access hidden applications minimized in the system tray
tr: Sistem tepsisine küçültülen uygulamalara erişin

# Description
source: Transfers application's menu to the desktop
tr: Uygulamanın menüsünü masaüstüne aktarır

# Description
source: Application job updates (via kuiserver)
tr: Uygulama görevi güncellemeleri (kuiserver ile)

# Description
source: Run Executable Data Engine
tr: Yürütülebilir Veri İşletkesini Başlat

# Description
source: Passive visual notifications for the user.
tr: Kullanıcı için pasif görsel bildirimler.

# Description
source: Date and time by timezone
tr: Zaman dilimine göre tarih ve zaman

# Description
source: Play audible feedback when devices are inserted or removed
tr: Aygıtlar takıldığında veya çıkarıldığında sesle geri bildirim ver

# Description
source: Shows a yearly request to donate to KDE
tr: KDE’ye bağış yapılması için yılda bir kez bir talep gösterir

# Description
source: Warns when running out of space on your home folder
tr: Ana klasörünüzdeki boş alan azaldığı zaman uyarır

# Description
source: Automatically change the system time zone based on the current location
tr: Geçerli konuma bağlı olarak sistem zamanını kendiliğinden değiştirin

# Description
source: Automatically Started Applications
tr: Otomatik Başlatılan Uygulamalar

# Description
source: Applies extracted accent color from wallpaper on request
tr: İsteğe bağlı olarak, duvar kâğıdından çıkarılan vurgu rengini uygular

# Description
source: Choose color scheme
tr: Renk şeması seçin

# Description
source: Choose default Applications
tr: Öntanımlı uygulamaları seçin

# Description
source: Choose mouse cursor theme
tr: Fare imleci teması seçin

# Description
source: Choose Plasma style
tr: Plasma biçemini seçin

# Description
source: Configure user feedback settings
tr: Kullanıcı geri bildirim ayarlarını yapılandırın

# Description
source: Configure user interface fonts
tr: Kullanıcı arayüzü yazıtiplerini yapılandırın

# Description
source: Choose icon theme
tr: Simge teması seçin

# Description
source: Install, manage and preview fonts
tr: Yazıtiplerini kurun, yönetin ve önizleyin

# Description
source: Choose global look and feel
tr: Global görünüm ve his’i seçin

# Description
source: Switches between dark and light Global Themes based on time of day
tr: Günün saatine bağlı olarak açık ve koyu global temalar arasında geçiş yapar

# Description
source: Adjust screen color temperature based on time
tr: Zamana bağlı olarak ekran rengi sıcaklığını ayarla

# Description
source: Configure the day-night cycle times
tr: Gece–gündüz döngüsü zamanlarını yapılandırın

# Description
source: Event Notifications and Actions
tr: Etkinlik Bildirimleri ve Eylemler

# Description
source: Language Setting, Numeric, Currency and Time Formats
tr: Dil Ayarı, Sayı, Para Birimi ve Zaman Biçimleri

# Description
source: Select a Sound Theme for Notifications
tr: Bildirimler için bir ses teması seçin

# Description
source: Configure application style and behavior
tr: Uygulama biçemini ve davranışını yapılandırın

# Description
source: Manage user accounts
tr: Kullanıcı hesaplarını yönetin

# Description
source: Configure the wallpaper
tr: Duvar kâğıdını yapılandırın

# Description
source: Monitors directories for changes
tr: Dizinleri değişiklikler için izler

# Description
source: Clipboard Tool.
tr: Pano aracı

# Description
source: Provides the system's time zone to applications
tr: Sistem zaman dilimini uygulamalara sunar

# Description
source: Controls media players using global keyboard shortcuts
tr: Global klavye kısayollarını kullanarak ortam oynatıcılarını denetler

# Description
source: Breeze Dark by the KDE VDG
tr: KDE VDG’den Esinti Koyu

# Description
source: Breeze by the KDE VDG
tr: KDE VDG’den Esinti

# Description
source: Breeze Twilight by the KDE VDG
tr: KDE VDG’den Esinti Alacakaranlık

# Description
source: Informs when applications get terminated to prevent out of memory conditions
tr: Uygulamalar var olan belleğin tükenmesinden ötürü sonlandırıldığında bildirir

# Description
source: Show public holidays in various countries or states
tr: Çeşitli ülkelerdeki ve eyaletlerdeki tatil günlerini gösterin

# Description
source: Lets you find software
tr: Yazılım bulmanızı sağlar

# Description
source: Find and open bookmarks
tr: Yer imlerini bul ve aç

# Description
source: Calculate expressions
tr: İfadeleri hesapla

# Description
source: Shows help information about runners when typing "?" or "help"
tr: “?” ve “help” yazıldığında çalıştırıcılar hakkında yardım bilgisi gösterir

# Description
source: Stop applications that are currently running
tr: Şu anda çalışan uygulamaları durdurun

# Description
source: File and URL opener
tr: Dosya ve URL açıcı

# Description
source: Open devices and folder bookmarks
tr: Aygıt ve klasör yer imlerini açın

# Description
source: Find applications, control panels and services
tr: Uygulamaları, denetim panellerini ve hizmetleri bulun

# Description
source: Fast user switching
tr: Hızlı kullanıcı değiştirme

# Description
source: Executes shell commands
tr: Kabuk komutlarını yürütür

# Description
source: Search the web using keywords
tr: Anahtar sözcükleri kullanarak Web’de arama yap

# Description
source: Automatically releases drives when their eject button is pushed
tr: Çıkar düğmesine basıldığında sürücüleri kendiliğinden ayırır

# Description
source: Provides a user interface for hardware events
tr: Donanım etkinlikleri için kullanıcı arayüzü sunar

# Description
source: Provides shortcuts for common session actions
tr: Temel oturum eylemleri için kısayollar sağlar

# Description
source: Manages services that provide status notifier user interfaces
tr: Durum bildirimi kullanıcı arayüzünü sunan hizmetleri yönetir

# Description
source: Plain color wallpaper
tr: Düz renk duvar kâğıdı

# Description
source: Wallpaper view for images
tr: Görseller için duvar kâğıdı görünümü

# Description
source: Slideshow wallpaper
tr: Slayt gösterisi duvar kâğıdı

# Description
source: Set image as (lockscreen) wallpaper
tr: Görseli, kilit ekranı duvar kâğıdı olarak ayarlayın

# Authors Name
source: Bhushan Shah
tr: Buşan Şah

# Authors Name
source: Fushan Wen
tr: Fuşan Wen

# Authors Name
source: The Plasma Team
tr: Plasma Takımı

# Authors Name
source: KDE Visual Design Group
tr: KDE Görsel Tasarım Grubu

# Authors Name
source: Plasma Team
tr: Plasma Takımı

# X-KDE-Keywords
source: klipper,clipboard,copy,paste
tr: klipper,pano,kopyala,yapıştır,kes

# X-KDE-Keywords
source: Autostart Manager,system startup,plasma start,cron,auto,start,start up,boot,load,session,startup,launch,login
tr: otomatik başlat yöneticisi,kendiliğinden başlat yöneticisi,sistem başlangıcı,cron,oto,otomatik,kendiliğinden,önyükle,yükle,oturum,başlangıç,oturum aç,giriş yap

# X-KDE-Keywords
source: color,colour,scheme,contrast,Widget colors,Color Scheme,color style,color theme,tint,accent color,color scheme,dark mode,light mode,accent colour,accent,highlight,colour
tr: renk,şema,düzen,kontrast,karşıtlık,araç takımı renkleri,renk şeması,renk stili,renk tarzı,renk biçemi,renk teması,gölge,açıklık,vurgu rengi,aksan rengi,koyu kip,koyu mod,karanlık kip,karanlık mod,açık mod,açık kip,aydınlık mod,aydınlık kip,vurgu

# X-KDE-Keywords
source: default applications,default apps,components,component chooser,resources,web browser,browser,internet,file manager,dolphin,email,e-mail,email client,terminal,terminal emulator,konsole,defaults,open with,file association
tr: öntanımlı uygulamalar,default uygulamalar,bileşenler,bileşen,bileşen seçicisi,özkaynaklar,kaynaklar,web,tarayıcı,internet,dosya yöneticisi,dolphin,email,e-posta,eposta,istemci,terminal,uçbirim,konsol,öntanımlılar,birlikte aç,dosya ilişkilendirmesi

# X-KDE-Keywords
source: Mouse,Cursor,Theme,Cursor Appearance,Cursor Color,Cursor Theme,Mouse Theme,Mouse Appearance,Mouse Skin,Pointer Colors,Pointer Appearance,cursor skin,cursor style,cursor size,mouse style,pointer,start,launch,busy,feedback,mouse,pointer,bounce,bouncing,rotating,spinning,startup,start-up,program,report,taskbar,animation,loading
tr: fare,imleç,tema,mouse,imleç görünüşü,imleç rengi,imleç teması,fare teması,mouse teması,fare görünüşü,mouse görünüşü,işaretçi rengi,işaretçi renkleri,işaretçi görünüşü,imleç biçemi,imleç tarzı,imleç büyüklüğü,imleç boyutu,işaretçi,başlat,meşgul,geri bildirim,zıpla,döndür,başlat,program,raporla,rapor et,bildir,görev çubuğu,animasyon,canlandırma,yükleniyor

# X-KDE-Keywords
source: Desktop Theme,Plasma Theme,plasma style,desktop style,plasma skin,desktop skin,theme
tr: masaüstü teması,plasma teması,plasma stili,plasma biçemi,plasma tarzı,masaüstü biçemi,masaüstü stili,masaüstü tarzı,tema

# X-KDE-Keywords
source: feedback,report,contact,data collection,statistics,usage,log,logging,telemetry
tr: geri bildirim,rapor,raporla,rapor et,bildir,iletişim,veri toplama,istatistik,kullanım,günlük,günlükleme,telemetri

# X-KDE-Keywords
source: fonts,font size,styles,charsets,character sets,panel,control panel,desktops,FileManager,Toolbars,Menu,Window Title,Title,DPI,anti-aliasing,desktop fonts,toolbar fonts,character,general fonts,typography,type,letters,character,hinting,sub-pixel,text,big text,change font,size
tr: font,fontlar,yazıtipi,yazıtipleri,yazı tipleri,yazı tipi boyutu,font boyutu,yazıtipi puntosu,font büyüklüğü,yazıtipi büyüklüğü,yazı tipi büyüklüğü,biçemler,tarzlar,stiller,karakter kümeleri,karakter setleri,panel,kontrol paneli,denetim paneli,masaüstü,dosya yöneticisi,araç çubukları,menü,pencere başlığı,başlık,DPI,kenar yumuşatma,masaüstü yazı tipleri,masaüstü fontları,masaüstü yazıtipleri,araç çubuğu yazı tipleri,araç çubuğu yazıtipi,araç çubuğu fontu,karakter,genel yazı tipleri,genel fontlar,genel yazıtipleri,tipografi,tür,harfler,karakter,aralıklandırma,şekil,alt piksel,metin,büyük metin,yazı tipini değiştir,yazıtipini değiştir,fontu değiştir,boyut, büyüklük

# X-KDE-Keywords
source: icons,effects,size,hicolor,locolor,change icons,buttons,button theme,icon theme,theme,iconography
tr: simge,simgeler,efekt,etki,efektler,etkiler,yüksek renk,düşük renk,simge değiştir,simgeleri değiştir,düğmeler,düğme,düğme teması,simge teması,tema,ikonografi

# X-KDE-Keywords
source: font,fonts,installer,truetype,type1,bitmap
tr: yazıtipi,yazıtipleri,yazı tipi,yazı tipleri,font,fontlar,truetype,type1,biteşlem,bitmap

# X-KDE-Keywords
source: theme,look,feel,global theme,desktop,appearance,skin, global,presentation,themes,design,UI
tr: tema,görünüş,görünüm,his,bakış,global tema,masaüstü,global,sunum,temalar,tasarım,UI,arayüz,kullanıcı arayüzü

# X-KDE-Keywords
source: kwin,window,manager,night,colors,redshift,eyes,night mode,colour,dark mode,dark,dim,sleep,eye strain,red,shift,orange,yellow,warm,screen tint,temperature,blue,light
tr: kwin,pencere,yönetici,gece,renkler,redshift,göz,gözler,gece kipi,renk,koyu kip,koyu mod,karanlık kip,karanlık mod,karart,sönder,uyku,uyut,göz yorgunluğu,kırmızı,yükselt,kaydır,turuncu,portakal,sarı,ılık,sıcak,ekran rengi,sıcaklık,mavi,ışık

# X-KDE-Keywords
source: dark,light,night,day
tr: koyu,açık,gece,gündüz,karanlık,aydınlık,akşam,sabah

# X-KDE-Keywords
source: System sounds,Audio,Sound,Notify,Alerts,Notification,popups,disturb,do not disturb,quiet,concentrate,concentration,alarm,popup,pop up,progress,badges,alert sounds,warning sounds,dnd,mute
tr: sistem sesleri,ses,bildirim,uyarı,ikaz,açılır pencere,rahatsız et,rahatsız etme,sessiz,konsantre,konsantrasyon,alarm,açılır,ilerleme,sürüş,rozet,rozetler,ikaz sesleri,uyarı sesleri,dnd,sessiz,sessize al,sesi kapat

# X-KDE-Keywords
source: language,translation,number format,locale,Country,charsets,character sets,Decimal symbol,Thousands separator,symbol,separator,sign,positive,negative,currency,money,fractional digits,calendar,time,date,formats,week,week start,first,paper,size,letter,A4,measure,metric,English,Imperial,region,measurement units,collation,sorting,date format,storage size,data size,size format,data format,binary dialect,byte,kilobyte,megabyte,gigabyte,terabyte
tr: dil,çeviri,sayı biçimi,yerel,ülke,karakter kümeleri,karakter kümeleri,karakter seti,ülke karakter seti,ülke karakter setleri,ondalık simgesi,binler ayırıcısı,sembol,ayırıcı,işaret,pozitif,negatif,para birimi,para,kesirli basamaklar,takvim,zaman,tarih,biçimler,hafta,hafta başlangıcı,ilk,kâğıt,boyut,mektup,A4,ölçü,metrik,ingilizce,imparatorluk,emperyal,bölge,ölçüm birimleri,karşılaştırma,sıralama,tarih biçimi,depolama boyutu,veri boyutu,boyut,biçim,veri biçimi,ikili lehçe,bayt,kilobayt,megabayt,gigabayt,terabayt

# X-KDE-Keywords
source: system sounds,sound theme,sound,sounds,alert,notification,bell
tr: sistem sesleri,ses teması,ses,uyarı,ikaz,bildirim,zil

# X-KDE-Keywords
source: style,styles,look,widget,icons,toolbars,text,highlight,apps,windows,KDE applications,theme,plasma,menu,global menu,GTK,GNOME,application style,app,programs,appearance,skin,themes,light mode,dark mode
tr: stil,stiller,tarz,tarzlar,biçem,biçemler,görünüş,his,bakış,araç takımı,simge,simgeler,araç çubuğu,araç çubukları,metin,yazı,vurgu,uygulama,uygulamalar,app,KDE uygulamaları,tema,temalar,plasma,menü,global menü,GTK,GNOME,uygulama biçemi,uygulama tarzı,uygulama stili,programlar,program,tema,temalar,açık kip, koyu kip,açık mod,koyu mod,aydınlık kip,aydınlık mod,karanlık mod,karanlık kip,windows,pencereler,pencere

# X-KDE-Keywords
source: users,accounts,profile picture,profile photo,avatar,name,password,passwords,email,e-mail,administrator,root user,standard user,profile,delete user,delete account,pfp,fingerprint,biometric
tr: kullanıcı,kullanıcılar,hesaplar,profil resmi,profil fotoğrafı,profil görseli,avatar,ad,parola,parolalar,şifre,şifreler,e-mail,email,e-posta,yönetici,kök,süper,yönetici,kök kullanıcı,standart kullanıcı,profil,kullanıcıyı sil,hesabı sil,pfp,parmak izi,biyometrik

# X-KDE-Keywords
source: wallpaper,desktop
tr: duvar kâğıdı,masaüstü
