Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/plasma5support._json_.po
Languages: tr

# Name
source: Activities Engine
tr: Etkinlikler İşletkesi

# Name
source: Application Information
tr: Uygulama Bilgisi

# Name
source: Device Notifications
tr: Aygıt Bildirimleri

# Name
source: Favicons
tr: Site Simgeleri

# Name
source: Files and Directories
tr: Dosyalar ve Dizinler

# Name
source: Geolocation
tr: Coğrafi Konum

# Name
source: Hotplug Events
tr: Tak–Çıkar Olayları

# Name
source: Keyboard and Mouse State
tr: Klavye ve Fare Durumu

# Name
source: Pointer Position
tr: İşaretçi Konumu

# Name
source: Places
tr: Yerler

# Name
source: Power Management
tr: Güç Yönetimi

# Name
source: Device Information
tr: Aygıt Bilgisi

# Name
source: BBC Weather
tr: BBC Hava Durumu

# Name
source: German Weather Service
tr: Alman Hava Durumu Hizmeti

# Name
source: NOAA's National Weather Service
tr: NOAA’nın Ulusal Hava Durumu Hizmeti

# Name
source: Weather
tr: Hava Durumu

# Description
source: Information on Plasma Activities
tr: Plasma Etkinlikler hakkında bilgi

# Description
source: Information and launching of all applications in the app menu.
tr: Uygulama menüsündeki uygulamalar hakkında bilgi ve uygulamaların başlatılması

# Description
source: Passive device notifications for the user.
tr: Kullanıcı için pasif aygıt bildirimleri

# Description
source: Data Engine for getting favicons of web sites
tr: Web sitelerinin simgelerini almak için veri işletkesi

# Description
source: Information about files and directories.
tr: Dosyalar ve dizinler hakkında bilgi.

# Description
source: Geolocation Data Engine
tr: Coğrafi konum verisi işletkesi

# Description
source: Tracks hot-pluggable devices as they appear and disappear.
tr: Takıp çıkarılabilir aygıtları görünüp kaybolduklarında izler.

# Description
source: Keyboard modifier and mouse buttons states
tr: Klavye niteleyicisi ve fare düğmeleri durumları

# Description
source: Mouse position and cursor
tr: Fare konumu ve imleci

# Description
source: PackageKit Data Engine
tr: PackageKit verisi işletkesi

# Description
source: Places, as seen in the file manager and in file dialogs.
tr: Dosya yöneticisi ve iletişim kutularında görüldüğü üzere Yerler.

# Description
source: Battery, AC, sleep and PowerDevil information.
tr: Pil, AC, uyku ve PowerDevil bilgisi

# Description
source: Device data via Solid
tr: Solid aracılığıyla aygıt verisi

# Description
source: XML Data from the British Broadcasting Corporation
tr: BBC tarafından sağlanan XML biçiminde veri

# Description
source: Weather forecast by German Weather Service
tr: Alman Hava Durumu Hizmeti tarafından verilen hava durumu tahminleri

# Description
source: XML Data from Environment Canada
tr: Environment Canada tarafından sağlanan XML biçiminde veri

# Description
source: XML Data from NOAA's National Weather Service
tr: NOAA’nın Ulusal Hava Durumu Hizmeti tarafından sağlanan XML biçiminde veri

# Description
source: Weather forecast by wetter.com
tr: wetter.com tarafından sağlanan hava durumu tahminleri

# Description
source: Weather data from multiple online sources
tr: Birden çok çevrimiçi kaynaktan hava durumu verisi

# Authors Name
source: The Plasma Team
tr: Plasma Takımı
