Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/ruqola._json_.po
Languages: tr

# Name
source: Github Authentication Plugin
tr: Github Kimlik Doğrulama Eklentisi

# Name
source: GitLab Authentication Plugin
tr: GitLab Kimlik Doğrulama Eklentisi

# Name
source: Google Authentication Plugin
tr: Google Kimlik Doğrulama Eklentisi

# Name
source: Password Authentication Plugin
tr: Parola Doğrulama Eklentisi

# Name
source: AI Text
tr: Yapay Zekâ Metni

# Name
source: Share Text
tr: Metni Paylaş

# Name
source: Web Shortcut
tr: Web Kısayolu

# Name
source: AI Actions
tr: Yapay Zekâ Eylemleri

# Name
source: Autogenerating Answer
tr: Kendiliğinden Üretilen Yanıt

# Name
source: Grab Screen
tr: Ekranı Yakala

# Description
source: This plugin allows you asking to AI.
tr: Bu eklenti, yapay zekâya soru sormanıza olanak tanır.

# Description
source: This plugin allows you sharing text.
tr: Bu eklenti, metin paylaşmanıza olanak tanır.

# Description
source: This plugin allows you asking on web.
tr: Bu eklenti, web üzerinde soru sormanıza olanak tanır.

# Description
source: This plugin allows you asking to AI engine some questions.
tr: Bu eklenti, yapay zekâ işletkesine sorular sormanıza olanak tanır.

# Description
source: This plugin allows you autogenerating answer.
tr: Bu eklenti, kendiliğinden yanıtlar üretilmesine olanak tanır.

# Description
source: This plugin allows you creating screenshot.
tr: Bu eklenti, ekran görüntüleri almaya olanak tanır.
