Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/json/skrooge._json_.po
Languages: tr

# Name
source: Advice plugin
tr: Tavsiye Eklentisi

# Name
source: Bookmark plugin
tr: Yer İmi Eklentisi

# Name
source: Dashboard plugin
tr: Gösterge Tablosu Eklentisi

# Name
source: Debug plugin
tr: Hata Ayıklama Eklentisi

# Name
source: Delete plugin
tr: Silme Eklentisi

# Name
source: File plugin
tr: Dosya Eklentisi

# Name
source: Highlight plugin
tr: Vurgulama Eklentisi

# Name
source: Monthly plugin
tr: Aylık Eklenti

# Name
source: Print plugin
tr: Yazdırma Eklentisi

# Name
source: Properties plugin
tr: Özellikler Eklentisi

# Name
source: Select all plugin
tr: Tümünü seç Eklentisi

# Name
source: Statistic plugin
tr: İstatistik Eklentisi

# Name
source: Undo redo plugin
tr: Geri alma tekrarlama Eklentisi

# Name
source: Skrooge import AFB120 plugin
tr: Varyemez AFB120 İçe Aktarma Eklentisi

# Name
source: AqBanking backend
tr: AqBanking Arka Ucu

# Name
source: Weboob coming backend
tr: Weboob arka ucu

# Name
source: Weboob backend
tr: Weboob arka ucu

# Name
source: Woob coming backend
tr: Woob geliş arka ucu

# Name
source: Woob backend
tr: Woob arka ucu

# Name
source: Woob backend (OFX)
tr: Woob arka ucu (OFX)

# Name
source: Skrooge import backend plugin
tr: Varyemez İçe Aktarma Arka Ucu Eklentisi

# Name
source: Skrooge import CSV plugin
tr: Varyemez CSV İçe Aktarma Eklentisi

# Name
source: Skrooge import GNC plugin
tr: Varyemez GNC İçe Aktarma Eklentisi

# Name
source: Skrooge import GSB plugin
tr: Varyemez GSB İçe Aktarma Eklentisi

# Name
source: Skrooge import IIF plugin
tr: Varyemez IIF İçe Aktarma Eklentisi

# Name
source: Skrooge import JSON plugin
tr: Varyemez JSON İçe Aktarma Eklentisi

# Name
source: Skrooge import KMY plugin
tr: Varyemez KMY İçe Aktarma Eklentisi

# Name
source: Skrooge import ledger plugin
tr: Varyemez ledger İçe Aktarma Eklentisi

# Name
source: Skrooge import MMB plugin
tr: Varyemez MMB İçe Aktarma Eklentisi

# Name
source: Skrooge import MNY plugin
tr: Varyemez MNY İçe Aktarma Eklentisi

# Name
source: Skrooge import MT940 plugin
tr: Varyemez MT940 İçe Aktarma Eklentisi

# Name
source: Skrooge import OFX plugin
tr: Varyemez OFX İçe Aktarma Eklentisi

# Name
source: Skrooge import PDF plugin
tr: Varyemez PDF İçe Aktarma Eklentisi

# Name
source: Skrooge import QIF plugin
tr: Varyemez QIF İçe Aktarma Eklentisi

# Name
source: Skrooge import SKG plugin
tr: Varyemez SKG İçe Aktarma Eklentisi

# Name
source: Skrooge import XHB plugin
tr: Varyemez XHB İçe Aktarma Eklentisi

# Name
source: Skrooge import XML plugin
tr: Varyemez XML İçe Aktarma Eklentisi

# Name
source: Skrooge
tr: Varyemez

# Name
source: Skrooge bank plugin
tr: Varyemez Banka Eklentisi

# Name
source: Skrooge budget plugin
tr: Varyemez Bütçe Eklentisi

# Name
source: Skrooge calculator plugin
tr: Varyemez Hesap Makinesi Eklentisi

# Name
source: Skrooge categories plugin
tr: Varyemez Kategoriler Eklentisi

# Name
source: Skrooge import and export plugin
tr: Varyemez İçe/Dışa Aktarma Eklentisi

# Name
source: Skrooge operation plugin
tr: Varyemez İşlem Eklentisi

# Name
source: Skrooge payee plugin
tr: Varyemez Alacaklı Eklentisi

# Name
source: Skrooge report plugin
tr: Varyemez Rapor Eklentisi

# Name
source: Skrooge scheduled plugin
tr: Varyemez Planlama Eklentisi

# Name
source: Skrooge search plugin
tr: Varyemez Arama Eklentisi

# Name
source: Skrooge tracker plugin
tr: Varyemez İzleyici Eklentisi

# Name
source: Skrooge unit plugin
tr: Varyemez Birim Eklentisi

# Description
source: A plugin to advise
tr: Tavsiye için eklenti

# Description
source: A plugin for bookmarks
tr: Yer imleri için bir eklenti

# Description
source: Display a summary of your information
tr: Bilgilerinizin bir özetini görüntüleyin

# Description
source: A plugin helping debug
tr: Hata ayıklamaya yardımcı bir eklenti

# Description
source: A plugin for delete
tr: Silme için bir eklenti

# Description
source: A plugin for file transactions
tr: Dosya işlemleri için bir eklenti

# Description
source: A plugin to highlight objects
tr: Nesneleri vurgulamak için bir eklenti

# Description
source: A monthly report plugin.
tr: Aylık rapor eklentisi.

# Description
source: A plugin to print pages
tr: Sayfaları yazdırmak için bir eklenti

# Description
source: A plugin to manage properties on objects
tr: Nesnelerin özelliklerini yönetmek için bir eklenti

# Description
source: A plugin to select all
tr: Tümünü seçmek için bir eklenti

# Description
source: A plugin to generate statistic
tr: İstatistik oluşturmak için bir eklenti

# Description
source: A plugin for undo and redo transactions
tr: İşlemleri geri almak ve tekrarlamak için bir eklenti

# Description
source: A Skrooge plugin to import AFB120 files
tr: AFB120 dosyaları içe aktarmak için bir Varyemez eklentisi

# Description
source: An import backend for Skrooge using AqBanking. You must install AqBanking (aqbanking-cli) and setup all accounts manually before using this backend. At least AqBanking version 5.6.10 or later is required. This backend starts an AqBanking user-interactive session in the default terminal emulator. If you experience issues please switch to the "xterm" terminal emulator by setting the parameters to: aqbanking(--terminal-emulator '"xterm -e"') [Note: The single and double quotes are important!] For a list of all parameters please run "skrooge-sabb.py bulkdownload --help".
tr: AqBanking kullanan, Varyemez için önemli bir arka uç. Bu arka ucu kullanmadan önce AqBanking (aqbanking-cli) paketini kurmalı ve tüm hesapları elle ayarlamalısınız. En azından AqBanking 5.6.10 veya sonrası bir sürüm gereklidir. Bu arka uç, öntanımlı uçbirim öykünücüsünde kullanıcı etkileşimli bir oturum başlatır. Eğer sorunlar yaşarsanız “xterm” uçbirim öykünücüsüne parametreleri şu şekilde değiştirerek geçebilirsiniz: aqbanking(--terminal-emulator '"xterm -e"') [Not: Tek ve çift tırnaklar önemlidir!] Tüm parametrelerin bir listesi için “skrooge-sabb.py bulkdownload --help” yazın.

# Description
source: An import backend for Skrooge using weboob for coming operation. This plugin can be used for card with deferred debit. You must install weboob and configure correctly the boobank module before using this backend. Parameter: The list of accounts to import separated by '|'. If you don't pass parameter then all accounts will be imported. Example: 123@ca|456@bp
tr: Geliş işlemi için weboob kullanan, Varyemez için önemli bir arka uç. Bu eklenti, ertelenmiş borç içeren kartlar için kullanılabilir. Bu arka ucu kullanmadan önce weboob’u kurmalı ve boobank modülünü düzgünce yapılandırmalısınız. Parametre: İçe aktarılacak hesaplar listesi “|” ile ayrılır. Parametre geçirmezseniz tüm hesaplar içe aktarılır. Örnek: 123@ca|456@bp

# Description
source: An import backend for Skrooge using weboob. You must install weboob and configure correctly the boobank module before using this backend. Parameters: 1-The list of accounts to import separated by '|'. If you don't pass parameter then all accounts will be imported. Example: 123@ca|456@bp 2-The first date of imported transactions in format YYYY-MM-DD. Example: 2017-09-25 Warning:If you want to specify this parameter, you have to specify the first one too but it could be blank. Example: ,2017-09-25
tr: weboob kullanan, Varyemez için önemli bir arka uç. Bu arka ucu kullanmadan önce weboob’u kurmalı ve boobank modülünü düzgünce yapılandırmalısınız. Parametreler: 1. İçe aktarılacak hesaplar listesi “|” ile ayrılır. Parametre geçirmezseniz tüm hesaplar içe aktarılır. Örnek: 123@ca|456@bp 2. YYYY-AA-GG biçiminde, içe aktarılan işlemlerin ilk tarihi. Örnek: 2024-09-25 Uyarı: Bu parametreyi belirtmek istiyorsanız ilk parametreyi de belirtmelisiniz; ancak boş bıraksanız da olur. Örnek: ,2024-09-25

# Description
source: An import backend for Skrooge using woob for coming operation. This plugin can be used for card with deferred debit. You must install woob and configure correctly the bank module before using this backend. Parameter: The list of accounts to import separated by '|'. If you don't pass parameter then all accounts will be imported. Example: 123@ca|456@bp
tr: Geliş işlemi için weboob kullanan, Varyemez için önemli bir arka uç. Bu eklenti, ertelenmiş borç içeren kartlar için kullanılabilir. Bu arka ucu kullanmadan önce woob’u kurmalı ve banka modülünü düzgünce yapılandırmalısınız. Parametre: İçe aktarılacak hesaplar listesi “|” ile ayrılır. Parametre geçirmezseniz tüm hesaplar içe aktarılır. Örnek: 123@ca|456@bp

# Description
source: An import backend for Skrooge using woob. You must install woob and configure correctly the bank module before using this backend. Parameters: 1-The list of accounts to import separated by '|'. If you don't pass parameter then all accounts will be imported. Example: 123@ca|456@bp 2-The first date of imported transactions in format YYYY-MM-DD. Example: 2017-09-25 Warning:If you want to specify this parameter, you have to specify the first one too but it could be blank. Example: ,2017-09-25 3-The woob additional options (example: --nss)
tr: weboob kullanan, Varyemez için önemli bir arka uç. Bu arka ucu kullanmadan önce woob’u kurmalı ve banka modülünü düzgünce yapılandırmalısınız. Parametreler: 1. İçe aktarılacak hesaplar listesi “|” ile ayrılır. Parametre geçirmezseniz tüm hesaplar içe aktarılır. Örnek: 123@ca|456@bp 2. YYYY-AA-GG biçiminde, içe aktarılan işlemlerin ilk tarihi. Örnek: 2024-09-25 Uyarı: Bu parametreyi belirtmek istiyorsanız ilk parametreyi de belirtmelisiniz; ancak boş bıraksanız da olur. Örnek: ,2024-09-25 3. woob ek seçenekleri (örnek: --nss)

# Description
source: A Skrooge plugin to import files from backends
tr: Arka uçlardan dosyalar içe aktarmak için bir Varyemez eklentisi

# Description
source: A Skrooge plugin to import CSV files
tr: CSV dosyaları içe aktarmak için Varyemez eklentisi

# Description
source: A Skrooge plugin to import GNC files
tr: GNC dosyaları içe aktarmak için Varyemez eklentisi

# Description
source: A Skrooge plugin to import GSB files
tr: GSB dosyaları içe aktarmak için Varyemez eklentisi

# Description
source: A Skrooge plugin to import IIF files
tr: IIF dosyaları içe aktarmak için Varyemez eklentisi

# Description
source: A Skrooge plugin to import JSON files
tr: JSON dosyaları içe aktarmak için Varyemez eklentisi

# Description
source: A Skrooge plugin to import KMY files
tr: KMY dosyaları içe aktarmak için Varyemez eklentisi

# Description
source: A Skrooge plugin to import ledger files
tr: Ledger dosyaları içe aktarmak için Varyemez eklentisi

# Description
source: A Skrooge plugin to import MMB files
tr: MMB dosyaları içe aktarmak için Varyemez eklentisi

# Description
source: A Skrooge plugin to import Microsoft Money files
tr: Microsoft Money dosyaları içe aktarmak için bir Varyemez eklentisi

# Description
source: A Skrooge plugin to import MT940 files
tr: MT940 dosyaları içe aktarmak için Varyemez eklentisi

# Description
source: A Skrooge plugin to import OFX files
tr: OFX dosyaları içe aktarmak için Varyemez eklentisi

# Description
source: A Skrooge plugin to import PDF files
tr: PDF dosyaları içe aktarmak için Varyemez eklentisi

# Description
source: A Skrooge plugin to import QIF files
tr: QIF dosyaları içe aktarmak için Varyemez eklentisi

# Description
source: A Skrooge plugin to import SKG files
tr: SKG dosyaları içe aktarmak için Varyemez eklentisi

# Description
source: A Skrooge plugin to import XHB files
tr: XHB dosyaları içe aktarmak için Varyemez eklentisi

# Description
source: A Skrooge plugin to import XML files
tr: XML dosyaları içe aktarmak için Varyemez eklentisi

# Description
source: Add a new transaction in skrooge
tr: Varyemez'de yeni bir işlem ekle

# Description
source: A Skrooge banking assistant plugin.
tr: Bir Varyemez banka işlemleri eklentisi.

# Description
source: A skrooge plugin to manage budgets
tr: Bütçe yönetimi için bir Varyemez eklentisi

# Description
source: A skrooge plugin to calculate
tr: Hesaplama işlemleri için bir Varyemez eklentisi

# Description
source: A skrooge plugin to manage categories
tr: Kategori yönetimi için bir Varyemez eklentisi

# Description
source: A skrooge plugin for import and export transactions
tr: İçe ve dışa aktarma işlemleri için bir Varyemez eklentisi

# Description
source: A skrooge plugin to manage transactions
tr: İşlemleri yönetmek için bir Varyemez eklentisi

# Description
source: A skrooge plugin to follow payee
tr: Alacaklıları takip etmek için bir Varyemez eklentisi

# Description
source: A skrooge plugin to manage reports
tr: Raporları yönetmek için bir Varyemez eklentisi

# Description
source: A skrooge plugin to manage scheduled transactions
tr: Zamanlanmış işlemleri yönetmek için bir Varyemez eklentisi

# Description
source: A skrooge plugin to search and treat transactions
tr: İşlemleri aramak ve ele almak için bir Varyemez eklentisi

# Description
source: A skrooge plugin to follow refund
tr: Geri iadeleri takip etmek için bir Varyemez eklentisi

# Description
source: A skrooge plugin for unit management
tr: Birim yönetimi için bir Varyemez eklentisi

# Description
source: You can get the list of available quotes from <a href="https://boursorama.com/bourse/">Boursorama</a>.<br/>Then, enter the symbol of the expected quotes.
tr: Kullanılabilir kurların bir listesini <a href="https://boursorama.com/bourse/">Boursorama</a>’dan alabilirsiniz.<br/>Sonrasında istenen kurun sembolünü girin.

# Description
source: You can get the list of available quotes from <a href="https://coinmarketcap.com">CoinMarketCap</a>.<br/><br/>Then, you must create an account to get an API key and set it in setting.<br/>Then, enter the expected quote in expected currency. Example: if you want BTC in USD, you must enter BTC-USD.
tr: Kullanılabilir kurların bir listesini <a href="https://coinmarketcap.com">CoinMarketCap</a>’den alabilirsiniz.<br/><br/>Sonrasında bir API anahtarı almak için bir hesap oluşturmalı ve ayarlarda girmelisiniz.<br/>Ardından, istenen kuru beklenen para birimi ile girin. Örneğin, BTC’yi USD olarak istiyorsanız BTC-USD girmelisiniz.

# Description
source: You can get the list of available quotes from <a href="https://www.cryptocompare.com/">CryptoCompare</a>.<br/>Then, you must create an account to get an API key and set it in setting.<br/>Then, enter the <expected quote>-<in the expected currency>. Example: if you want BTC in USD, you must enter BTC-USD.
tr: Kullanılabilir kurların bir listesini <a href="https://www.cryptocompare.com/">CryptoCompare</a>’den alabilirsiniz.<br/><br/>Sonrasında bir API anahtarı almak için bir hesap oluşturmalı ve ayarlarda girmelisiniz.<br/>Ardından, istenen kuru beklenen para birimi ile girin. Örneğin, BTC’yi USD olarak istiyorsanız BTC-USD girmelisiniz.

# Description
source: [DEPRECATED: Prefer exchangerates_apilayer.com]. You can get the list of available quotes from <a href="https://exchangeratesapi.io/">exchangeratesapi.io</a>.<br/><br/>Then, you must create an account to get an API key and set it in setting.<br/>Then, enter the expected quote in expected currency. Example: if you want BTC in USD, you must enter BTC-USD.
tr: [KULLANILMIYOR: exchangerates_apilayer.com adresini tercih edin.] Kullanılabilir kurların bir listesini <a href="https://exchangeratesapi.io/">exchangeratesapi.io</a>’dan alabilirsiniz.<br/><br/>Sonrasında bir API anahtarı almak için bir hesap oluşturmalı ve ayarlarda girmelisiniz.<br/>Ardından, istenen kuru beklenen para birimi ile girin. Örneğin, BTC’yi USD olarak istiyorsanız BTC-USD girmelisiniz.

# Description
source: You can get the list of available quotes from <a href="https://exchangeratesapi.io/">exchangeratesapi.io</a>.<br/><br/>Then, you must create an account on <a href="https://apilayer.com">https://apilayer.com</a> to get an API key and set it in setting.<br/>Then, enter the expected quote in expected currency. Example: if you want BTC in USD, you must enter BTC-USD.
tr: Kullanılabilir kurların bir listesini <a href="https://exchangeratesapi.io/">exchangeratesapi.io</a>’dan alabilirsiniz.<br/><br/>Sonrasında bir API anahtarı almak için <a href="https://apilayer.com">https://apilayer.com</a> üzerinde bir hesap oluşturmalı ve ayarlarda girmelisiniz.<br/>Ardından, istenen kuru beklenen para birimi ile girin. Örneğin, BTC’yi USD olarak istiyorsanız BTC-USD girmelisiniz.

# Description
source: You can get the list of supported currencies from <a href="https://currencies.apps.grandtrunk.net/currencies">here</a>.<br/>Then, enter the expected currency.
tr: Desteklenen para birimlerinin bir listesini <a href="https://currencies.apps.grandtrunk.net/currencies">buradan</a> alabilirsiniz.<br/>Sonrasında, istenen para birimini girin.

# Description
source: You can find the list of available quotes <a href="https://skrooge.org/data">here</a>.<br/>Don't put the csv extension.<br/>In some case (eg. inflation), you will have to remove already downloaded values to download them again.
tr: Kullanılabilir kurların bir listesini <a href="https://skrooge.org/data">buradan</a> alabilirsiniz.<br/>CSV uzantısını koymayın.<br/>Bazı durumlarda (örneğin, enflasyon), indirilen değerleri yeniden indirmek için onları kaldırmanız gerekebilir.

# Description
source: You can get the list of available quotes from <a href="https://stooq.pl">Stooq</a>.<br/>Then, enter the symbol of the expected quotes.
tr: Kullanılabilir kurların bir listesini <a href="https://stooq.pl">Stooq</a>’dan alabilirsiniz.<br/>Sonrasında, istenen kurun sembolünü girin.
