Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/ark.po
Languages: tr

source: The &ark; Handbook
tr: &ark; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Applications 16.12
tr: Uygulamalar 16.12

source: &ark; is an archive manager by &kde;.
tr: &ark;, &kde; için bir arşiv yöneticisidir.

source: archive
tr: arşiv

source: compression
tr: sıkıştırma

source: Introduction
tr: Giriş

source: &ark; is a program for viewing, extracting, creating and modifying archives. &ark; can handle various archive formats such as <command>tar</command>, <command>gzip</command>, <command>bzip2</command>, <command>zip</command>, <command>rar</command>, <command>7zip</command>, <command>xz</command>, <command>rpm</command>, <command>cab</command>, <command>deb</command>, <command>xar</command> and <command>AppImage</command> (support for certain archive formats depends on the appropriate command-line programs being installed).
tr: &ark;, arşivleri görüntüleme, çıkarma, oluşturma ve düzenleme yapabilen bir programdır. &ark;, <command>tar</command>, <command>gzip</command>, <command>bzip2</command>, <command>zip</command>, <command>rar</command>, <command>7zip</command>, <command>xz</command>, <command>rpm</command>, <command>cab</command>, <command>deb</command>, <command>xar</command> ve <command>AppImage</command> gibi çeşitli dosya biçimlerini işleyebilir (bazı arşiv biçimleri için destek, kurulu olan uygun komut satırı programlarına bağlıdır).

source: &ark;'s main window
tr: &ark; ana penceresi

source: In order to successfully use &ark;, you need KDE Frameworks 5. The library libarchive version 3.1 or above is needed to handle most archive types, including tar, compressed tar, rpm, deb and cab archives. To handle other file formats, you need the appropriate command line programs, such as <command>zipinfo</command>, <command>zip</command>, <command>unzip</command>, <command>rar</command>, <command>unrar</command>, <command>7z</command>, <command>lsar</command>, <command>unar</command> and <command>lrzip</command>.
tr: &ark;’ı başarıyla kullanmak için KDE Framework 5’e gereksiniminiz vardır. libarchive kitaplığının 3.1 veya üzeri sürümü; tar, sıkıştırılmış tar, rpm, deb ve cab arşivleri de dahil olmak üzere çoğu arşiv türünü işlemek için gereklidir. Diğer dosya biçimlerini işlemek için uygun komut satırı programları gerekir; bunlar <command>zipinfo</command>, <command>zip</command>, <command>unzip</command>, <command>rar</command>, <command>unrar</command>, <command>7z</command>, <command>lsar</command>, <command>unar</command> ve <command>lrzip</command> programlarıdır.

source: Using &ark;
tr: &ark; Kullanımı

source: Opening Archives
tr: Arşivleri Açmak

source: To open an archive in &ark;, choose <guimenuitem>Open...</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo>) from the <guimenu>Archive</guimenu> menu. You can also open archive files by dragging and dropping from &dolphin;. Archive files should be associated with &ark;, so you can also <mousebutton>right</mousebutton> click a file in &dolphin; and select <guimenuitem>Open with &ark;</guimenuitem> to open it or select an extract action for this file.
tr: &ark; içinde bir arşivi açmak için <guimenuitem>Aç…</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo>) <guimenu>Arşiv</guimenu> menüsünü seçin. Ayrıca, &dolphin; içinden dosyaları sürükleyip bırakarak ta arşivi açabilirsiniz. Arşiv dosyaları &ark; ile ilişkilendirilmelidir, &dolphin;’de bir dosyayı tıklayıp açabilmeniz için <mousebutton>sağ</mousebutton> fare düğmesine tıklayıp <guimenuitem>&ark; ile Aç</guimenuitem> ögesini seçebilir veya bu dosya için bir çıkarma eylemi seçebilirsiniz.

source: If you have enabled the information panel in the <guimenu>Settings</guimenu> menu additional information about the selected folders or files in the archive is displayed.
tr: <guimenu>Ayarlar</guimenu> menüsünden bilgi panelini etkinleştirdiyseniz arşiv içinde seçili klasörler veya dosyalar hakkında ek bilgi görüntülenir.

source: Archive Operations
tr: Arşiv İşlemleri

source: Various operations can be performed for an opened archive by using the <guimenu>Archive</guimenu> menu. For example, you can save the archive with a different name using <guimenuitem>Save As...</guimenuitem>. Archive properties such as type, size and MD5 hash can be viewed using the <guimenuitem>Properties</guimenuitem> item.
tr: Açık bir arşiv için <guimenu>Arşiv</guimenu> menüsünü kullanarak çeşitli işlemler yapılabilir. Örneğin, arşivi <guimenuitem>Farklı Kaydet…</guimenuitem> kullanarak farklı bir adla kaydedebilirsiniz. Tür, boyut ve MD5 özeti gibi arşiv özellikleri, <guimenuitem> Özellikler</guimenuitem> ögesi kullanılarak görüntülenebilir.

source: &ark; has the ability to test archives for integrity. This functionality is currently available for <command>zip</command>, <command>rar</command> and <command>7z</command> archives. The test action can be found in the <guimenu>Archive</guimenu> menu.
tr: &ark; arşivleri bütünlük açısından sınama yeteneğine sahiptir. Bu işlev şu an <command>zip</command>, <command>rar</command> ve <command>7z</command> arşivleri için vardır. Sınama, <guimenu>Arşiv</guimenu> menüsünde bulunabilir.

source: Archive Comments
tr: Arşiv Açıklamaları

source: &ark; can handle comments embedded in <literal role="extension">zip</literal> and <literal role="extension">rar</literal> archives.
tr: &ark;, <literal role="extension">zip</literal> and <literal role="extension">rar</literal> arşivlerinde gömülü olan açıklamaları işleyebilir.

source: Comments embedded in <literal role="extension">zip</literal> archives are automatically displayed.
tr: <literal role="extension">zip</literal> içinde gömülü olan açıklamalar kendiliğinden görüntülenirler.

source: Using <literal role="extension">rar</literal> archives you can modify a comment with the actions <guimenuitem>Add Comment</guimenuitem> or <guimenuitem>Edit comment</guimenuitem> (<keycombo action="simul">&Alt;<keycap>C</keycap></keycombo>) from the <guimenu>Archive</guimenu> menu.
tr: <literal role="extension">rar</literal> arşivlerini, <guimenu>Arşiv</guimenu> menüsünden <guimenuitem>Açıklama Ekle</guimenuitem> veya <guimenuitem>Açıklamayı Düzenle</guimenuitem> (<keycombo action="simul">&Alt;<keycap>C</keycap></keycombo>) ögesine tıklayarak değiştirebilirsiniz.

source: Editing a comment
tr: Bir açıklamayı düzenlemek

source: The comment menu item is enabled only for <literal role="extension">rar</literal> archives.
tr: Yalnızca <literal role="extension">rar</literal> arşivleri için açıklama menü ögesi etkindir.

source: To remove a comment from a <literal role="extension">rar</literal> archive delete the text in the comment window.
tr: <literal role="extension">rar</literal> arşivinden bir açıklamayı kaldırmak için açıklama penceresindeki metni silin.

source: Working with Files
tr: Dosyalarla Çalışmak

source: Once an archive has been opened, you can perform various operations on the files inside the archive. By selecting a file and using the <guimenu>File</guimenu> menu, you can choose different operations to perform:
tr: Bir arşiv açıldıktan sonra, arşiv içindeki dosyalar üzerinde çeşitli işlemler gerçekleştirebilirsiniz. <guimenu>Dosya</guimenu> menüsünden bir dosya seçip gerçekleştirmek için farklı işlemler seçilebilir:

source: <guimenuitem>Preview</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo>) will open the file with &ark;'s internal viewer. This is a fast read-only viewer, but does not support all file types.
tr: <guimenuitem>Önizleme</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo>), &ark;’ın içsel görüntüleyicisiyle açılır. Bu hızlı bir saltokunur görüntüleyicidir; ancak tüm dosya türlerini desteklemez.

source: <guimenuitem>Open</guimenuitem> will open the file in the associated application for that file type.
tr: <guimenuitem>Aç</guimenuitem> ögesi, dosyayı o dosya türü için ilişkili uygulamada açar.

source: <guimenuitem>Open With...</guimenuitem> allows you to choose which application to open the file with.
tr: <guimenuitem>Birlikte Aç…</guimenuitem> ögesi, dosyayı açmak için kullanacağınız uygulamayı sizin seçmenize izin verir.

source: <guimenuitem>Rename</guimenuitem> (<keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo>) This action allows to change names of both files and folders. As in the Dolphin file manager, this action can be called via a shortcut and renaming is done via inline editing. There are also filename checks provided, which prevent usage of invalid characters such as <userinput>/</userinput>, <userinput>.</userinput> and <userinput>..</userinput> in filenames.
tr: <guimenuitem>Yeniden Adlandır</guimenuitem> (<keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo>) Bu eylem, her iki dosya ve klasörün adlarını değiştirmenize izin verir. Dolphin dosya yöneticisinde olduğu gibi, bu eylem kısayol yoluyla çağrılabilir ve yeniden adlandırma, satır içi düzenleme yoluyla yapılır. Ayrıca, dosya adlarında <userinput>/</userinput>, <userinput>.</userinput> ve <userinput>..</userinput> gibi geçersiz karakterlerin kullanılmasını önleyen dosya adı denetimleri de vardır.

source: <guimenuitem>Delete</guimenuitem> (<keycap>Del</keycap>) will remove the currently selected file(s) from the archive. Note that this action is undoable.
tr: <guimenuitem>Sil</guimenuitem> (<keycap>Sil</keycap>), seçili olan dosyaları arşivden kaldırır. Bu eylemin geri alınamaz olduğunu unutmayın.

source: <guimenuitem>Extract</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo>) opens a submenu with previously accessed folders, and you can choose to quickly extract into any of these or browse to a non-listed folder. See the next section for more details on extraction.
tr: <guimenuitem>Çıkar</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo>) önceden erişilen klasörleri içeren bir alt menü açar ve bunlardan herhangi birine tez eklemeyi veya listelenmemiş bir klasöre göz atmayı seçebilirsiniz. Çıkarma işlemi hakkında hakkında daha fazla bilgi için bir sonraki bölüme bakın.

source: <guimenuitem>Cut</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo>) / <guimenuitem>Copy</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo>) / <guimenuitem>Paste</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo>): As in typical file managers, moving, pasting and copying are provided. Users can move or copy files from different folders (which are expandable in the tree view) and paste them to the same destination at once. A folder can be copied into itself, but can not be moved. There are also checks for conflicting filenames: You won't be able to copy or move files into a folder that has entries with the same names - that could lead to data loss.
tr: <guimenuitem>Kes</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo>) / <guimenuitem>Kopyala</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo>) / <guimenuitem>Yapıştır</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo>): Tipik dosya yöneticilerinde olduğu gibi taşı, yapıştır ve kopyalama yapılabilir. Kullanıcılar dosyaları farklı klasörlerdeki (ağaç görünümünde genişletilebilir) taşıyabilir veya kopyalayabilir ve aynı anda aynı hedefe yapıştırabilirler. Bir klasör kendisine kopyalanabilir; ancak taşınamaz. Çakışan dosya adları için de denetimler bulunmaktadır: Dosyaları, aynı ada sahip girdileri olan ve veri kaybına neden olabilecek bir klasöre kopyalayamaz veya taşıyamazsınız.

source: <guimenuitem>Add Files</guimenuitem> (<keycombo action="simul">&Alt;<keycap>A</keycap></keycombo>) This action can be used to add files at any location within the archive. If you select a folder and use this action, files will be added to the selected folder. Otherwise, the new files will be added to the root of the archive.
tr: <guimenuitem>Dosyalar Ekle</guimenuitem> (<keycombo action="simul">&Alt;<keycap>A</keycap></keycombo>) Bu eylem, arşivin herhangi bir yerine dosyalar eklemek için kullanılabilir. Bir klasör seçip bu eylemi kullanırsanız dosyalar seçili klasöre eklenir. Aksi takdirde, yeni dosyalar arşivin kök dizinine eklenir.

source: Editing Files
tr: Dosyaları Düzenlemek

source: If you edit and save a file which you opened using <guimenuitem>Open</guimenuitem> or <guimenuitem>Open With...</guimenuitem>, Ark will ask you if you want to update the file in the archive. If you answer Yes, the archive will be updated with the saved file.
tr: <guimenuitem>Aç</guimenuitem> veya <guimenuitem>Birlikte Aç…</guimenuitem> kullanılarak açtığınız dosyaları düzenleyebilir ve kaydedebilirsiniz, Ark, arşivdeki dosyayı güncellemek isteyip istemediğinizi soracaktır. Evet yanıtı verirseniz, arşiv kaydedilen dosya ile güncellenecektir.

source: Extracting Files
tr: Dosyaları Çıkarmak

source: Once an archive has been opened in &ark;, it can be extracted. This can be done by selecting <guisubmenu>Extract</guisubmenu> from the <guimenu>File</guimenu> menu. This opens a submenu with previously accessed folders, and you can choose to quickly extract into any of these. Alternatively, select the submenu item <guisubmenu>Extract To...</guisubmenu> to open the <guilabel>Extract</guilabel> dialog, where you can set various options that affect the extraction. See below for information on the available options in the Extract dialog.
tr: &ark; içinde bir arşiv açıldığında, bu arşiv çıkarılabilir. Bu, <guimenu>Dosya</guimenu> menüsünden <guisubmenu> Çıkar</guisubmenu> seçeneği seçilerek yapılır. Daha önce erişilen klasörleri içeren bir alt menü açar ve bunlardan herhangi birine tez eklemeyi seçebilirsiniz. Alternatif olarak, çıkarmayı etkileyen çeşitli seçenekleri ayarlayabileceğiniz <guilabel>Çıkar</guilabel> iletişim penceresini açmak için <guisubmenu>Şuraya Çıkar…</guisubmenu> alt menü ögesini seçin. Çıkar iletişim penceresinde olan kullanılabilir seçenekler hakkında bilgi için aşağıya bir göz atın.

source: You can also use the <guibutton>Extract</guibutton> button in the toolbar to access the same extraction options.
tr: Aynı çıkarma seçeneklerine erişmek için araç çubuğundaki <guibutton>Çıkar</guibutton> düğmesini de kullanabilirsiniz.

source: To extract the entire archive, you can select <guisubmenu>Extract All</guisubmenu> from the <guimenu>Archive</guimenu> menu. This action unconditionally extracts all files in the archive.
tr: Tüm arşivi çıkarmak için <guimenu>Arşiv</guimenu> menüsündeki <guisubmenu>Tümünü Çıkar</guisubmenu> ögesini seçebilirsiniz. Bu eylem koşulsuz olarak arşivdeki tüm dosyaları çıkaracaktır.

source: It is possible to extract files and folders by simply dragging them with the mouse to a folder in &dolphin;.
tr: Dosyaları ve klasörleri fare ile &dolphin;’deki bir klasöre sürükleyerek çıkarmak olanaklıdır.

source: Note: Extracting files from an archive does not change the archive and its contents.
tr: Not: Dosyaları bir arşivden çıkarmak, arşivi ve içeriğini değiştirmez.

source: The Extract dialog
tr: Çıkar iletişim kutusu

source: The <guilabel>Extract</guilabel> dialog allows you to choose where the files will be extracted to. The default location is the folder the archive is in. The dialog can also be opened by pressing <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo>.
tr: <guilabel>Çıkar</guilabel> iletişim kutusu, dosyaların nereye çıkarılacağını seçmenize olanak sağlar. Öntanımlı konum, arşivin bulunduğu klasördür. Ayrıca, bu pencere <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> düğmesine basılarak da açılabilir.

source: &ark;'s Extract dialog
tr: &ark; Çıkar iletişim kutusu

source: You can specify to extract the files into a subfolder. The default name of this subfolder is the archive name without the filename extension, but you can edit it to your needs. If you want to preserve paths when extracting, select the <guilabel>Preserve paths when extracting</guilabel> option. You may also choose to open the destination folder in &dolphin; or close &ark; once the extraction is complete.
tr: Dosyaların bir alt klasöre çıkarılmasını belirtebilirsiniz. Bu alt klasörün öntanımlı adı, dosya adı uzantısı olmayan arşiv adıdır; ancak bunu gereksinimlerinize göre düzenleyebilirsiniz. Çıkarma sırasında yolları korumak istiyorsanız <guilabel>Çıkarırken dosya yollarını koru</guilabel> seçeneğini seçin. Hedef klasörü &dolphin;’de açmayı veya çıkarma işlemi tamamlandıktan sonra &ark;’ı kapatmayı da seçebilirsiniz.

source: If one or more files in the archive list are highlighted, you can also select which files to extract:
tr: Arşiv listesinde bir veya daha fazla dosya vurgulanmışsa hangi dosyaların çıkarılacağını da seçebilirsiniz:

source: <guilabel>Selected files only</guilabel> extracts only the files which have been selected.
tr: <guilabel>Yalnızca seçili dosyalar</guilabel> yalnızca seçili dosyaları çıkarır.

source: <guilabel>All files</guilabel> extracts the entire contents of the archive.
tr: <guilabel>Tüm dosyalar</guilabel> arşivin tüm içeriğini çıkarır.

source: Creating Archives and Adding Files
tr: Arşivler Oluşturmak ve Dosyalar Eklemek

source: To create a new archive in &ark;, choose <guimenuitem>New</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo>) from the <guimenu>Archive</guimenu> menu.
tr: &ark; ile yeni bir arşiv oluşturmak için <guimenu>Arşiv</guimenu> menüsünden <guimenuitem>Yeni</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo>) ögesini seçin.

source: Create an archive
tr: Bir arşiv oluştur

source: You can then type the name of the archive, with the appropriate extension (<literal role="extension">tar.gz</literal>, <literal role="extension">zip</literal>, <literal role="extension">7z</literal>, &etc;) or select a supported format in the <guilabel>Filter</guilabel> combo box and check the <guilabel>Automatically add <replaceable>filename extension</replaceable></guilabel> option.
tr: Arşiv adını, uygun bir uzantıyla (<literal role="extension">tar.gz</literal>, <literal role="extension">zip</literal>, <literal role="extension">7z</literal>, &etc;) birlikte yazabilir veya <guilabel>Süzgeç</guilabel> kutusundan ve <guilabel><replaceable>.uzantı</replaceable> uzantısını kendiliğinden ekle</guilabel> seçeneğiyle yapabilirsiniz.

source: To add files or folders to the new archive, choose <guimenuitem>Add Files...</guimenuitem> from the <guimenu>Archive</guimenu> menu.
tr: Yeni arşive dosya veya klasörler eklemek için <guimenu>Arşiv</guimenu> menüsünden <guimenuitem>Dosyalar Ekle…</guimenuitem> ögesini seçin.

source: An alternative way to add files to an archive is to drag one or more files from e.g. &dolphin; into the main &ark; window, and it will be added to the current archive. Note that files added in this way will always be added to the root directory of the archive.
tr: Dosyaları arşive eklemenin başka bir yolu ise bir veya daha çok dosyayı; örn, &dolphin; üzerinden &ark; ana penceresine sürüklemektir. Böyle eklenen dosyaların her zaman arşivin kök dizinine ekleneceğini unutmayın.

source: Additional options are presented in collapsible groups at the bottom of the dialog.
tr: Ek seçenekler iletişim kutusunun alt kısmında daraltılabilir gruplar halinde sunulur.

source: Compression
tr: Sıkıştırma

source: A higher value generates smaller archives, but results in longer compression and decompression times. The default compression level proposed by &ark; is usually a good compromise between size and (de)compression speed. For most formats the minimum compression level is equivalent to just storing the files, &ie; applying no compression.
tr: Daha yüksek bir değer daha küçük arşivler oluşturur; ancak daha uzun sıkıştırma ve açma süreleri ile sonuçlanır. &ark; tarafından önerilen öntanımlı sıkıştırma düzeyi; genellikle boyut ve sıkıştırma (açma) hızı arasında iyi bir uzlaşmadır. Çoğu biçim için minimum sıkıştırma düzeyi yalnızca dosyaların saklanmasına eşdeğerdir; &ie; hiçbir sıkıştırma uygulanmaz.

source: For <literal role="extension">rar</literal>, <literal role="extension">7z</literal> and <literal role="extension">zip</literal> archives you can select between different compression methods.
tr: <literal role="extension">rar</literal>, <literal role="extension">7z</literal> ve <literal role="extension">zip</literal> arşivleri için farklı sıkıştırma yöntemleri arasından seçim yapabilirsiniz.

source: Note that using compression methods other than the pre-selected defaults may limit compatibility with file archivers. For example, opening <literal role="extension">zip</literal> archives with compression methods other than <quote>Deflate</quote> requires newer archiving software.
tr: Önceden seçili öntanımlılar dışındaki sıkıştırma yöntemlerinin kullanılmasının dosya arşivleyicilerle uyumluluğu sınırlayabileceğini unutmayın. Örneğin, <literal role="extension">zip</literal> arşivlerini <quote>Deflate</quote> dışındaki sıkıştırma yöntemleriyle açmanız daha yeni arşivleme yazılımları gerektirir.

source: Password Protection
tr: Parola Koruması

source: If you create a <literal role="extension">zip</literal>, <literal role="extension">rar</literal>, <literal role="extension">7zip</literal> and <literal role="extension">jar</literal> archive you can protect it with a password. Currently, only the <literal role="extension">zip</literal> format supports multiple encryption methods. For other formats that support only one encryption method, the method is shown in the drop down box.
tr: Bir <literal role="extension">zip</literal>, <literal role="extension">rar</literal>, <literal role="extension">7zip</literal> ve <literal role="extension">jar</literal> arşivi oluşturduysanız bunu bir parola ile koruyabilirsiniz. Şu anda yalnızca <literal role="extension">zip</literal> biçimi çoklu şifrelemeyi desteklemektedir. Yalnızca bir şifreleme yöntemini destekleyen diğer biçimler için yöntem, açılır kutuda gösterilir.

source: Other encryption methods than the default <guilabel>ZipCrypto</guilabel> might not be supported by all file archivers.
tr: Öntanımlı <guilabel>ZipCrypto</guilabel> dışındaki diğer şifreleme yöntemleri tüm dosya arşivleyicileri tarafından desteklenmeyebilir.

source: Create a password protected archive
tr: Parola korumalı bir arşiv oluştur

source: Choose whether to require the password before showing the list of files. This is called header encryption and is available only with the <literal role="extension">rar</literal> and <literal role="extension">7zip</literal> formats. Header encryption is enabled by default (when available), in order to offer the maximum protection for novice users.
tr: Dosya listesini göstermeden önce şifre istenip istenmeyeceğini seçin. Buna üstbilgi şifrelemesi denir ve yalnızca <literal role="extension">rar</literal> ve <literal role="extension">7zip</literal> biçimleri tarafından desteklenir. Acemi kullanıcılara en yüksek korumayı sağlamak amacıyla üstbilgi şifrelemesi öntanımlı olarak etkindir (kullanılabilir olduğunda).

source: Multi-volume Archive
tr: Çok Parçalı Arşiv

source: With the <literal role="extension">zip</literal>, <literal role="extension">rar</literal> and <literal role="extension">7z</literal> formats you can create multi-volume archives, also known as multi-part or split archives.
tr: <literal role="extension">zip</literal>, <literal role="extension">rar</literal> ve <literal role="extension">7z</literal> biçimleriyle çok parçalı arşivler oluşturabilirsiniz. Bunlara çok kısımlı veya bölünmüş arşivler de denir.
