Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/ark.po
Languages: tr

source: A multi-volume archive is one big compressed archive split into several files. This feature is useful if the maximum file size is limited, &eg; by the capacity of a storage medium or the maximal size of an email with attachments.
tr: Çok parçalı bir arşiv, birkaç dosyaya bölünmüş büyük bir sıkıştırılmış arşivdir. Bu özellik, en büyük dosya boyutu sınırlıysa kullanışlıdır; örneğin, depolama ortamının sığasına veya ekleri olan bir e-postanın en büyük boyutuna göre.

source: To create a multi-volume archive, check the <guilabel>Create multi-volume archive</guilabel> checkbox and set a maximum <guilabel>Volume size</guilabel> in the dialog. Then add all files to the archive and &ark; will automatically generate the required number of archive volumes. Depending on the selected format the files have an extension with consecutively numbering scheme &eg; <filename>xxx.7z.001</filename>, <filename>xxx.7z.002</filename> or <filename>xxx.zip.001</filename>, <filename>xxx.zip.002</filename> or <filename>xxx.part1.rar</filename>, <filename>xxx.part2.rar</filename> &etc;.
tr: Çok parçalı bir arşiv oluşturmak için <guilabel>Çok parçalı arşiv oluştur</guilabel> onay kutusunu işaretleyin ve iletişim kutusunda en büyük <guilabel>Parça boyutu</guilabel>’nu ayarlayın. Sonrasında bütün dosyaları arşive ekleyin ve &ark; gereken arşiv parçası sayısını üretecektir. Seçilen biçime göre, dosyalar artan sıralı bir numaralandırma şemasına iye olabilir; örneğin, <filename>xxx.7z.001</filename>, <filename>xxx.7z.002</filename> veya <filename>xxx.zip.001</filename>, <filename>xxx.zip.002</filename> veya <filename>xxx.kısım1.rar</filename>, <filename>xxx.kısım2.rar</filename> gibi.

source: To extract a multi-volume archive, put all archive files into one folder and open the file with the lowest extension number in &ark; and all other parts of the split archive will be opened automatically.
tr: Çok parçalı bir arşivi çıkarmak için tüm arşiv dosyalarını tek bir klasöre koyun ve &ark; içindeki en düşük uzantı numarasına sahip dosyayı açın. Bölünmüş arşivin diğer tüm bölümleri kendiliğinden açılacaktır.

source: Using &ark; in the File Manager
tr: &ark;’ı Dosya Yöneticisinde Kullanmak

source: Clicking with the &RMB; on an archive in a file manager like &dolphin; displays a context menu with an item <guimenuitem>Extract</guimenuitem>. The menu has these additional items to extract an archive using &ark;:
tr: &dolphin; gibi bir dosya yöneticisinde bir arşive &RMB; ile tıklamak, <guimenuitem>Çıkar</guimenuitem> ögesini içeren bir bağlam menüsü açar. Menüde, arşivi &ark; ile açmak için bu ek ögeler bulunur:

source: <guimenuitem>Extract here</guimenuitem> creates a subfolder in the folder with the archive and extracts the folders and files into it. In case the archive contains only one file or folder, no subfolder will be created.
tr: <guimenuitem>Buraya Çıkar</guimenuitem>, arşivin bulunduğu klasörde bir alt klasör oluşturur ve klasörleri ve dosyaları bu klasöre çıkarır. Arşiv yalnızca bir dosya veya klasör içeriyorsa bir alt klasör oluşturulmaz.

source: <guimenuitem>Extract here and delete archive</guimenuitem> creates a subfolder in the folder with the archive, extracts the folders and files into it and deletes the archive.
tr: <guimenuitem>Buraya Çıkar ve Arşivi Sil</guimenuitem>, arşivin bulunduğu klasörde bir alt klasör oluşturur ve klasörleri ve dosyaları bu klasöre çıkarır ve arşivi siler.

source: <guimenuitem>Extract to…</guimenuitem> opens the Extract dialog where you can choose the destination folder and various extraction options.
tr: <guimenuitem>Şuraya Çıkar…</guimenuitem>, hedef klasörü ve çeşitli çıkarma seçeneklerini seçebileceğiniz Çıkar iletişim kutusunu açar.

source: &dolphin;'s context menu for a selection of files and/or folders displays these actions in the <guimenu>Compress</guimenu> submenu:
tr: &dolphin;’in çeşitli dosya ve/veya klasörlere ilişkin bağlam menüsü, <guimenu>Sıkıştır</guimenu> alt menüsünde şu eylemleri görüntüler:

source: <guimenuitem>Compress to "Archive.tar.gz"</guimenuitem> and <guimenuitem>Compress to "Archive.zip"</guimenuitem> creates these archive types in the current folder.
tr: <guimenuitem>"Arşiv.tar.gz" Olarak Sıkıştır</guimenuitem> ve <guimenuitem>"Arşiv.zip" Olarak Sıkıştır</guimenuitem>, bu arşiv türlerini geçerli klasörde oluşturur.

source: <guimenuitem>Compress to...</guimenuitem> opens a dialog where you can select folder, name and archive type.
tr: <guimenuitem>Şuraya Sıkıştır…</guimenuitem>, klasörü, adı ve arşiv türünü seçebileceğiniz bir iletişim kutusu açar.

source: Advanced Batch Mode
tr: Gelişmiş Toplu İş Kipi

source: &ark; has an advanced batch mode to manage archives without launching a graphical user interface. This mode allows you to extract or create archives and add files to them.
tr: &ark;, grafiksel kullanıcı arayüzünü başlatmadan arşivleri yönetmek için gelişmiş bir toplu iş kipine iyedir. Bu kip, arşiv çıkarmanıza veya oluşturmanıza ve bunlara dosya eklemenize olanak tanır.

source: The batch mode is documented in <ulink url="man:/ark">&ark;'s man page</ulink>.
tr: Toplu iş kipi, <ulink url="man:/ark">&ark; kılavuz sayfası</ulink> altında belgelendirilmiştir.

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: &ark; is Copyright &copy; 1997-2016, The &ark; Development Team.
tr: &ark; Telif hakkı &copy; 1997–2016, &ark; Geliştirme Takımı.

source: Authors:
tr: Yazarlar:

source: Corel Corporation (author: Emily Ezust) <email>emilye@corel.com</email>
tr: Corel Corporation (Yazar: Emily Ezust) <email>emilye@corel.com</email>

source: Corel Corporation (author: Michael Jarrett) <email>michaelj@corel.com</email>
tr: Corel Corporation (Yazar: Michael Jarrett) <email>michaelj@corel.com</email>

source: Documentation Copyright &copy; 2000 &Matt.Johnston; &Matt.Johnston.mail;
tr: Belgelendirme telif hakkı &copy; 2000 &Matt.Johnston; &Matt.Johnston.mail;

source: Documentation updated for &kde; 3.3 by &Henrique.Pinto; &Henrique.Pinto.mail;.
tr: Belgelendirme güncellemesi, &kde; 3.3 — &Henrique.Pinto; &Henrique.Pinto.mail;.

source: Documentation updated for KDE Applications 16.04 by &Ragnar.Thomsen; &Ragnar.Thomsen.mail;.
tr: Belgelendirme güncellemesi, KDE Uygulamalar 16.04 — &Ragnar.Thomsen; &Ragnar.Thomsen.mail;.

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Kaan Özdinçer <email>kaanozdincer@gmail.com</email></para> <para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
