Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/ark_man-ark.1.po
Languages: tr

source: &ark; User's Manual
tr: &ark; Kullanıcı Kılavuzu

source: <firstname>Lauri</firstname><surname>Watts</surname> <contrib>Initial version of &ark; man page in 2005.</contrib> <email>lauri@kde.org</email>
tr: <firstname>Lauri</firstname><surname>Watts</surname> <contrib>İlk &ark; kılavuz sayfası sürümü, 2005.</contrib> <email>lauri@kde.org</email>

source: <firstname>Raphael</firstname><surname>Kubo da Costa</surname> <contrib>Update of &ark; man page in 2009.</contrib> <email>rakuco@FreeBSD.org</email>
tr: <firstname>Raphael</firstname><surname>Kubo da Costa</surname> <contrib>&ark; kılavuz sayfası güncelleme, 2009.</contrib> <email>rakuco@FreeBSD.org</email>

source: <firstname>Ragnar</firstname><surname>Thomsen</surname> <contrib>Update of &ark; man page in 2015 and 2016.</contrib> <email>rthomsen6@gmail.com</email>
tr: <firstname>Ragnar</firstname><surname>Thomsen</surname> <contrib>&ark; kılavuz sayfası güncelleme, 2015 ve 2016.</contrib> <email>rthomsen6@gmail.com</email>

source: KDE Applications
tr: KDE Uygulamaları

source: &kde; archiving tool
tr: &kde; arşivleme aracı

source: <command>ark</command> <group choice="opt"><option>-b</option></group> <group choice="opt"><option>-a</option></group> <group choice="opt"><option>-e</option></group> <group choice="opt"><option>-O</option></group> <group choice="opt"><option>-c</option></group> <group choice="opt"><option>-f</option> <replaceable> suffix</replaceable></group> <group choice="opt"><option>-p</option></group> <group choice="opt"><option>-t</option> <replaceable> file</replaceable></group> <group choice="opt"><option>-d</option></group> <group choice="opt"><option>-m</option></group> <group choice="opt"><option>-o</option> <replaceable> directory</replaceable></group> <arg choice="opt">&kde-frameworks; Generic Options</arg> <arg choice="opt">&Qt; Generic Options</arg>
tr: <command>ark</command> <group choice="opt"><option>-b</option></group> <group choice="opt"><option>-a</option></group> <group choice="opt"><option>-e</option></group> <group choice="opt"><option>-O</option></group> <group choice="opt"><option>-c</option></group> <group choice="opt"><option>-f</option> <replaceable> sonek</replaceable></group> <group choice="opt"><option>-p</option></group> <group choice="opt"><option>-t</option> <replaceable> dosya</replaceable></group> <group choice="opt"><option>-d</option></group> <group choice="opt"><option>-m</option></group> <group choice="opt"><option>-o</option> <replaceable> dizin</replaceable></group> <arg choice="opt">&kde-frameworks; Genel Seçenekleri</arg> <arg choice="opt">&Qt; Genel Seçenekleri</arg>

source: Description
tr: Açıklama

source: &ark; is a program for managing various compressed file formats within &kde;. Archives can be viewed, extracted, created and modified with &ark;. The program can handle various formats such as <application>tar</application>, <application>gzip</application>, <application>bzip2</application>, <application>zip</application>, <application>rar</application> (when the appropriate libraries or command-line programs are installed).
tr: &ark;, &kde; için birçok farklı sıkıştırılmış dosya biçimi yönetimini yapan bir programdır. &ark; ile arşivler görüntülenebilir, çıkarılabilir, oluşturulabilir ve düzenlenebilir. Program, <application>tar</application>, <application>gzip</application>, <application>bzip2</application>, <application>zip</application>, <application>rar</application> gibi birçok farklı biçimi (uygun kitaplık veya komut satırı programları kuruluysa) desteklemektedir.

source: Operation modes
tr: İşlem kipleri

source: &ark; can be used either as a stand-alone &GUI; program as well as a command-line program in order to perform some specific tasks.
tr: &ark;, tek başına bir grafiksel program olarak kullanılabileceği gibi, bazı belirli görevleri gerçekleştirmek için bir komut satırı programı olarak da kullanılabilir.

source: If invoked without the -b (--batch) or -c (--add) options, &ark; is started as a normal &GUI; program.
tr: -b (--batch) veya -c (--add) seçenekleri olmadan çağrılırsa &ark;, normal bir grafiksel program olarak başlatılır.

source: When the -b (--batch) option is used, &ark; can be used to extract the contents of one or more files directly from the command-line, without launching its &GUI;.
tr: -b (--batch) seçeneği kullanıldığında &ark;, grafik arayüzünü başlatmadan bir veya daha çok dosyanın içeriğini doğrudan komut satırından çıkarmak için kullanılabilir.

source: When the -c (--add) option is used, &ark; prompts for files that should be added to a new archive or to an existing archive.
tr: -c (--add) seçeneği kullanıldığında &ark;, yeni veya var olan bir arşive eklenmesi gereken dosyaları ister.

source: Options
tr: Seçenekler

source: Show a dialog for specifying the options for a batch or add operation.
tr: Toplu iş veya ekleme işlemine ilişkin seçenekleri belirlemek için bir iletişim kutusu gösterin.

source: List supported &MIME; types.
tr: Desteklenen &MIME; türlerini listele.

source: -o, --destination <replaceable>directory</replaceable>
tr: -o, --destination <replaceable>dizin</replaceable>

source: Default the extraction directory to <replaceable>directory</replaceable>. If not passed, the current path is used.
tr: Çıkarma dizinini öntanımlı olarak <replaceable>dizin</replaceable>’e ayarla. Geçirilmezse geçerli yol kullanılır.

source: Options for adding files
tr: Dosyalar eklemek için seçenekler

source: Query the user for an archive filename and add specified files to it. Quit when finished.
tr: Kullanıcıyı bir arşiv dosya adı için sorgula ve belirtilen dosyaları buna ekle. İş bitince çıkılır.

source: -t, --add-to <replaceable>filename</replaceable>
tr: -t, --add-to <replaceable>dosyaadı</replaceable>

source: Add the specified files to <replaceable>filename</replaceable>. Create archive if it does not exist. Quit when finished.
tr: Belirtilen dosyaları <replaceable>dosyaadı</replaceable>’na ekle. Yoksa arşiv dosyası oluştur. İş bitince çıkılır.

source: Change the current directory to the first entry and add all other entries relative to this one.
tr: Geçerli dizini ilk girdiyle değiştir ve buna göre diğer tüm girdileri ekle.

source: -f, --autofilename <replaceable>suffix</replaceable>
tr: -f, --autofilename <replaceable>sonek</replaceable>

source: Automatically choose a filename, with the selected <replaceable>suffix</replaceable> (for example rar, tar.gz, zip or any other supported types).
tr: Bir <replaceable>sonek</replaceable> kullanarak kendiliğinden bir dosya adı seç (örneğin, rar, tar.gz, zip veya desteklenen diğer dosya türleri).

source: Options for batch extraction
tr: Toplu çıkarma işlemleri için seçenekler

source: Use the batch interface instead of the usual dialog. This option is implied if more than one url is specified.
tr: Her zamanki iletişim kutusu yerine toplu arabirimi kullan. Birden fazla URL belirtilmişse bu seçenek belirtilir.

source: The destination argument will be set to the path of the first file supplied.
tr: Hedef argümanı, sağlanan ilk dosyanın yoluna ayarlanacaktır.

source: Archive contents will be read, and if detected to not be a single folder archive, a subfolder by the name of the archive will be created.
tr: Arşiv içeriği okunur ve tek klasör arşivi olmadığı algılanırsa arşivin adına göre bir alt klasör oluşturulur.

source: Open the destination folder when the extraction is complete.
tr: Çıkarma işlemi tamamlandığında hedef klasörü aç.

source: See Also
tr: Ayrıca

source: More detailed user documentation is available from <ulink url="help:/ark">help:/ark</ulink> (either enter this &URL; into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>help:/ark</parameter></userinput>).
tr: Ayrıntılı kullanıcı belgelendirmesine <ulink url="help:/ark">help:/ark</ulink> bölümünden ulaşabilirsiniz (ya bu &URL;’yi &konqueror;’a girin ya da <userinput><command>khelpcenter</command> <parameter>help:/ark</parameter></userinput> komutunu çalıştırın).

source: Examples
tr: Örnekler

source: <command>ark</command> <option>--batch</option> <replaceable>archive.tar.bz2</replaceable>
tr: <command>ark</command> <option>--batch</option> <replaceable>arşiv.tar.bz2</replaceable>

source: Will extract <replaceable>archive.tar.bz2</replaceable> into the current directory without showing any &GUI;.
tr: <replaceable>arşiv.tar.bz2</replaceable> dosyasını, herhangi bir grafik arayüz göstermeden geçerli dizine çıkarır.

source: <command>ark</command> <option>-b</option> <option>-d</option> <replaceable>archive.tar.bz2</replaceable> <replaceable>archive2.zip</replaceable>
tr: <command>ark</command> <option>-b</option> <option>-d</option> <replaceable>arşiv.tar.bz2</replaceable> <replaceable>arşiv2.zip</replaceable>

source: Will first show an extraction options dialog and then extract both <replaceable>archive.tar.bz2</replaceable> and <replaceable>archive2.zip</replaceable> into the directory chosen in the dialog.
tr: Önce çıkarma seçenekleri iletişim kutusunu gösterip <replaceable>arşiv.tar.bz2</replaceable> ve <replaceable>arşiv2.zip</replaceable> dosyalarını iletişim kutusunda seçili dizine çıkarır.

source: <command>ark</command> <option>--add-to</option> <replaceable>my-archive.zip</replaceable> <replaceable>photo1.jpg</replaceable> <replaceable>text.txt</replaceable>
tr: <command>ark</command> <option>--add-to</option> <replaceable>arşivim.zip</replaceable> <replaceable>fotoğraf.jpg</replaceable> <replaceable>metin.txt</replaceable>

source: Will create <replaceable>my-archive.zip</replaceable> if does not exist and then add <replaceable>photo1.jpg</replaceable> and <replaceable>text.txt</replaceable> to it.
tr: Yoksa <replaceable>arşivim.zip</replaceable> dosyasını oluşturulur, ardından <replaceable>fotoğraf.jpg</replaceable> ve <replaceable>metin.txt</replaceable> dosyaları içine eklenir.

source: Maintainership
tr: Proje Yönetimi

source: &ark; is currently maintained by <emphasis role="bold">Elvis Angelaccio</emphasis> and <emphasis role="bold">Ragnar Thomsen</emphasis>.
tr: &ark; bakımı şu anda <emphasis role="bold">Elvis Angelaccio</emphasis> ve <emphasis role="bold">Ragnar Thomsen</emphasis> tarafından yapılmaktadır.
