Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/dolphin.po
Languages: tr

source: <guilabel>Expandable folders</guilabel> determines whether any folders that have subfolders are displayed in a tree view, where the sub items can be expanded by &LMB; clicking the <guiicon>&gt;</guiicon> icon and collapsed by clicking the <guiicon>v</guiicon> icon.
tr: <guilabel>Genişletilebilir klasörler</guilabel>, alt klasörlere sahip herhangi bir klasörün, ağaç görünümünde gösterilip gösterilmeyeceğine karar verir. Alt ögeleri &LMB; ile <guiicon>&gt;</guiicon> simgesine tıklayarak genişletebilir ve <guiicon>v</guiicon> simgesine tıklayarak küçültebilirsiniz.

source: <guilabel>Folder size</guilabel> allows defining the property to use for sorting folders by their size. It is possible to sort folders by number of items by choosing <guilabel>Show number of items</guilabel> or by the size of the contents by choosing <guilabel>Show size of contents</guilabel>. The recursion level can be limited, which can be useful to constrain unneeded iterations in deep folder structures or on slow file systems. It is also possible to disable displaying folder size by choosing <guilabel>Show no size</guilabel> (which might improve performance in rare cases, however impacts other features like sorting).
tr: <guilabel>Klasör boyutu</guilabel>, özelliği klasörleri boyutlarına göre sıralamak için tanımlamaya olanak tanır. Klasörleri, içlerindeki öge sayılarına göre sıralamak için <guilabel>Öge sayısını göster</guilabel>’i veya içeriğinin boyutuna göre sıralamak için <guilabel>İçeriğin boyutunu göster</guilabel>’i kullanın. Özyineleme düzeyi sınırlı olabilir; bu da derin klasör yapılarındaki gereksiz yinelemeleri veya yavaş dosya sistemlerinin yaratacağı kötü etkiyi sınırlamak için yararlıdır. <guilabel>Boyutu gösterme</guilabel> seçeneğini kullanarak klasör boyutunu görüntülemeyi devre dışı bırakabilirsiniz (bazı nadir görülen durumlarda başarımı artırır; ancak sıralama gibi özellikleri etkiler).

source: The <guilabel>Date style</guilabel> option can be used to configure the mode to display dates in &dolphin;. It is possible to choose between <guilabel>Relative</guilabel> (&eg;, <quote>Yesterday, 3:00pm</quote>) or <guilabel>Absolute</guilabel> (&eg;, <quote>2020-12-23 15:00</quote>).
tr: <guilabel>Tarih biçemi</guilabel> seçeneği, &dolphin;’de tarihleri gösterme biçimi kipini yapılandırmak için kullanılabilir. <guilabel>Göreceli</guilabel> (&eg;, <quote>Dün, 15:00</quote>) veya <guilabel>Mutlak</guilabel> (&eg;, <quote>2020-12-23 15:00) arasında seçim yapmak olanaklıdır.</quote>).

source: Navigation
tr: Dolaşım

source: This group contains settings which control how navigation in the folder structure and in archives works.
tr: Bu grup, klasör yapısında ve arşivlerde gezinmeyi denetleyen ayarları içerir.

source: Screenshot of the Navigation settings in &dolphin;'s preferences dialog
tr: &dolphin; tercihleri penceresindeki Dolaşım ayarlarının ekran görüntüsü

source: Navigation Settings.
tr: Dolaşım Ayarları.

source: Navigation Settings in &dolphin;'s Preferences Dialog.
tr: &dolphin; Tercihleri Penceresindeki Dolaşım Ayarları.

source: The option to open items with a single or double mouse click is a system wide setting and can be changed in the &systemsettings; in the <menuchoice><guimenu>Workspace</guimenu> <guimenuitem>General Behavior</guimenuitem></menuchoice> module.
tr: Ögeleri tek veya çift fare tıklamasıyla açma seçeneği sistem çapında bir ayardır ve &systemsettings; <menuchoice><guimenu>Çalışma Alanı Davranışı</guimenu><guimenuitem>Genel Davranış</guimenuitem></menuchoice> modülünden değiştirilebilir.

source: Archives will be opened inside &dolphin;, and not in an external application, if <guilabel>Open Archives as folder</guilabel> is enabled.
tr: <guilabel>Arşivleri klasör gibi aç</guilabel> etkinse arşivler, dış bir uygulama kullanmadan, &dolphin; içinde açılabilirler.

source: If <guilabel>Open folders during drag operations</guilabel> is enabled, dragging an item with the mouse and hovering over a folder with it for a short time will open that folder. This allows you to move or copy items quickly to folders which are several levels deeper in the folder hierarchy.
tr: <guilabel>Sürükleme işlemleri sırasında klasörleri aç</guilabel> etkinleştirilmişse fareyle bir ögeyi sürükleyip bir klasörün üzerine getirdikten sonra kısa bir süre beklemek o klasörü açar. Bu, ögeleri klasör hiyerarşisinde birkaç düzeyde daha derin olan klasörlere tez taşımanıza veya kopyalamanıza olanak tanır.

source: Services
tr: Hizmetler

source: This group offers a selection of services that can be shown in the <guisubmenu>Actions</guisubmenu> submenu of &dolphin;'s context menu which appears when clicking a file or folder with the &RMB;.
tr: Bu grup, &dolphin;’in &RMB; ile bir dosya veya klasöre tıklandığında görünen bağlam menüsünün <guisubmenu>Eylemler</guisubmenu> alt menüsünde gösterilebilen çeşitli hizmetler sunar.

source: Screenshot of the Services Menu settings in &dolphin;'s preferences dialog
tr: &dolphin;’in tercihler iletişim kutusundaki Hizmetler Menüsü ayarlarının ekran görüntüsü

source: Services Settings.
tr: Hizmetler Ayarları.

source: Services Settings in &dolphin;'s Preferences Dialog.
tr: &dolphin; Tercihleri Penceresindeki Hizmetler Ayarları.

source: Using the <guibutton>Download New Services</guibutton> you can fetch additional services for the context menu.
tr: <guibutton>Yeni Hizmetler İndir</guibutton> düğmesini kullanarak bağlam menüsü için ek hizmetler indirebilirsiniz.

source: If you have installed &dolphin;'s plugins for <guilabel>Bazaar</guilabel>, <guilabel>Mercurial</guilabel>, <guilabel>Git</guilabel> or <guilabel>Subversion</guilabel> from the kdesdk module these services are shown in the list. If these plugins are enabled and you enter a folder which is under version control, the version state (locally changed, up to date &etc;) is indicated by icons and you have additional entries in the context menu like commit, update, add, remove &etc;
tr: &dolphin;’in <guilabel>Bazaar</guilabel>, <guilabel>Mercurial</guilabel>, <guilabel>Git</guilabel> veya <guilabel>Subversion</guilabel> eklentilerini kdesdk modülünden kurduysanız bunlar hizmetler listesinde gösterilir. Bu eklentiler etkinleştirildiyse ve sürüm denetimi altındaki bir klasöre girerseniz sürüm durumu (yerel olarak değişti, güncel vb.) simgelerle gösterilir ve bağlam menüsünde işleme, güncelleme, ekleme, kaldırma gibi ek girdileriniz olur.

source: In the service list you can also choose if the <guimenuitem>Copy To</guimenuitem>, <guimenuitem>Move To</guimenuitem>, <guimenuitem>Add to Places</guimenuitem>, <guimenuitem>Sort By</guimenuitem>, <guimenuitem>View Mode</guimenuitem>, <guimenuitem>Open in New Tab</guimenuitem>, <guimenuitem>Open in New Window</guimenuitem>, <guimenuitem>Copy Location</guimenuitem>, and <guimenuitem>Duplicate Here</guimenuitem> commands are shown in the context menu.
tr: Hizmetler listesinde ayrıca <guimenuitem>Şuraya Kopyala</guimenuitem>, <guimenuitem>Şuraya Taşı</guimenuitem>, <guimenuitem>Yerlere Ekle</guimenuitem>, <guimenuitem>Şuna Göre Sırala</guimenuitem>, <guimenuitem>Görünüm Kipi</guimenuitem>, <guimenuitem>Yeni Sekmede Aç</guimenuitem>, <guimenuitem>Yeni Pencerede Aç</guimenuitem>, <guimenuitem>Konumu Kopyala</guimenuitem> ve <guimenuitem>Burada Çoğalt</guimenuitem> komutlarının bağlam menüsünde gösterilip gösterilmeyeceğini seçebilirsiniz.

source: &dolphin; has to be restarted to activate the changes for some of these settings.
tr: Bu ayarların etkinleştirilebilmesi için &dolphin;’in yeniden başlatılması gerekir.

source: Trash
tr: Çöp Kutusu

source: This group contains settings which control the behavior of the trash.
tr: Bu grup, çöp kutusunun davranışlarını denetleyen ayarları içerir.

source: Screenshot of the Trash settings in &dolphin;'s preferences dialog
tr: &dolphin;’in tercihler iletişim kutusundaki Çöp Kutusu ayarlarının ekran görüntüsü

source: Trash Settings.
tr: Çöp Kutusu Ayarları.

source: Trash Settings in &dolphin;'s Preferences Dialog.
tr: &dolphin;’in Tercihler iletişim kutusundaki Çöp Kutusu ayarları.

source: Files which are older than a configurable number of days can be deleted automatically.
tr: Ayarlanabilir bir gün sayısından daha eski olan dosyalar kendiliğinden silinebilir.

source: The size of the trash can be limited to a configurable percentage of the disk size. If this limit is reached, a warning can be issued, or the oldest or largest files can be deleted automatically.
tr: Çöp kutusunun boyutu, disk boyutunun yapılandırılabilir bir yüzdesi ile sınırlanabilir. Bu sınıra ulaşılırsa bir uyarı verir veya en eski veya en büyük dosyalar kendiliğinden silinebilir.

source: User Feedback
tr: Kullanıcı Geri Bildirimi

source: This group contains settings which control your contributing information on the &dolphin; usage to its developers.
tr: Bu grup, &dolphin; kullanımı hakkında hangi istatistiklerin geliştiricilere iletileceğini denetleyen ayarları içerir.

source: Screenshot of the User Feedback settings in &dolphin;'s preferences dialog
tr: &dolphin;’in tercihler iletişim kutusundaki Kullanıcı Geri Bildirimi ayarlarının ekran görüntüsü

source: User Feedback Settings.
tr: Kullanıcı Geri Bildirimi Ayarları.

source: User Feedback Settings in &dolphin;'s Preferences Dialog.
tr: &dolphin; Tercihleri Penceresindeki Kullanıcı Geri Bildirimi Ayarları.

source: You can contribute some feedback on &dolphin; if you wish. Use sliders to configure your level of participation.
tr: İsterseniz &dolphin; kullanımı hakkındaki geri bildirimlerinizi buradan iletebilirsiniz. Katılma düzeyinizi ayarlamak için sürgüleri kullanın.

source: Folder View Display Style
tr: Klasör Görünümü Gösterim Biçemi

source: The following settings control how the contents of a folder are displayed in the &dolphin; view, and are stored on a per-folder basis by default:
tr: Aşağıdaki ayarlar, bir klasörün içeriğinin &dolphin;’de nasıl görüntüleneceğini denetler ve öntanımlı olarak klasör bazında saklanır:

source: The view mode (Icons, Compact, Details)
tr: Görünüm kipi (Simgeler, Sıkışık, Ayrıntılar)

source: The sorting of items, which is determined by the sort order (ascending, descending) and the attribute (such as name, size,...) that the items are sorted by
tr: Ögelerin sıralandığı sıralama düzeni (artan, azalan) ve özniteliği (ad, boyut, … gibi) tarafından belirlenen ögelerin sıralaması

source: Sorting of folders and files &ndash; are folders shown first or not?
tr: Klasörlerin ve dosyaların sıralanması &ndash; klasörler önce gösteriliyor mu, gösterilmiyor mu?

source: Previews &ndash; are they shown instead of icons (based on the settings made in <link linkend="preferences-dialog-general-previews"><guilabel>Previews</guilabel> tab of &dolphin;'s General settings</link>) or not?
tr: Önizlemeler &mdash; simgelerin yerine mi gösteriliyorlar (&dolphin;’in <link linkend="preferences-dialog-general-previews"><guilabel>Önizlemeler</guilabel> sekmesindeki ayarlara göre</link>) yoksa gösterilmiyorlar mı?

source: Are items shown in groups in the views?
tr: Ögeler görünümlerde gruplar halinde mi gösteriliyor?

source: Are hidden files shown?
tr: Gizli dosyalar gösteriliyor mu?

source: What additional information (besides the name) is shown in the Icons or Details view?
tr: Simgeler veya Ayrıntılar görünümünde hangi ek bilgiler (adın yanı sıra) gösteriliyor?

source: The view display style can be configured in the <menuchoice><guimenu>View</guimenu></menuchoice> menu, some (such as the view mode) can also be changed using toolbar buttons.
tr: Görünüm özellikleri, <menuchoice><guimenu>Görünüm</guimenu></menuchoice> menüsünden yapılandırılabilir; bazı ayarlar ise (örn. görünüm kipi) araç çubuğu düğmelerinden erişilebilirdir.

source: The View Display Style dialog
tr: Görünüm Özellikleri iletişim kutusu

source: Screenshot of the View Display Style dialog
tr: Görünüm Özellikleri iletişim kutusunun ekran görüntüsü

source: The View Display Style dialog.
tr: Görünüm Özellikleri iletişim kutusu

source: The View Display Style Dialog.
tr: Görünüm Özellikleri iletişim kutusu.

source: The <guilabel>View Display Style</guilabel> dialog can be used to quickly modify the view display styles for many folders at once. This is done for the current folder, for the current folder including all subfolders, or even for all folders, depending on the choice made in the <guilabel>Apply to</guilabel> section.
tr: <guilabel>Görünüm Özellikleri</guilabel> iletişim kutusu, aynı anda birçok klasör için görünüm biçemlerini tez değiştirmek için kullanılabilir. Bu, <guilabel>Şuna uygula</guilabel> bölümünde yapılan seçime bağlı olarak geçerli klasör, tüm alt klasörler dahil geçerli klasör ve hatta tüm klasörler için yapılabilir.

source: If <guilabel>Use as default view settings</guilabel> is enabled, the chosen view properties will also be used for all folders which do not have customized view properties yet.
tr: <guilabel>Varsayılan görünüm ayarları olarak kullan</guilabel> etkinleştirilirse seçili görünüm özellikleri, henüz özelleştirilmiş görünüm özelliklerine sahip olmayan tüm klasörler için de kullanılacaktır.

source: Command Reference
tr: Komut Başvurusu

source: By default the menubar is not shown. All actions described here either can be accessed with toolbar buttons or with items in the menu of the <guibutton>Control</guibutton> toolbar button.
tr: Öntanımlı olarak menü çubuğu gösterilmez. Burada açıklanan tüm işlemlere araç çubuğu düğmeleriyle veya <guibutton>Denetim</guibutton> araç çubuğu düğmesinin menüsündeki ögelerle erişilebilir.

source: The Menubar in &dolphin;'s Main Window
tr: &dolphin;’in ana penceresindeki Menü Çubuğu

source: The File Menu
tr: Dosya Menüsü

source: <guimenu>File</guimenu> <guisubmenu>Create New</guisubmenu>
tr: <guimenu>Dosya</guimenu> <guisubmenu>Yeni Oluştur</guisubmenu>

source: Creates a new object (such as a folder or a text file) in the current folder.
tr: Geçerli klasörde yeni bir nesne (klasör veya metin dosyası gibi) oluşturur.

source: You will find an explanation of all available objects in &konqueror;'s handbook in the chapter <ulink url="help:/konqueror/making.html">Create New</ulink>.
tr: Kullanılabilir tüm nesnelerin açıklamasını &konqueror;’ın el kitabında <ulink url="help:/konqueror/making.html">Yeni Oluştur</ulink> bölümünde bulabilirsiniz.

source: It is possible to create your own <guisubmenu>Create New...</guisubmenu> submenu items. Use files from <ulink url="https://invent.kde.org/frameworks/kio/-/tree/master/src/new_file_templates">KIO source repository</ulink> as a reference and put the resulting <filename role="extension">.desktop</filename> file into the <filename role="directory">.local/share/templates</filename> in your home directory (the address can be determined using the <userinput>kf5-config --path templates</userinput> command in &konsole;), then restart &dolphin;.
tr: Kendi <guisubmenu>Yeni Oluştur…</guisubmenu> alt menü ögelerinizi oluşturmanız olanaklıdır. Başvuru olarak <ulink url="https://invent.kde.org/frameworks/kio/-/tree/master/src/new_file_templates">KIO kaynak deposu</ulink> dosyalarını kullanın ve sonuçta ortaya çıkan <filename role="extension">.desktop</filename> dosyasını ana dizininizdeki <filename role="directory">.local/share/templates</filename> içine kopyalayın (adres, &konsole;’de <userinput>kf5-config kullanılarak belirlenebilir) --path templates</userinput> kullanılarak belirlenebilir), ardından &dolphin;’i yeniden başlatın.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New Window</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Yeni Pencere</guimenuitem>

source: Opens a new &dolphin; window.
tr: Yeni bir &dolphin; penceresi açar.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New Tab</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Yeni Sekme</guimenuitem>

source: Opens a new tab.
tr: Yeni bir sekme açar.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Close Tab</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Sekmeyi Kapat</guimenuitem>

source: Closes the current tab.
tr: Geçerli sekmeyi kapatır.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>T</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Undo close tab</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>T</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Sekme Kapatmayı Geri Al</guimenuitem>

source: Reopens the last closed tab.
tr: Son kapatılan sekmeyi yeniden açar.

source: <shortcut> <keycombo action="simul"><keycap>F2</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Rename</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>F2</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Yeniden Adlandır</guimenuitem>

source: Renames one currently selected item inline. Opens the <link linkend="batch-rename">batch rename dialog</link> if several items are selected.
tr: Seçili bir ögeyi yerinde yeniden adlandırır. Birkaç öge seçiliyse <link linkend="batch-rename">toplu yeniden adlandırma penceresini</link> açar.

source: <shortcut> <keycombo action="simul"><keycap>Del</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Move to Trash</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>Sil</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Çöp Kutusuna Taşı</guimenuitem>

source: Moves the currently selected item(s) to the trash.
tr: Seçili ögeleri çöp kutusuna taşır.

source: <shortcut> <keycombo action="simul">&Shift;<keycap>Del</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Delete</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Shift;<keycap>Sil</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Sil</guimenuitem>

source: Permanently deletes the currently selected item(s). The items are not moved to the trash and cannot be restored.
tr: Seçili olan ögeleri kalıcı olarak siler. Ögeler çöp kutusuna taşınmaz ve geri yüklenemez.

source: <guimenu>File</guimenu> <guimenuitem>Show Target</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Hedefi Göster</guimenuitem>

source: This action highlights a link target in a new &dolphin; window.
tr: Bu eylem, yeni bir &dolphin; penceresi içinde bir bağlantı hedefini vurgular.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Duplicate Here</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Burada Çoğalt</guimenuitem>

source: Creates duplicates of selected items appending <replaceable> copy</replaceable> to the end of their names.
tr: Adlarının sonuna bir <replaceable> kopyası</replaceable> ekleyerek seçili ögelerin bir kopyasını oluşturur.

source: <shortcut> <keycombo action="simul">&Alt;<keycap>Return</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Properties</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;<keycap>Giriş</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Özellikler</guimenuitem>

source: Shows the properties dialog for the currently selected item(s).
tr: Seçili ögelerin özelliklerinin yer aldığı pencereyi gösterir.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Çık</guimenuitem>

source: Exits &dolphin;.
tr: &dolphin; uygulamasından çıkar.

source: The Edit Menu
tr: Düzen Menüsü

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Geri Al</guimenuitem>

source: Undoes the last action performed by &dolphin;.
tr: &dolphin; tarafından yapılan son işlemi geri alır.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Cut</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Kes</guimenuitem>

source: Cuts the currently selected item(s).
tr: O anda seçili olan ögeleri keser.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Kopyala</guimenuitem>

source: Copies the currently selected item(s).
tr: O anda seçili olan ögeleri kopyalar.

source: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste Clipboard Contents...</guimenuitem></menuchoice> or <menuchoice><guimenu>Edit</guimenu><guimenuitem>Paste one File</guimenuitem></menuchoice> or <menuchoice><guimenu>Edit</guimenu><guimenuitem>Paste one Folder</guimenuitem></menuchoice> or <menuchoice><guimenu>Edit</guimenu><guimenuitem>Paste x Items</guimenuitem> </menuchoice>
tr: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Pano İçeriğini Yapıştır…</guimenuitem></menuchoice> veya <menuchoice><guimenu>Düzen</guimenu><guimenuitem>Bir Dosya Yapıştır</guimenuitem></menuchoice> veya <menuchoice><guimenu>Düzen</guimenu><guimenuitem>Bir Klasör Yapıştır</guimenuitem></menuchoice> veya <menuchoice><guimenu>Düzen</guimenu><guimenuitem>X Ögeyi Yapıştır</guimenuitem> </menuchoice>

source: Pastes the currently copied/cut items to the current folder. If the clipboard does not contain files or folders, the clipboard contents (such as text or image data) will be pasted into a new file. The name of this file has to be entered in a dialog.
tr: Şu anda kopyalanan/kesilen ögeleri geçerli klasöre yapıştırır. Panoda dosya veya klasör yoksa pano içeriği (metin veya gönsel verisi gibi) yeni bir dosyaya yapıştırılır. Bu dosyanın adı bir iletişim kutusuna girilmelidir.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F5</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy to inactive split view</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F5</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Etkin Olmayan Bölünmüş Görünüme Kopyala</guimenuitem>

source: Copies the currently selected item(s) from the active split view to the inactive split view.
tr: Şu anda seçili olan ögeleri etkin bölünmüş görünümden etkin olmayan bölünmüş görünüme kopyalar.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F6</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Move to inactive split view</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F6</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Etkin Olmayan Bölünmüş Görünüme Taşı</guimenuitem>
