Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/dolphin.po
Languages: tr

source: The &dolphin; Handbook
tr: &dolphin; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Serdar</firstname><surname>Soytetir</surname><affiliation><address><email>tulliana@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit> <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit> <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: &dolphin; is the default file manager by &kde;, designed with usability as a primary focus.
tr: &dolphin;, &kde; için kullanışlılığa odaklanan, öntanımlı dosya yöneticisidir.

source: Filemanager
tr: Dosya Yöneticisi

source: file
tr: dosya

source: management
tr: yönetim

source: Introduction
tr: Giriş

source: &dolphin; is &plasma;'s default file manager. It aims to improve usability at the user interface level. &dolphin; focuses only on being a file manager whereas &konqueror;, which was &kde;'s default file manager in &kde; 3 and can still be used for file management, is a universal viewer for many file types.
tr: &dolphin;, &plasma;’nın öntanımlı dosya yöneticisidir ve kullanıcı arayüzünde kullanışlılığı geliştirmeyi amaçlar. &dolphin;, &kde; 3 sürümündeki &konqueror; gibi bir dosya yöneticisi olmaya odaklanmıştır. Konqueror, hâlâ bir dosya yöneticisi olarak ve birçok dosya türü için genel bir görüntüleyici olarak kullanılmaktadır.

source: This design approach allows the developers to concentrate on optimizing the user interface for the specific task of file management.
tr: Bu tasarım yaklaşımı, geliştiricilerin dosya yönetiminin özel görevi için kullanıcı arabirimini en iyi duruma getirmeye odaklanmalarına olanak tanır.

source: Please report any problems or feature requests to the &dolphin; author via the bug report dialog. This is accessible either from the <guibutton>Control</guibutton> button at the right of the toolbar in the default mode without menubar; or from <menuchoice><guimenu>Help</guimenu><guimenuitem>Report Bug...</guimenuitem></menuchoice> menu of the application, if the menubar is shown.
tr: Lütfen &dolphin; ile ilgili sorunları ve özellik isteklerinizi hata raporlama penceresini kullanarak gönderin. Bu pencereye, menü çubuğu bulunmayan öntanımlı kipte araç çubuğunun en sağında bulunan <guibutton>Denetle</guibutton> düğmesiyle veya etkinleştirilmiş durumdaki menü çubuğunda bulunan <menuchoice><guimenu>Yardım</guimenu><guimenuitem>Hata Bildir…</guimenuitem></menuchoice> ögesinden erişilebilir.

source: Using &dolphin;
tr: &dolphin; Kullanımı

source: &dolphin; User Interface
tr: &dolphin; Kullanıcı Arayüzü

source: The screenshot below shows &dolphin;'s default user interface:
tr: Aşağıdaki ekran görüntüleri, &dolphin;’in öntanımlı görünümünü gösterir.

source: Screenshot of &dolphin;'s default user interface
tr: &dolphin;’in öntanımlı kullanıcı arayüzü

source: <phrase>&dolphin;'s default user interface.</phrase>
tr: <phrase>&dolphin;’in öntanımlı kullanıcı arayüzü.</phrase>

source: <para>&dolphin;'s default user interface.</para>
tr: <para>&dolphin;’in öntanımlı kullanıcı arayüzü.</para>

source: The elements of the default user interface are:
tr: Öntanımlı kullanıcı arayüzü ögeleri:

source: The toolbar, which can be used for quick access to frequently used actions. The toolbar can be customized by clicking it with the &RMB; and choosing <menuchoice><guimenuitem>Configure Toolbars...</guimenuitem></menuchoice> from the context menu, with <guimenuitem>Configure Toolbars...</guimenuitem> from the <guibutton>Control</guibutton> button at the right of the toolbar or via <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem></menuchoice> from the main menu.
tr: Araç çubuğu, sık kullanılan eylemlere tez erişim için kullanılır. Araç çubuğu, üzerinde &RMB; ile sağ tıklanarak ve bağlam menüsünden <menuchoice><guimenuitem>Araç Çubuklarını Yapılandır…</guimenuitem></menuchoice> seçeneğiyle, <guimenuitem>Araç Çubuklarını Yapılandır…</guimenuitem> (araç çubuğunun sağındaki <guibutton>Denetle</guibutton> üzerinden) ile veya ana menüden <menuchoice><guimenu>Ayarlar</guimenu> <guimenuitem>Araç Çubuklarını Yapılandır…</guimenuitem></menuchoice> ile özelleştirilebilir.

source: Screenshot of &dolphin;'s toolbar
tr: &dolphin;’in araç çubuğunun ekran görüntüsü

source: The default toolbar.
tr: Öntanımlı araç çubuğu.

source: Toolbar items where the icon is sufficient for knowing the command do not have text alongside the icons. This can be changed by a &RMB; click and selecting the item text below <guilabel>Show Text</guilabel>. The <guibutton>Control</guibutton> button at the right side of the toolbar is only displayed if the menubar is hidden.
tr: Araç çubuğu ögelerinden uygulayacakları komutu anlamaya yeterli bir simgeye sahip olanlarda simgelerin yanında metin bulunmaz. Bu, &RMB; ile tıklayıp <guilabel>Metni Göster</guilabel> ögesi seçilerek değiştirilebilir. Araç çubuğunun sağındaki <guibutton>Denetle</guibutton> düğmesi yalnızca menü çubuğu gizlenmiş ise gösterilir.

source: The location bar, which always displays the path to the current folder. It can be switched between two different modes, see the <link linkend="location-bar">section on the location bar</link> for details.
tr: Konum çubuğu her zaman geçerli klasörün adresini gösterir ve iki farklı kipte kullanılabilir, ayrıntılı bilgi için <link linkend="location-bar">konum çubuğu</link> bölümüne bakabilirsiniz.

source: The <link linkend="dolphin-view">view</link>, which shows all files and folders in the current folder.
tr: <link linkend="dolphin-view">Görünüm</link>, geçerli klasördeki tüm dosya ve klasörleri gösterir.

source: The <link linkend="places-panel"><guilabel>Places</guilabel> panel</link>, which provides quick access to bookmarked locations and disks or other media.
tr: <link linkend="places-panel"><guilabel>Yerler</guilabel> paneli</link>, yer imlerine eklenmiş konumlara, disklere ve diğer ortamlara tez erişim sağlar.

source: If desktop search and file indexing are enabled in the <guilabel>Desktop Search</guilabel> module in the &systemsettings; the panel provides <guilabel>Recent</guilabel> items and allows you to search for <guilabel>Documents</guilabel>, <guilabel>Images</guilabel>, <guilabel>Audio Files</guilabel> and <guilabel>Video</guilabel>.
tr: Masaüstü arama ve dosya indeksleme, &systemsettings;’nın <guilabel>Dosya Arama</guilabel> modülünde etkinleştirilmişse panel, <guilabel>Son Kullanılan</guilabel> ögeleri gösterir ve <guilabel>Belgeleri</guilabel>, <guilabel>Görselleri</guilabel>, <guilabel>Ses Dosyalarını</guilabel> ve <guilabel>Videoları</guilabel> aramanıza izin verir.

source: The status bar. It displays the name, size and type of the file which is currently hovered over with the mouse, or the number and size of the files which are selected. At the right, there is a zoom slider that allows you to adjust the size of the icons in the view.
tr: Durum çubuğu. Fare imlecinin o anda üzerinde olduğu dosyanın adını, boyutunu ve türünü veya seçili dosyaların sayısını ve boyutunu görüntüler. Sağda, görünümdeki simgelerin boyutunu ayarlamanıza olanak tanıyan bir yakınlaştırma sürgüsü vardır.

source: The menubar (hidden by default), which provides access to all commands and configuration options. See the <link linkend="commands-menubar">Command Reference</link> for a list of all menu commands. The menubar can be toggled with <guimenuitem>Show Menubar</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo>) from the <guimenu>Settings</guimenu> menu or the <guibutton>Control</guibutton> button.
tr: Menü çubuğu (öntanımlı olarak gizlidir), tüm komutlara ve yapılandırma seçeneklerine erişimi sağlar. Tüm menü komutları için <link linkend="commands-menubar">Komut Kılavuzu</link> bağlantısına bakabilirsiniz. Menü çubuğunun görünüp görünmeyeceğini <guimenu>Ayarlar</guimenu> menüsündeki <guimenuitem>Menü Çubuğunu Göster</guimenuitem> seçeneğinden, <guibutton>Denetle</guibutton> düğmesinden veya (<keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo>) kısayolu ile belirleyebilirsiniz.

source: If the menubar is hidden, all its actions are available from the <guibutton>Control</guibutton> button.
tr: Menü çubuğu gizliyse kullanılabilir tüm eylemleri <guibutton>Denetim</guibutton> düğmesiyle görebilirsiniz.

source: The additional <guilabel>Information</guilabel>, <guilabel>Folders</guilabel> and <guilabel>Terminal</guilabel> panels are hidden by default, for more information see <link linkend="panels"><guilabel>Panels</guilabel>.</link>
tr: Ek <guilabel>Bilgiler</guilabel>, <guilabel>Klasörler</guilabel> ve <guilabel>Uçbirim</guilabel> panelleri öntanımlı olarak gizlidir, daha fazla bilgi için <link linkend="panels"><guilabel>Paneller</guilabel> bölümüne göz atın.</link>

source: The &dolphin; View
tr: &dolphin; Görünümü

source: Using the View
tr: Görünümü Kullanmak

source: The view displays all files and folders in the current folder. These items can be accessed or manipulated in different ways:
tr: Görünüm, geçerli klasördeki tüm dosya ve klasörleri görüntüler. Bu ögelere farklı şekillerde erişilebilir veya değiştirilebilirler:

source: A file or folder can be opened by clicking it with the &LMB; (or double-clicking, if <guilabel>Open by double-clicking instead</guilabel> is enabled in the &systemsettings; in the <menuchoice><guimenu>Workspace</guimenu> <guimenuitem>General Behavior</guimenuitem></menuchoice> module).
tr: Bir dosya veya klasör, üzerine &LMB; ile tıklanarak açılabilir (veya &systemsettings;’nın <menuchoice><guimenu>Çalışma Alanı</guimenu> <guimenuitem>Genel Davranış</guimenuitem></menuchoice> modülünde <guilabel>Dosya veya klasörlere tıklamak onları seçer</guilabel> etkinleştirilmişse çift tıklanarak.

source: Clicking any item or the white area around the items with the &RMB; opens a context menu which provides access to many frequently used actions for the item or the current folder, respectively.
tr: Herhangi bir ögeye veya ögelerin çevresindeki beyaz alana &RMB; ile tıklamak, sırasıyla öge veya geçerli klasör için sıkça kullanılan birçok eyleme erişim sağlayan bir bağlam menüsü açar.

source: If the &LMB; is pressed on an item, but not immediately released, the item can be dragged and dropped in another folder in the current view or in another &dolphin; view (in another &dolphin; window or in the same window if the view is split, see below) to move or copy it or to create a symbolic link. Items can even be dropped in another application to open them in that application.
tr: &LMB;, bir öge üzerinde basılır; ancak hemen serbest bırakılmazsa öge geçerli görünümdeki başka bir klasöre taşımak veya kopyalamak veya sembolik bir bağlantı oluşturmak için sürüklenip bırakılabilir (başka bir &dolphin; penceresinde veya görünüm bölünmüşse aynı pencerede, aşağıya bakın). Ögeler, o uygulamada açılmaları için başka bir uygulamanın üzerine bile bırakılabilir.

source: &dolphin; remembers the history of visited folders. To navigate backward or forward in the history, the corresponding buttons in the toolbar can be used:
tr: &dolphin; ziyaret edilen klasörlerin geçmişini anımsar. Geçmişte ileri veya geri gitmek için araç çubuğundaki ilgili düğmeler kullanılabilir:

source: The Back and Forward buttons in the toolbar.
tr: Araç çubuğundaki Geri ve İleri düğmeleri.

source: The <guibutton>Back</guibutton> and <guibutton>Forward</guibutton> buttons in the toolbar can be used to navigate in the history.
tr: <guibutton>Geri</guibutton> ve <guibutton>İleri</guibutton> düğmeleri geçmişte dolaşmak için kullanılabilir.

source: If you click with the &MMB; the item in the history is opened in a new tab thus keeping the current tab with its content.
tr: &MMB; ile tıklarsanız geçmişteki öge yeni bir sekmede açılır; böylece geçerli sekmenizi içeriği ile birlikte tutmuş olursunuz.

source: &dolphin; View Appearance
tr: &dolphin; Görünüşü

source: The toolbar contains buttons to control the appearance of the view:
tr: Araç çubuğu, görünümün görünüşünü denetlemek için düğmeler içerir:

source: <phrase>The buttons in the toolbar which control the appearance of the view.</phrase>
tr: <phrase>Görünümün görünüşünü denetleyen araç çubuğundaki düğmeler.</phrase>

source: <para>The buttons in the toolbar which control the appearance of the view.</para>
tr: <para>Görünümün görünüşünü denetleyen araç çubuğundaki düğmeler.</para>

source: All the settings discussed below and other options concerning, &eg; the sorting of the files in the current folder, can also be modified in the <guimenu>View</guimenu> menu and in the <link linkend="view-properties-dialog">View Display Style dialog</link>. By default, these settings are remembered for each folder separately. This behavior can be changed in the <link linkend="preferences-dialog-general"><quote>General</quote></link> section of the settings.
tr: Aşağıda belirtilen tüm ayarlar ve geçerli klasördeki dosyaların sıralanması ile ilgili tüm seçenekler ayrıca <guimenu>Görünüm</guimenu> menüsünden ve <link linkend="view-properties-dialog">Görünüm Özellikleri iletişim kutusundan </link> değiştirilebilir. Öntanımlı olarak, bu ayarlar her bir klasör için ayrı ayrı anımsanırlar. Bu davranış, ayarların <link linkend="preferences-dialog-general"><quote>Genel</quote></link> bölümünden değiştirilebilir.

source: View Modes
tr: Görünüm Kipleri

source: The first three buttons in the above screenshot switch between &dolphin;'s view modes.
tr: Yukarıdaki ekran görüntüsünde bulunan ilk üç düğme &dolphin;’in görünüm kipini değiştirir.

source: In the <guibutton>Icons</guibutton> view, which is the default, files will be represented by an icon that visualizes the file type, and a folder icon will be shown for subfolders. The names of folders and files, and the items enabled in <menuchoice><guimenu>View</guimenu><guisubmenu>Additional Information</guisubmenu></menuchoice>, are displayed below the icons.
tr: Öntanımlı olan <guibutton>Simge</guibutton> görünümünde, dosyalar dosya türünü de görselleştiren bir simge ile, klasörler de alt klasörleri göstermek için klasör simgesiyle gösterilir. Klasör ve dosya adları ve <menuchoice><guimenu>Görünüm</guimenu><guisubmenu>Ek Bilgileri Göster</guisubmenu></menuchoice> ile etkinleştirilen ögeler, simgelerin altında gözükecektir.

source: The <guilabel>Compact</guilabel> view shows the folder contents as icons with the name beside it and the items enabled in <menuchoice><guimenu>View</guimenu><guisubmenu>Additional Information</guisubmenu></menuchoice> below the name. The items are grouped in columns similar to the <guilabel>Short View</guilabel> in the &kde; file dialog.
tr: <guilabel>Sıkışık</guilabel> görünüm, klasör içeriğini yanındaki adı ve <menuchoice><guimenu>Görünüm</guimenu><guisubmenu>Ek Bilgileri Göster</guisubmenu></menuchoice> içinde etkinleştirilen ögeleri simgeler olarak gösterir. Ögeler, &kde; dosya iletişim kutusundaki <guilabel>Kısa Görünüm</guilabel>’e benzer sütunlarda gruplanır.

source: In the <guibutton>Details</guibutton> view, the folder contents are displayed as a detailed list which contains the name, size and last modification time of each item. Additional columns can be added by clicking a column header with the &RMB;.
tr: <guibutton>Ayrıntılar</guibutton> görünümünde, klasör içerikleri ad, boyut ve son değiştirilme zamanını da içerecek şeklide oluşturulan ayrıntılı bir liste biçiminde gösterilir. Sütun başlığına &RMB; ile tıklanarak ek sütunlar eklenebilir.

source: In the context menu of the header line, you can add or remove side padding by checking or unchecking the respective menu item and choose between a custom or automatic column width. Automatic width adjusts the width of all columns once to display the longest item in the column completely, except for the <guilabel>Name</guilabel> column where the extension is replaced by <quote>...</quote>
tr: Başlık satırının bağlam menüsünde, ilgili menü ögesini işaretleyerek veya işaretini kaldırarak yan dolgu ekleyebilir veya kaldırabilir ve özel veya otomatik sütun genişliği arasında seçim yapabilirsiniz. Otomatik genişlik, uzantının <quote>…</quote> ile değiştirildiği <guilabel>Ad</guilabel> sütunu dışında, sütundaki en uzun ögeyi tamamen görüntülemek için tüm sütunların genişliğini bir kez ayarlar.

source: The order of columns can be changed by drag and drop of column headers, except for the <guilabel>Name</guilabel> header, which is always the first column in this view.
tr: Sütunların sırası, bu görünümde her zaman ilk sütun olan <guilabel>Ad</guilabel> başlığı dışında, sütun başlıklarını sürükleyip bırakarak değiştirilebilir.

source: The details view allows you to view the current folder in a tree-like fashion if <link linkend="preferences-dialog-viewmodes-details"> <guilabel>Expandable folders</guilabel></link> are enabled: Each subfolder of the current folder can be <quote>expanded</quote> or <quote>collapsed</quote> by clicking on the <guiicon>></guiicon> or <guiicon>v</guiicon> icon next to it.
tr: Eğer <link linkend="preferences-dialog-viewmodes-details"> <guilabel>Genişletilebilir klasörler</guilabel></link> seçeneği etkinleştirilmişse Ayrıntılar görünümü, geçerli klasör için ağaç görünümü sağlar: Geçerli klasörün her alt klasörü <guiicon>+</guiicon> veya <guiicon>-</guiicon> simgelerine tıklanarak <quote>genişletilebilir</quote> veya <quote>daraltılabilir</quote>.

source: <screeninfo>Grouped View</screeninfo>
tr: <screeninfo>Gruplandırılmış Görünüm</screeninfo>

source: <phrase>Grouped View</phrase>
tr: <phrase>Gruplandırılmış Görünüm</phrase>

source: All view modes support grouping by the sort type selected in <menuchoice><guimenu>View</guimenu><guisubmenu>Sort by</guisubmenu></menuchoice>
tr: Tüm görünüm kipleri, <menuchoice><guimenu>Görünüm</guimenu><guisubmenu>Şuna Göre Sırala</guisubmenu></menuchoice> menüsünde bulunan türe göre sıralayarak gruplandırma özelliğini destekler

source: Information in the View
tr: Görünümdeki Bilgiler

source: In all view modes &dolphin; shows at least an icon and a name for each item. Using <guisubmenu>Additional Information</guisubmenu> in the <guimenu>View</guimenu> menu or the context menu of the header in <guilabel>Details</guilabel> mode, you can select more information for each item to be shown:
tr: Tüm görünüm kiplerinde &dolphin;, her öge için en az bir simge ve bir ad gösterir.

source: <guimenuitem>Size</guimenuitem>, <guimenuitem>Date</guimenuitem>, <guimenuitem>Type</guimenuitem>, <guimenuitem>Rating</guimenuitem>, <guimenuitem>Tags</guimenuitem> or <guimenuitem>Comment</guimenuitem>.
tr: <guimenuitem>Boyut</guimenuitem>, <guimenuitem>Tarih</guimenuitem>, <guimenuitem>Tür</guimenuitem>, <guimenuitem>Derecelendirme</guimenuitem>, <guimenuitem>Künyeler</guimenuitem> veya <guimenuitem>Açıklama</guimenuitem>.

source: Depending on the file type, additionally, sorting criteria can be selected:
tr: Dosya türüne bağlı olarak ayrıca sıralama kriterleri seçilebilir:

source: <guimenuitem>Document</guimenuitem>: Number of words and lines
tr: <guimenuitem>Belge</guimenuitem>: Sözcüklerin ve satırların sayısı

source: <guimenuitem>Image</guimenuitem>: Size and orientation
tr: <guimenuitem>Görsel</guimenuitem>: Boyut ve yönelim

source: <guimenuitem>Audio</guimenuitem>: Artist, album, duration and track
tr: <guimenuitem>Ses</guimenuitem>: Sanatçı, albüm, süre ve parça

source: The <guisubmenu>Other</guisubmenu> submenu allows you to select <guimenuitem>Path</guimenuitem>, <guimenuitem>Link Destination</guimenuitem>, <guimenuitem>Copied From</guimenuitem>, <guimenuitem>Permissions</guimenuitem>, <guimenuitem>Owner</guimenuitem> or <guimenuitem>User Group</guimenuitem>.
tr: <guisubmenu>Diğer</guisubmenu> alt menüsü, size <guimenuitem>Yol</guimenuitem>,<guimenuitem>Bağlantı Hedefi</guimenuitem>,<guimenuitem>Kopyalanan Yer</guimenuitem>,<guimenuitem>İzinler</guimenuitem>,<guimenuitem>Sahibi</guimenuitem> veya <guimenuitem>Kullanıcı Grubu</guimenuitem> bilgilerini seçmenize izin verir.

source: Preview
tr: Önizleme

source: If <guibutton>Preview</guibutton> is enabled, the icons are based on the actual file or folder contents; &eg; for images a scaled down preview of the image is shown.
tr: Eğer <guibutton>Önizleme</guibutton> düğmesi etkinleştirilmişse simgeler dosya veya klasör simgeleri içeriğine göre gösterilir. Örneğin, görsel dosyaları için görselin yeniden boyutlandırılmış bir önizlemesi gösterilir.

source: Split
tr: Böl

source: If <guibutton>Split</guibutton> is clicked, two views are shown which can display the contents of different folders. This can be convenient for moving or copying files.
tr: Eğer <guibutton>Böl</guibutton> düğmesi tıklanmışsa farklı iki klasörün içeriğini gösteren iki görünüm oluşturulur. Bu görünüm, dosyaları kopyalamak veya taşımak için oldukça uygundur.

source: Selecting Items in the View
tr: Görünümdeki Ögeleri Seçmek

source: There are several ways to select items in the view. Once a group of items is selected, all actions, such as <menuchoice><guimenuitem>Cut</guimenuitem></menuchoice>, <menuchoice><guimenuitem>Copy</guimenuitem></menuchoice>, <menuchoice><guimenuitem>Move to Trash</guimenuitem></menuchoice>, and drag and drop operations, affect all selected items.
tr: Görünümdeki ögeleri seçmenin çeşitli yolları vardır. Bir grup öge seçildiğinde, <menuchoice><guimenuitem>Kes</guimenuitem></menuchoice>, <menuchoice><guimenuitem>Kopyala</guimenuitem></menuchoice>, <menuchoice><guimenuitem>Çöp Kutusuna Taşı</guimenuitem></menuchoice> ve sürükle bırak gibi tüm işlemler seçili ögelere uygulanır.

source: Selecting Items Using the Mouse
tr: Ögeleri Fare Kullanarak Seçmek

source: You can press the &LMB; somewhere in the view and draw a rectangle around a group of items before releasing the button. This will select all items in the rectangle and clear the previous selection. If the &Shift; key is pressed during the selection process, the previous selection is kept.
tr: Görünümde &LMB; ile bir yere basabilir ve düğmeyi bırakmadan önce bir grup öge etrafında bir dikdörtgen çizebilirsiniz. Bu, dikdörtgendeki tüm ögeleri seçer ve önceki seçimi siler. Seçme işlemi sırasında &Shift; düğmesine basılırsa önceki seçim tutulur.

source: If the &Ctrl; key is pressed while an item is clicked with the &LMB;, the selection state of this item is toggled. If the &Ctrl; key is pressed while a rectangle is drawn around a group of items as described above, the selection state of all items in the rectangle will be toggled.
tr: Bir ögeye &LMB; ile tıklarken, &Ctrl;’e basıldığında, bu ögenin seçim durumu değiştirilir. &Ctrl; düğmesine basılırken yukarıda açıklandığı gibi bir grup öge etrafında bir dikdörtgen çizilirse dikdörtgenin içindeki tüm ögelerin seçim durumu değiştirilir.

source: If the &Shift; key is pressed while an item is clicked with the &LMB;, all items between the previous current item and the clicked item will be selected.
tr: Bir ögeye &LMB; ile tıklanırken, &Shift; düğmesine basıldığında, önceki geçerli öge ile tıklanan öge arasındaki tüm ögeler seçilecektir.
