Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/dolphin.po
Languages: tr

source: If <guilabel>Show selection marker</guilabel> is enabled in the <link linkend="preferences-dialog-general-behavior"><quote>Behavior</quote> tab of the <guilabel>General</guilabel> section of the settings</link>, a small <guiicon>+</guiicon> or <guiicon>-</guiicon> button appears in the top left corner of the item which is currently hovered over with the mouse. Clicking this sign selects or deselects the item, respectively.
tr: <guilabel>Seçim işaretçisini göster</guilabel>, ayarların <guilabel>Genel</guilabel> bölümünün <link linkend="preferences-dialog-general-behavior"><quote>Davranış</quote> sekmesinde etkinleştirildiyse</link>, ögenin sol üst köşesine fareyle gelindiğinde küçük bir <guiicon>+</guiicon> veya <guiicon>-</guiicon> düğmesi görünür. Bu işarete tıklamak, sırasıyla ögeyi seçer veya seçimini kaldırır.

source: Selecting Items Using the Keyboard
tr: Ögeleri Klavye Kullanarak Seçmek

source: If an arrow key, <keycap>Page Up</keycap>, <keycap>Page Down</keycap>, <keycap>Home</keycap>, or <keycap>End</keycap> is pressed, the new current item is selected, and the previous selection is cleared.
tr: Bir ok düğmesine veya <keycap>Page Up</keycap>, <keycap>Page Down</keycap>, <keycap>Home</keycap> veya <keycap>End</keycap> düğmesine basılırsa yeni geçerli öge seçilir ve önceki seçim temizlenir.

source: If the &Ctrl; key is held while one of the above keys is pressed, the selection remains unchanged.
tr: &Ctrl; düğmesi basılı tutulurken yukarıdaki düğmelerden birine basılırsa seçim değişmeden kalır.

source: If the &Shift; key is held while one of the above keys is pressed, all items between the previous current item and the new current item will be selected.
tr: &Shift; düğmesi basılı tutulurken yukarıdaki düğmelerden birine basılırsa önceki geçerli öge ile yeni geçerli öge arasındaki tüm ögeler seçilir.

source: If <keycombo action="simul">&Ctrl;<keysym>Space</keysym></keycombo> is pressed, the selection state of the current item is toggled.
tr: <keycombo action="simul">&Ctrl;<keysym>Boşluk</keysym></keycombo> düğmelerine basılırsa geçerli ögenin seçim durumu değiştirilir.

source: <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> selects all items in the view.
tr: <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo>, görünümdeki tüm dosyaları seçer.

source: <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> toggles the selection state of all items in the view.
tr: <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> kısayolu, görünümdeki seçilmiş olan ögelerin seçimini kaldırıp seçili olmayan ögeleri seçer.

source: Select a file or folder by typing the first few letters of its name and the first matching item is selected. To clear the selection and cancel the keyboard search press &Esc; or wait longer than the timeout of 1 second.
tr: Adının ilk birkaç harfini yazarak bir dosya veya klasör seçin ve bunun sonucunda eşleşen ilk öge seçilir. Seçimi temizlemek ve klavye aramasını iptal etmek için &Esc;’e basın veya 1 saniyelik zaman aşımından daha uzun bir süre bekleyin.

source: Location Bar
tr: Konum Çubuğu

source: The location bar, which can be found above &dolphin;'s view, displays the path to the current folder. The location bar has two modes.
tr: Konum çubuğu, &dolphin; görünümünün üst kısmında bulunur ve geçerli klasörün adresini gösterir. Konum çubuğunun iki kipi vardır.

source: Bread Crumb Mode
tr: Kırıntı Kipi

source: In the <quote>bread crumb</quote> mode, which is the default, each folder name in the path to the current folder is a button which can be clicked to quickly open that folder. Moreover, clicking the <quote>&gt;</quote> sign to the right of a folder opens a menu which allows you to quickly open a subfolder of that folder.
tr: Öntanımlı olan <quote>kırıntı</quote> kipinde, geçerli klasörün yolundaki her bir klasör adı, o klasörü tez açmak için tıklanabilen bir düğmedir. Ayrıca, bir klasörün sağındaki <quote>&gt;</quote> işaretine tıklamak, o klasörün bir alt klasörünü tez açmanızı sağlayan bir menüyü açar.

source: Screenshot of the location bar in bread crumb mode
tr: Konum çubuğunun kırıntı kipindeki ekran görüntüsü

source: <phrase>Location bar in bread crumb mode.</phrase>
tr: <phrase>Kırıntı kipindeki konum çubuğunun ekran görüntüsü.</phrase>

source: <para>Location bar in bread crumb mode.</para>
tr: <para>Kırıntı kipindeki konum çubuğunun ekran görüntüsü.</para>

source: Editable Mode
tr: Düzenlenebilir Kip

source: When in bread crumb mode, clicking in the gray area to the right of the path with the &LMB; switches the location bar to <quote>editable</quote> mode, in which the path can be edited using the keyboard. To switch back to bread crumb mode, click the check mark at the right of the location bar with the &LMB;.
tr: Kırıntı kipindeyken, yolun sağ tarafındaki gri alana &LMB; ile tıklamak, konum çubuğunu <quote>düzenlenebilir</quote> kipe geçirir. Artık yolu klavye kullanarak düzenleyebilirsiniz. Yeniden kırıntı kipine geçmek isterseniz konum çubuğunun en sağındaki işaretleme simgesine &LMB; ile tıklayın.

source: Screenshot of the location bar in editable mode
tr: Konum çubuğunun düzenlenebilir kipteki ekran görüntüsü

source: <phrase>Location bar in editable mode.</phrase>
tr: <phrase>Konum çubuğunun düzenlenebilir kipteki ekran görüntüsü.</phrase>

source: <para>Location bar in editable mode.</para>
tr: <para>Konum çubuğunun düzenlenebilir kipteki ekran görüntüsü.</para>

source: Using Kioslaves
tr: Kioslaves’i Kullanma

source: If the location bar is empty in editable mode, a drop down box appears in front of the bar listing all available kioslaves on your system. Kioslaves are programs built into &kde; which add support for many different protocols to &dolphin; and other &kde; applications.
tr: Düzenlenebilir kipte konum çubuğu boşsa çubuğun önünde sisteminizdeki tüm kioslaves’leri listeleyen bir açılır kutu görünür. Kioslave’ler, &dolphin;’e ve diğer &kde; uygulamalarına pek çok farklı protokol için destek ekleyen, &kde;’ye yerleşik programlardır.

source: For example with the <quote>fish</quote> kioslave &dolphin; can be used to manage files and folders on a remote host that is accessible via <acronym>SSH</acronym>. To do this you would type <userinput>fish://username@remotehost</userinput> into the location bar. Similar remote file management can be done on remote hosts accessible via the &FTP;, &NFS;, SFTP, &SMB; (&CIFS;) or webdav protocols.
tr: Örneğin <quote>fish</quote> kioslave’i ile &dolphin;, <acronym>SSH</acronym> aracılığıyla erişilebilen uzak bir ana bilgisayardaki dosya ve klasörleri yönetmek için kullanılabilir. Bunu yapmak için konum çubuğuna <userinput>fish://kullanıcıadı@uzakmakine</userinput> yazarsınız. Benzer uzak dosya yönetimi; &FTP;, &NFS;, SFTP, &SMB; (&CIFS;) veya webdav protokolleri üzerinden erişilebilen uzak ana bilgisayarlarda yapılabilir.

source: It is also possible to use the kioslaves drop down box to access &systemsettings;, fonts, trash, other programs and devices attached to your computer. See the drop down box for the full list of capabilities available from kioslaves on your system.
tr: &systemsettings;’na, yazıtiplerine, çöp kutusuna, diğer programlara ve bilgisayarınıza bağlı aygıtlara erişmek için kioslave açılır kutusunu kullanmak da olanaklıdır. Sisteminizdeki kioslave’lerde bulunan yeteneklerin tam listesi için açılır kutuya bakın.

source: Screenshot of the list of kioslaves
tr: Kioslaves listesinin ekran görüntüsü

source: Location bar showing list of available kioslaves.
tr: Kullanılabilir kioslaves’lerin listesini gösteren konum çubuğu.

source: List of available kioslaves.
tr: Kullanılabilir kioslaves’lerin listesi.

source: Places and Context
tr: Yerler ve Bağlam

source: If the <guilabel>Places</guilabel> panel is hidden; in both modes an additional icon in front of the path is displayed. This icon can be clicked with the &LMB; to open a menu which offers quick access to <quote>places</quote> and storage media. See the <link linkend="places-panel">section about the Places Panel</link> for details.
tr: <guilabel>Yerler</guilabel> paneli gizliyse her iki kipte de yolun önünde ek bir simge görüntülenecektir. Bu simgeye, <quote>yerlere</quote> ve depolama ortamına tez erişim sağlayan bir menüyü açmak için &LMB; ile tıklanabilir. Ayrıntılar için <link linkend="places-panel">Yerler Paneli hakkındaki bölüme</link> göz atın.

source: <screeninfo>Location bar with Places icon</screeninfo>
tr: <screeninfo>Yerler simgesiyle birlikte Konum çubuğu</screeninfo>

source: <phrase>Location bar with Places icon</phrase>
tr: <phrase>Yerler simgesiyle birlikte Konum çubuğu</phrase>

source: The context menu of the location bar offers actions to switch between the modes and to copy and paste the path using the clipboard. Check the last option in this context menu to display either the full path starting with the root folder of the file system or to display the path starting with the current places entry.
tr: Konum çubuğunun bağlam menüsü, kipler arasında geçiş yapmak ve yolu panoyu kullanarak kopyalayıp yapıştırmak için eylemler sunar. Dosya sisteminin kök klasörden başlayarak tam yolu görüntülemek veya geçerli yer girişiyle başlayan yolu görüntülemek için bu bağlam menüsündeki son seçeneğe bakın.

source: <screeninfo>Location bar context menu</screeninfo>
tr: <screeninfo>Konum çubuğu bağlam menüsü</screeninfo>

source: <phrase>Location bar context menu</phrase>
tr: <phrase>Konum çubuğu bağlam menüsü</phrase>

source: Panels
tr: Paneller

source: &dolphin; allows a number of panels to be placed next to the view. These can be enabled in <menuchoice><guimenu>View</guimenu><guisubmenu>Show Panels</guisubmenu></menuchoice>. By unlocking the panels and clicking and dragging a panel title, the panel can be moved to a different position, even outside the window.
tr: &dolphin;, birkaç panelin görünümün yanında olmasına izin verir. Bunlar, <menuchoice><guimenu>Görünüm</guimenu><guisubmenu>Panelleri Göster</guisubmenu></menuchoice> içinden etkinleştirilebilir. Panellerin kilidini açarak ve bir panel başlığını sürükleyerek, panel pencere dışında farklı bir konuma taşınabilir.

source: Places
tr: Yerler

source: The <guilabel>Places</guilabel> panel is located at the left of the window by default. The <guilabel>Places</guilabel> panel shows any locations you have bookmarked. It also shows any disk or media attached to the computer, recently accessed items and allows you to search for certain type of files. The order of these entries can be changed by drag and drop.
tr: <guilabel>Yerler</guilabel> paneli, öntanımlı olarak pencerenin solunda konumlanır. <guilabel>Yerler</guilabel> paneli, yer imlerine eklediğiniz tüm yerleri gösterir. Ayrıca, bilgisayara bağlı herhangi bir disk veya ortam, yakın zamanda erişilen ögeleri de gösterir ve belirli türde dosyaları aramanıza izin verir. Bu girdilerin sırası sürükle ve bırak yöntemiyle değiştirilebilir.

source: The easiest way to add a folder to the <guilabel>Places</guilabel> panel is to drag it and drop it in the panel. Moreover, you can click inside the panel with the &RMB; and choose <menuchoice><guimenuitem>Add Entry...</guimenuitem></menuchoice> from the context menu. The first procedure creates a system wide bookmark, the second procedure can be used to add the current path of the location bar or any desired folder or device. A dialog opens where label, location and icon can be edited and the usage of this entry can be restricted to &dolphin;.
tr: <guilabel>Yerler</guilabel> paneline bir klasör eklemenin en kolay yolu, klasörü sürükleyip panelin üstüne bırakmaktır. Ayrıca, panele &RMB; ile tıklayıp bağlam menüsünden <menuchoice><guimenuitem>Girdi Ekle</guimenuitem></menuchoice> seçilebilir. İlk yöntem sistem genelinde yer imi oluşturur, ikinci yöntem ise yer çubuğunun geçerli yolunu veya herhangi bir istenen klasörü veya aygıtı eklemek için kullanılabilir. Etiket, yer ve simgenin düzenlenebildiği gibi bu girişin kullanımını &dolphin; ile sınırlandırılabilecek bir iletişim kutusu açılır.

source: A &RMB; click opens the context menu to edit, add, hide or remove entries and change the icon size to one of the predefined values or lock/unlock the panels.
tr: &RMB; ile girdileri düzenlemek, eklemek, gizlemek veya kaldırmak, simge boyutunu önceden tanımlanmış değerlerden birine değiştirmek için bağlam menüsünü tıklayın veya panelleri kilitleyin/kilidini açın.

source: The context menu has an action to open the entry in a new tab. Devices can be unmounted using the context menu.
tr: Bağlam menüsünde, girdiyi yeni bir sekmede açacak bir eylem vardır. Bağlam menüsü kullanılarak aygıtlar çıkarılabilir.

source: Information
tr: Bilgi

source: The <guilabel>Information</guilabel> panel shows extended information about the selected items(s) or about the current folder or the file which is currently hovered over with the mouse, including size, type, and date of last modification. It also features a large preview of the selected item and allows you to assign a rating, tags, and comments to it.
tr: <guilabel>Bilgiler</guilabel> paneli, seçilen ögelerle ilgili, geçerli klasör veya şu anda fareyle üzerine getirilen dosya hakkında, son değişikliklerin boyutu, türü ve tarihi içerilmek üzere genişletilmiş bilgileri gösterir. Ayrıca, seçilen ögenin büyük bir önizlemesine sahiptir ve ona bir derecelendirme, künye ve açıklama atamanıza olanak tanır.

source: Folders
tr: Klasörler

source: The <guilabel>Folders</guilabel> panel shows a tree view structure of the file system. It only shows folders. Clicking a folder with the &LMB; opens this folder in the &dolphin; view.
tr: <guilabel>Klasörler</guilabel> paneli, dosya sisteminin ağaç görünümü yapısını gösterir. Yalnızca klasörleri gösterir. &LMB; ile bir klasöre tıklayarak; bu klasörü &dolphin;’in görünümünde açar.

source: Use <guilabel>Limit to Home Directory</guilabel> to hide all folders from the tree view except your <guilabel>Home</guilabel>.
tr: <guilabel>Ana Dizine Sınırla</guilabel> seçeneğiyle, <guilabel>Ana Klasör</guilabel>’ünüz dışındaki tüm klasörleri, ağaç görünümünde gizleyebilirsiniz.

source: Terminal
tr: Uçbirim

source: This panel contains a terminal. The terminal will open at the folder currently shown in the &dolphin; view. Changing the folder in the active &dolphin; view will update the working folder of the terminal. Changing the directory in the terminal will update the working folder in the &dolphin; view. The terminal only works with local media.
tr: Bu panel bir uçbirim içerir. Uçbirim, şu anda &dolphin; içinde gösterilen klasörde açılacaktır. Etkin &dolphin; görünümündeki klasörü değiştirmek, uçbirimin çalışma klasörünü güncelleyecektir. Uçbirimdeki dizini değiştirmek, &dolphin; içindeki çalışma klasörünü de güncelleyecektir. Uçbirim yalnızca yerel ortamlar ile çalışır.

source: Quick Tips
tr: Tez İpuçları

source: The following are a number of tips to save time when using &dolphin;.
tr: &dolphin; kullanırken zamandan kazanmanızı sağlayacak birkaç ipucu.

source: Quick Bookmarking
tr: Tez Yer İmlerine Ekleme

source: To quickly create a bookmark in the <guilabel>Places</guilabel> panel for the current folder, &RMB; click in the work space and click <menuchoice><guimenuitem>Add to Places</guimenuitem></menuchoice> in the context menu.
tr: Geçerli klasör için <guilabel>Yerler</guilabel> panelinde tez yer imi oluşturmak için çalışma alanına &RMB; ile tıklayın ve içerik menüsünde <menuchoice><guimenuitem>Yerlere Ekle</guimenuitem></menuchoice> seçeneğine tıklayın.

source: The corresponding menu item visibility can be toggled via the <link linkend="preferences-dialog-context-menu">&dolphin; context menu settings</link>.
tr: Karşılık gelen menü ögesi görünürlüğü, <link linkend="preferences-dialog-context-menu">&dolphin; bağlam menüsü ayarlarından</link> açılıp kapatılabilir.

source: Filtering Files
tr: Dosyaları Süzme

source: &dolphin; is capable of filtering files, &ie; showing only those items in the view whose name contains a given text. For example, if you wish to show only the <acronym>MP3</acronym> files within a folder, you could filter for <quote>.mp3</quote>. This would then filter out all files whose name does not contain <quote>.mp3</quote>.
tr: &dolphin;, dosyaları süzebilir; örneğin, bir listede yalnızca adı verilen metinle eşleşen ögeleri gösterebilir. Başka bir örnekte, yalnızca bir klasördeki <acronym>MP3</acronym> dosyalarını göstermek istiyorsanız <quote>.mp3</quote> için süzebilirsiniz. Bu, adında <quote>.mp3</quote> olmayan tüm diğer dosyaları gizleyecektir.

source: To filter files, first enable the filter bar, either by pressing <keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo> or via the menu: <menuchoice> <guimenu>Edit</guimenu> <guimenuitem>Filter...</guimenuitem> </menuchoice>. You can then enter the text to be filtered for in the filter bar. The filter bar can be disabled either by pressing &Esc;, or with a &LMB; click on the <guiicon>Hide Filter Bar</guiicon> icon.
tr: Dosyaları süzmek için öncelikle <keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo> veya menüyü kullanarak süzgeç çubuğunu etkinleştirin: <menuchoice> <guimenu>Düzen</guimenu> <guimenuitem>Süz…</guimenuitem> </menuchoice>. Sonrasında süzülecek metni süzgeç çubuğuna girebilirsiniz. Süzgeç çubuğunu gizlemek için &Esc;’e basın veya <guiicon>Süzgeç Çubuğunu Gizle</guiicon> seçeneğine &LMB; ile tıklayın.

source: Finding Files and Searching in Files
tr: Dosyaları Bulma ve Dosyalar İçinde Arama

source: &dolphin; is capable of searching for files and for content in files. If <keycombo action="simul"> &Ctrl;<keycap>F</keycap></keycombo> is pressed or <menuchoice> <guimenu>Edit</guimenu> <guimenuitem>Search...</guimenuitem> </menuchoice> is used, the <guilabel>Search</guilabel> bar will open already set up to search for files within the current folder and any sub-folders. Start to type into the find input box and the search starts immediately.
tr: &dolphin;, dosyaları ve dosya içeriğini arama yeteneğine sahiptir. <keycombo action="simul"> &Ctrl;<keycap>F</keycap></keycombo> kısayoluna basıldığında veya <menuchoice> <guimenu>Düzen</guimenu> <guimenuitem>Ara…</guimenuitem> </menuchoice> seçeneği kullanıldığında, <guilabel>Arama</guilabel> çubuğu, geçerli klasörü ve onun alt klasörlerini aramak için ayarlı bir biçimde görünür. Giriş kutusuna yazmaya başladığınızda arama anında başlatılır.

source: <screeninfo>Search files and for content in files</screeninfo>
tr: <screeninfo>Dosyaları ve dosya içeriğini ara</screeninfo>

source: <phrase>Search files and for content in files</phrase>
tr: <phrase>Dosyaları ve dosya içeriğini ara</phrase>

source: &dolphin; searching files and for content in files.
tr: &dolphin;, dosyalarda ve dosya içeriğinde arama yapıyor.

source: The search is case insensitive, and does not require surrounding wildcards (<userinput>*foo*</userinput> and <userinput>foo</userinput> are equivalent), but you can use wildcards inside the search term. <userinput>*</userinput> will match zero or more characters, <userinput>?</userinput> only one single character.
tr: Arama BÜYÜK/küçük harf duyarlı değildir ve çevreleyen joker karakterlere gereksinim duymaz (<userinput>*foo*</userinput> ve <userinput>foo</userinput> aynı şeydir); ancak arama teriminin içinde joker karakterleri kullanabilirsiniz. <userinput>*</userinput> sıfır veya daha çok karakterle eşleşir, <userinput>?</userinput> yalnızca tek bir karakterle.

source: This feature can be used with running Baloo services; without these services a KIOSlave is launched to provide the search results.
tr: Bu özellik, çalışan Baloo hizmetleriyle birlikte kullanılabilir; bu hizmetler olmadan, arama sonuçlarını sağlamak için bir KIOSlave başlatılır.

source: The option from <guilabel>Everywhere</guilabel> with activated Baloo services searches in all indexed folders, without Baloo this option starts the search from the user's <replaceable>Home</replaceable> folder.
tr: Etkinleştirilmiş Baloo hizmetleriyle <guilabel>Her Yerde</guilabel> seçeneği tüm indekslenmiş klasörlerde arama yapar, Baloo olmadan bu seçenek aramayı kullanıcının <replaceable>Ana Klasör</replaceable>’ünden başlatır.

source: <screeninfo>Search with More Options</screeninfo>
tr: <screeninfo>Daha Fazla Seçenek ile Ara</screeninfo>

source: <phrase>Search with More Options</phrase>
tr: <phrase>Daha Fazla Seçenek ile Ara</phrase>

source: &dolphin; searching with More Options.
tr: Daha Fazla Seçenek ile &dolphin;’de arama

source: Use the <guilabel>More Options</guilabel> button to extend the <guilabel>Search</guilabel> bar. This provides a very comfortable way for the user to shrink the number of search results.
tr: <guilabel>Arama</guilabel> çubuğunu genişletmek için <guilabel>Diğer Seçenekler</guilabel> düğmesini kullanın. Bu, kullanıcının arama sonuçlarının sayısını küçültmesi için çok rahat bir yol sağlar.

source: To start a search select one or more file types (<guilabel>Documents</guilabel>, <guilabel>Audio</guilabel>, <guilabel>Video</guilabel>, <guilabel>Images</guilabel>), a time period, rating, and tag, if you have defined any via <userinput>tag:<replaceable>foo</replaceable></userinput> in the input box.
tr: Bir arama başlatmak için bir veya daha fazla dosya türü (<guilabel>Belgeler</guilabel>, <guilabel>Ses</guilabel>, <guilabel>Video</guilabel>, <guilabel>Görseller</guilabel>), bir zaman aralığı, derecelendirme ve eğer <userinput>tag:<replaceable>foo</replaceable></userinput> aracılığıyla giriş kutusunda herhangi bir etiket tanımladıysanız etiket seçin.

source: It is possible to clear selection using the <guibutton>Clear Selection</guibutton> button.
tr: <guibutton>Seçimi Temizle</guibutton> düğmesini kullanarak seçimi temizlemek olanaklıdır.

source: Alternatively you can use these options in the <guilabel>Places</guilabel> panel together with the <guilabel>Filter</guilabel> bar to find files using Baloo or limit the search to files matching the filter expression.
tr: Alternatif olarak, <guilabel>Yerler</guilabel> panelindeki bu seçenekleri Baloo kullanarak dosyaları bulmak için <guilabel>Süzgeç</guilabel> çubuğuyla birlikte kullanabilir veya aramayı süzgeç ifadesiyle eşleşen dosyalarla sınırlandırabilirsiniz.

source: Use the Save icon to save a search to the <guilabel>Search For</guilabel> section in the <guilabel>Places</guilabel> panel to quickly access it again in the future.
tr: Bir aramaya gelecekte yeniden tez erişmek üzere <guilabel>Yerler</guilabel> panelindeki <guilabel>Ara</guilabel> bölümüne kaydetmek için Kaydet simgesini kullanın.

source: Use the <guilabel>More Search Tools</guilabel> drop-down list to select other search tools than Baloo.
tr: Baloo dışındaki diğer arama araçlarını seçmek için <guilabel>Diğer Arama Araçları</guilabel> açılır listesini kullanın.

source: Mounting Storage Media
tr: Depolama Ortamı Bağlama

source: A quick way to mount Storage Media is to click on the device in the <guilabel>Places</guilabel> panel. This will mount and open the device in &dolphin;.
tr: Depolama ortamlarını tez bağlamanın yolu <guilabel>Yerler</guilabel> panelinde ögenin üzerine tıklamaktır. Bu eylem, aygıtı bağlar ve &dolphin; içinde açar.

source: Undo Actions
tr: Geri Al Eylemleri
