Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/dolphin.po
Languages: tr

source: Moves the currently selected item(s) from the active split view to the inactive split view. Is disabled if the current user does not have write permission on the selected item(s).
tr: Seçili ögeleri etkin bölünmüş görünümden etkin olmayan bölünmüş görünüme taşır. Geçerli kullanıcının seçilen öge(ler) üzerinde yazma izni yoksa devre dışı bırakılır.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Filter...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Süz…</guimenuitem>

source: <action>Enables and disables the <link linkend="filter-files">filter bar</link>.</action> You can also use the alternate shortcut <keycombo action="simul">&Shift;<keycap>/</keycap></keycombo> for this action.
tr: <action><link linkend="filter-files">Süzgeç çubuğunu</link> etkinleştirir/devre dışı bırakır.</action> Bu eylem için alternatif olarak <keycombo action="simul">&Shift;<keycap>/</keycap></keycombo> kısayolunu da kullanabilirsiniz.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Search...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Ara…</guimenuitem>

source: Opens the find bar. Enter a search term into the edit box and select to search for filename or in contents of files starting from the current folder or everywhere.
tr: Bul çubuğunu açar. Düzenleme kutusuna bir arama terimi girin ve dosya klasöründe, geçerli klasörden başlayarak veya her yerden dosya içeriğinde arama yapmak için simgesini seçin.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Select All</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Tümünü Seç</guimenuitem>

source: Selects all files and folders in the current folder.
tr: Geçerli klasördeki tüm dosya ve klasörleri seçer.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Invert Selection</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Seçimi Tersine Çevir</guimenuitem>

source: Selects all unselected items and deselects all selected items in the current folder.
tr: Seçili olmayan tüm ögeleri seçer ve geçerli klasördeki seçili ögelerin seçimini kaldırır.

source: The View Menu
tr: Görünüm Menüsü

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom In</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Yakınlaştır</guimenuitem>

source: Increases the size of icons in the view.
tr: Görünüm içerisindeki simgelerin boyutlarını büyütür.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom Out</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Uzaklaştır</guimenuitem>

source: Decreases the size of icons in the view.
tr: Görünüm içerisindeki simgelerin boyutlarını küçültür.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>0</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom Reset</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>0</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Yakınlaştırma Düzeyini Sıfırla</guimenuitem>

source: Resets the size of icons in the view to default.
tr: Görünümdeki simgelerin boyutunu öntanımlıya sıfırlar.

source: <guimenu>View</guimenu> <guisubmenu>View Mode</guisubmenu>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Görünüm Kipi</guisubmenu>

source: Changes the view mode to <guimenuitem>Icons</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>1</keycap></keycombo>), <guimenuitem>Compact</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo>) or <guimenuitem>Details</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>3</keycap></keycombo>).
tr: Görünüm kipini <guimenuitem>Simgeler</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>1</keycap></keycombo>), <guimenuitem>Sıkışık</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo>) veya <guimenuitem>Ayrıntılar</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>3</keycap></keycombo>) olarak değiştirir.

source: <guimenu>View</guimenu> <guisubmenu>Sort By</guisubmenu>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Şuna Göre Sırala</guisubmenu>

source: <action>Changes whether items are sorted</action> by <guimenuitem>Name</guimenuitem> or other criteria described in <link linkend="dolphin-view-information">Information in the View</link>.
tr: <action>Ögelerin</action> <link linkend="dolphin-view-information">Görünümdeki Bilgiler</link> içinde açıklanan <guimenuitem>Ad</guimenuitem> veya başka bir kritere göre sıralanıp sıralanmayacağını değiştirir.

source: <guimenuitem>Descending</guimenuitem> reverses the sort order. <guimenuitem>Folders First</guimenuitem> sorts folders before files.
tr: <guimenuitem>Azalan</guimenuitem>, sıralamayı ters çevirir. <guimenuitem>Önce Klasörler</guimenuitem> klasörleri, dosyalardan önce sıralar.

source: <guimenu>View</guimenu> <guisubmenu>Show Additional Information</guisubmenu>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Ek Bilgileri Göster</guisubmenu>

source: <action>Displays additional information</action> described in <link linkend="dolphin-view-information">Information in the View</link>.
tr: <link linkend="dolphin-view-information">Information in the View</link> bölümünde açıklanmış olan <action>ek bilgileri gösterir</action>.

source: <guimenu>View</guimenu> <guimenuitem>Show Previews</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Önizlemeleri Göster</guimenuitem>

source: <action>Displays a symbolic preview of the file contents </action> in the different view modes.
tr: Farklı görünüm kiplerinde dosya içeriğinin <action>sembolik bir önizlemesini görüntüler</action>.

source: <guimenu>View</guimenu> <guimenuitem>Show in Groups</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Gruplayarak Göster</guimenuitem>

source: <action>Displays</action> the content of the current folder grouped by the option selected in <guimenuitem>Sort By</guimenuitem>.
tr: Geçerli klasörün içeriğini <guimenuitem>Şuna Göre Sırala</guimenuitem> içinde seçilen seçeneğe göre gruplandırılmış olarak <action>görüntüler</action>.

source: <shortcut> <keycombo action="simul">&Alt;<keycap>.</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Show Hidden Files</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;<keycap>.</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Gizli Dosyaları Göster</guimenuitem>

source: <action>Shows all the hidden files and sub-folders within the current folder.</action>There is an alternate shortcut <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> for this action.
tr: <action>Geçerli klasördeki tüm gizli dosyaları ve alt klasörleri gösterir.</action>Bu eylem için alternatif olarak <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> kısayolunu da kullanabilirsiniz.

source: <shortcut> <keycombo action="simul"><keycap>F3</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Split</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>F3</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Böl</guimenuitem>

source: Enables and disables the split view mode.
tr: Bölünmüş görünüm kipini etkinleştirir/devre dışı bırakır.

source: <shortcut> <keycombo action="simul"><keycap>F5</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Reload</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>F5</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Yeniden Yükle</guimenuitem>

source: Reloads the current folder.
tr: Geçerli klasörü yeniden yükler.

source: <guimenu>View</guimenu> <guimenuitem>Stop</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Durdur</guimenuitem>

source: Stops loading/reading the contents of the current folder.
tr: Geçerli klasörün içeriğinin yüklenmesini/okunmasını durdurur.

source: <guimenu>View</guimenu> <guisubmenu>Show Panels</guisubmenu>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Panelleri Göster</guisubmenu>

source: <action>Enables and disables</action> the different <link linkend="panels">panels</link>: <guimenuitem>Places</guimenuitem> (<keycap>F9</keycap>), <guimenuitem>Information</guimenuitem> (<keycap>F11</keycap>), <guimenuitem>Folders</guimenuitem> (<keycap>F7</keycap>), <guimenuitem>Terminal</guimenuitem> (<keycap>F4</keycap>). With <guimenuitem>Lock Panels</guimenuitem> the panel header with caption and two buttons is hidden to save space and the panels are immutable, with <guimenuitem>Unlock Panels</guimenuitem> the header is visible and the panel can be moved to the right or left or even outside the main window.
tr: Değişik <link linkend="panels">panelleri</link> <action>etkinleştirir/devre dışı bırakır</action>: <guimenuitem>Yerler</guimenuitem> (<keycap>F9</keycap>), <guimenuitem>Bilgi</guimenuitem> (<keycap>F11</keycap>), <guimenuitem>Klasörler</guimenuitem> (<keycap>F7</keycap>), <guimenuitem>Uçbirim</guimenuitem> (<keycap>F4</keycap>). <guimenuitem>Panelleri Kilitle</guimenuitem> ile, panel başlığı, açıklaması ve iki adet düğme, yerden tasarruf etmek için gizlenir, <guimenuitem>Panellerin Kilidini Aç</guimenuitem> ile başlık görünür olur ve panel sağa, sola ve hatta ana pencerenin dışına taşınabilir.

source: <shortcut> <keycap>F6</keycap> </shortcut> <guimenu>View</guimenu> <guisubmenu>Location Bar</guisubmenu> <guimenuitem>Editable Location</guimenuitem>
tr: <shortcut> <keycap>F6</keycap> </shortcut> <guimenu>Görünüm</guimenu> <guisubmenu>Konum Çubuğu</guisubmenu> <guimenuitem>Düzenlenebilir Konum</guimenuitem>

source: Changes the location bar between the two modes; the <link linkend="location-bar-bread-crumb">bread crumb mode</link> and the <link linkend="location-bar-editable">editable mode</link>.
tr: Konum çubuğunu iki kip arasında değiştirir: <link linkend="location-bar-bread-crumb">kırıntı kipi</link> ve <link linkend="location-bar-editable">düzenlenebilir kip</link>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guisubmenu>Location Bar</guisubmenu> <guimenuitem>Replace Location</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guisubmenu>Konum Çubuğu</guisubmenu> <guimenuitem>Konumu Değiştir</guimenuitem>

source: Switches the location bar to <link linkend="location-bar-editable">editable mode</link>, if necessary, and selects the location such that it can be replaced quickly.
tr: Konum çubuğunu <link linkend="location-bar-editable">düzenlenebilir kipe</link> geçirir, gerekirse de yerinin tez değiştirilebilmesi için seçer.

source: <guimenu>View</guimenu> <guimenuitem>Adjust View Display Style...</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Görünüm Özelliklerini Ayarla…</guimenuitem>

source: Opens the <link linkend="view-properties-dialog">View Display Style Dialog</link>.
tr: <link linkend="view-properties-dialog">Görünüm Özellikleri iletişim kutusunu</link> açar.

source: The Go Menu
tr: Git Menüsü

source: <shortcut> <keycombo action="simul">&Alt;<keycap>Up</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Up</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;<keycap>Yukarı Ok Düğmesi</keycap></keycombo> </shortcut> <guimenu>Git</guimenu> <guimenuitem>Yukarı</guimenuitem>

source: Changes to the folder above the current folder.
tr: Geçerli klasörün bir üst klasörüne gider.

source: <shortcut> <keycombo action="simul">&Alt;<keycap>Left</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Back</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;<keycap>Sol Ok Düğmesi</keycap></keycombo> </shortcut> <guimenu>Git</guimenu> <guimenuitem>Geri</guimenuitem>

source: Changes to the previously viewed folder.
tr: Daha önce görüntülenen klasöre gider.

source: <shortcut> <keycombo action="simul">&Alt;<keycap>Right</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Forward</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;<keycap>Sağ Ok Düğmesi</keycap></keycombo> </shortcut> <guimenu>Git</guimenu> <guimenuitem>İleri</guimenuitem>

source: <action>Undoes</action> a <quote>Go Back</quote> action.
tr: <quote>Geri Git</quote> eylemini <action>geri alır</action>.

source: <shortcut> <keycombo action="simul">&Alt;<keycap>Home</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Home</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;<keycap>Home</keycap></keycombo> </shortcut> <guimenu>Git</guimenu> <guimenuitem>Başlangıç</guimenuitem>

source: Changes to the users home folder, &eg; /home/Peter/.
tr: Kullanıcının ana klasörüne geçer; örn. /home/Yamtar/

source: <guimenu>Go</guimenu> <guisubmenu>Recently Closed Tabs</guisubmenu>
tr: <guimenu>Git</guimenu> <guisubmenu>Son Kapatılan Sekmeler</guisubmenu>

source: Shows a list of recently closed tabs which can be reopened.
tr: Yeni kapatılan ve yeniden açılabilecek olan sekmeleri gösterir.

source: The Tools Menu
tr: Araçlar Menüsü

source: <shortcut> <keycombo action="simul">&Shift;<keycap>F4</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Open Terminal</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Shift;<keycap>F4</keycap></keycombo> </shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Uçbirim Aç</guimenuitem>

source: Opens &konsole; within the current folder.
tr: Geçerli klasör içinde &konsole; uygulamasını açar.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Open Preferred Search Tool</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Tercih Edilen Arama Aracını Aç</guimenuitem>

source: Opens preferred search tool in the current folder.
tr: Geçerli klasörde tercih edilen arama aracını açar.

source: <guimenu>Tools</guimenu> <guimenuitem>Compare Files</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Dosyaları Karşılaştır</guimenuitem>

source: Compare the currently selected files or folders with &kompare;. This action is only enabled if two files or folders are selected.
tr: Mevcut olarak seçilen dosyaları veya klasörleri &kompare; ile karşılaştırın. Bu eylem, yalnızca iki dosya veya klasör seçilirse etkinleştirilir.

source: <guimenu>Tools</guimenu> <guisubmenu>Select Remote Charset</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Uzak Karakter Kodlamasını Seç</guisubmenu>

source: Allows you to choose the charset used by a remote connection manually.
tr: Uzak bir bağlantı tarafından kullanılan karakter kümesini elle seçmenize izin verir.

source: The Settings and Help Menu
tr: Ayarlar ve Yardım Menüsü

source: &dolphin; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/menus.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/menus.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
tr: &dolphin;’deki <guimenu>Ayarlar</guimenu> ve <guimenu>Yardım</guimenu> menüleri, &kde; uygulamalarındaki ortak menülerdendir; daha fazla bilgi için &kde; Temelleri’ndeki <ulink url="help:/fundamentals/menus.html#menus-settings">Ayarlar Menüsü</ulink> ve <ulink url="help:/fundamentals/menus.html#menus-help">Yardım Menüsü</ulink> bölümlerine bakın.

source: Miscellaneous Questions
tr: Çeşitli Sorular

source: Has &dolphin; replaced &konqueror;?
tr: &dolphin;, &konqueror;’un yerini mi aldı?

source: &dolphin; is not intended to be a competitor to &konqueror;: &konqueror; acts as a universal viewer being able to show &HTML; pages, text documents, folders and a lot more, whereas &dolphin; focuses on being only a file manager. This approach allows the optimization of the user interface for the task of file management.
tr: &dolphin;’in &konqueror;’a rakip olması amaçlanmamıştır: &konqueror; &HTML;, sayfalar, metin belgeleri, klasörler ve çok daha fazlasını görüntüleyebilen evrensel bir görüntüleyici görevi görür. &dolphin; yalnızca bir dosya yöneticisi olmaya odaklanır. Bu yaklaşım, dosya yönetimi görevi için kullanıcı arayüzünün eniyilenmesine izin verir.

source: How can I get involved with the development of &dolphin;?
tr: &dolphin; geliştirme sürecine nasıl dahil olabilirim?

source: The easiest way to get involved with &dolphin; is to subscribe to the developer mailing list <ulink url="https://mail.kde.org/mailman/listinfo/kfm-devel">kfm-devel</ulink> and drop an email to the developer mailing list. Email what you can do, how much time you can devote &etc;, the developers will let you know what you can do in the project. If you wish to contribute to the documentation please email the <ulink url="mailto:kde-doc-english@kde.org">&kde; Documentation Team</ulink> list.
tr: &dolphin; ile ilgilenmenin en kolay yolu; <ulink url="https://mail.kde.org/mailman/listinfo/kfm-devel">kfm-devel</ulink>geliştirici posta listesine abone olmak ve listeye bir posta atmaktır. Ne yapabileceğinizi ve ne kadar zamanınızın olduğunu da içerirseniz geliştiricilerimiz size uygun bir görev bulacaklardır. Belgelendirmeye katkıda bulunmak isterseniz, lütfen <ulink url="mailto:kde-doc-english@kde.org">&kde; Belgelendirme Ekibi</ulink> listesine e-posta gönderin.

source: How can I submit bug reports?
tr: Hata bildirimlerini nasıl yapabilirim?

source: The official channel for submitting bug reports is via the &kde; bug tracking system. The &kde; bug tracker can be found at <ulink url="https://bugs.kde.org">https://bugs.kde.org</ulink>.
tr: Hata bildirimi için kullanılan resmi kanal. &kde; hata izleyicisidir. &kde; izleyicisi, <ulink url="https://bugs.kde.org">https://bugs.kde.org</ulink> adresinde bulunabilir.

source: How can I submit feature requests?
tr: Özellik isteklerini nasıl gönderebilirim?

source: The official channel for submitting feature requests is via the &kde; bug tracking system. The &kde; bug tracker can be found at <ulink url="https://bugs.kde.org">https://bugs.kde.org</ulink>.
tr: Özellik istekleri için kullanılan resmi kanal. &kde; hata izleyicisidir. &kde; izleyicisi, <ulink url="https://bugs.kde.org">https://bugs.kde.org</ulink> adresinde bulunabilir.

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Program copyright 2006&ndash;2014 Peter Penz <email>peter.penz@gmx.at</email>, Frank Reininghaus <email>frank78ac@googlemail.com</email> and Emmanuel Pescosta <email>emmanuelpescosta099@gmail.com</email>
tr: Program telif hakkı 2006&ndash;2014 Peter Penz <email>peter.penz@gmx.at</email>, Frank Reininghaus <email>frank78ac@googlemail.com</email> ve Emmanuel Pescosta <email>emmanuelpescosta099@gmail.com</email>

source: Contributors:
tr: Katkıda Bulunanlar:

source: Documentation copyright 2005 Peter Penz <email>peter.penz@gmx.at</email>
tr: Belgelendirme telif hakları 2005 Peter Penz <email>peter.penz@gmx.at</email>

source: Documentation copyright 2006 &Orville.Bennett; &Orville.Bennett.mail;
tr: Belgelendirme telif hakları 2006 &Orville.Bennett; &Orville.Bennett.mail;

source: Documentation copyright 2006 Michael Austin <email>tuxedup@users.sourceforge.net</email>
tr: Belgelendirme telif hakları 2006 Michael Austin <email>tuxedup@users.sourceforge.net</email>

source: Documentation copyright 2009 Frank Reininghaus <email>frank78ac@googlemail.com</email>
tr: Belgelendirme telif hakları 2009 Frank Reininghaus <email>frank78ac@googlemail.com</email>

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Serdar Soytetir <email>tulliana@gmail.com</email></para><para>Çeviri: Kaan Özdinçer <email>kaanozdincer@gmail.com</email></para><para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
