Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/dolphin.po
Languages: tr

source: &dolphin; is capable of undoing changes you have made to files. For example if you moved a file to the Trash, &dolphin; can undo this and move it back to its original location. To undo an action, press <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> or select <menuchoice> <guimenu>Edit</guimenu> <guimenuitem>Undo: (action name)</guimenuitem> </menuchoice> in the menu, &eg; <guimenuitem>Undo: Rename</guimenuitem>.
tr: &dolphin; dosyalarda yaptığınız değişiklikleri geri alma yeteneğine sahiptir. Örneğin, bir dosyayı Çöp Kutusu’na taşıdıysanız &dolphin; bunu geri alabilir ve özgün konumuna geri taşıyabilir. Bir eylemi geri almak için <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo>’ye basın veya ana menüden <menuchoice><guimenu>Düzen</guimenu> <guimenuitem>Geri Al: (eylem adı)</guimenuitem></menuchoice> ögesini seçin; örn. <guimenuitem>Geri Al: Yeniden Adlandır</guimenuitem>.

source: Renaming A Batch Of Files
tr: Dosyaları Toplu Olarak Yeniden Adlandırma

source: &dolphin; is capable of renaming a number of files at the same time. Each file will have the file name specified, including a number, &eg;, Image1.jpg, Image2.jpg, Image3.jpg. This can be useful, &eg;, for pictures taken with a digital camera.
tr: &dolphin;, aynı anda birkaç dosyayı yeniden adlandırma yeteneğine sahiptir. Her dosya; örneğin, Görsel1.jpg, Görsel2.jpg, Görsel3.jpg gibi bir sayı dahil olmak üzere belirtilen dosya adına sahip olacaktır. Bu, örneğin bir sayısal fotoğraf makinesiyle çekilen resimler için yararlı olabilir.

source: If you wish to rename a batch of files, first select the files to be renamed. This can be done by pressing the &LMB; and drawing a rectangle around the files to be renamed before releasing it, or by holding &Ctrl; and clicking each file to be renamed (see <link linkend="selection">Selecting Items in the View</link> for more details on item selection). Then open the batch-rename dialog by pressing <keycap>F2</keycap> or via the File menu: <menuchoice> <guimenu>File</guimenu> <guimenuitem>Rename...</guimenuitem> </menuchoice>
tr: Bir grup dosyayı yeniden adlandırmak istiyorsanız önce yeniden adlandırılacak dosyaları seçin. Bu, &LMB;’ne basılı tutup yeniden adlandırmak istediğiniz dosyaları seçmek için bir dörtgen çizerek veya &Ctrl; ve yeniden adlandırılacak her dosyaya tıklayarak yapılabilir (öge seçimi hakkında daha fazla ayrıntı için bkz. <link linkend="selection">Görünümdeki Ögeleri Seçme</link>). Ardından <keycap>F2</keycap>’e basarak veya Dosya menüsü aracılığıyla toplu yeniden adlandırma iletişim kutusunu açın: <menuchoice> <guimenu>Dosya</guimenu> <guimenuitem>Yeniden Adlandır…</guimenuitem></menuchoice>

source: Then enter the name you wish to give the files. The # character must be present within the name. The files will then be renamed, where the <userinput>#</userinput> character is replaced by a different consecutive number for each file.
tr: Ardından dosyalara vermek istediğiniz adı girin. Adın içinde # karakteri bulunmalıdır. Dosyalar daha sonra yeniden adlandırılacak ve burada <userinput>#</userinput> karakteri her dosya için farklı bir ardışık sayı ile değiştirilecektir.

source: If all file extensions in your selection are different, the name of all files can be changed without using a <userinput>#</userinput> placeholder while preserving the file extensions. This is &eg; useful to rename a video file and all associated subtitle files, which have the same filename, but different extensions.
tr: Seçiminizdeki tüm dosya uzantıları farklıysa dosya uzantıları korunurken tüm dosyaların adı <userinput>#</userinput> yer tutucusu kullanılmadan değiştirilebilir. Bu; örneğin, aynı dosya adına; ancak farklı uzantılara sahip olan bir video dosyasını ve ilişkili tüm altyazı dosyalarını yeniden adlandırmak için kullanışlıdır.

source: Comparing A Selection Of Files or Folders
tr: Seçili Dosyaları ve Klasörleri Karşılaştırma

source: If the &kompare; application is installed, you can use it to see the differences between two files or folders.
tr: Eğer &kompare; uygulaması kuruluysa iki dosya veya klasör arasındaki farkları görmek için kullanabilirsiniz.

source: First select the two files or folders to be compared. Then launch the &kompare; application via the Tools menu: <menuchoice> <guimenu>Tools</guimenu> <guimenuitem>Compare Files</guimenuitem> </menuchoice>. &kompare; will then open showing the differences between the files or folders.
tr: Önce karşılaştırılacak iki dosyayı veya klasörü seçin. Ardından Araçlar menüsü aracılığıyla &kompare; uygulamasını başlatıp <menuchoice><guimenu>Araçlar</guimenu> <guimenuitem>Dosyaları Karşılaştır</guimenuitem></menuchoice> seçeneğini kullanın. &kompare;, daha sonra dosyalar veya klasörler arasındaki farkları göstermek için açılacaktır.

source: Configuring &dolphin;
tr: &dolphin; Yapılandırması

source: &dolphin; distinguishes two different kinds of settings:
tr: &dolphin;’in iki çeşit ayarı vardır:

source: Settings which affect the general behavior of &dolphin;. These can be configured using the <link linkend="preferences-dialog">Preferences Dialog</link>.
tr: &dolphin;’in genel davranışlarını düzenleyen ayarlar. Bu ayarlar, <link linkend="preferences-dialog">Tercihler</link> iletişim kutusundan yapılandırılabilir.

source: Settings which determine how the contents of a folder are displayed in &dolphin;. These settings are called <link linkend="view-properties">View Display Styles</link> and can be controlled with toolbar buttons, via the <guimenu>View</guimenu> menu, and with the <link linkend="view-properties-dialog">View Display Style dialog</link>. In the default configuration, all folders use the same display style, but &dolphin; can also be configured to remember each folder's display style separately in the <link linkend="preferences-dialog-general-behavior"><quote>General</quote> section of the settings</link>.
tr: &dolphin; içinde klasör içeriğinin nasıl görüntülendiğini belirleyen ayarlar. Bu ayarlar, <link linkend="view-properties">Görünüm Gösterim Biçemi</link> olarak adlandırılırlar ve araç çubuğu düğmeleriyle, <guimenu>Görünüm</guimenu> menüsüyle ve <link linkend="view-properties-dialog">Görünüm Özellikleri iletişim kutusuyla</link> değiştirilebilirler. Öntanımlı yapılandırmada tüm klasörler aynı gösterim biçemini kullanır; ancak &dolphin; her bir klasörün gösterim biçemini ayrı ayrı anımsaması için ayarların <link linkend="preferences-dialog-general-behavior"><quote>Genel</quote></link> bölümünden yapılandırılabilir.

source: The &dolphin; Preferences Dialog
tr: &dolphin; Tercihleri Penceresi

source: The Preferences Dialog is opened via <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &dolphin;...</guimenuitem></menuchoice> in the menu in &dolphin;'s main window. The settings are divided into several groups which can be accessed by clicking the corresponding icon on the left of the dialog.
tr: Tercihler iletişim kutusuna, &dolphin;’in ana penceresindeki <menuchoice><guimenu>Ayarlar</guimenu> <guimenuitem>&dolphin; Uygulamasını Yapılandır…</guimenuitem></menuchoice>menü ögesinden erişilebilir. Ayarlar, pencerenin sol tarafındaki ilgili simgeye tıklanarak erişilebilen birden çok bölüme ayrılmıştır.

source: All settings except for the <guilabel>Startup</guilabel> page and the <guilabel>Status Bar</guilabel> tab on the <guilabel>General</guilabel> page are shared with &konqueror; in filemanager mode.
tr: <guilabel>Genel</guilabel> sayfasındaki <guilabel>Başlangıç</guilabel> sayfası ve <guilabel>Durum Çubuğu</guilabel> sekmesi dışındaki tüm ayarlar, &konqueror;’ın dosya yöneticisi kipi ile paylaşılır.

source: General
tr: Genel

source: This group contains settings which control the general behavior of &dolphin;. The group is divided further into four subgroups which can be accessed using the tab bar at the top.
tr: Bu grup, &dolphin;’in genel davranışını denetleyen ayarları içerir. Grup daha üstte sekme çubuğunu kullanarak erişilebilen dört alt gruba ayrılmıştır.

source: Screenshot of the General settings in &dolphin;'s preferences dialog
tr: &dolphin; tercihleri penceresindeki Genel ayarların ekran görüntüsü

source: General Settings.
tr: Genel Ayarlar.

source: General Settings in &dolphin;'s Preferences Dialog.
tr: &dolphin; Tercihleri Penceresindeki Genel Ayarlar.

source: Behavior Tab
tr: Davranış Sekmesi

source: In the <guilabel>View</guilabel> section, you can configure whether the same <link linkend="view-properties">view display style</link> is shared among all folders or folders remember their own individual view display styles.
tr: <guilabel>Görünüm</guilabel> bölümünde, aynı <link linkend="view-properties">görünüm özelliklerinin</link> tüm pencereler arasında paylaşılıp paylaşılmayacağını belirtebilirsiniz.

source: <guilabel>Sorting Mode</guilabel> controls how items are sorted in the view. If <guilabel>Natural sorting</guilabel> is enabled, the sort order of three example files will be <orderedlist> <listitem><para>File1,</para></listitem> <listitem><para>File2,</para></listitem> <listitem><para>File10.</para></listitem> </orderedlist> If this option is disabled, the normal alphabetical sorting case sensitive or case insensitive will be used, which leads to the sort order
tr: <guilabel>Sıralama Kipi</guilabel> ögelerin, görünüm içinde nasıl sıralanacağını denetler. <guilabel>Doğal sıralama</guilabel> etkinse üç örnek dosya için sıralama <orderedlist> <listitem><para>Dosya1,</para></listitem> <listitem><para>Dosya2,</para></listitem> <listitem><para>Dosya10</para></listitem> </orderedlist> biçiminde olur. Bu seçenek devre dışı bırakılırsa normal abecesel sıralama, BÜYÜK/küçük harf uyumlu ve uyumsuz olacaktır ki bu sıralamayı etkiler.

source: File1,
tr: Dosya1,

source: File10,
tr: Dosya10,

source: File2.
tr: Dosya2.

source: When hovering over a file or folder with the mouse, a small window with relevant information is shown if <guilabel>Show tooltips</guilabel> is enabled.
tr: Fareyle bir dosya veya klasörün üzerine geldiğinizde, <guilabel>Araç ipuçlarını göster</guilabel> etkinleştirilmişse ilgili bilgileri içeren küçük bir pencere gösterilir.

source: <guilabel>Show selection marker</guilabel> shows a small <guibutton>+</guibutton> or <guibutton>-</guibutton> button above an item's icon if the item is hovered over with the mouse. These can be used to select or deselect the item.
tr: <guilabel>Seçim işaretçisini göster</guilabel>, ögenin fareyle üzerine gelindiğinde ögenin simgesinin üzerinde küçük bir <guibutton>+</guibutton> veya <guibutton>-</guibutton> düğmesini gösterir. Bunlar ögeyi seçmek veya seçimini kaldırmak için kullanılabilir.

source: Enable <guilabel>Rename inline</guilabel> to use this mode if only one item is currently selected. If this option is disabled or several items are selected, a dialog will be displayed for renaming.
tr: Yalnızca bir öge seçilmişse bu kipi kullanmak için <guilabel>Yerinde yeniden adlandır</guilabel> seçeneğini etkinleştirin. Bu seçenek devre dışı bırakılırsa veya birkaç öge birden seçilirse yeniden adlandırma için bir iletişim kutusu görüntülenecektir.

source: Enabling <guilabel>Switch between split panes with tab key</guilabel> allows to switch split views with the &Tab; key.
tr: <guilabel>Sekme düğmesiyle bölünmüş görünüm bölmeleri arasında geçiş yap</guilabel> seçeneğini etkinleştirmek, bölünmüş görünümler arasında &Tab; düğmesiyle geçiş yapılabilmesine izin verir.

source: Disable <guilabel>Turning off split view closes active pane</guilabel> to close the inactive pane when you are turning off the split view mode, &eg; pressing <keycap>F3</keycap>.
tr: Bölünmüş görünüm kipini kapatırken etkin olmayan bölmeyi kapatmak için <guilabel>Bölünmüş görünümü kapatmak etkin bölmeyi kapatır</guilabel> seçeneğini devre dışı bırakın; örneğin, <keycap>F3</keycap>’e basarak.

source: Previews Tab
tr: Önizlemeler Sekmesi

source: In this tab, you can configure for which file types previews are shown. Moreover, the maximum size of local and remote files for which previews are generated can be chosen.
tr: Bu sekmede, hangi dosya türü önizlemelerinin gösterileceğini yapılandırabilirsiniz. Ayrıca, önizlemelerin oluşturulduğu yerel ve uzak dosyaların en büyük boyutu seçilebilir.

source: If previews are enabled for folders, previews of some files in the folder will be shown inside a folder's icon.
tr: Klasörler için önizlemeler etkinleştirildiyse klasördeki bazı dosyaların önizlemeleri bir klasör simgesinin içinde gösterilir.

source: Confirmations Tab
tr: Onaylar Sekmesi

source: In the ask for confirmation section, you can enable warning dialogs that are shown before potentially harmful actions.
tr: Onay iste bölümünde, potansiyel olarak zararlı eylemlerden önce gösterilen uyarı iletişim kutularını etkinleştirebilirsiniz.

source: It is also possible to choose the default action <guilabel>When opening an executable file</guilabel>. There are three options, namely <guimenuitem>Always ask</guimenuitem>, <guimenuitem>Open in application</guimenuitem>, and <guimenuitem>Run script</guimenuitem>.
tr: <guilabel>Yürütülebilir bir dosyayı açarken</guilabel> öntanımlı eylemi seçmek de olanaklıdır. <guimenuitem>Her zaman sor</guimenuitem>, <guimenuitem>Uygulamada aç</guimenuitem> ve <guimenuitem>Betiği çalıştır</guimenuitem> olmak üzere üç seçenek vardır.

source: The confirmation settings for <guilabel>Moving files or folders to trash</guilabel> and <guilabel>Deleting files or folders</guilabel> affect file operations in &dolphin;, &konqueror;, &gwenview; and all &kde; applications using the default &kde; file dialog, whereas <guilabel>Closing Dolphin windows with multiple tabs</guilabel> is a &dolphin; specific setting.
tr: <guilabel>Dosya veya klasörleri çöp kutusuna taşıma</guilabel> ve <guilabel>Dosyaları veya klasörleri silme</guilabel> için olan onay ayarları, &dolphin;, &konqueror;, &gwenview; ve öntanımlı &kde; dosya iletişim kutusunu kullanan tüm &kde; uygulamalarını etkilerken, <guilabel>Birden çok sekmeli Dolphin pencerelerini kapatma</guilabel>, &dolphin;’e özel bir ayardır.

source: Status Bar Tab
tr: Durum Çubuğu Sekmesi

source: In this tab, some additional items can be enabled for the status bar, provided the status bar is wide enough:
tr: Durum çubuğunun yeterince geniş olması koşuluyla, bu sekmedeki durum çubuğu için bazı ek ögeler etkinleştirilebilir:

source: The <guilabel>Show status bar</guilabel> item can be used for toggling status bar visibility.
tr: <guilabel>Durum çubuğunu göster</guilabel> ögesi, durum çubuğu görünürlüğünü değiştirmek için kullanılabilir.

source: The <guilabel>Show zoom slider</guilabel> item allows switching visibility of the icon size widget.
tr: <guilabel>Yakınlaştırma sürgüsünü göster</guilabel> ögesi, simge boyutu araç takımının görünürlüğünü değiştirmeye izin verir.

source: The <guilabel>Show space information</guilabel> item can be used to switch on and off a bar that shows how much space is free on the current drive.
tr: <guilabel>Depolama alanı bilgisini göster</guilabel> ögesi, geçerli sürücüde ne kadar boş alan olduğunu gösteren bir çubuğu açıp kapatmak için kullanılabilir.

source: Startup
tr: Başlangıç

source: This group contains settings which control the appearance of &dolphin; on startup.
tr: Bu grup, &dolphin;’in başlangıç görünümünü belirleyen ayarları içerir.

source: Screenshot of the Startup settings in &dolphin;'s preferences dialog
tr: &dolphin; tercihleri penceresindeki Başlangıç ayarlarının ekran görüntüsü

source: Startup Settings.
tr: Başlangıç Ayarları.

source: Startup Settings in &dolphin;'s Preferences Dialog.
tr: &dolphin; Tercihleri Penceresindeki Başlangıç Ayarları.

source: The <guilabel>Show on startup</guilabel> option allows choosing the folder which is opened on startup.
tr: <guilabel>Başlangıçta göster</guilabel> seçeneği, başlangıçta açılan klasörün seçilmesini sağlar.

source: If the <guimenuitem>Folders, tabs, and window state from last time</guimenuitem> item is selected then
tr: <guimenuitem>Son kullanılan klasörler, sekmeler ve pencere durumu</guimenuitem> ögesi seçiliyse o zaman

source: When launched from the &GUI; or CLI without any &URL;s, &dolphin; restores session
tr: &GUI;’den veya komut satırından herhangi bir &URL; olmadan başlatıldıysa &dolphin; oturumu geri yükler

source: When rebooting with &dolphin; open, it restores session normally after the system comes back
tr: &dolphin; açıkken sistem yeniden başlatılırsa sistem geri geldiğinde olağan durumu geri yükler

source: When launched with &URL;s, &dolphin; window is opened showing those &URL;s instead of restoring session
tr: &URL;’ler ile başlatıldığında &dolphin;,oturumu geri yüklemek yerine o &URL;’leri gösteren pencereler açılır

source: When &dolphin; is already running and a new window is opened, that new window shows a single tab with the same &URL; as was visible in the previously-open &dolphin; instance
tr: &dolphin; halihazırda çalışıyor ve yeni bir pencere açılmışsa o yeni pencere bir önceki açık olan &dolphin; örneğindeki &URL;’yi gösteren tek bir sekme ile açılır

source: The location of the folder can also be entered directly or chosen in a dialog which can be opened by clicking the button showing a <quote>folder</quote> icon. Moreover, the current location or the default location (which is the user's home folder) can be used as the startup folder by clicking the corresponding button.
tr: Klasörün konumu ayrıca doğrudan girilebilir veya bir <quote>klasör</quote> simgesini gösteren düğme tıklanarak açılabilen bir iletişim kutusundan seçilebilir. Ayrıca, geçerli konum veya öntanımlı konum (kullanıcının ana klasörüdür), ilgili düğme tıklanarak başlangıç klasörü olarak kullanılabilir.

source: <guilabel>Begin in split view mode</guilabel> controls if the <link linkend="dolphin-view">&dolphin; view</link> is split on startup or not for new windows.
tr: <guilabel>Bölünmüş görünüm kipinde başla</guilabel>, <link linkend="dolphin-view">&dolphin; görünümünün</link> başlangıçta yeni pencereler için bölünüp bölünmeyeceğini denetler.

source: <guilabel>Show filter bar</guilabel> controls if the filter bar is shown on startup or not. See the <link linkend="filter-files">section on the filter bar</link> for details.
tr: <guilabel>Süzgeç çubuğunu göster</guilabel>, süzgecin başlangıçta görünüp görünmeyeceğini denetler. Daha fazla bilgi için <link linkend="filter-files">süzgeç çubuğu hakkındaki bölüme</link> göz atın.

source: <guilabel>Make location bar editable</guilabel> controls if the location bar is in editable mode on startup. The bread crumb mode of the location bar is used otherwise. See the <link linkend="location-bar">section about the location bar</link> for details about the two modes.
tr: <guilabel>Konum çubuğunu düzenlenebilir yap</guilabel>, başlangıçta konum çubuğunun düzenlenebilir kipte olup olmadığını denetler. Aksi takdirde, konum çubuğunun kırıntı kipi kullanılır. İki kip hakkında ayrıntılar için <link linkend="location-bar">konum çubuğuyla ilgili bölüme</link> bakın.

source: <guilabel>Open new folders in tabs</guilabel> controls whether &dolphin; should open a new folder in a new tab of the current instance when called externally. If not enabled, the new folders will be opened in new instances of &dolphin;. By default this option is enabled.
tr: <guilabel>Yeni klasörleri sekmelerde aç</guilabel>, &dolphin; dışarıdan çağrıldığında var olan örneğin yeni bir sekmesinde yeni bir klasör açmalıdır. Etkinleştirilmemişse yeni klasörler yeni &dolphin; örneklerinde açılacaktır. Öntanımlı olarak bu seçenek etkindir.

source: If <guilabel>Show full path inside location bar</guilabel> is enabled, the full path of the current location is shown in the bread crumb mode of the location bar. Otherwise, a shortened version of the path is shown if it begins with the path of one of the places in the <guilabel>Places</guilabel> panel.
tr: <guilabel>Konum çubuğunda tam yolu göster</guilabel> etkinse geçerli konumun tam yolu, konum çubuğunun kırıntı kipinde gösterilir. Aksi takdirde, yolun <guilabel>Yerler</guilabel> panelindeki yerlerden biriyle başlayan yolun kısaltılmış hali gösterilir.

source: <guilabel>Show full path in title bar</guilabel> makes it easy to distinguish between files or folders with the same name in different folders.
tr: <guilabel>Başlık çubuğunda tam yolu göster</guilabel>, farklı klasörlerdeki aynı ada sahip dosyalar veya klasörler arasında ayrım yapmayı kolaylaştırır.

source: This group contains settings which control the behavior of &dolphin;'s view modes. The three view modes (Icons, Compact, and Details) are accessible via the tab bar at the top.
tr: Bu grup, &dolphin;’in görüntüleme kiplerinin davranışını denetleyen ayarları içerir. Üç görünüm kipine (Simgeler, Sıkışık ve Ayrıntılar) üstteki sekme çubuğundan erişilebilir.

source: Screenshot of the Icons View settings in &dolphin;'s preferences dialog
tr: &dolphin; tercihleri penceresindeki Simge Görünümü ayarlarının ekran görüntüsü

source: View Modes Settings.
tr: Görünüm Kipi Ayarları.

source: View Modes Settings in &dolphin;'s Preferences Dialog.
tr: &dolphin; Tercihleri Penceresindeki Görünüm Kipi Ayarları.

source: Common settings for all view modes
tr: Tüm görünüm kipleri için genel ayarlar

source: All three view modes have some common settings:
tr: Her üç görünüm kipinde de bazı ortak ayarlar bulunur:

source: Sliders which control the size of the icons. The <guilabel>Default</guilabel> or <guilabel>Preview</guilabel> sizes are used if previews are disabled or enabled, respectively. Note that the icon size can be changed easily with the zoom slider in the status bar if the corresponding option is enabled in the <link linkend="preferences-dialog-general-statusbar"><quote>General</quote> section of the settings</link>.
tr: Simgelerin boyutlarını denetleyen sürgüler. <guilabel>Öntanımlı</guilabel> veya <guilabel>Önizleme</guilabel> boyutları, önizlemeler kapatıldığında veya etkinleştirildiğinde kullanılırlar. Simge boyutunun, <link linkend="preferences-dialog-general-statusbar">ayarların <quote>Genel</quote> bölümündeki</link> ilgili seçenek etkinleştirildiğinde durum çubuğundaki yakınlaştırma sürgüsüyle kolayca değiştirilebileceğini unutmayın.

source: A setting for the font used in the view mode: either the system font or a custom font can be chosen.
tr: Görünüm kipinde kullanılan yazıtipi için bir ayar: Sistem yazıtipi veya özel bir yazıtipi seçilebilir.

source: The other settings in the <guilabel>Text</guilabel> section which apply to only one of the view modes are discussed below.
tr: Görünüm kiplerinden yalnızca biri için geçerli olan <guilabel>Metin</guilabel> bölümündeki diğer ayarlar aşağıda ele alınmıştır.

source: Icons
tr: Simgeler

source: <guilabel>Width</guilabel> controls the minimum width that is reserved for the text of a file item.
tr: <guilabel>Genişlik</guilabel>, bir dosya ögesinin metni için ayrılan en az genişliği denetler.

source: <guilabel>Maximum lines</guilabel> means maximum number of text lines below the icon.
tr: <guilabel>En çok satır sayısı</guilabel>, simgenin altındaki en çok metin satırı sayısı anlamına gelir.

source: Compact
tr: Sıkışık

source: <guilabel>Maximum width</guilabel> controls the maximum width that is reserved for the text of a file item.
tr: <guilabel>En büyük genişlik</guilabel>, bir dosya ögesinin metni için ayrılan en büyük genişliği denetler.

source: Details
tr: Ayrıntılar
