Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/filelight.po
Languages: tr

source: The &filelight; Handbook
tr: &filelight; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: &filelight; 1.21 (Applications 15.08)
tr: &filelight; 1.21 (Uygulamalar 15.08)

source: Show disk usage and delete unused files.
tr: Disk kullanımını gösterin ve kullanılmayan dosyaları silin.

source: Filelight
tr: Dosya Feneri

source: disk usage
tr: disk kullanımı

source: Introduction
tr: Giriş

source: &filelight; 1.20 Screenshot
tr: &filelight; 1.20 Ekran Görüntüsü

source: Screenshot
tr: Ekran Görüntüsü

source: &filelight; allows you to quickly understand exactly where your diskspace is being used by graphically representing your file system as a set of concentric segmented-rings. You can use it to locate hotspots of disk usage and then manipulate those areas using &dolphin; or &konqueror;.
tr: &filelight; dosya sisteminizi grafik olarak bölütlü halkalar kümesi olarak temsil ederek, disk alanınızın nereden kullanıldığını tez anlamanıza olanak tanır. Disk kullanımının önemli noktalarını bulmak ve daha sonra bu alanları &dolphin; veya &konqueror; kullanarak değiştirmek için kullanabilirsiniz.

source: Configuring &filelight;
tr: &filelight; Yapılandırması

source: The &filelight; settings dialog has two tabs for configuring the &filelight; options. The two tabs are <guilabel>Scanning</guilabel> and <guilabel>Appearance</guilabel>. Below is a description of the settings tabs. The &filelight; settings dialog can be found by clicking <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Filelight</guimenuitem></menuchoice>.
tr: &filelight; ayarlar penceresi, &filelight; seçeneklerini yapılandırmak için iki sekme barındırır. Bunlar, <guilabel>Tarama</guilabel> ve <guilabel>Görünüm</guilabel> sekmeleridir. Aşağıda ayar sekmelerinin açıklamaları bulunmaktadır. &filelight; ayar penceresi, <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Dosya Feneri Uygulamasını Yapılandır</guimenuitem></menuchoice> ögesine tıklanarak bulunabilir.

source: Scanning
tr: Tarama

source: Scanning Screenshot
tr: Tarama Ekran Görüntüsü

source: The scanning tab allows you to configure how &filelight; scans folders. The <guilabel> Do not scan these folders</guilabel> is used to exclude certain folders from your scan. This option is very useful for skipping folders that you may not have permissions to read, or folders that are part of a virtual filesystem, such as /proc. To add a folder to the list, click the <guibutton>Add...</guibutton> button, this will start a dialog where you can choose the folder of your choice from a tree view. To remove a folder simply select the folder of your choice and click the <guibutton>Remove</guibutton> button.
tr: Tarama sekmesi, &filelight;’nin klasörleri nasıl tarayacağını yapılandırmanıza izin verir. <guilabel>Bu klasörleri taramadan dışla</guilabel>, belirli klasörleri taramanızdan dışlamak için kullanılır. Bu seçenek, okumak için izni olmayanlar veya bir sanal dosya sisteminin bir parçası olan klasörleri (örneğin, / proc) atlamak için çok kullanışlıdır. Listeye bir klasör eklemek için <guibutton>Ekle…</guibutton> düğmesine tıklayın, burada ağaç görünümünden seçtiğiniz klasörü seçebileceğiniz bir iletişim kutusu açılacaktır. Bir klasörü kaldırmak için istediğiniz klasörü seçin ve <guibutton>Kaldır</guibutton> düğmesine tıklayın.

source: Using <guilabel>Scan across filesystem boundaries</guilabel> allows scans to enter folders that are part of other filesystems. For example, when unchecked, this will usually prevent the contents of <filename class="directory">/mnt</filename> from being scanned if you scan starting from the root folder <filename class="directory">/</filename>. A scan of remote filesystems, &eg; NFS or Samba mounts, can generate high network traffic. To prevent scanning them check <guilabel>Exclude remote filesystems</guilabel>. The next option <guilabel>Exclude removable media</guilabel> prevents &filelight; from scanning removable media (&eg; &CD-ROM;s).
tr: <guilabel>Dosya sistemi sınırları arasında tarama yap</guilabel>, taramaların diğer dosya sistemlerinin bir parçası olan klasörlere girmesine izin verir. Örneğin, işaretlenmemişse bu, genellikle kök <filename class="directory">/</filename> klasöründen başlayarak tarama yaparsanız <filename class="directory">/mnt</filename> içeriğinin taranmasını önleyecektir. Uzak dosya sistemlerinin, &eg; NFS veya Samba, taranması yüksek ağ trafiği oluşturacaktır. Taramayı engellemek için <guilabel>Uzak dosya sistemlerini dışla</guilabel> seçeneğini işaretleyin. Sonraki seçenek <guilabel>Çıkarılabilir ortamı dışarıda tut</guilabel> seçilirse &filelight;, çıkarılabilir ortamları (&eg; &CD-ROM;) taramayı engelleyecektir.

source: Appearance
tr: Görünüş

source: Appearance Screenshot
tr: Görünüş Ekran Görüntüsü

source: The <guilabel>Appearance</guilabel> tab allows you to configure the way &filelight; looks.
tr: <guilabel>Görünüş</guilabel> sekmesi, &filelight; görünüşünü yapılandırmanıza olanak tanır.

source: The <guilabel>Color scheme</guilabel> section is used to choose a color scheme for &filelight;. The color schemes are <guilabel>Rainbow</guilabel>, <guilabel>System Colors</guilabel>, and <guilabel>High Contrast</guilabel>. There is also a <guilabel>Contrast</guilabel> slider to adjust the contrast of the ring segments for easier viewing.
tr: <guilabel>Renk Şeması</guilabel> bölümü, &filelight; için bir renk şeması seçilmesi için kullanılır. Bunlar, <guilabel>Gökkuşağı</guilabel>, <guilabel>Sistem renkleri</guilabel>, ve <guilabel>Yüksek karşıtlık</guilabel> renk şemalarıdır. Ayrıca, daha kolay görüntüleme için halka bölütlerinin karşıtlığını ayarlamak için <guilabel>Karşıtlık</guilabel> sürgüsü vardır.

source: The <guilabel>Use anti-aliasing</guilabel> check box is used to enable the use of anti-aliasing in the &filelight; view. Selected, this option makes the ring segments have a much cleaner look.
tr: <guilabel>Yumuşatma kullan</guilabel> onay kutusu, &filelight; görünümünde kullanılacak yumuşatmayı etkinleştirmek için kullanılır. Seçiliyse halka bölütlerinin görünümün daha temiz yapar.

source: The <guilabel>Vary label font sizes</guilabel> check box is useful when you have files or folders with long names. This option will change the size of the font to allow it to fit in the view better. When this option is enabled a <guilabel>Minimum font size</guilabel> spinbox becomes available for choosing the smallest size font to scale to.
tr: <guilabel>Etiket yazıtipi puntosunu değişken yap</guilabel> işaret kutusu, uzun adlı dosya ve klasörleriniz varsa kullanışlıdır. Bu seçenek, yazıtipi puntosunu ayarlayarak, görünüme daha iyi oturmasını sağlayacaktır. Seçenek etkinleştirildiğinde, <guilabel>En küçük yazıtipi puntosu</guilabel> ayar kutusu, ölçeklenebilir en küçük puntolu yazıtipini seçmek için kullanılabilir hale gelecektir.

source: The <guilabel>Show small files</guilabel> option is disabled by default as small files tend to clutter the &filelight; view. Enable this option if you would like to have your small files included in the &filelight; view. These files are merged all into a single <quote>multi-segment</quote>.
tr: <guilabel>Küçük dosyaları göster</guilabel> seçeneği, küçük dosyaların karmaşıklığa yol açmaması için öntanımlı olarak kapalıdır. Küçük dosyalarınızı &filelight; görünümünde içermek istiyorsanız bu seçeneği etkinleştirin. Bu dosyalar tek bir <quote>çoklu bölüt</quote> olarak birleştirilir.

source: Using &filelight;
tr: &filelight; Kullanımı

source: Starting &filelight;
tr: &filelight;’ni Başlatmak

source: &filelight; can be started from the application launcher, or from the command-line
tr: &filelight;, uygulama başlatıcısı veya komut satırından başlatılabilir

source: From the Application Launcher
tr: Uygulama Başlatıcısı Üzerinden

source: Open the application menu and move your cursor up the menu to the <guimenu>Utilities</guimenu> menu item. Choose <guimenuitem>&filelight;</guimenuitem>.
tr: Menüyü açın ve imleci <guimenu>İzlenceler</guimenu> menü ögesinin üstüne getirin. <guimenuitem>&filelight;</guimenuitem> ögesini seçin.

source: From the Command Line
tr: Komut Satırı Üzerinden

source: You can start &filelight; by typing its name on the command line. If you give it a folder name, as in the example below, it will scan that folder.
tr: &filelight;’ni (filelight) komut satırına yazarak başlatın. Aşağıdaki örnekteki gibi bir klasör adı verirseniz o klasörü tarayacaktır.

source: Scanning folders
tr: Klasörleri tarama

source: Scanning a folder shows it's contents as a filemap. To scan a folder, use the scan menu, or type a &URL; straight into the location bar.
tr: Bir klasörü taramak, içeriğini bir dosya adı olarak gösterecektir. Bir klasörü taramak için tarama menüsünü kullanın veya doğrudan konum çubuğuna bir &URL; yazın.

source: Exploring Filemaps
tr: Dosya Haritalarını Keşfetmek

source: Once a scan has completed you will be presented with a filemap that represents the folder you scanned. The filemap is a series of segmented-rings that expand from the center. Brightly colored segments are folders, gray segments are files. Segments are sized in proportion to their filesize. Segments can be nested, so for example, <filename class="directory">/home/mxcl</filename> will be one level outwards and within the bounds of the segment representing <filename class="directory">/home</filename>. Segments are labeled and hovering the mouse over segments will give you more details of that segment and its child segments.
tr: Tarama tamamlandıktan sonra, taradığınız klasörü temsil eden bir dosya haritası sunulacaktır. Dosya haritası, merkezden genişleyen bölütlü halkalar dizisidir. Parlak renkli bölütler klasörler, gri bölümler ise dosyalardır. Bölütler, dosya boyutlarıyla orantılıdır. Bölütler iç içe geçmiş olabilirler, örneğin, <filename class="directory">/home/mxcl</filename> dışa doğru bir düzeydir ve <filename class="directory">/home</filename> temsil eden bölüt sınırları dahilinde olabilir. Bölütler etiketlenir ve fareyi üzerine getirirseniz o dilimin ve onun alt bölütlerinin ayrıntıları görüntülenir.

source: Filemap Screenshot
tr: Dosya Haritası Ekran Görüntüsü

source: You can open folders with your default file manager or &konsole; using the context menu for that segment. A &MMB; click opens files by mimetype, &eg; images with <application>Gwenview</application>. You can right click a segment to get a context menu for the scanned folder with actions to copy the folder path to the clipboard or delete the folder or file. Left clicking segments will re-center the map on that segment.
tr: Klasörlerin içerik menüsünü kullanarak öntanımlı dosya yöneticinizle veya &konsole; ile klasörleri açabilirsiniz. Bir &MMB; tıklaması, MIME türüne göre, &eg;, <application>Gwenview</application> içeren görüntüleri açar. Bir bölüte sağ tıklayıp bağlam menüsünü açarak; taranan klasör için klasör yolunu panoya kopyalamak veya dosyayı silmek gibi eylemlere erişebilirsiniz. Bölütlere sağ tıklamak, haritayı o bölüt üzerinde yeniden ortalar.

source: Menu and Command Reference
tr: Menü ve Komut Başvuruları

source: The Scan Menu
tr: Tarama Menüsü

source: <guimenu>Scan</guimenu> <guimenuitem>Scan folder..</guimenuitem>
tr: <guimenu>Tara</guimenu> <guimenuitem>Klasör Tara</guimenuitem>

source: Offers a folder selection dialog so you can choose a folder to scan.
tr: Taranacak klasörü seçebilmeniz için bir klasör seçimi iletişim kutusu sunar.

source: <shortcut> <keycombo action="simul">&Ctrl;<keysym>Home</keysym></keycombo> </shortcut> <guimenu>Scan</guimenu> <guimenuitem>Scan Home folder</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keysym>Baş</keysym></keycombo> </shortcut> <guimenu>Tara</guimenu> <guimenuitem>Ana Klasörü Tara</guimenuitem>

source: Starts a scan of the user's home folder.
tr: Kullanıcının ana klasörünü taramaya başlar.

source: <guimenu>Scan</guimenu> <guimenuitem>Scan Root folder</guimenuitem>
tr: <guimenu>Tara</guimenu> <guimenuitem>Kök Klasörü Tara</guimenuitem>

source: Starts a scan of the root folder.
tr: Kök klasörü taramaya başlar.

source: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>Scan</guimenu> <guimenuitem>Rescan</guimenuitem>
tr: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>Tara</guimenu> <guimenuitem>Yeniden Tara</guimenuitem>

source: Starts a new scan of the current working folder, this is useful when changes have been made to the filesystem.
tr: Geçerli çalışma klasöründe yeni bir tarama başlatır; dosya sistemi üzerinde değişiklikler yapıldığında bu kullanışlıdır.

source: <shortcut> &Esc; </shortcut> <guimenu>Scan</guimenu> <guimenuitem>Stop</guimenuitem>
tr: <shortcut> &Esc; </shortcut> <guimenu>Tara</guimenu> <guimenuitem>Durdur</guimenuitem>

source: Stops the current scan.
tr: Geçerli taramayı durdurur.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Scan</guimenu> <guimenuitem>Quit</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Tara</guimenu> <guimenuitem>Çık</guimenuitem>

source: Quits &filelight;.
tr: &filelight;’nden çıkar.

source: The View Menu
tr: Görünüm Menüsü

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom In</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Yakınlaştır</guimenuitem>

source: Increase the view of the filemap.
tr: Dosya haritasının görünümünü artırır.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom Out</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Uzaklaştır</guimenuitem>

source: Decrease the view of the filemap.
tr: Dosya haritasının görünümünü azaltır.

source: The Go Menu
tr: Git Menüsü

source: <shortcut> <keycombo action="simul">&Alt;<keycap>Up</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Up</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;<keycap>Yukarı Ok</keycap></keycombo> </shortcut> <guimenu>Git</guimenu> <guimenuitem>Yukarı</guimenuitem>

source: Moves you up one step in the filesystem to the parent folder.
tr: Dosya sisteminde bir adım ilerleyerek üst klasöre gider.

source: <guimenu>Go</guimenu> <guimenuitem>Back</guimenuitem>
tr: <guimenu>Git</guimenu> <guimenuitem>Geri</guimenuitem>

source: Moves you one step back in your browsing history of the filesystem.
tr: Dosya sistemindeki tarama geçmişinizde sizi bir adım geriye götürür.

source: <guimenu>Go</guimenu> <guimenuitem>Forward</guimenuitem>
tr: <guimenu>Git</guimenu> <guimenuitem>İleri</guimenuitem>

source: Moves you one step forward in your browsing history of the filesystem.
tr: Dosya sistemindeki tarama geçmişinizde sizi bir adım ileri götürür.

source: Additionally &filelight; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/menus.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/menus.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
tr: Ek olarak &filelight;, yaygın &kde; <guimenu>Ayarlar</guimenu> ve <guimenu>Yardım</guimenu> menü ögelerine sahiptir, daha fazla bilgi için &kde; Temel Bilgilerin <ulink url="help:/fundamentals/menus.html#menus-settings">Ayarlar Menüsü</ulink> ve <ulink url="help:/fundamentals/menus.html#menus-help">Yardım Menüsü</ulink> bölümlerine göz atın.

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Program copyright 2006 Max B. Howell <email>max.howell@methylblue.com</email>
tr: Program telif hakkı 2006 Max B. Howell <email>max.howell@methylblue.com</email>

source: Program copyright 2008-2013 Martin Sandsmark <email>martin.sandsmark@kde.org</email>
tr: Program telif hakkı 2008–2013 Martin Sandsmark <email>martin.sandsmark@kde.org</email>

source: Documentation
tr: Belgelendirme

source: Documentation copyright 2003 Max B. Howell <email>max.howell@methylblue.com</email>
tr: Belgelendirme telif hakkı 2003 Max B. Howell <email>max.howell@methylblue.com</email>

source: Documentation copyright 2009 Martin Sandsmark <email>martin.sandsmark@kde.org</email>
tr: Belgelendirme telif hakkı 2009 Martin Sandsmark <email>martin.sandsmark@kde.org</email>

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviren: Kaan Özdinçer <email>kaanozdincer@gmail.com</email></para>
