Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/fundamentals_ui.po
Languages: tr

source: Finding Your Way Around
tr: Yolunuzu Bulmak

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Serdar</firstname><surname>Soytetir</surname><affiliation><address><email>tulliana@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: A Visual Dictionary
tr: Görsel Bir Sözlük

source: The &plasma-workspaces; feature many different graphical user interface elements, commonly known as <quote>widgets</quote>. This guide will introduce you to their names and functions.
tr: &plasma-workspaces; genellikle <quote>araç takımları</quote> olarak bilinen birçok farklı grafiksel kullanıcı arayüzü ögesi içerir. Bu kılavuz, size bunların adlarını ve işlevlerini tanıtacaktır.

source: The Big Picture
tr: Büyük Resim

source: Windows
tr: Pencereler

source: A Window
tr: Pencere

source: This is the window of the &kwrite;, a text editor. Click on part of the window to learn more about it.
tr: Bu, bir metin düzenleyicisi olan &kwrite;’ın penceresidir. Hakkında daha fazla bilgi almak için pencerenin bir kısmına tıklayın.

source: The <emphasis role="bold">Window Menu</emphasis>
tr: <emphasis role="bold">Pencere Menüsü</emphasis>

source: The <emphasis role="bold"><link linkend="visualdict-titlebar">Titlebar</link></emphasis>
tr: <emphasis role="bold"><link linkend="visualdict-titlebar">Başlık Çubuğu</link></emphasis>

source: Buttons to <emphasis>minimize</emphasis>, <emphasis>maximize</emphasis>, or <emphasis>close</emphasis> the window
tr: Pencereyi <emphasis>simge durumuna küçültmek</emphasis>, <emphasis>ekranı kaplamak</emphasis> veya <emphasis>kapatmak</emphasis> için düğmeler

source: The <emphasis role="bold"><link linkend="visualdict-menubar">Menubar</link></emphasis>
tr: <emphasis role="bold"><link linkend="visualdict-menubar">Menü Çubuğu</link></emphasis>

source: The <emphasis role="bold"><link linkend="visualdict-toolbar">Toolbar</link></emphasis>
tr: <emphasis role="bold"><link linkend="visualdict-toolbar">Araç Çubuğu</link></emphasis>

source: A very large <emphasis role="bold"><link linkend="visualdict-text-area">Text Area</link></emphasis> that acts as this program's <emphasis role="bold"><link linkend="visualdict-central-widget">Central Widget</link></emphasis>
tr: Bu programın <emphasis role="bold"><link linkend="visualdict-central-widget">Ana Araç Takımı</link></emphasis> olarak görev yapan büyükçe bir <emphasis role="bold"><link linkend="visualdict-text-area">Metin Alanı</link></emphasis>

source: A vertical <emphasis role="bold"><link linkend="visualdict-scrollbar">Scrollbar</link></emphasis> (there is also a horizontal scrollbar below the text box)
tr: Dikey bir <emphasis role="bold"><link linkend="visualdict-scrollbar">Sarma Çubuğu</link></emphasis> (metin kutusunun altında bir tane de yatay sarma çubuğu vardır)

source: The <emphasis role="bold"><link linkend="visualdict-statusbar">Statusbar</link></emphasis>
tr: <emphasis role="bold"><link linkend="visualdict-statusbar">Durum Çubuğu</link></emphasis>

source: Another Window
tr: Başka Bir Pencere

source: This is the another window, that of the &dolphin; file manager. Click on part of the window to learn more about it.
tr: Bu, &dolphin; dosya yöneticisinin bir penceresidir. Hakkında daha fazla bilgi almak için pencerenin bir kısmına tıklayın.

source: A <emphasis role="bold"><link linkend="visualdict-panel">panel</link></emphasis> that contains a list of Places on the computer system
tr: Bilgisayar sistemindeki Yerler listesini içeren bir <emphasis role="bold"><link linkend="visualdict-panel">panel</link></emphasis>

source: A <emphasis role="bold"><link linkend="visualdict-breadcrumb">Breadcrumb</link></emphasis> of the path of the displayed folder
tr: Görüntülenen klasörlerin yolunu belirten bir <emphasis role="bold"><link linkend="visualdict-breadcrumb">kırıntı</link></emphasis>

source: A folder <emphasis role="bold"><link linkend="visualdict-icon">Icon</link></emphasis>
tr: Bir klasör <emphasis role="bold"><link linkend="visualdict-icon">simgesi</link></emphasis>

source: A file <emphasis role="bold"><link linkend="visualdict-icon">Icon</link></emphasis>
tr: Bir dosya <emphasis role="bold"><link linkend="visualdict-icon">simgesi</link></emphasis>

source: A highlighted <emphasis role="bold"><link linkend="visualdict-icon">Icon</link></emphasis>
tr: Vurgulanmış bir <emphasis role="bold"><link linkend="visualdict-icon">simge</link></emphasis>

source: A <emphasis role="bold"><link linkend="visualdict-context-menu">Context Menu</link></emphasis> listing actions that can be performed on a file
tr: Bir dosya üzerinde gerçekleştirilebilecek eylemleri listeleyen bir <emphasis role="bold"><link linkend="visualdict-context-menu">Bağlam Menüsü</link></emphasis>

source: A <emphasis role="bold"><link linkend="visualdict-slider">Slider</link></emphasis> that changes the size of the <link linkend="visualdict-icon">Icons</link> displayed
tr: Görüntülenen <link linkend="visualdict-icon">simgelerin</link> boyutunu değiştiren bir <emphasis role="bold"><link linkend="visualdict-slider">Sürgü</link></emphasis>

source: More <emphasis role="bold"><link linkend="visualdict-panel">Panels</link></emphasis>
tr: Daha çok <emphasis role="bold"><link linkend="visualdict-panel">paneller</link></emphasis>

source: Elements of Graphical User Interface (&GUI;)
tr: Grafiksel Kullanıcı Arayüzü Ögeleri

source: Some &GUI; Elements
tr: Bazı Grafiksel Kullanıcı Arayüzü Ögeleri

source: This screenshot, from the &systemsettings; Formats panel, shows some &GUI; elements. Click on part of the window to learn more about it.
tr: &systemsettings; Biçimler panelinin bu ekran görüntüsü birkaç kullanıcı arayüzü ögesini gösterir. Hakkında daha fazla bilgi almak için pencerenin bir kısmına tıklayın.

source: An <emphasis role="bold"><link linkend="visualdict-icon-list">Icon List</link></emphasis> (the second item is selected)
tr: Bir <emphasis role="bold"><link linkend="visualdict-icon-list">Simge Listesi</link></emphasis> (ikinci öge seçili)

source: An open <emphasis role="bold"><link linkend="visualdict-drop-down-box">Drop Down Box</link></emphasis>
tr: Açık bir <emphasis role="bold"><link linkend="visualdict-drop-down-box">Açılır Kutu</link></emphasis>

source: An item in the <link linkend="visualdict-drop-down-box">Drop Down Box</link> that has been selected
tr: <link linkend="visualdict-drop-down-box">Açılır Kutu</link> içinde seçili bir öge

source: Some more <emphasis role="bold"><link linkend="visualdict-button">Buttons</link></emphasis>
tr: Birkaç <emphasis role="bold"><link linkend="visualdict-button">Düğme</link></emphasis>

source: Some More &GUI; Elements
tr: Bazı Ek Grafiksel Kullanıcı Arayüzü Ögeleri

source: This screenshot, from the &systemsettings; Custom Shortcuts panel, shows some more &GUI; elements.
tr: &systemsettings; Özel Kısayollar panelinin bu ekran görüntüsü, ek kullanıcı arayüzü ögeleri gösterir.

source: A <emphasis role="bold"><link linkend="visualdict-tree-view">Tree View</link></emphasis>
tr: Bir <emphasis role="bold"><link linkend="visualdict-tree-view">Ağaç Görünümü</link></emphasis>

source: A <emphasis role="bold"><link linkend="visualdict-check-box">Check Box</link></emphasis> that has been selected
tr: Seçili bir <emphasis role="bold"><link linkend="visualdict-check-box">Onay Kutusu</link></emphasis>

source: A pair of <emphasis role="bold"><link linkend="visualdict-spin-box">Spin Boxes</link></emphasis>
tr: Bir çift <emphasis role="bold"><link linkend="visualdict-spin-box">Döndürme Kutusu</link></emphasis>

source: A <emphasis role="bold"><link linkend="visualdict-menu-button">Menu Button</link></emphasis>
tr: Bir <emphasis role="bold"><link linkend="visualdict-menu-button">Menü Düğmesi</link></emphasis>

source: Even More &GUI; Elements
tr: Daha Daha Grafiksel Kullanıcı Arayüzü Ögeleri

source: This screenshot, from the &systemsettings; Default Applications panel, shows even more &GUI; elements. Click on part of the window to learn more about it.
tr: &systemsettings; Öntanımlı Uygulamalar panelinin bu ekran görüntüsü, daha çok kullanıcı arayüzü ögeleri gösterir. Hakkında daha fazla bilgi almak için pencerenin bir kısmına tıklayın.

source: A <emphasis role="bold"><link linkend="visualdict-list-box">List Box</link></emphasis>
tr: Bir <emphasis role="bold"><link linkend="visualdict-list-box">Liste Kutusu</link></emphasis>

source: A pair of <emphasis role="bold"><link linkend="visualdict-radio-button">Radio Buttons</link></emphasis>
tr: Bir çift <emphasis role="bold"><link linkend="visualdict-radio-button">Radyo Düğmesi</link></emphasis>

source: A <emphasis role="bold"><link linkend="visualdict-text-box">Text Box</link></emphasis>
tr: Bir <emphasis role="bold"><link linkend="visualdict-text-box">Metin Kutusu</link></emphasis>

source: Some Combo Boxes
tr: Bazı Çoklu Kutular

source: Finally, this screenshot, from the &systemsettings; Colors panel, shows five <emphasis role="bold"><link linkend="visualdict-tab">Tabs</link></emphasis>
tr: &systemsettings; Renkler panelinin bu ekran görüntüsü, beş adet <emphasis role="bold"><link linkend="visualdict-tab">Sekme</link></emphasis> gösterir

source: The Widgets
tr: Araç Takımları

source: Name
tr: Ad

source: Description
tr: Açıklama

source: Screenshot
tr: Ekran Görüntüsü

source: Central Widget
tr: Ana Araç Takımı

source: The main area of the running application. This might be the document you are editing in a word processor or the board of a game like Chess.
tr: Çalışan uygulamanın ana alanı. Bu, bir sözcük işlemcide düzenlediğiniz belge veya Satranç gibi bir oyunun tahtası olabilir.

source: Button
tr: Düğme

source: These can be clicked with the &LMB; to perform an action.
tr: Bir eylem gerçekleştirmek için &LMB; ile tıklanabilir.

source: Breadcrumb
tr: Kırıntı

source: Shows the path in a hierarchical system, such as a filesystem. Click on any part of the path to go up in the tree to that location. Click on the arrow to the right of part of the path to go to another child element of that path.
tr: Dosya sistemi gibi hiyerarşik bir sistemdeki yolu gösterir. Ağaçta o konuma gitmek için yolun herhangi bir kısmına tıklayın. Yolun başka bir alt ögesine gitmek için yolun bir bölümünün sağındaki oka tıklayın.

source: Check Box
tr: Onay Kutusu

source: These can be clicked to select and unselect items. They are typically used in a list of several selections. Selected items typically display a check mark, whereas unselected items will have an empty box.
tr: Ögeleri seçmek ve seçimi kaldırmak için bunlara tıklanabilir. Genellikle birkaç seçimden oluşan bir listede kullanılırlar. Seçili ögelerde genellikle bir onay imi görüntülenirken seçili olmayan ögelerde boş bir kutu bulunur.

source: Color Selector
tr: Renk Seçicisi

source: This allows a color to be selected for various purposes, such as changing the color of text. For more information, see <xref linkend="colors"/>
tr: Bu, metnin rengini değiştirmek gibi çeşitli amaçlar için bir rengin seçilmesine olanak tanır. Daha fazla bilgi için <xref linkend="colors"/> bölümüne bakın.

source: Combo Box
tr: Çoklu Kutu

source: A combination of a <link linkend="visualdict-drop-down-box">Drop Down Box</link> and a <link linkend="visualdict-text-box">Text Box</link>. You can select an option from the list, or type in the text box. Some combo boxes may automatically complete entries for you, or open the list with a list of choices that match what you have typed.
tr: <link linkend="visualdict-drop-down-box">Açılır Kutu</link>’nun ve <link linkend="visualdict-text-box">Metin Kutusu</link>’nun birleşimidir. Listeden bir seçenek belirleyebilir veya metin kutusuna yazabilirsiniz. Bazı açılır kutular kendiliğinden girişleri tamamlayabilir veya yazdıklarınızla eşleşen seçeneklerin bir listesini açabilirler.

source: Context Menu
tr: Bağlam Menüsü

source: Many user interface elements in the &plasma; Workspace and in Applications contain a context menu, which can be opened by clicking on something with the &RMB;. This menu contains options and actions that usually affect the user interface element that was right-clicked.
tr: &plasma; Çalışma Alanı’ndaki ve Uygulamalar’daki birçok kullanıcı arayüzü ögesinin, &RMB; ile tıklanarak açılabilen bir bağlam menüsü bulunur. Bu menü, genellikle sağ tıklanan kullanıcı arayüzü ögesini etkileyen seçenekleri ve eylemleri içerir.

source: Dialog Box
tr: İletişim Kutusu

source: A small window that appears above a larger application window. It may contain a message, warning, or configuration panel, among others.
tr: Daha büyük bir uygulama penceresinin üzerinde görünen küçük bir pencere. Diğerlerinin yanı sıra bir ileti, uyarı veya yapılandırma paneli içerebilir.

source: Drop Down Box
tr: Açılır Kutu

source: This provides a list of items, from which you may select one.
tr: Bu, arasından seçim yapabileceğiniz ögelerin bir listesini sağlar.

source: Icon
tr: Simge

source: A graphical representation of something, such as a file or action. They typically, but not always, also contain a text description, either beneath or to the right of the icon.
tr: Bir dosya veya eylem gibi bir şeyin grafiksel temsili. Bunlar her zaman olmasa da genellikle simgenin altında veya sağında bir metin açıklaması da içerir.

source: Icon List
tr: Simge Listesi

source: This provides a list of items represented by an <link linkend="visualdict-icon">Icon</link> and a description. It is typically used in the left panel of configuration panels to allow selection from various types of configuration categories.
tr: Bu, bir <link linkend="visualdict-icon">simge</link> ve bir açıklama ile temsil edilen öğelerin bir listesini sağlar. Çeşitli yapılandırma kategorileri arasından seçim yapılmasına olanak sağlamak için genellikle yapılandırma panellerinin sol panelinde kullanılır.

source: List Box
tr: Liste Kutusu

source: This is a list of items that typically allows multiple items to be selected. To select a group of contiguous items, press the &Shift; key and click the first and last items. To select multiple items that are not contiguous, press the &Ctrl; key and select the desired items.
tr: Bu, genellikle birden fazla ögenin seçilmesine izin veren bir öge listesidir. Bir grup bitişik ögeyi seçmek için &Shift; düğmesine basıp ilk ve son ögelere tıklayın. Bitişik olmayan birden çok ögeyi seçmek için &Ctrl; düğmesine basıp istediğiniz ögeleri seçin.

source: Menu
tr: Menü

source: A list of selections, that usually perform an action, set an option, or opens a window. These can be opened from <link linkend="visualdict-menubar">menubars</link> or <link linkend="visualdict-menu-button">menu buttons</link>.
tr: Genellikle bir eylemi gerçekleştiren, bir seçeneği ayarlayan veya bir pencere açan seçimlerin listesi. Bunlar, <link linkend="visualdict-menubar">Menü Çubukları</link> veya <link linkend="visualdict-menu-button">Menü Düğmeleri</link> ile açılabilirler.

source: Menubar
tr: Menü Çubuğu

source: These are located at the top of nearly every window and provide access to all the functions of the running application. For more information, see <xref linkend="menus"/>.
tr: Bunlar hemen hemen her pencerenin üstünde bulunur ve çalışan uygulamanın tüm işlevlerine erişim sağlar. Daha fazla bilgi için <xref linkend="menus"/> bölümüne bakın.

source: Menu Button
tr: Menü Düğmesi

source: A special type of <link linkend="visualdict-button">button</link> that opens a <link linkend="visualdict-menu">menu</link>.
tr: Bir <link linkend="visualdict-menu">menü</link> açan özel bir <link linkend="visualdict-button">düğme</link> türü.

source: Panel <emphasis>or</emphasis> Sidebar <emphasis>or</emphasis> Tool View
tr: Panel <emphasis>veya</emphasis> Kenar Çubuğu <emphasis>veya</emphasis> Araç Görünümü

source: These are located on the sides or bottom of the <link linkend="visualdict-central-widget">central widget</link> and allow you to perform many different tasks in an application. A text editor might provide a list of open documents in one, while a word processor might allow you to select a clip art image.
tr: Bunlar <link linkend="visualdict-central-widget">merkezi araç takımının</link> yanlarında veya altında bulunur ve bir uygulamada birçok farklı görevi gerçekleştirmenize olanak tanır. Bir metin düzenleyicisi, açık belgelerin bir listesini tek bir belgede sunabilirken, bir sözcük işlemci bir hazır desen seçmenize izin verebilir.

source: Progress Bar
tr: İlerleme Çubuğu

source: A small bar that indicates that a long-running operation is being performed. The bar may indicate how much of the operation has completed, or it may simply bounce back and forth to indicate that the operation is in progress.
tr: Uzun süren bir işlemin gerçekleştirildiğini gösteren küçük bir çubuk. Çubuk, işlemin ne kadarının tamamlandığını gösterebilir veya işlemin sürdüğünü göstermek için ileri geri sıçrayabilir.

source: Radio Button
tr: Radyo Düğmesi

source: These are used in a list of options, and only permit one of the options in the list to be selected.
tr: Bunlar bir seçenek listesinde kullanılır ve listedeki seçeneklerden yalnızca birinin seçilmesine izin verir.

source: Scrollbar
tr: Sarma Çubuğu

source: Allows you to navigate a document.
tr: Bir belgede dolaşmanızı sağlar.

source: Slider
tr: Sürgü

source: Allows a numeric value to be selected by moving a small bar either horizontally or vertically across a line.
tr: Küçük bir çubuğun bir çizgi boyunca yatay veya dikey olarak hareket ettirilmesiyle sayısal bir değerin seçilmesine olanak sağlar.

source: Spin Box
tr: Döndürme Kutusu

source: This permits a numerical value to be selected, either by using the up and down arrows to the right of the box to raise or lower the value, respectively, or by typing the value into the <link linkend="visualdict-text-box">text box</link>.
tr: Bu, kutunun yan tarafında bulunan ok düğmelerini aşağı veya yukarı doğru kullanarak veya <link linkend="visualdict-text-box">metin kutusuna</link> doğrudan bir değer girerek bir sayısal değerin belirlenmesine olanak tanır.

source: Status Bar
tr: Durum Çubuğu

source: These are located at the bottom of many applications and display information about what the application is currently doing. For instance, a web browser might indicate the progress of loading a web page, while a word processor might display the current word count.
tr: Bunlar birçok uygulamanın alt kısmında bulunur ve uygulamanın o anda ne yaptığına ilişkin bilgileri görüntülerler. Örneğin, bir web tarayıcısı bir web sayfasının yüklenme sürecini gösterebilirken, bir sözcük işlemci şu anki sözcük sayısını görüntüleyebilir.

source: <entry>Tab</entry>
tr: <entry>Sekme</entry>

source: These appear at the top of an area of a window, and permit that area of the window to be changed to a variety of different selections.
tr: Bunlar pencerenin bir alanının üst kısmında görünür ve pencerenin o alanının çeşitli farklı seçimlerle değiştirilmesine olanak tanır.

source: Text Area
tr: Metin Alanı

source: Allows a large amount of text to be typed in, typically multiple lines or paragraphs. Unlike a <link linkend="visualdict-text-box">Text Box</link>, pressing &Enter; will usually result in a line break.
tr: Büyük miktarda metnin (genellikle birden çok satır veya paragraf) yazılmasına olanak tanır. Bir <link linkend="visualdict-text-box">Metin Kutusu</link>’nun aksine, &Enter;’e basmak yeni bir satır yapar.

source: Text Box
tr: Metin Kutusu

source: A single-line text entry that allows a small amount of text to be typed in. Typically, pressing &Enter; will perform the same action as clicking the <guibutton>OK</guibutton> button.
tr: Küçük bir metnin girilmesini sağlayan tek satırlı bir metin girişi. Tipik olarak, &Enter; düğmesine basmak <guibutton>Tamam</guibutton> düğmesi ile aynı işlemi gerçekleştirecektir.

source: Titlebar
tr: Başlık Çubuğu

source: This is located at the top of every window. It contains the name of the application and usually information about what the application is doing, like the title of the web page being viewed in a web browser or the filename of a document open in a word processor.
tr: Bu, her pencerenin üst kısmında bulunur. Uygulamanın adını ve genellikle, bir web tarayıcısında görüntülenen web sayfasının başlığı veya bir sözcük işlemcide açılan bir belgenin dosya adı gibi, uygulamanın ne yaptığına ilişkin bilgileri içerir.

source: Toolbar
tr: Araç Çubuğu

source: These are located near the top of many applications, typically directly underneath the <link linkend="visualdict-menubar">menu bar</link>. They provide access to many common functions of the running application, like <emphasis>Save</emphasis> or <emphasis>Print</emphasis>.
tr: Bunlar genellikle çoğu uygulamanın üst kısmında, <link linkend="visualdict-menubar">menü çubuğunun</link> doğrudan altında bulunurlar. Örneğin, <emphasis>Kaydet</emphasis> veya <emphasis>Yazdır</emphasis> gibi uygulamaların en çok kullanılan işlevlerine doğrudan erişim sağlarlar.

source: Tree View
tr: Ağaç Görünümü

source: A Tree View allows you to select from a hierarchical list of options. A section, or category, of the Tree View may be unexpanded, in which case no options will appear beneath it and the arrow to the left of the title will be pointing right, toward the title. It may also be expanded, in which case several options will be listed below it, and the arrow to the left of the title will be pointing down, toward the options. To expand a portion of the tree view, click the arrow to the left of the title of the section you wish to expand, double-click on the title, or select the title using your keyboard's arrow keys and press the &Enter; or <keycap>+</keycap> key. To minimize a portion of the tree view, you may also click the arrow, double-click on the title, or press the &Enter; or <keycap>-</keycap> key.
tr: Ağaç Görünümü, hiyerarşik bir seçenekler listesinden seçim yapmanıza olanak tanır. Ağaç Görünümü’nün bir bölümü veya kategorisi genişletilmemiş olabilir; bu durumda altında hiçbir seçenek görünmez ve başlığın solundaki ok sağ başlığa doğru işaret eder. Genişletilmiş de olabilir; bu durumda altında birkaç seçenek listelenir ve başlığın solundaki ok aşağıya, seçeneklere doğru işaret eder. Ağaç görünümünün bir kısmını genişletmek için genişletmek istediğiniz bölümün başlığının solundaki oka veya başlığa çift tıklayın veya klavyenizin ok düğmelerini kullanarak başlığı seçip &Enter; veya <keycap>+</keycap> düğmesine basın. Görünümün bir kısmını daraltmak için yine bölümün başlığının solundaki oka veya başlığa çift tıklayın veya klavyenizin ok düğmelerini kullanarak başlığı seçip &Enter; veya <keycap>-</keycap> düğmesine basın.

source: Common Menus
tr: Ortak Menüler

source: Many &kde; applications contain these menus. However, most applications will have more menu entries than those listed here, and others may be missing some of the entries listed here.
tr: Birçok &kde; uygulaması bu menüleri içerir. Ancak çoğu uygulamada burada listelenenlerden daha fazla menü girdisi bulunur ve bazılarında burada listelenen girdilerden bazıları eksik olabilir.

source: A Menu Bar
tr: Bir Menü Çubuğu

source: A menubar
tr: Bir menü çubuğu

source: The menubar in <ulink url="https://www.kde.org/applications/graphics/gwenview/">&gwenview;</ulink>.
tr: <ulink url="https://www.kde.org/applications/graphics/gwenview/">&gwenview;</ulink> uygulamasındaki menü çubuğu.
