Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/fundamentals_tasks.po
Languages: tr

source: Common Tasks
tr: Genel Görevler

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Navigating Documents
tr: Belgelerde Dolaşmak

source: Scrolling
tr: Sarmak

source: You're probably familiar with the scrollbar that appears on the right side (and sometimes the bottom) of documents, allowing you to move within documents. However, there are several other ways you can navigate documents, some of which are faster and easier.
tr: Büyük olasılıkla, belgelerin sağ tarafında (ve bazen alt kısmında) görünen ve belgeler içinde hareket etmenize olanak tanıyan sarma çubuğuna aşinasınızdır. Ancak belgelerde dolaşmanın, bazıları daha hızlı ve daha kolay olan başka yolları da vardır.

source: Several mice have a wheel in the middle. You can move it up and down to scroll within a document. If you press the &Shift; key while using the mouse wheel, the document will scroll faster.
tr: Birçok farenin ortasında bir tekerlek bulunur. Bir belge içinde kaydırmak için yukarı ve aşağı hareket ettirebilirsiniz. Fare tekerleğini kullanırken &Shift; düğmesine bastığınızda belge daha hızlı kaydırılacaktır.

source: If you're using a portable computer like a laptop, you might also be able to scroll using the touchpad. Some computers allow you to scroll vertically by moving your finger up and down the rightmost side of the touchpad, and allow you to scroll horizontally by moving your finger across the bottommost side of the touchpad. Others let you scroll using two fingers: move both fingers up and down anywhere on the touchpad to scroll vertically, and move them left and right to scroll horizontally. Since this functionality emulates the mouse wheel functionality described above, you can also press the &Shift; key while you do this to scroll faster.
tr: Dizüstü bilgisayar gibi taşınabilir bir bilgisayar kullanıyorsanız dokunmatik yüzeyi kullanarak da sarma yapabilirsiniz. Bazı bilgisayarlar, parmağınızı dokunmatik yüzeyin en sağ tarafında yukarı ve aşağı hareket ettirerek dikey olarak, parmağınızı dokunmatik yüzeyin en alt tarafında hareket ettirerek ise yatay olarak sarmanıza olanak tanır. Diğerleri iki parmağınızı kullanarak sarma yapmanıza izin verir: Dikey olarak sarmak için her iki parmağınızı dokunmatik yüzeyin herhangi bir yerinde yukarı ve aşağı ve yatay olarak sarmak için sola ve sağa hareket ettirin. Bu işlevsellik yukarıda açıklanan fare tekerleği işlevini taklit ettiğinden, daha hızlı kaydırmak için bunu yaparken &Shift; düğmesine basın.

source: If you use the &plasma-workspaces;, you can control mouse wheel behavior in the <ulink url="help:/kcontrol/mouse/">Mouse module in &systemsettings;</ulink>, and you can control touchpad scrolling behavior in the Touchpad module in &systemsettings;. Otherwise, look in the configuration area of your operating system or desktop environment.
tr: &plasma-workspaces; kullanıyorsanız fare tekerleği davranışını <ulink url="help:/kcontrol/mouse/">&systemsettings; içindeki Fare modülünden</ulink> ve dokunmatik yüzey davranışını da Dokunmatik Yüzey modülünden denetleyebilirsiniz. Aksi halde işletim sisteminizin veya masaüstü ortamınızın yapılandırma alanına bakın.

source: Additionally, the scrollbar has several options in its context menu. You can access these by right-clicking anywhere on the scrollbar. The following options are available:
tr: Ayrıca sarma çubuğunun bağlam menüsünde de çeşitli seçenekler bulunur. Bunlara sarma çubuğunun herhangi bir yerine sağ tıklayarak erişebilirsiniz. Aşağıdaki seçenekler kullanılabilir:

source: Scroll here
tr: Buraya Sar

source: Scroll directly to the location represented by where you right-clicked on the scrollbar. This is the equivalent of simply clicking on that location on the scrollbar.
tr: Sarma çubuğunda sağ tıkladığınız yerin temsil ettiği konuma doğrudan ilerleyin. Bu, sarma çubuğundaki o konuma tıklamakla eşdeğerdir.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Home</keycap></keycombo></shortcut> <guimenuitem>Top</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>Baş</keycap></keycombo></shortcut> <guimenuitem>Üst</guimenuitem>

source: Go to the beginning of the document.
tr: Belgenin başlangıcına gidin.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>End</keycap></keycombo></shortcut> <guimenuitem>Bottom</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>Son</keycap></keycombo></shortcut> <guimenuitem>Alt</guimenuitem>

source: Go to the end of the document.
tr: Belgenin sonuna gidin.

source: <shortcut><keycap>PgUp</keycap></shortcut> <guimenuitem>Page up</guimenuitem>
tr: <shortcut><keycap>Sayfa Yukarı</keycap></shortcut> <guimenuitem>Sayfa Yukarı</guimenuitem>

source: Navigate to the previous page in a document that represents a printed document, or one screen up in other types of documents.
tr: Basılı bir belgeyi temsil eden bir belgede önceki sayfaya veya diğer belge türlerinde bir ekran yukarıya gidin.

source: <shortcut><keycap>PgDn</keycap></shortcut> <guimenuitem>Page down</guimenuitem>
tr: <shortcut><keycap>Sayfa Aşağı</keycap></shortcut> <guimenuitem>Sayfa Aşağı</guimenuitem>

source: Navigate to the next page in a document that represents a printed document, or one screen down in other types of documents.
tr: Basılı bir belgeyi temsil eden bir belgede sonraki sayfaya veya diğer belge türlerinde bir ekran aşağıya gidin.

source: Scroll up
tr: Yukarı Sar

source: Scroll up one unit (usually a line) in the document. This is the equivalent of clicking the up arrow at the top of the scrollbar.
tr: Belgede bir birim (genellikle bir satır) yukarı sarın. Bu, sarma çubuğunun üst kısmındaki yukarı okuna tıklamaya eşdeğerdir.

source: Scroll down
tr: Aşağı Sar

source: Scroll down one unit (usually a line) in the document. This is the equivalent of clicking the down arrow at the bottom of the scrollbar.
tr: Belgede bir birim (genellikle bir satır) aşağı sarın. Bu, sarma çubuğunun üst kısmındaki aşağı okuna tıklamaya eşdeğerdir.

source: Zooming
tr: Yakınlaştırmak

source: Many applications permit you to zoom. This makes the text or image you are viewing larger or smaller. You can generally find the zoom function in the <link linkend="menus-view">View menu</link>, and sometimes in the status bar of the application.
tr: Birçok uygulama yakınlaştırmanıza izin verir. Bu, görüntülemekte olduğunuz metin veya görselin daha büyük veya daha küçük olmasını sağlar. Yakınlaştırma işlevini genellikle <link linkend="menus-view">Görünüm</link> menüsünde, bazen de uygulamanın durum çubuğunda bulabilirsiniz.

source: You can also zoom using the keyboard by pressing <keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo> to zoom in, or <keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo> to zoom out. If you can scroll with the mouse wheel or touchpad as described in <xref linkend="nav-scroll"/>, you can also zoom by pressing &Ctrl; and scrolling that way.
tr: Yakınlaştırmak için <keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo>, uzaklaştırmak için <keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo> düğmelerini kullanarak da yakınlaştırma/uzaklaştırma işlevlerinden yararlanabilirsiniz. <xref linkend="nav-scroll"/> bölümünde sözü edildiği üzere fare tekerleğini veya dokunmatik yüzeyi kullanarak sarabiliyorsanız &Ctrl; düğmesine basarak da yakınlaştırabilir veya uzaklaştırabilirsiniz.

source: Opening and Saving Files
tr: Dosyaları Açmak ve Kaydetmek

source: Introduction
tr: Giriş

source: Many &kde; applications work with files. Most applications have a <guimenu>File</guimenu> menu with options that allow you to open and save files. For more information on that, see <xref linkend="menus-file"/>. However, there are lots of different operations that require selecting a file. Regardless of the method, all &kde; applications generally use the same file selection window.
tr: Birçok &kde; uygulaması dosyalarla çalışır. Uygulamaların çoğunda dosyaları açmak ve kaydetmek için bir <guimenu>Dosya</guimenu> menüsü vardır. Daha fazla bilgi için <xref linkend="menus-file"/> bölümüne bakın. Ayrıca bir dosya seçmeyi gerektiren başka birçok işlem vardır. İstisnalar dışında tüm &kde; uygulamaları, genel olarak aynı dosya seçme penceresini kullanır.

source: The File Open Window
tr: Dosya Açma Penceresi

source: The File Open window.
tr: Dosya açma penceresi.

source: Opening a file in <ulink url="https://www.kde.org/applications/internet/konqueror/">&konqueror;</ulink>.
tr: <ulink url="https://www.kde.org/applications/internet/konqueror/">&konqueror;</ulink>’da bir dosya açmak.

source: The File Selection Window
tr: Dosya Seçme Penceresi

source: The Toolbar
tr: Araç Çubuğu

source: This contains standard navigation tool buttons:
tr: Bu, standart dolaşma aracı düğmelerini içerir:

source: Back
tr: Geri

source: Causes the folder view to change to the previously displayed folder in its history. This button is disabled, if there is no previous item.
tr: Klasör görünümünün, geçmişinde daha önce görüntülenen klasöre değişmesine neden olur. Önceki öge yoksa bu düğme devre dışı bırakılır.

source: Forward
tr: İleri

source: Causes the folder view to change to the next folder in its history. This button is disabled, if there is no next folder.
tr: Klasör görünümünün, geçmişinde daha sonra görüntülenen klasöre değişmesine neden olur. Sonraki öge yoksa bu düğme devre dışı bırakılır.

source: Parent Folder
tr: Üst Klasör

source: This will cause the folder view to change to the immediate parent of the currently displayed folder, if possible.
tr: Bu, olanaklıysa klasör görünümünün o anda görüntülenen klasörün hemen üst ögesine değişmesine neden olur.

source: <guibutton>Reload</guibutton> (<keycap>F5</keycap>)
tr: <guibutton>Yeniden Yükle</guibutton> (<keycap>F5</keycap>)

source: Reloads the folder view, displaying any changes that have been made since it was first loaded or last reloaded.
tr: Klasör görünümünü yeniden yükler ve ilk yüklendiğinden veya son yeniden yüklendiğinden bu yana yapılan değişiklikleri görüntüler.

source: Show Preview
tr: Önizlemeyi Göster

source: Displays a preview of each file inside the folder view.
tr: Klasör görünümünde her dosyanın önizlemesini görüntüler.

source: Zoom Slider
tr: Yakınlaştırma Sürgüsü

source: This allows you to change the size of the icon or preview shown in the folder view.
tr: Bu, klasör görünümünde gösterilen simgenin veya önizlemenin boyutunu değiştirmenize olanak tanır.

source: <guibutton>Options</guibutton>
tr: <guibutton>Seçenekler</guibutton>

source: <guimenu>Options</guimenu><guisubmenu>Sorting</guisubmenu>
tr: <guimenu>Seçenekler</guimenu><guisubmenu>Sıralama</guisubmenu>

source: <guimenu>Options</guimenu><guisubmenu>Sorting</guisubmenu> <guimenuitem>By Name</guimenuitem>
tr: <guimenu>Seçenekler</guimenu><guisubmenu>Sıralama</guisubmenu> <guimenuitem>Ada Göre</guimenuitem>

source: Sort files listed in the folder view alphabetically by name.
tr: Klasör görünümünde listelenen dosyaları ada göre abecesel olarak sıralayın.

source: <guimenu>Options</guimenu><guisubmenu>Sorting</guisubmenu> <guimenuitem>By Size</guimenuitem>
tr: <guimenu>Seçenekler</guimenu><guisubmenu>Sıralama</guisubmenu> <guimenuitem>Boyuta Göre</guimenuitem>

source: Sort files listed in the folder view in order of their file size.
tr: Klasör görünümünde listelenen dosyaları boyutlarına göre sıralayın.

source: <guimenu>Options</guimenu><guisubmenu>Sorting</guisubmenu> <guimenuitem>By Date</guimenuitem>
tr: <guimenu>Seçenekler</guimenu><guisubmenu>Sıralama</guisubmenu> <guimenuitem>Tarihe Göre</guimenuitem>

source: Sort files listed in the folder view by the date they were last modified.
tr: Klasör görünümünde listelenen dosyaları son değiştirilme tarihlerine göre sıralayın.

source: <guimenu>Options</guimenu><guisubmenu>Sorting</guisubmenu> <guimenuitem>By Type</guimenuitem>
tr: <guimenu>Seçenekler</guimenu><guisubmenu>Sıralama</guisubmenu> <guimenuitem>Türe Göre</guimenuitem>

source: Sort files listed in the folder view alphabetically by their file type.
tr: Klasör görünümünde listelenen dosyaları türlerine göre sıralayın.

source: <guimenu>Options</guimenu><guisubmenu>Sorting</guisubmenu> <guimenuitem>Descending</guimenuitem>
tr: <guimenu>Seçenekler</guimenu><guisubmenu>Sıralama</guisubmenu> <guimenuitem>Azalan</guimenuitem>

source: When unchecked (the default), files in the folder view will be sorted in ascending order. (For instance, files sorted alphabetically will be sorted from A to Z, while files sorted numerically will be sorted from smallest to largest.) When checked, files in the folder will be sorted in descending order (in reverse).
tr: İşaretlenmediğinde (öntanımlı), klasör görünümündeki dosyalar artan düzende sıralanacaktır. (Örneğin, abecesel olarak sıralanan dosyalar A’dan Z’ye, sayısal olarak sıralanan dosyalar ise en küçükten en büyüğe doğru sıralanacaktır.) İşaretlendiğinde, klasördeki dosyalar azalan düzende (tersine) sıralanacaktır.

source: <guimenu>Options</guimenu><guisubmenu>Sorting</guisubmenu> <guimenuitem>Folders First</guimenuitem>
tr: <guimenu>Seçenekler</guimenu><guisubmenu>Sıralama</guisubmenu> <guimenuitem>Önce Klasörler</guimenuitem>

source: When enabled (the default), folders will appear before regular files.
tr: Etkinleştirildiğinde (öntanımlı), klasörler dosyalardan önce görünecektir.

source: <guimenu>Options</guimenu><guisubmenu>View</guisubmenu>
tr: <guimenu>Seçenekler</guimenu><guisubmenu>Görünüm</guisubmenu>

source: <guimenu>Options</guimenu><guisubmenu>View</guisubmenu> <guimenuitem>Short View</guimenuitem>
tr: <guimenu>Seçenekler</guimenu><guisubmenu>Görünüm</guisubmenu> <guimenuitem>Kısa Görünüm</guimenuitem>

source: Displays only the filenames.
tr: Yalnızca dosya adlarını görüntüler.

source: <guimenu>Options</guimenu><guisubmenu>View</guisubmenu> <guimenuitem>Detailed View</guimenuitem>
tr: <guimenu>Seçenekler</guimenu><guisubmenu>Görünüm</guisubmenu> <guimenuitem>Ayrıntılı Görünüm</guimenuitem>

source: Displays <guilabel>Name</guilabel>, <guilabel>Date</guilabel> and <guilabel>Size</guilabel> of the files.
tr: Dosyaların <guilabel>Ad</guilabel>, <guilabel>Tarih</guilabel> ve <guilabel>Boyut</guilabel> bilgilerini görüntüler.

source: <guimenu>Options</guimenu><guisubmenu>View</guisubmenu> <guimenuitem>Tree View</guimenuitem>
tr: <guimenu>Seçenekler</guimenu><guisubmenu>Görünüm</guisubmenu> <guimenuitem>Ağaç Görünümü</guimenuitem>

source: Like Short View, but folders can be expanded to view their contents.
tr: Kısa Görünüm gibi; ancak klasörler içeriklerini görüntülemek için genişletilebilir.

source: <guimenu>Options</guimenu><guisubmenu>View</guisubmenu> <guimenuitem>Detailed Tree View</guimenuitem>
tr: <guimenu>Seçenekler</guimenu><guisubmenu>Görünüm</guisubmenu> <guimenuitem>Ayrıntılı Ağaç Görünümü</guimenuitem>

source: This also allows folders to be expanded, but displays the additional columns available in Detailed View.
tr: Bu aynı zamanda klasörlerin genişletilmesine de olanak tanır; ancak Ayrıntılı Görünüm’de kullanılabilir olan ek sütunları da görüntüler.

source: <shortcut> <keycombo action="simul">&Alt;<keycap>.</keycap></keycombo> </shortcut> <guimenu>Options</guimenu><guimenuitem>Show Hidden Files</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;<keycap>.</keycap></keycombo> </shortcut> <guimenu>Seçenekler</guimenu><guimenuitem>Gizli Dosyaları Göster</guimenuitem>

source: Displays files or folders normally hidden by your operating system. The alternate shortcut for this action is <keycap>F8</keycap>.
tr: Normalde işletim sisteminiz tarafından gizlenen dosya veya klasörleri görüntüler. Bu eylemin alternatif kısayolu <keycap>F8</keycap>’dir.

source: <shortcut><keycap>F9</keycap></shortcut> <guimenu>Options</guimenu><guimenuitem>Show Places Navigation Panel</guimenuitem>
tr: <shortcut><keycap>F9</keycap></shortcut> <guimenu>Seçenekler</guimenu><guimenuitem>Yerler Panelini Göster</guimenuitem>

source: Displays the places panel which provides quick access to bookmarked locations and disks or other media.
tr: Yer imlerine eklenen konumlara, disklere veya diğer ortamlara tez erişim sağlayan yerler panelini görüntüler.

source: <guimenu>Options</guimenu><guimenuitem>Show Bookmarks</guimenuitem>
tr: <guimenu>Seçenekler</guimenu><guimenuitem>Yer İmlerini Göster</guimenuitem>

source: Displays an additional icon on the toolbar that provides access to <quote>bookmarks</quote>, a list of saved locations.
tr: Araç çubuğunda, kayıtlı konumların listesi olan <quote>yer imlerine</quote> erişim sağlayan ek bir simge görüntüler.

source: <guimenu>Options</guimenu><guimenuitem>Show Aside Preview</guimenuitem>
tr: <guimenu>Seçenekler</guimenu><guimenuitem>Yan Önizlemeyi Göster</guimenuitem>

source: Displays a preview of the currently highlighted file to the right of the folder view.
tr: Geçerli olarak vurgulanan dosyanın önizlemesini klasör görünümünün sağında görüntüler.

source: Bookmarks
tr: Yer İmleri

source: Opens a submenu to edit or add bookmarks and to add a new bookmark folder.
tr: Yer imlerini düzenlemek veya eklemek ve yeni bir yer imi klasörü eklemek için bir alt menü açar.

source: Location Bar
tr: Konum Çubuğu

source: The location bar, which can be found on top of the folder view, displays the path to the current folder. The location bar has two modes:
tr: Klasör görünümünün üst kısmında bulunan konum çubuğu, geçerli klasörün yolunu görüntüler. Konum çubuğunun iki kipi vardır:

source: Bread Crumb Mode
tr: Kırıntı Kipi

source: In the <quote>bread crumb</quote> mode, which is the default, each folder name in the path to the current folder is a button which can be clicked to quickly open that folder. Moreover, clicking the <quote>&gt;</quote> sign to the right of a folder opens a menu which permits to quickly open a subfolder of that folder.
tr: Öntanımlı olan <quote>kırıntı</quote> kipinde, geçerli klasörün yolundaki her klasör adı, o klasörü tez açmak için tıklanabilen bir düğmedir. Ayrıca, bir klasörün sağındaki <quote>&gt;</quote> işaretine tıklamak, o klasörün bir alt klasörünün tez açılmasını sağlayan bir menü açar.

source: Screenshot of the location bar in bread crumb mode
tr: Kırıntı kipindeki konum çubuğunun ekran görüntüsü

source: <phrase>Location bar in bread crumb mode.</phrase>
tr: <phrase>Kırıntı kipindeki konum çubuğunun ekran görüntüsü.</phrase>

source: <para>Location bar in bread crumb mode.</para>
tr: <para>Kırıntı kipindeki konum çubuğunun ekran görüntüsü.</para>

source: Editable Mode
tr: Düzenlenebilir Kip

source: When in bread crumb mode, clicking in the gray area to the right of the path with the &LMB; switches the location bar to the <quote>editable</quote> mode, in which the path can be edited using the keyboard. To switch back to bread crumb mode, click the check mark at the right of the location bar with the &LMB;.
tr: Kırıntı kipindeyken yolun sağındaki gri alana &LMB; ile tıklamak, konum çubuğunu, yolun klavye kullanılarak düzenlenebileceği <quote>düzenlenebilir</quote> kipe geçirir. Kırıntı kipine geri dönmek için konum çubuğunun sağındaki onay işaretine &LMB; ile tıklayın.

source: Screenshot of the location bar in editable mode
tr: Düzenlenebilir kipte konum çubuğunun ekran görüntüsü

source: <phrase>Location bar in editable mode.</phrase>
tr: <phrase>Düzenlenebilir kipte konum çubuğu.</phrase>

source: <para>Location bar in editable mode.</para>
tr: <para>Düzenlenebilir kipte konum çubuğu.</para>

source: The context menu of the location bar offers action to switch between the modes and to copy and paste the path using the clipboard. Check the last option in this context menu to display either the full path starting with the root folder of the file system or to display the path starting with the current places entry.
tr: Konum çubuğunun bağlam menüsü, kipler arasında geçiş yapma ve panoyu kullanarak yolu kopyalayıp yapıştırma eylemi sunar. Dosya sisteminin kök klasörüyle başlayan tam yolu veya geçerli yerler girişiyle başlayan yolu görüntülemek için bu bağlam menüsündeki son seçeneği işaretleyin.

source: <screeninfo>Location bar context menu</screeninfo>
tr: <screeninfo>Konum çubuğu bağlam menüsü</screeninfo>

source: <phrase>Location bar context menu</phrase>
tr: <phrase>Konum çubuğu bağlam menüsü</phrase>

source: The <guilabel>Places</guilabel> List
tr: <guilabel>Yerler</guilabel> Listesi

source: This provides the standard &kde; list of Places, shared with &dolphin; and other file management tools.
tr: &dolphin; ve diğer dosya yönetimi araçlarıyla paylaşılan, &kde;’nin standart Yerler listesini gösterir.

source: The Folder View
tr: Klasör Görünümü

source: The largest part of the file selection window is the area that lists all items in the current directory. To select a file, you can double-click on it, or choose one and hit <guibutton>Open</guibutton> or <guibutton>Save</guibutton>.
tr: Dosya seçim penceresinin en büyük kısmı geçerli dizindeki tüm ögelerin listelendiği alandır. Bir dosyayı seçmek için üzerine çift tıklayabilir veya ögeyi seçerek <guibutton>Aç</guibutton> veya <guibutton>Kaydet</guibutton> düğmesine tıklayabilirsiniz.

source: You can also select multiple files at once. To select specific files, or to unselect specific files that are already selected, press and hold &Ctrl;, click on each file, then release &Ctrl;. To select a contiguous group of files, click the first file, press and hold &Shift;, click on the last file in the group, and release &Shift;.
tr: Aynı anda birden fazla dosyayı da seçebilirsiniz. Belirli dosyaları seçmek veya önceden seçili olan belirli dosyaların seçimini kaldırmak için &Ctrl; düğmesini basılı tutun, her bir dosyaya tıklayın ve ardından &Ctrl;’ü bırakın. Bitişik bir dosya grubunu seçmek için ilk dosyaya tıklayın, &Shift; düğmesini basılı tutun, gruptaki son dosyayı tıklayın ve &Shift;’i bırakın.

source: The Folder View supports a limited set of file operations, which can be accessed by right-clicking on a file to access its context menu, or using keyboard shortcuts. The following items are available in the context menu:
tr: Klasör Görünümü, bağlam menüsüne erişmek için bir dosyaya sağ tıklanarak veya klavye kısayolları kullanılarak erişilebilen sınırlı sayıda dosya işlemini destekler. Bağlam menüsünde aşağıdaki ögeler bulunur:

source: Create New...
tr: Yeni Oluştur…

source: Create a new file or folder.
tr: Yeni bir dosya veya klasör oluşturun.

source: <guimenuitem>Move to Trash...</guimenuitem> (<keycombo action="simul"><keycap>Del</keycap></keycombo>)
tr: <guimenuitem>Çöp Kutusuna Taşı…</guimenuitem> (<keycombo action="simul"><keycap>Sil</keycap></keycombo>)

source: Move the currently selected item to the trash.
tr: Seçili ögeyi çöp kutusuna taşıyın.

source: Sorting
tr: Sıralama

source: This submenu can also be accessed from the toolbar, and is described in <xref linkend="files-ui-toolbar-options-sorting"/>.
tr: Bu alt menüye <xref linkend="files-ui-toolbar-options-sorting"/> bölümünde anlatıldığı üzere araç çubuğundan da ulaşılabilir.

source: View
tr: Görünüm

source: This submenu can also be accessed from the toolbar, and is described in <xref linkend="files-ui-toolbar-options-view"/>.
tr: Bu alt menüye <xref linkend="files-ui-toolbar-options-view"/> bölümünde anlatıldığı üzere araç çubuğundan da ulaşılabilir.

source: Open File Manager
tr: Dosya Yöneticisini Aç

source: Opens the current folder in your default file manager application.
tr: Geçerli klasörü öntanımlı dosya yöneticisi uygulamanızda açar.

source: <guimenuitem>Properties</guimenuitem> (<keycombo action="simul">&Alt;&Enter;</keycombo>)
tr: <guimenuitem>Özellikler</guimenuitem> (<keycombo action="simul">&Alt;&Enter;</keycombo>)
