Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/fundamentals_install.po
Languages: tr

source: Installing &plasma-desktop; and &kde; Applications
tr: &plasma-desktop; ve &kde; Uygulamaları Kurulumu

source: You can install &kde; applications, including &plasma-desktop;, on a variety of different platforms, ranging from smartphones and tablets to computers running &Microsoft; &Windows;, &macOS;, &UNIX;, &BSD; or &Linux;. Binary packages are available for many different platforms and distributions, or advanced users may build the source code.
tr: &kde;’yi akıllı telefonlar, tabletler, &Microsoft; &Windows;, &macOS;, &UNIX;, &BSD; ve &Linux; çalıştıran bilgisayarlar gibi çeşitli platformlara kurabilirsiniz. Birçok farklı platform ve dağıtım için ikili paketler vardır. Ayrıca ileri düzey kullanıcılar kaynak kodlardan derleyebilirler.

source: Installing Packages
tr: Paketlerin Kurulumu

source: Hundreds of developers worldwide have done a lot of work to make it easy to install &kde; onto a variety of different devices and platforms.
tr: Farklı aygıtlar ve platformlar üzerine &kde; kurmayı kolaylaştırmak için dünyanın çeşitli yerlerindeki yüzlerce geliştirici emek vermektedir.

source: Nearly every &Linux; distribution provides binary packages for individual applications and the &plasma-desktop; as a whole.
tr: Neredeyse tüm &Linux; dağıtımları tekil uygulamaları ve bütün olarak &plasma-desktop; için ikili paketler sunar.

source: To install an individual application, look for its name in your distribution's package collection. To install one of the &plasma-workspaces;, like &plasma-desktop;, look for a metapackage or package group, typically <literal>plasma-desktop</literal>.
tr: Belirli bir uygulamayı kurmak için dağıtımınızın paket koleksiyonuna bakın. &plasma-desktop; gibi &plasma-workspaces; alanlarından birini kurmak için bir üst-paket (metapackage) arayın veya <literal>plasma-desktop</literal> gibi bir paket grubunun olup olmadığını denetleyin.

source: Some applications may be installed together with other applications in a combined package named after the &kde; package they are provided in. For instance, &konqueror; might be found in the <literal>kde-baseapps</literal> package.
tr: Bazı uygulamalar, &kde; ile birleştirilmiş bir paket adı ile diğer uygulamalarla birlikte kuruluyor olabilir. Örneğin, &konqueror;, <literal>kde-baseapps</literal> paketinde olabilir.

source: If you have trouble locating &kde; packages for your distribution, please contact their support resources. Many distributions also have a team dedicated to packaging applications by &kde; that can provide assistance specific to them.
tr: Eğer dağıtımınızda &kde; paketlerini bulamıyorsanız dağıtımınızın destek kaynaklarına başvurun. Birçok dağıtımın &kde; için ayrı bir takımı vardır ve bu takımlar &kde;’ye özel yardım sağlar.

source: The &kde; on Windows Initiative provides binary packages of &kde; applications for &Microsoft; &Windows;. They also provide a special installer application that permits you to install individual applications or groups and all necessary dependencies easily.
tr: Windows üzerinde &kde; Girişimi, &Microsoft; &Windows; için &kde; uygulamalarının ikili paketlerini sağlarlar. Ayrıca, belirli uygulamaları ve bağımlılıkları kolayca kurmanızı sağlayan özel bir kurulum programı da sunulur.

source: For more information on the initiative and to download the installer, visit <ulink url="https://community.kde.org/Windows">the KDE on Windows Initiative</ulink>.
tr: Bu girişim ve kurulum programı hakkında daha fazla bilgi için <ulink url="https://community.kde.org/Windows">the KDE on Windows Initiative</ulink> adresini ziyaret edin.

source: Individual &kde; applications can be installed through several different <quote>ports</quote> systems available for &macOS;. Several different &kde; applications also provide their own binary builds for &macOS;.
tr: Belirli &kde; uygulamaları çeşitli <quote>aktarımlar</quote> ile &macOS; üzerine kurulabilir. Bazı &kde; uygulamalarının &macOS; için kendilerinin ürettiği ikili paketleri de vardır.

source: For more information, visit <ulink url="https://community.kde.org/Mac">&kde; on &macOS;</ulink>.
tr: Daha fazla bilgi için <ulink url="https://community.kde.org/Mac">&macOS; üzerinde &kde;</ulink> adresini ziyaret edin.

source: Most &BSD; distributions allows you to install &kde; applications and the &plasma-desktop; through their <quote>ports</quote> system.
tr: &BSD; dağıtımlarının çoğu &kde; uygulamalarını ve &plasma-desktop;’nü bir bütün olarak kurmanızı sağlayacak <quote>aktarım</quote> sistemine sahiptirler.

source: For more information on installing ports, see your &BSD; distribution's documentation.
tr: &BSD; sürümünün kurulumu için dağıtımınızın belgelendirmelerine bakın.

source: Mobile Devices
tr: Taşınabilir Aygıtlar

source: <productname>Plasma Mobile</productname> is an exciting initiative to bring a new &kde; experience to mobile devices like smartphones or tablets. Binary releases are provided for several different devices.
tr: <productname>Plasma Cep</productname>, telefonlar gibi taşınabilir aygıtlarda ve tabletlerde &kde; deneyimi sağlayan heyecanlandırıcı, yeni bir girişimdir. Farklı aygıtlar için ikili (derlenmiş ve kullanım hazır) sürümleri bulunur.

source: For more information, visit <ulink url="https://www.plasma-mobile.org/"><productname>Plasma Mobile</productname></ulink>.
tr: Daha fazla bilgi için <ulink url="https://www.plasma-mobile.org/"><productname>Plasma Cep</productname></ulink> adresini ziyaret edin.

source: Live Media
tr: Çalışan Ortam (Live Media)

source: Several &Linux; and &BSD; distributions offer live media. This permits you to try out the &plasma-desktop; without installing anything to your system. All you have to do insert a CD or connect a USB drive and boot from it. If you like what you see, most offer an option to install it to your hard drive.
tr: Bazı &Linux; ve &BSD; dağıtımları, çalışan ortamlar (live media) sunarlar. Çalışan ortamlar, sisteminize hiçbir şey kurmadan &plasma-desktop;’nü denemenizi sağlar. Yalnızca bir CD takmak veya USB sürücüsü bağlamak ve sistemi oradan başlatmak (önyüklemek) yeterlidir. Eğer denerken gördüğünüz ortamı severseniz aynı ortam (birçoğu) size bu yazılımı sabit diskinize kurma seçeneği de sunar.

source: There is <ulink url="https://www.kde.org/download/distributions.php">a list of distributions that offer the &kde; workspace and applications on live media</ulink> on the &kde; website.
tr: &kde; web sayfasında, &kde; çalışma alanını ve uygulamalarını sunan dağıtımların <ulink url="https://www.kde.org/download/distributions.php">bir listesi</ulink> bulunur.

source: Building from Source Code
tr: Kaynak Kodlarından Yapmak

source: For detailed information on how to compile and install &plasma-desktop; and applications see <ulink url="https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source">Build from source</ulink>.
tr: &plasma-desktop; ortamının ve uygulamaların nasıl derleneceği ve kurulacağı üzerine ayrıntılı bilgiyi <ulink url="https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source">Kaynaktan Yap</ulink> bölümünden alabilirsiniz.

source: Since &kde; software uses <command>cmake</command> you should have no trouble compiling it. Should you run into problems please report them to the &kde; mailing lists.
tr: &kde; <command>cmake</command> kullamaya başladığından beri artık derleme konusunda bir sorun yaşamamalısınız. Derleme sırasında bir sorun yaşarsanız lütfen oluşan hataları &kde; e-posta listelerine bildirin.

source: The recommended tool to build Frameworks, &plasma-desktop; and all the other applications is <ulink url="https://commits.kde.org/kdesrc-build">kdesrc-build</ulink>
tr: lFrameworks, &plasma-desktop; ve tüm diğer uygulamaları yapmak için önerilen araç <ulink url="https://commits.kde.org/kdesrc-build">kdesrc-build</ulink>’dir
