Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/fundamentals_tasks.po
Languages: tr

source: Many Applications show a search and replace bar instead of the Replace window. See <ulink url="help:/katepart/kate-part-find-replace.html#replacing-text">&katepart; documentation</ulink> for additional information on the search and replace bar.
tr: Birçok Uygulamada Değiştir penceresi yerine bir arama ve değiştirme çubuğu gösterilir. Ara ve Değiştir çubuğu hakkında daha fazla bilgi için <ulink url="help:/katepart/kate-part-find-replace.html#replacing-text">&katepart; belgelendirmesi</ulink>ne gözatın.

source: <screeninfo>The search and replace bar.</screeninfo>
tr: <screeninfo>Ara ve değiştir çubuğu.</screeninfo>

source: <phrase>The search and replace bar.</phrase>
tr: <phrase>Ara ve değiştir çubuğu.</phrase>

source: Replacing <userinput>kmail</userinput> with <userinput>kate</userinput> in &kate;'s search and replace bar
tr: &kate;’in ara ve değiştir çubuğunda <userinput>kmail</userinput> ile <userinput>kate</userinput> değiştirme

source: Thanks to an anonymous Google Code-In 2011 participant for writing much of this section.
tr: Bu belgenin çoğunu yazan Anonim Google Code-In 2011 katılımcısına özellikle teşekkürler.

source: Choosing Fonts
tr: Yazıtiplerini Seçmek

source: The font selector appears in many different &kde; applications. It lets you select the font face, font style, and font size of the text that appears in your application.
tr: Yazıtipi seçicisi, birçok &kde; uygulamasında kullanılır. Bu araç, uygulamanızda metinlerin gösterileceği yazıtipi görünümünü, biçimini ve puntosunu seçmenizi sağlar.

source: The Font Selector
tr: Yazıtipi Seçicisi

source: The font selector.
tr: Yazıtipi seçicisi.

source: Selecting a font in <ulink url="help:/systemsettings">&systemsettings;</ulink>.
tr: <ulink url="help:/systemsettings">&systemsettings;</ulink> içinde bir yazıtipi seçmek.

source: Font
tr: Yazıtipi

source: This is the leftmost selection box, and lets you choose the font face from a list of fonts on your system.
tr: Bu, en soldaki seçim kutusudur ve sisteminizdeki yazıtipleri listesinden bir yazıyüzü seçmenizi sağlar.

source: Font style
tr: Yazıtipi biçemi

source: This is the center selection box, and lets you choose the font style from the following choices:
tr: Bu, ortadaki seçim kutusudur ve aşağıdaki seçenekler arasından yazıtipi biçemini seçmenizi sağlar:

source: <guilabel>Italic</guilabel> - this displays text in a cursive, or slanted fashion, and is commonly used for citations or to emphasize text.
tr: <guilabel>Yatık</guilabel> — metni el yazısı veya eğik biçimde görüntüler ve genellikle alıntı yapmak veya metni vurgulamak için kullanılır.

source: <guilabel>Regular</guilabel> - the default. Text is displayed without any special appearance.
tr: <guilabel>Normal</guilabel> — öntanımlı. Metin herhangi bir özel görünüş olmadan görüntülenir.

source: <guilabel>Bold Italic</guilabel> - a combination of both <guilabel>Bold</guilabel> and <guilabel>Italic</guilabel>
tr: <guilabel>Kalın Yatık</guilabel> — hem <guilabel>Kalın</guilabel> hem de <guilabel>Yatık</guilabel> biçemlerinin birleşimidir

source: <guilabel>Bold</guilabel> - this displays text in a darker, thicker fashion, and is commonly used for titles of documents or to emphasize text.
tr: <guilabel>Kalın</guilabel> — bu, metni daha koyu, daha kalın bir biçimde görüntüler ve genellikle belge başlıkları için veya metni vurgulamak için kullanılır.

source: Size
tr: Boyut

source: This is the rightmost selection box, and lets you select the size of your text. Font size is measured in <emphasis>points</emphasis>, a standard unit of measure in typography. For more information on this, see <ulink url="https://en.wikipedia.org/wiki/Point_(typography)">the <quote>Point (typography)</quote> article on Wikipedia</ulink>.
tr: Bu, en sağdaki seçim kutusudur ve metninizin boyutunu seçmenizi sağlar. Yazıtipi boyutu, tipografide standart bir ölçü birimi olan <emphasis>punto</emphasis> türünden ölçülür. Bunun hakkında daha fazla bilgi için <ulink url="https://tr.wikipedia.org/wiki/Punto_(birim)">Vikipedi’deki <quote>Punto (birim)</quote> yazısına bakın</ulink>.

source: Preview
tr: Önizleme

source: The bottom of the font selector displays a preview of text using the font settings that are currently selected. You may change this text if you wish.
tr: Yazıtipi seçicisinin alt kısmı, o anda seçili olan yazıtipi ayarlarını kullanan metnin önizlemesini görüntüler. İsterseniz bu metni değiştirebilirsiniz.

source: Choosing Colors
tr: Renkleri Seçmek

source: The color chooser appears in many &kde; applications, whenever you need to select a color. It lets you pick from a <guilabel>Basic colors</guilabel> consisting of many predefined colors or mix your own when you want a specific color.
tr: Renk seçicisi, bir renk seçmeniz gerektiğinde birçok &kde; uygulamasında kullanılabilirdir. Önceden tanımlanmış birçok renkten oluşan <guilabel>Temel renkler</guilabel> arasından seçim yapmanıza veya belirli bir renk istediğinizde kendi renklerinizi karıştırmanıza olanak tanır.

source: The Color Selector
tr: Renk Seçicisi

source: The color selector.
tr: Renk seçicisi.

source: Selecting a color in <ulink url="help:/systemsettings">&systemsettings;</ulink>.
tr: <ulink url="help:/systemsettings">&systemsettings;</ulink> içinde bir renk seçmek.

source: Using Basic Colors
tr: Temel Renkleri Kullanmak

source: The basic colors group is a set of predefined colors. You can find it on the top side of the color chooser window.
tr: Temel renkler grubu, önceden tanımlanmış bir dizi renkten oluşur. Bunu renk seçici penceresinin üst tarafında bulabilirsiniz.

source: To select a color from the basic colors, simply click on it. The color will be displayed at the right of the palette, along with its &HTML; hexadecimal code
tr: Temel renklerden bir renk seçmek için üzerine tıklamanız yeterlidir. Renk, &HTML; onaltılık kodu ile birlikte paletin sağ tarafında görüntülenecektir.

source: Mixing Colors
tr: Renkleri Karıştırmak

source: The color chooser also lets you mix your own colors. There are several ways to do this:
tr: Renk seçicisi ayrıca kendi renklerinizi karıştırmanıza da olanak tanır. Bunu yapmanın birkaç yolu vardır:

source: Using the Grid
tr: Izgarayı Kullanmak

source: The right side of the color chooser contains a large box, and a thinner box immediately to its right. You can use the left box to select the Hue and Saturation of the desired color based on the visual guide provided in the box. The right bar adjusts the Value. Adjust these to select the desired color, which is displayed in the middle of the window.
tr: Renk seçicisinin sağ tarafında büyük bir kutu, hemen sağında ise daha ince bir kutu bulunur. Kutuda verilen görsel kılavuza göre istediğiniz rengin Tonunu ve Doygunluğunu seçmek için soldaki kutuyu kullanabilirsiniz. Sağ çubuk Değeri ayarlar. Pencerenin ortasında görüntülenen istenen rengi seçmek için bunları ayarlayın.

source: For more information on Hue, Saturation, and Value, see <xref linkend="colors-mixing-hsv"/>
tr: Ton, Doygunluk ve Değer ile ilgili daha fazla bilgi için <xref linkend="colors-mixing-hsv"/> bölümüne bakın.

source: Using the Screen Colors
tr: Ekran Renklerini Kullanmak

source: The eyedropper tool allows you to select a color from your screen. To use it, select the <guibutton>Pick Screen Color</guibutton> button below the basic colors, and then click anywhere on your screen to select that color.
tr: Damlalık aracı, ekranınızdan bir renk seçmenize olanak tanır. Bunu kullanmak için temel renklerin altındaki <guibutton>Ekran Rengini Seç</guibutton> düğmesini seçin ve ardından o rengi seçmek için ekranınızda herhangi bir yeri tıklayın.

source: Hue/Saturation/Value
tr: Ton/Doygunluk/Değer

source: The lower-right corner of the screen allows you to manually enter the coordinates of the desired color in the Hue/Saturation/Value (<acronym>HSV</acronym>) color space. For more information on this, see <ulink url="https://en.wikipedia.org/wiki/HSL_and_HSV">the <quote>HSL and HSV</quote> article on Wikipedia</ulink>.
tr: Ekranın sağ alt köşesi, Ton/Doygunluk/Değer (<acronym>HSV</acronym>) renk uzayında istediğiniz rengin koordinatlarını elle girmenize olanak tanır. Bunun hakkında daha fazla bilgi için <ulink url="https://tr.wikipedia.org/wiki/HSL_ve_HSV">Vikipedi’deki <quote>HSL ve HSV</quote> yazısına bakın</ulink>.

source: These values are also updated when selecting a color by other methods, so they always accurately represent the currently selected color.
tr: Bu değerler aynı zamanda başka yöntemlerle bir renk seçerken de güncellenir, böylece o anda seçili olan rengi her zaman doğru şekilde temsil ederler.

source: Red/Green/Blue
tr: Kırmızı/Yeşil/Mavi

source: The lower-right corner of the screen also allows you to manually enter the coordinates of the desired color in the Red/Green/Blue (<acronym>RGB</acronym>) color model. For more information on this, see <ulink url="https://en.wikipedia.org/wiki/RGB_color_model">the <quote>RGB color model</quote> article on Wikipedia</ulink>.
tr: Ekranın sağ alt köşesi ayrıca Kırmızı/Yeşil/Mavi (<acronym>RGB</acronym>) renk modelinde istenilen rengin koordinatlarını manuel olarak girmenize olanak sağlar. Bunun hakkında daha fazla bilgi için <ulink url="https://tr.wikipedia.org/wiki/RGB_renk_modeli">Vikipedi’deki <quote>RGB renk modeli</quote></ulink> yazısına bakın.

source: &HTML; Hexadecimal Code
tr: &HTML; Onaltılık Kodu

source: You may enter the &HTML; hexadecimal code representing the color in the lower-right corner of the screen. For more information on this, see <ulink url="https://en.wikipedia.org/wiki/Web_colors">the <quote>Web colors</quote> article on Wikipedia</ulink>.
tr: Ekranın sağ alt köşesine rengi temsil eden &HTML; onaltılı kodunu girebilirsiniz. Bunun hakkında daha fazla bilgi için <ulink url="https://tr.wikipedia.org/wiki/Web_renkleri">Vikipedi’deki <quote>Web renkleri</quote></ulink> yazısına bakın.

source: This value is also updated when selecting a color by other methods, so it always accurately represents the currently selected color.
tr: Bu değer, başka yöntemlerle bir renk seçildiğinde de güncellenir, böylece o anda seçili olan rengi her zaman doğru şekilde temsil eder.

source: Custom Colors
tr: Özel Renkler

source: After selecting a color, you may add it to the Custom Colors group so you can use it later. To do so, click the <guibutton>Add to Custom Colors</guibutton> button.
tr: Bir renk seçtikten sonra onu daha sonra kullanabilmek için Özel Renkler grubuna ekleyebilirsiniz. Bunu yapmak için <guibutton>Özel Renklere Ekle</guibutton> düğmesine tıklayın.
