Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/fundamentals_tasks.po
Languages: tr

source: Open the Properties window that allows you to view and modify various types of metadata related to the currently selected file.
tr: Şu anda seçili dosyayla ilgili çeşitli üst veri türlerini görüntülemenize ve değiştirmenize olanak tanıyan Özellikler penceresini açın.

source: The Preview Pane
tr: Önizleme Paneli

source: If enabled, this displays a preview of the currently highlighted file.
tr: Etkinleştirilirse o anda vurgulanan dosyanın önizlemesi görüntülenir.

source: The <guilabel>Name</guilabel> Entry
tr: <guilabel>Ad</guilabel> Girdisi

source: When a file is selected, a name will appear in this text box. You may also manually enter a file name or path in this text box.
tr: Bir dosya seçildiğinde bu metin kutusunda bir ad görünecektir. Bu metin kutusuna elle bir dosya adı veya yolu da girebilirsiniz.

source: The <guilabel>Filter</guilabel> Entry
tr: <guilabel>Süzgeç</guilabel> Girdisi

source: When opening a file, the <guilabel>Filter</guilabel> entry allows you to enter a filter for the files displayed in the folder view. The filter uses standard globs; patterns must be separated by white space. For instance, you can enter <userinput>*.cpp *.h *.moc</userinput> to display several different common &Qt; programming files.
tr: Bir dosyayı açarken, <guilabel>Süzgeç</guilabel> girdisi, klasör görünümünde görüntülenen dosyalar için bir süzgeç girmenizi sağlar. Süzgeç, standart globalleri kullanır; dizgiler boşlukla ayrılmalıdır. Örneğin, birkaç farklı ortak &Qt; programlama dosyalarını görüntülemek için <userinput>*.cpp *.h *.moc</userinput> girebilirsiniz.

source: To display all files, enter a single asterisk (<userinput>*</userinput>).
tr: Tüm dosyaları görüntülemek için bir yalnıca bir * kullanın (<userinput>*</userinput>).

source: The filter entry saves the last 10 filters entered between sessions. To use one, press the arrow button on the right of the entry and select the desired filter string. You can disable the filter by pressing the <guibutton>Clear text</guibutton> button to the left of the autocompletion arrow button.
tr: Süzgeç girdisi, oturumlar arasında girilen son 10 süzgeci kaydeder. Birini kullanmak için girdinin sağındaki ok düğmesine basın ve istediğiniz süzgeç dizisini seçin. Otomatik tamamlama ok düğmesinin solundaki <guibutton>Metni Temizle</guibutton> düğmesine basarak süzgeci devre dışı bırakabilirsiniz.

source: When saving a file, the <guilabel>Filter</guilabel> entry will instead display a drop down box that allows you to select from all the file types the application supports. Select one to save a file in that format.
tr: Bir dosyayı kaydederken, <guilabel>Süzgeç</guilabel> girdisi bunun yerine uygulamanın desteklediği tüm dosya türleri arasından seçim yapmanızı sağlayan bir açılır kutu görüntüleyecektir. Bir dosyayı bu biçimde kaydetmek için birini seçin.

source: Automatically select filename extension
tr: Dosya adı uzantısını kendiliğinden seç

source: When saving a file, this check box will appear. When selected (the default), the application will automatically append the default file extension for the selected file type to the end of the file name, if it does not already appear in the <guilabel>Name</guilabel> entry. The file extension that will be used is listed in parenthesis at the end of the check box label.
tr: Bir dosyayı kaydederken bu onay kutusu görünecektir. Seçildiğinde (öntanımlı) uygulama, <guilabel>Ad</guilabel> girdisinde zaten görünmüyorsa seçilen dosya türü için öntanımlı dosya uzantısını dosya adının sonuna kendiliğinden ekleyecektir. Kullanılacak dosya uzantısı onay kutusu etiketinin sonunda parantez içinde listelenmiştir.

source: The File Save Window
tr: Dosya Kaydetme Penceresi

source: The File Save window.
tr: Dosya kaydetme penceresi.

source: Saving a file in <ulink url="https://www.kde.org/applications/internet/konqueror/">&konqueror;</ulink>.
tr: <ulink url="https://www.kde.org/applications/internet/konqueror/">&konqueror;</ulink>’da bir dosyayı kaydetmek.

source: The <guibutton>Open</guibutton> or <guibutton>Save</guibutton> Button
tr: <guibutton>Aç</guibutton> veya <guibutton>Kaydet</guibutton> Düğmesi

source: Depending on the action being performed, an <guibutton>Open</guibutton> or <guibutton>Save</guibutton> button will be displayed. Clicking on this button will close the file selection window and perform the requested action.
tr: Gerçekleştirilen eyleme bağlı olarak <guibutton>Aç</guibutton> veya <guibutton>Kaydet</guibutton> düğmesi görüntülenecektir. Bu düğmeye tıklamak dosya seçim penceresini kapatacak ve istenen eylemi gerçekleştirecektir.

source: The <guibutton>Cancel</guibutton> Button
tr: <guibutton>İptal</guibutton> Düğmesi

source: Clicking <guibutton>Cancel</guibutton> will close the file dialog without performing any action.
tr: <guibutton>İptal</guibutton> düğmesine basmak, herhangi bir işlem yapmadan dosya penceresini kapatır.

source: Thanks and Acknowledgments
tr: Teşekkürler ve Destek Olanlar

source: Special thanks to Google Code-In 2011 participant Alexey Subach for writing parts of this section.
tr: Bu bölümün bazı kısımlarını yazdığı için Google Code-In 2011 katılımcısı Alexey Subach’a özellikle teşekkür ederiz.

source: Check Spelling
tr: Yazım Denetimi

source: &sonnet; is the spelling checker used by &kde; applications such as &kate;, &kmail;, and &calligrawords;. It is a &GUI; frontend to various free spell checkers.
tr: &sonnet;; &kate;, &kmail; ve &calligrawords; gibi &kde; uygulamaları tarafından kullanılan bir yazım denetleyicisidir. Birçok özgür yazım denetleyicisi için bir grafik kullanıcı arayüzü ön ucudur.

source: To use &sonnet; you need to install a spell checker like <application>&GNU; Aspell</application>, <application>Hspell</application> or <application>Hunspell</application> and additionally the corresponding dictionaries for the languages that you wish to use.
tr: &sonnet;’i kullanmak için <application>&GNU; Aspell</application>, <application>Hspell</application> veya <application>Hunspell</application> gibi bir yazım denetleyicisi ve denetlemek istediğiniz diller için sözlükler kurmalısınız.

source: The Check Spelling Window
tr: Yazım Denetimi Penceresi

source: The Check spelling window.
tr: Yazım denetimi penceresi.

source: Correcting a misspelling.
tr: Hatalı bir yazımı düzeltmek.

source: To check spelling, go to <menuchoice><guimenu>Tools</guimenu> <guimenuitem>Spelling...</guimenuitem></menuchoice>.
tr: Yazımı denetlemek için <menuchoice><guimenu>Araçlar</guimenu> <guimenuitem>Yazım Denetimi…</guimenuitem></menuchoice> menüsüne gidin.

source: If a word is possibly misspelled in your document, it is displayed in the top line in the dialog. &sonnet; tries to appropriate word(s) for replacement. The best guess is displayed to the right of <guilabel>Replace with</guilabel>. To accept this replacement, click on <guibutton>Replace</guibutton>.
tr: Belgenizdeki bir sözcüğü yanlış yazmışsanız pencerenin en üst satırında gösterilir. &sonnet;, değiştirmeniz için doğru sözcüğü/sözcükleri bulmayı dener. En iyi öneri <guilabel>Bununla Değiştir</guilabel> ögesinin sağ tarafında bulunur. Bu değiştirme işlemini kabul etmek için <guibutton>Değiştir</guibutton> düğmesine tıklayın.

source: &sonnet; also allows you to select a word from the list of suggestions and replace the misspelled word with that selected word. With the help of the <guibutton>Suggest</guibutton> button, you can add more suggestions from the dictionary to the suggestions list.
tr: &sonnet; ayrıca öneriler listesinden bir sözcük seçmenize ve yanlış yazılan sözcüğü seçili sözcükle değiştirmenize de olanak tanır. <guibutton>Öner</guibutton> düğmesi yardımıyla sözlükten öneriler listesine daha fazla öneri ekleyebilirsiniz.

source: Click on <guibutton>Ignore</guibutton> to keep your original spelling.
tr: Özgün yazımınızı korumak için <guibutton>Yok Say</guibutton> düğmesine tıklayın.

source: Click on <guibutton>Finished</guibutton> to stop spellchecking and <emphasis>keep</emphasis> the changes made.
tr: <guibutton>Bitti</guibutton> düğmesine tıklayarak yazım denetimini durdurabilir ve yapılan değişiklikleri <emphasis>koruyabilirsiniz</emphasis>.

source: Click on <guibutton>Cancel</guibutton> to stop spellchecking and <emphasis>cancel</emphasis> the changes already made.
tr: <guibutton>İptal</guibutton> düğmesine tıklayarak yazım denetimini durdurabilir ve yapılan değişiklikleri <emphasis>iptal</emphasis> edebilirsiniz.

source: Click on <guibutton>Replace All</guibutton> to automatically replace the misspelled word(s) with the chosen replacement word, if they appear again in your document later.
tr: Yanlış yazılan sözcükleri, daha sonra belgenizde yeniden görünürlerse seçili değiştirme sözcüğüyle kendiliğinden değiştirmek için <guibutton>Tümünü Değiştir</guibutton>’e tıklayın.

source: Click on <guibutton>Ignore All</guibutton> to ignore the spelling at that point and all the future occurrences of the word misspelled.
tr: O noktadaki yazımı ve yanlış yazılan sözcüğün gelecekteki tüm oluşumlarını yok saymak için <guibutton>Tümünü Yok Say</guibutton>’a tıklayın.

source: Click on <guibutton>Add to Dictionary</guibutton> to add the misspelled word to your personal dictionary.
tr: <guibutton>Sözlüğe Ekle</guibutton> düğmesine tıklayarak hatalı yazım olarak gösterilen sözcüğü kişisel sözlüğünüze ekleyebilirsiniz.

source: The <guilabel>Personal Dictionary</guilabel> is a distinct dictionary from the system dictionary and the additions made by you will not be seen by others.
tr: <guilabel>Kişisel Sözlük</guilabel> sistem sözlüğünden ayrı bir sözlüktür ve sizin tarafınızdan yapılan eklemeler diğer kullanıcılar tarafından görülemez.

source: The drop down box <guilabel>Language</guilabel> at the bottom of this dialog allows you to switch to another dictionary temporarily.
tr: Bu pencerenin en altındaki <guilabel>Dil</guilabel> açılır kutusu, geçici olarak başka bir dil seçmenizi sağlar.

source: Automatic Spell Checking
tr: Kendiliğinden Yazım Denetimi

source: In many applications, you can automatically check spelling as you type. To enable this feature, select <menuchoice><guimenu>Tools</guimenu> <guimenuitem>Automatic Spell Checking</guimenuitem></menuchoice>.
tr: Birçok uygulamada, yazarken kendiliğinden yazım denetimi yapabilirsiniz. Bu özelliği etkinleştirmek için <menuchoice><guimenu>Araçlar</guimenu> <guimenuitem>Kendiliğinden Yazım Denetimi</guimenuitem></menuchoice>’ni seçin.

source: Potentially misspelled words will be underlined in red. To select a suggestion, right click on the word, select the <guisubmenu>Spelling</guisubmenu> submenu, and select the suggestion. You may also instruct &sonnet; to ignore this spelling for this document by selecting <guimenuitem>Ignore Word</guimenuitem>, or you may select <guimenuitem>Add to Dictionary</guimenuitem> to save it in your personal dictionary.
tr: Yanlış yazılması olası sözcüklerin altı kırmızıyla çizilecektir. Bir öneri seçmek için sözcüğe sağ tıklayın, <guisubmenu>Yazım Denetimi</guisubmenu> alt menüsünü seçin ve öneriyi seçin. Ayrıca &sonnet;’in bu belgede bu yazımı yok sayması için <guimenuitem>Sözcüğü Yok Say</guimenuitem>’ı veya kişisel sözlüğünüze kaydetmesi için <guimenuitem>Sözlüğe Ekle</guimenuitem>’yi seçebilirsiniz.

source: Configuring &sonnet;
tr: &sonnet; Yapılandırması

source: To change your dictionary, go to <menuchoice><guimenu>Tools</guimenu> <guimenuitem>Change Dictionary...</guimenuitem></menuchoice>. A small window will appear at the bottom of the current document that will allow you to change your dictionary.
tr: Sözlüğünüzü değiştirmek için <menuchoice><guimenu>Araçlar</guimenu> <guimenuitem>Sözlüğü Değiştir…</guimenuitem></menuchoice> seçeneğine gidin. Geçerli belgenin altında sözlüğünüzü değiştirmenize olanak sağlayacak küçük bir pencere görünecektir.

source: For more information on configuring &sonnet;, see the <ulink url="help:/kcontrol/spellchecking">Spell Checker &systemsettings; module documentation</ulink>
tr: &sonnet;’i yapılandırma konusunda daha fazla bilgi için &systemsettings; <ulink url="help:/kcontrol/spellchecking">Yazım Denetimi modülü belgelendirmesine</ulink> gidin

source: Special thanks to Google Code-In 2011 Participant Salma Sultana for writing much of this section.
tr: Bu bölümün çoğunu yazdığı için Google Code-2011 Katılımcısı Salma Sultana’ya özellikle teşekkür ederiz.

source: Find and Replace
tr: Bul ve Değiştir

source: The Find function of many &kde; applications lets you find specific text in a document, while the Replace function allows you to replace text that is found with different text you provide.
tr: Birçok &kde; uygulamasında bulunan Bul işlevi, belirli bir metni bulmanıza izin verirken Değiştir işlevi ise o metni sağlayacağınız başka bir metinle değiştirebilmenizi sağlar.

source: You can find both these functions in the <guimenu>Edit</guimenu> menu of many &kde; applications. For more information on this menu, see <xref linkend="menus-edit"/>.
tr: Bu iki işlevi de birçok &kde; uygulamasını <guimenu>Düzen</guimenu> menüsünde bulabilirsiniz. Bu menü hakkında daha fazla bilgi için <xref linkend="menus-edit"/> bölümüne bakın.

source: The Find Function
tr: Bul İşlevi

source: The Find function searches for text in a document and selects it.
tr: Bul işlevi, bir belgedeki metni arar ve onu seçer.

source: The Find Window
tr: Bul Penceresi

source: The Find window.
tr: Bul penceresi.

source: Searching for <userinput>income</userinput> in <ulink url="https://www.kde.org/applications/office/sheets/">&calligrasheets;</ulink>.
tr: <ulink url="https://www.kde.org/applications/office/sheets/">&calligrasheets;</ulink> içinde <userinput>gelir</userinput> aranıyor.

source: To use Find in many applications, go to <menuchoice><guimenu>Edit</guimenu> <guimenuitem>Find...</guimenuitem></menuchoice> or press <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo>. Then, in the <guilabel>Text to find:</guilabel> text box, enter the text that you want to find.
tr: Uygulamalarda Bul işlevini kullanmak için <menuchoice><guimenu>Düzen</guimenu> <guimenuitem>Bul…</guimenuitem></menuchoice> ögesine gidin veya <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> kısayolunu kullanın. Sonrasında <guilabel>Bulunacak metin:</guilabel> kutusuna bulmak istediğiniz metni girin.

source: If <guilabel>Regular expression</guilabel> is checked you will be able to search using regular expressions. Click on <guibutton>Edit</guibutton> to select from and enter commonly used regular expression characters, like <guilabel>White Space</guilabel> or <guilabel>Start of Line</guilabel>. If &kate; is installed, you can find <ulink url="help:/katepart/regular-expressions.html">more information on writing regular expressions in its documentation</ulink>.
tr: Eğer <guilabel>Düzenli ifade</guilabel> işaretlenmişse düzenli ifadeleri kullanarak arama yapabilirsiniz. <guibutton>Düzenle</guibutton> düğmesine tıklayarak sık kullanılan <guilabel>Boşluk</guilabel> veya <guilabel>Satır Başı</guilabel> gibi düzenli ifade karakterlerini seçip girebilirsiniz. Sisteminizde &kate; kuruluysa düzenli ifadeleri yazma konusunda daha fazla bilgiyi <ulink url="help:/katepart/regular-expressions.html"> bölümünde</ulink> bulabilirsiniz.

source: You can limit the found results by configuring these options:
tr: Bu seçenekleri yapılandırarak bulunan sonuçları sınırlayabilirsiniz:

source: Case sensitive
tr: BÜYÜK/küçük harf duyarlı

source: Capital and lowercase characters are considered different. For example, if you search for <quote>This</quote>, results that contain <quote>this</quote> will not be returned.
tr: BÜYÜK/küçük harfler farklı değerlendirilir. Örneğin, <quote>Bu</quote> sözcüğünü ararken <quote>bu</quote> sonucu bulunamaz.

source: Whole words only
tr: Yalnızca tam sözcükler

source: By default, when the application searches for text, it will return results even in the middle of other text. For instance, if you search for <quote>is</quote> it will stop on every word that contains that, like <quote>th<emphasis>is</emphasis></quote> or <quote>h<emphasis>is</emphasis>tory</quote>. If you check this option, the application will only return results when the search text is a word by itself, that is, surrounded by whitespace.
tr: Öntanımlı olarak, uygulama metin aradığında diğer metnin ortasında bile sonuçları döndürür. Örneğin, <quote>is</quote> aramasını yaparsanız bunu içeren her sözcükte durur; <quote>s<emphasis>is</emphasis></quote> veya <quote>p<emphasis>is</emphasis></quote> gibi. Bu seçeneği işaretlerseniz uygulama yalnızca arama metni başlı başına bir sözcük olduğunda, yani boşluklarla çevrelendiğinde sonuçları döndürecektir.

source: From cursor
tr: İmleçten itibaren

source: The search will start from the location of the cursor and stop at the end of the text.
tr: Arama imlecin bulunduğu yerden başlayacak ve metnin sonunda duracaktır.

source: Find backwards
tr: Geriye doğru bul

source: By default, the application searches for the text starting at the beginning of the document, and move through it to the end. If you check this option, it will instead start at the end and work its way to the beginning.
tr: Uygulama, öntanımlı olarak belgenin başından başlayarak metni arar ve belgenin sonuna kadar ilerler. Bu seçeneği işaretlerseniz bunun yerine sondan başlayacak ve başlangıca doğru ilerleyecektir.

source: Selected text
tr: Seçili metin

source: Select this option to search only in the text that is currently selected, not the entire document. It is disabled when no text is selected.
tr: Belgenin tamamında değil, yalnızca o anda seçili olan metinde arama yapmak için bu seçeneği seçin. Hiçbir metin seçilmediğinde devre dışı bırakılır.

source: Many applications show a search bar instead of the Find window. See <ulink url="help:/katepart/kate-part-find-replace.html#finding-text">&katepart; documentation</ulink> for additional information on the search bar.
tr: Birçok uygulamada Bul penceresi yerine bir arama çubuğu görüntülenir. Arama çubuğu üzerine ek bilgi için <ulink url="help:/katepart/kate-part-find-replace.html#finding-text">&katepart; belgelendirmesine</ulink> bakın.

source: <screeninfo>The search bar in &kate;.</screeninfo>
tr: <screeninfo>&kate; arama çubuğu.</screeninfo>

source: <phrase>The search bar in &kate;.</phrase>
tr: <phrase>&kate; arama çubuğu.</phrase>

source: Searching for <userinput>software</userinput> in &kate;'s search bar.
tr: &kate; arama çubuğunda <userinput>software</userinput> aranıyor.

source: The Find function only selects the first match that it finds. You can continue searching by selecting <menuchoice><guimenu>Edit</guimenu><guimenuitem>Find Next</guimenuitem></menuchoice> or by pressing <keycap>F3</keycap>.
tr: Bul işlevi, yalnızca bulduğu ilk eşleşmeyi seçer. Aramayı sürdürmek için <menuchoice><guimenu>Düzen</guimenu><guimenuitem>Sonrakini Bul</guimenuitem></menuchoice> seçeneğine gidebilir veya <keycap>F3</keycap>’e basabilirsiniz.

source: Example of a Search
tr: Bir Arama Örneği

source: Example of a search.
tr: Bir arama örneği.

source: &kate; displays a match for <userinput>KDE</userinput>.
tr: &kate;, <userinput>KDE</userinput> için bir eşleşme görüntülüyor.

source: The Replace Function
tr: Değiştir İşlevi

source: The Replace function searches for text in a document and replaces it with other text. You can find it in many application at <menuchoice><guimenu>Edit</guimenu><guisubmenu>Replace...</guisubmenu></menuchoice> or by pressing <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo>.
tr: Değiştir işlevi, belgede bir metni arar ve onu başka bir metinle değiştirir. Bunu, birçok uygulamada <menuchoice><guimenu>Düzen</guimenu><guisubmenu>Değiştir…</guisubmenu></menuchoice> ögesinde bulabilir veya <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> düğmelerine basarak çağırabilirsiniz.

source: The Replace Window
tr: Değiştir Penceresi

source: The Replace window.
tr: Değiştir penceresi.

source: Replacing <userinput>income</userinput> with <userinput>expense</userinput> in &calligrasheets;
tr: &calligrasheets; içinde <userinput>income</userinput>’ı <userinput>expense</userinput> ile değiştirmek

source: The window of the Replace function is separated into 3 sections:
tr: Değiştir işlevinin penceresi üç bölüme ayrılmıştır:

source: Find
tr: Bul

source: Here you may enter the text you wish to search for. See <xref linkend="find-find"/> for more information on the options provided here.
tr: Aramak istediğiniz metni buraya girebilirsiniz. Burada sağlanan seçenekler hakkında daha fazla bilgi için <xref linkend="find-find"/> bölümüne bakın.

source: Replace
tr: Değiştir

source: Here you may enter the text you wish to replace the found text with.
tr: Bulunan metni değiştirmek istediğiniz metni buraya girebilirsiniz.

source: You can reuse the found text in the replacement text by selecting the <guilabel>Use placeholders</guilabel> checkbox. Placeholders, sometimes known as backreferences, are a special character sequence that will be replaced with all or part of the found text. For instance, <quote>\0</quote> represents the entire found string.
tr: <guilabel>Yer tutucular kullan</guilabel> onay kutusunu seçerek, bulunan metni yeni metinde yeniden kullanabilirsiniz. Bazen geri başvurular olarak da bilinen yer tutucular, bulunan metnin tümü veya bir kısmı ile değiştirilecek özel bir karakter dizisidir. Örneğin, <quote>\0</quote>, tüm bulunan metni temsil eder.

source: You may insert placeholders into the text box by clicking the <guibutton>Insert Placeholder</guibutton> button, then selecting an option from the menu like <guimenuitem>Complete Match</guimenuitem>. For example, if you are searching for <quote>message</quote>, and you want to replace it with <guilabel>messages</guilabel> insert the <guimenuitem>Complete Match</guimenuitem> placeholder and add an <quote>s</quote>. The replace field will then contain <quote>\0s</quote>.
tr: <guibutton>Yer Tutucu Ekle</guibutton> düğmesini tıklayıp ardından menüden <guimenuitem>Tam Eşleşme</guimenuitem> gibi bir seçeneği belirleyerek metin kutusuna yer tutucular ekleyebilirsiniz. Örneğin, <quote>ileti</quote> sözcüğünü arıyorsanız ve bunu <guilabel>iletiler</guilabel> ile değiştirmek istiyorsanız <guimenuitem>Tam Eşleşme</guimenuitem> yer tutucusunu girin ve bir <quote>ler</quote> ekleyin.

source: If &kate; is installed, you can learn more about placeholders in the <ulink url="help:/katepart/regular-expressions.html">Regular Expressions appendix of its documentation</ulink>.
tr: &kate; kuruluysa bu uygulamanın <ulink url="help:/katepart/regular-expressions.html">belgelendirmesinde bulunan Düzenli İfadeler</ulink> bölümünden yer tutucular hakkında daha fazla bilgi alabilirsiniz.

source: <guilabel>Options</guilabel>
tr: <guilabel>Seçenekler</guilabel>

source: This contains all the same options that the <link linkend="find-find">Find</link> function does, with one addition:
tr: Bu, <link linkend="find-find">Bul</link> işlevi ile aynı seçenekleri içerir ve şu ek seçenekleri sunar:

source: If the <guilabel>Prompt on replace</guilabel> option is checked a window will appear on every found word, allowing you to confirm whether you would like to replace the found text.
tr: Eğer <guilabel>Değiştirmeden önce sor</guilabel> seçeneği işaretliyse, bulunan her sözcükte bir pencere açılarak değiştirme işlemini onaylamanız istenecektir.
