Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/fundamentals_ui.po
Languages: tr

source: The <keysym>Meta</keysym> key described below is a generic name for the custom key found on many different keyboards. On keyboards designed for &Microsoft; &Windows;, this key is usually called the <keysym>Windows</keysym> key, and will have a picture of the &Windows; logo. On keyboards designed for &Mac; computers, this key is known as the <keysym>Command</keysym> key and will have a picture of the <trademark class="registered">Apple</trademark> logo and/or the <keycap>⌘</keycap> symbol. On keyboards designed for &UNIX; systems, this key is really known as the <keysym>Meta</keysym> key and is typically labeled with a diamond: <keycap>◆</keycap>.
tr: Aşağıda açıklanan <keysym>Meta</keysym> düğmesi, birçok farklı klavyede bulunan özel düğme için kullanılan genel addır. &Microsoft; &Windows; için tasarlanan klavyelerde <keysym>Windows</keysym> düğmesi olarak bilinir ve üzerinde &Windows; simgesi vardır. &Mac; için tasarlanmış bilgisayarlarda bu düğmeye <keysym>Command</keysym> düğmesi denir ve üzerinde <trademark class="registered">Apple</trademark> simgesi ve/veya <keycap>⌘</keycap> sembolü bulunur. &UNIX; için tasarlanmış sistemlerde ise bu düğme <keysym>Meta</keysym> olarak bilinir ve genellikle bir elmas (<keycap>◆</keycap>) şekli ile etiketlenmiştir.

source: Working with Windows
tr: Pencerelerle Çalışmak

source: These shortcuts allow you to perform all kinds of operations with windows, whether it be opening, closing, moving, or switching between them.
tr: Bu kısayollar; pencerelerle açma, kapatma, taşıma veya pencereler arasında geçiş yapma gibi her türlü işlemi gerçekleştirmenize olanak tanır.

source: Starting and Stopping Applications
tr: Uygulamaları Başlatma ve Durdurma

source: These shortcuts make it easy to start and stop programs.
tr: Bu kısayollar programları başlatmayı ve durdurmayı kolaylaştırır.

source: Shortcut
tr: Kısayol

source: Open the Application Launcher
tr: Uygulama Başlatıcısını Aç

source: <keycombo action="simul">&Alt;<keycap>Space</keycap></keycombo> / <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo>
tr: <keycombo action="simul">&Alt;<keycap>Boşluk</keycap></keycombo> / <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo>

source: Run Command Interface
tr: Komut Çalıştırma Arayüzü

source: &Ctrl;<keycap>Esc</keycap>
tr: &Ctrl;<keycap>Vazgeç</keycap>

source: System Activity
tr: Sistem Etkinliği

source: Close
tr: Kapat

source: Quit
tr: Çık

source: Force Quit
tr: Çıkmayı Zorla

source: Moving Around
tr: Dolaşmak

source: These shortcuts allow you to navigate between windows, activities, and desktops efficiently.
tr: Bu kısayollar; pencereler, etkinlikler ve masaüstleri arasında verimli bir şekilde dolaşmanıza olanak tanır.

source: Present Windows
tr: Açık pencereler

source: Present Windows on current desktop
tr: Geçerli masaüstündeki açık pencereler

source: Present Windows of current application only
tr: Yalnızca geçerli uygulamanın açık pencereleri

source: Show Desktop
tr: Masaüstünü Göster

source: Activate Window Demanding Attention
tr: İlgi İsteyen Pencereyi Etkinleştir

source: Walk through windows
tr: Pencereler arasında gezin

source: Walk through windows (Reverse)
tr: Pencereler arasında gezin (geriye doğru)

source: Open the Window Operations menu
tr: Pencere İşlemleri menüsünü aç

source: &Meta;&Alt;<keysym>Up</keysym>
tr: &Meta;&Alt;<keysym>Yukarı</keysym>

source: Switch to Window Above
tr: Üstteki Masaüstüne Geç

source: &Meta;&Alt;<keysym>Down</keysym>
tr: &Meta;&Alt;<keysym>Aşağı</keysym>

source: Switch to Window Below
tr: Alttaki Masaüstüne Geç

source: &Meta;&Alt;<keysym>Left</keysym>
tr: &Meta;&Alt;<keysym>Sol</keysym>

source: Switch to Window to the Left
tr: Soldaki Pencereye Geç

source: &Meta;&Alt;<keysym>Right</keysym>
tr: &Meta;&Alt;<keysym>Sağ</keysym>

source: Switch to Window to the Right
tr: Sağdaki Pencereye Geç

source: Panning and Zooming
tr: Kaydırma ve Yakınlaştırma

source: Need to get a closer look? The &plasma-workspaces; allow you to zoom in and out and move your entire desktop around, so you can zoom in even when the application you are using doesn't support it.
tr: Daha yakından bakmamız mı gerekiyor? &plasma-workspaces; yakınlaştırıp uzaklaştırmanıza ve tüm masaüstünüzü hareket ettirmenize izin verir, ayrıca kullandığınız uygulama desteklemediğinde bile yakınlaştırabilirsiniz.

source: Zoom In
tr: Yakınlaştır

source: Zoom Out
tr: Uzaklaştır

source: Zoom Normal
tr: Normalleştir

source: &Meta;<keysym>Up</keysym>
tr: &Meta;<keysym>Yukarı</keysym>

source: Pan Up
tr: Yukarı Kaydır

source: &Meta;<keysym>Down</keysym>
tr: &Meta;<keysym>Aşağı</keysym>

source: Pan Down
tr: Aşağı Kaydır

source: &Meta;<keysym>Left</keysym>
tr: &Meta;<keysym>Sol</keysym>

source: Pan left, move window to monitor to the left
tr: Sola kaydır, pencereyi soldaki monitöre taşı

source: In a multi-monitor environment
tr: Çoklu monitör bulunan bir ortamda

source: &Meta;<keysym>Right</keysym>
tr: &Meta;<keysym>Sağ</keysym>

source: Pan right, move window to monitor to the right<footnoteref linkend="fn1"/>
tr: Sağa kaydır, pencereyi sağdaki monitöre taşı<footnoteref linkend="fn1"/>

source: &Meta;<keysym>PgUp</keysym>
tr: &Meta;<keysym>Sayfa Yukarı</keysym>

source: Maximize/Restore window
tr: Pencereyi ekrana kapla/geri yükle

source: &Meta;<keysym>PgDn</keysym>
tr: &Meta;<keysym>Sayfa Aşağı</keysym>

source: Minimize window
tr: Pencereyi simge durumuna küçült

source: Working with Activities and Virtual Desktops
tr: Etkinlikler ve Sanal Masaüstleri ile Çalışmak

source: These shortcuts allow you to switch between and manage <ulink url="help:/plasma-desktop/activities-interface.html">Activities</ulink> and <ulink url="help:/kcontrol/desktop/">virtual desktops</ulink>.
tr: Bu kısayollar, <ulink url="help:/plasma-desktop/activities-interface.html">Etkinlikler</ulink> ve <ulink url="help:/kcontrol/desktop/">Sanal Masaüstleri</ulink> arasında geçiş yapmanıza ve onları yönetmenize olanak tanır.

source: Manage Activities
tr: Etkinlikleri Yönet

source: Next Activity
tr: Sonraki Etkinlik

source: Previous Activity
tr: Önceki Etkinlik

source: Switch to Desktop 1
tr: 1. Masaüstüne Geç

source: Switch to Desktop 2
tr: 2. Masaüstüne Geç

source: Switch to Desktop 3
tr: 3. Masaüstüne Geç

source: Switch to Desktop 4
tr: 4. Masaüstüne Geç

source: Working with the Desktop
tr: Masaüstü ile Çalışmak

source: These shortcuts allow you to work with the &plasma-desktop; and panels.
tr: Bu kısayollar, &plasma-desktop; ve panelleri ile çalışmanıza olanak tanır.

source: Add Widgets
tr: Araç Takımları Ekle

source: Remove this <replaceable>Widget</replaceable>
tr: Bu <replaceable>Araç Takımı</replaceable>’nı Kaldır

source: Lock/Unlock Widgets
tr: Araç Takımlarını Kilitle/Kilitlerini Aç

source: <replaceable>Widget</replaceable> Settings
tr: <replaceable>Araç Takımı</replaceable> Ayarları

source: Run the Associated Application
tr: İlişkilendirilmiş Uygulamayı Çalıştır

source: Desktop Settings
tr: Masaüstü Ayarları

source: Getting Help
tr: Yardım Almak

source: Need some help? The manual for the current application is only a keypress away, and some programs even have additional help that explains the element in focus.
tr: Yardıma mı gereksiniminiz var? Geçerli uygulamanın kılavuzu yalnızca bir düğme basımı kadar yakınınızdadır ve bazı programlarda odaklanılan ögeyi açıklayan ek yardım bile bulunmaktadır.

source: Help
tr: Yardım

source: What's This?
tr: Bu Nedir?

source: Working with Documents
tr: Belgelerle Çalışmak

source: Whether it's a text document, spreadsheet, or web site, these shortcuts make performing many kinds of tasks with them easy.
tr: İster bir metin belgesi, ister elektronik tablo veya web sitesi olsun, bu kısayollar birçok görevin gerçekleştirilmesini kolaylaştırır.

source: Refresh
tr: Yenile

source: Select All
tr: Tümünü Seç

source: Undo
tr: Geri Al

source: Redo
tr: Yinele

source: <entry>Cut</entry>
tr: <entry>Kes</entry>

source: Copy
tr: Kopyala

source: Paste
tr: Yapıştır

source: <entry>New</entry>
tr: <entry>Yeni</entry>

source: Print
tr: Yazdır

source: Save
tr: Kaydet

source: Find
tr: Bul

source: Close Document/Tab
tr: Belgeyi/Sekmeyi Kapat

source: Working with Files
tr: Dosyalarla Çalışmak

source: Whether you are in an Open/Save dialog or the &dolphin; file manager, these shortcuts save you time when performing operations on files. Note that some of the concepts used with files are the same as with documents, so several of the shortcuts are identical to their counterparts listed above.
tr: İster Aç/Kaydet iletişim kutusunda, ister &dolphin; dosya yöneticisinde olun, bu kısayollar dosyalar üzerinde işlem yaparken size zaman kazandırır. Dosyalarla kullanılan bazı kavramların belgelerle aynı olduğunu, dolayısıyla kısayolların birçoğunun yukarıda listelenenlerle aynı olduğunu unutmayın.

source: Replace Location
tr: Konumu Değiştir

source: Invert Selection
tr: Seçimi Tersine Çevir

source: &Alt;<keycap>Left</keycap>
tr: &Alt;<keycap>Sol</keycap>

source: Back
tr: Geri

source: &Alt;<keycap>Right</keycap>
tr: &Alt;<keycap>Sağ</keycap>

source: Forward
tr: İleri

source: &Alt;<keycap>Up</keycap>
tr: &Alt;<keycap>Yukarı</keycap>

source: Up (to folder that contains this one)
tr: Yukarı (bunu içeren klasöre)

source: &Alt;<keycap>Home</keycap>
tr: &Alt;<keycap>Baş</keycap>

source: Home Folder
tr: Ana Klasör

source: Delete
tr: Sil

source: Move to Trash
tr: Çöp Kutusuna Taşı

source: &Shift;<keycap>Delete</keycap>
tr: &Shift;<keycap>Sil</keycap>

source: Delete Permanently
tr: Kalıcı Olarak Sil

source: Changing Volume and Brightness
tr: Ses Düzeyini ve Parlaklığı Değiştirmek

source: In addition to the standard keys, many computer keyboards and laptops nowadays have special keys or buttons to change the speaker volume, as well as the brightness of your monitor if applicable. If present, you can use these keys in the &plasma-workspaces; to perform those tasks.
tr: Standart düğmelere ek olarak günümüzde birçok bilgisayar klavyesi ve dizüstü bilgisayarda, hoparlör ses düzeyini ve varsa monitörünüzün parlaklığını değiştirmek için özel düğmeler bulunmaktadır. Varsa bu düğmeleri, bu görevleri gerçekleştirmek için &plasma-workspaces; içinde kullanabilirsiniz.

source: If you do not have such keys, see <xref linkend="kbd-modifying"/> for information on how to assign keys for these tasks.
tr: Bu tür düğmeleriniz yoksa bu görevlere nasıl düğmeler atayacağınızla ilgili bilgi için <xref linkend="kbd-modifying"/> bölümüne bakın.

source: Leaving Your Computer
tr: Bilgisayarınızdan Ayrılmak

source: All done? Use these shortcuts and put your computer away!
tr: Her şey tamam mı? Bu kısayolları kullanın ve bilgisayarınızdan uzaklaşın!

source: Lock Screen
tr: Ekranı Kilitle

source: &Ctrl;&Alt;<keycap>Del</keycap>
tr: &Ctrl;&Alt;<keycap>Sil</keycap>

source: Leave
tr: Ayrıl

source: Modifying Shortcuts
tr: Kısayolları Değiştirmek

source: The shortcuts described in <link linkend="kbd-windows">Working With Windows</link>, <link linkend="kbd-leaving">Leaving Your Computer</link>, <link linkend="kbd-vol-bright">Changing Volume and Brightness</link> and <link linkend="kbd-activities">Working with Activities and Virtual Desktops</link> are called <emphasis>global shortcuts</emphasis>, since they work regardless of which window you have open on your screen. These can be modified in the <ulink url="help:/kcontrol/keys/">Global Shortcuts panel of &systemsettings;</ulink>, where they are separated by &kde; component.
tr: <link linkend="kbd-windows">Pencerelerle Çalışmak</link>, <link linkend="kbd-leaving">Bilgisayardanızdan Ayrılmak</link>, <link linkend="kbd-vol-bright">Ses Düzeyini ve Parlaklığı değiştirmek</link> ve <link linkend="kbd-activities">Etkinlikler ve Sanal Masaüstleri ile Çalışmak</link> bölümlerinde belirtilen kısayollar, <emphasis>evrensel kısayollar</emphasis> olarak bilinir; çünkü ekranda hangi pencereyi açtığınızdan bağımsız olarak çalışırlar. Bunlar, &kde; bileşeni olarak ayrılmış olan <ulink url="help:/control/keys/"> sistem ayarlarının Global Kısayollar panelinden</ulink> değiştirilebilirler.

source: The shortcuts described <link linkend="kbd-desktop">Working with the Desktop</link> are immutable and cannot be modified.
tr: <link linkend="kbd-desktop">Masaüstü ile Çalışmak</link> bölümünde belirtilen kısayollar, değişmez ve değiştirilemezler.

source: The shortcuts described in <link linkend="kbd-docs">Working with Documents</link> and <link linkend="kbd-help">Getting Help</link> are set by individual programs. Most &kde; programs allow you to use the <link linkend="shortcuts">common shortcut editing dialog</link> to modify these. The shortcuts described in <link linkend="kbd-files">Working With Files</link> can be edited in the same manner when used inside a file manager like &dolphin; or &konqueror;, but cannot be modified in the case of Open/Save dialogs, &etc;
tr: <link linkend="kbd-docs">Belgeler ile Çalışmak</link> ve <link linkend="kbd-help">Yardım Almak</link> bölümlerinde belirtilen kısayollar, programlar tarafından belirlenirler. Birçok &kde; programı, <link linkend="shortcuts">ortak kısayol düzenleme penceresi</link> kullanımına izin vererek, bunları değiştirmenize izin verir. <link linkend="kbd-files">Dosyalar ile Çalışmak</link> bölümünde belirtilen kısayollar, &dolphin; dosya yöneticisi veya &konqueror; gibi programların içindeyken aynı şekilde düzenlenebilir; ancak Aç/Kaydet gibi pencereleri için düzenlenemezler.
