Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/fundamentals_ui.po
Languages: tr

source: Some applications, like &dolphin;, do not show a menubar by default. You can show it by pressing <keycombo>&Ctrl;<keycap>M</keycap></keycombo>. You can also use this to hide the menubar in applications that support doing so.
tr: &dolphin; gibi bazı uygulamalar, öntanımlı olarak bir menü çubuğu göstermez. Menü çubuğunu, <keycombo>&Ctrl;<keycap>M</keycap></keycombo> kısayolunu kullanarak görünür duruma getirebilirsiniz. Ayrıca bu kısayolu, uygulama destekliyorsa menü çubuğunu gizlemek için de kullanabilirsiniz.

source: The File Menu
tr: Dosya Menüsü

source: The <guimenu>File</guimenu> menu allows you to perform operations on the currently open file and access common tasks in applications.
tr: <guimenu>Dosya</guimenu> menüsü, o anda açık olan dosya üzerinde işlemler yapmanızı ve uygulamanın temel işlevlerine erişmenizi sağlar.

source: Common menu items include:
tr: Genellikle içerilen menü ögeleri:

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>New</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Dosya</guimenu><guimenuitem>Yeni</guimenuitem>

source: Creates a new file.
tr: Yeni bir dosya oluşturur.

source: <guimenu>File</guimenu><guimenuitem>New Window</guimenuitem>
tr: <guimenu>Dosya</guimenu><guimenuitem>Yeni Pencere</guimenuitem>

source: Opens a new window.
tr: Yeni bir pencere açar.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Open...</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo></shortcut> <guimenu>Dosya</guimenu><guimenuitem>Aç…</guimenuitem>

source: Opens an already existing file.
tr: Var olan bir dosyayı açar.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Save</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>Dosya</guimenu><guimenuitem>Kaydet</guimenuitem>

source: Saves the file. If the file already exists it will be overwritten.
tr: Dosyayı kaydeder. Eğer dosya varsa üzerine yazılır.

source: <guimenu>File</guimenu><guimenuitem>Save As...</guimenuitem>
tr: <guimenu>Dosya</guimenu><guimenuitem>Farklı Kaydet…</guimenuitem>

source: Saves the file with a new filename.
tr: Dosyayı yeni bir adla kaydeder.

source: <guimenu>File</guimenu><guimenuitem>Save All</guimenuitem>
tr: <guimenu>Dosya</guimenu><guimenuitem>Tümünü Kaydet</guimenuitem>

source: Saves all open files.
tr: Açık olan tüm dosyaları kaydeder.

source: <shortcut><keycap>F5</keycap></shortcut> <guimenu>File</guimenu><guimenuitem>Reload</guimenuitem>
tr: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Dosya</guimenu><guimenuitem>Yeniden Yükle</guimenuitem>

source: Reloads the current file.
tr: Geçerli dosyayı yeniden yükler.

source: <guimenu>File</guimenu><guimenuitem>Reload All</guimenuitem>
tr: <guimenu>Dosya</guimenu><guimenuitem>Tümünü Yeniden Yükle</guimenuitem>

source: Reloads all open files.
tr: Açık olan tüm dosyaları yeniden yükler.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Print...</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo></shortcut> <guimenu>Dosya</guimenu><guimenuitem>Yazdır…</guimenuitem>

source: Prints the file. Use <guilabel>Print to File (PDF)</guilabel> to generate a &PDF; file or select a range of pages to print only these pages to a new &PDF; file
tr: Dosyayı yazdırır. Bir &PDF; dosyası üretmek veya bir sayfa erimini bir &PDF; dosyasına aktarmak için <guilabel>Dosyaya Yazdır (PDF)</guilabel> seçeneğini kullanın

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Close</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo></shortcut> <guimenu>Dosya</guimenu><guimenuitem>Kapat</guimenuitem>

source: Closes the current file.
tr: Geçerli dosyayı kapatır.

source: <guimenu>File</guimenu><guimenuitem>Close All</guimenuitem>
tr: <guimenu>Dosya</guimenu><guimenuitem>Tümünü Kapat</guimenuitem>

source: Closes all open files.
tr: Açık olan tüm dosyaları kapatır.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Quit</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Dosya</guimenu><guimenuitem>Çık</guimenuitem>

source: Exits the program.
tr: Programdan çıkar.

source: The Edit Menu
tr: Düzen Menüsü

source: The <guimenu>Edit</guimenu> menu allows you to modify the currently open file.
tr: <guimenu>Düzen</guimenu> menüsü, açık olan dosya üzerinde değişiklikler yapmanızı sağlar.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Undo</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu><guimenuitem>Geri Al</guimenuitem>

source: Undo the last action you performed in the file.
tr: Dosya üzerinde yapılan son değişikliği geri alır.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Redo</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu><guimenuitem>Yinele</guimenuitem>

source: Redo the last action you performed in the file.
tr: Dosya üzerinde yapılan son değişikliği yineler.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Cut</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu><guimenuitem>Kes</guimenuitem>

source: Removes the currently selected portion of the file, if any, and places a copy of it in the clipboard buffer.
tr: Dosyanın o anda seçili olan kısmını kaldırır ve panoya arabelleğine bir kopyasını yerleştirir.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Copy</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu><guimenuitem>Kopyala</guimenuitem>

source: Places a copy of the currently selected portion of the file, if any, in the clipboard buffer.
tr: Dosyanın seçili bölümünün bir kopyasını (varsa) pano arabelleğine yerleştirir.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Paste</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu><guimenuitem>Yapıştır</guimenuitem>

source: Copies the first item in the clipboard buffer to the current location in the file, if any.
tr: Pano arabelleğindeki ilk ögeyi, varsa dosyadaki geçerli konuma kopyalar.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Select All</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu><guimenuitem>Tümünü Seç</guimenuitem>

source: Selects the entire contents of the currently open file.
tr: Açık olan dosyanın tüm içeriğini seçer.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Find...</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu><guimenuitem>Bul…</guimenuitem>

source: Allows you to search for text in the currently open file.
tr: Açık olan dosyada metin aramanızı sağlar.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Replace...</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu><guimenuitem>Değiştir…</guimenuitem>

source: Allows you to search for text in the currently open file and replace it with something else.
tr: Açık olan dosyada metin aramanıza ve onu başka bir şeyle değiştirmenize olanak sağlar.

source: <shortcut><keycap>F3</keycap></shortcut> <guimenu>Edit</guimenu><guimenuitem>Find Next</guimenuitem>
tr: <shortcut><keycap>F3</keycap></shortcut> <guimenu>Düzen</guimenu><guimenuitem>Sonrakini Bul</guimenuitem>

source: Go to the next match of the last Find operation.
tr: Arama işleminde eşleşen sonraki sonuca gider.

source: <shortcut><keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Find Previous</guimenuitem>
tr: <shortcut><keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu><guimenuitem>Öncekini Bul</guimenuitem>

source: Go to the previous match of the last Find operation.
tr: Arama işleminde eşleşen önceki sonuca gider.

source: The View Menu
tr: Görünüm Menüsü

source: The <guimenu>View</guimenu> menu allows you to change the layout of the currently open file and/or the running application.
tr: <guimenu>Görünüm</guimenu> menüsü, o anda açık olan dosyanın ve/veya çalışan uygulamanın yerleşimini değiştirmenize olanak tanır.

source: This menu has different options depending on the application you are using.
tr: Bu menüde kullandığınız uygulamaya bağlı olarak farklı seçenekler bulunur.

source: The Tools Menu
tr: Araçlar Menüsü

source: The <guimenu>Tools</guimenu> menu allows you to perform certain actions on the currently open file.
tr: <guimenu>Araçlar</guimenu> menüsü, halihazırda açık olan dosya üzerinde belirli eylemleri gerçekleştirmenize olanak tanır.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>O</keycap></keycombo></shortcut> <guimenu>Tools</guimenu><guimenuitem>Automatic Spell Checking</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>O</keycap></keycombo></shortcut> <guimenu>Araçlar</guimenu><guimenuitem>Kendiliğinden Yazım Denetimi</guimenuitem>

source: Check for spelling errors as you type. For more information, see <xref linkend="spellcheck-auto"/>.
tr: Yazarken yazdıklarınızı denetleyin Daha fazla bilgi için <xref linkend="spellcheck-auto"/> bölümüne bakın.

source: <guimenu>Tools</guimenu><guimenuitem>Spelling...</guimenuitem>
tr: <guimenu>Araçlar</guimenu><guimenuitem>Yazım Denetimi…</guimenuitem>

source: This initiates the spellchecking program - a program designed to help the user catch and correct any spelling errors. For more information, see <xref linkend="spellcheck-check"/>.
tr: Bu, yazım denetimi uygulamasını başlatır — bu uygulama kullanıcının yazım hatalarını yakalamasına ve düzeltmesine yardımcı olur. Daha fazla bilgi için <xref linkend="spellcheck-check"/> bölümüne bakın.

source: <guimenu>Tools</guimenu><guimenuitem>Spelling (from cursor)...</guimenuitem>
tr: <guimenu>Araçlar</guimenu><guimenuitem>Yazım Denetimi (İmleçten İtibaren)…</guimenuitem>

source: This initiates the spellchecking program, but only checks the portion of the document from the current location of the cursor to the end. For more information, see <xref linkend="spellcheck-check"/>.
tr: Bu, yazım denetimi programını başlatır; ancak belgenin yalnızca imlecin geçerli konumundan sonuna kadar olan kısmını denetler. Daha fazla bilgi için <xref linkend="spellcheck-check"/> bölümüne bakın.

source: <guimenu>Tools</guimenu><guimenuitem>Spellcheck Selection...</guimenuitem>
tr: <guimenu>Araçlar</guimenu><guimenuitem>Yazım Denetimi Seçimi…</guimenuitem>

source: This initiates the spellchecking program, but only checks the currently selected text in the document. For more information, see <xref linkend="spellcheck-check"/>.
tr: Bu, yazım denetimi programını başlatır; ancak yalnızca belgede seçili olan metni denetler. Daha fazla bilgi için <xref linkend="spellcheck-check"/> bölümüne bakın.

source: <guimenu>Tools</guimenu><guimenuitem>Change Dictionary...</guimenuitem>
tr: <guimenu>Araçlar</guimenu><guimenuitem>Sözlüğü Değiştir…</guimenuitem>

source: This allows you to change the dictionary used to check spellings. For more information, see <xref linkend="spellcheck-config"/>.
tr: Bu, yazım denetimi için kullanılan sözlüğü değiştirmenize olanak tanır. Daha fazla bilgi için <xref linkend="spellcheck-config"/> bölümüne bakın.

source: The Settings Menu
tr: Ayarlar Menüsü

source: The <guimenu>Settings</guimenu> allows you to customize the application.
tr: <guimenu>Ayarlar</guimenu> menüsü, uygulamayı özelleştirmenize olanak tanır.

source: This menu typically contains the following items:
tr: Bu menü, genellikle aşağıdaki ögeleri içerir:

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Menubar</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> </shortcut> <guimenu>Ayarlar</guimenu> <guimenuitem>Menü Çubuğunu Göster</guimenuitem>

source: <action>Toggle the Menubar display</action> on and off. Once hidden it can be made visible using the shortcut <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> again. If the menubar is hidden, the context menu opened with a right mouse button click anywhere in the view area has an extra entry <guimenuitem>Show Menubar</guimenuitem>.
tr: <action>Menü Çubuğu</action>’nu görüntülemeyi açar/kapatır. Gizlendikten sonra, <keycombo action="simul">&Ctrl; <keycap>M</keycap></keycombo> kısayolunu kullanarak yeniden görünür duruma getirilebilir. Menü çubuğu gizliyse görünüm alanının herhangi bir yerinde farenin sağ düğmesiyle tıklandığında açılan bağlam menüsünde ek bir <guimenuitem>Menü Çubuğunu Göster</guimenuitem> girdisi bulunur.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Statusbar</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Durum Çubuğunu Göster</guimenuitem>

source: Toggles the display of the statusbar on and off. Some &kde; applications use statusbar at the bottom of their screen to display useful information.
tr: Durum çubuğunu açar ve kapatır. Bazı &kde; uygulamaları, yararlı bilgileri görüntülemek için ekranın altındaki durum çubuğunu kullanır.

source: <guimenu>Settings</guimenu><guisubmenu>Toolbars Shown</guisubmenu>
tr: <guimenu>Ayarlar</guimenu><guisubmenu>Gösterilen Araç Çubukları</guisubmenu>

source: Allows you to show and hide the various toolbars supported by the application.
tr: Uygulama tarafından desteklenen çeşitli araç çubuklarını gösterip gizlemenizi sağlar.

source: <guimenu>Settings</guimenu><guimenuitem>Show Statusbar</guimenuitem>
tr: <guimenu>Ayarlar</guimenu><guimenuitem>Durum Çubuğunu Göster</guimenuitem>

source: When checked, this displays a small bar at the bottom of the application containing information about the status. When unchecked the status bar is hidden.
tr: İşaretlendiğinde, uygulamanın alt kısmında durumla ilgili bilgileri içeren küçük bir çubuk görüntülenir. İşaretlenmediğinde durum çubuğu gizlenir.

source: <guimenu>Settings</guimenu><guimenuitem>Configure Shortcuts...</guimenuitem>
tr: <guimenu>Ayarlar</guimenu><guimenuitem>Kısayolları Yapılandır…</guimenuitem>

source: Allows you to enable, disable, and modify keyboard shortcuts. For more information, see <xref linkend="shortcuts"/>.
tr: Kısayolları etkinleştirmenizi, devre dışı bırakmanızı ve değiştirebilmenizi sağlar. Daha fazla bilgi için <xref linkend="shortcuts"/> bölümüne bakın.

source: <guimenu>Settings</guimenu><guimenuitem>Configure Toolbars...</guimenuitem>
tr: <guimenu>Ayarlar</guimenu><guimenuitem>Araç Çubuklarını Yapılandır…</guimenuitem>

source: Allows you to customize the contents, layout, text, and icons of toolbars. For more information, see <xref linkend="toolbars"/>.
tr: Araç çubuklarının içeriğini, yerleşimini, metnini ve simgelerini özelleştirmenizi sağlar. Daha fazla bilgi için <xref linkend="toolbars"/> bölümüne bakın.

source: <guimenu>Settings</guimenu><guimenuitem>Configure Notifications...</guimenuitem>
tr: <guimenu>Ayarlar</guimenu><guimenuitem>Bildirimleri Yapılandır…</guimenuitem>

source: This item displays a standard &kde; notifications configuration dialog, where you can change the notifications (sounds, visible messages, &etc;) used by the application.
tr: Bu öge, standart bir &kde; uygulaması tarafından kullanılan bildirimleri (sesler, görünür iletiler vb.) değiştirebileceğiniz bir bildirim yapılandırma iletişim kutusu görüntüler.

source: For more information how to configure notifications please read the documentation for the &systemsettings; module <ulink url="help:/kcontrol/kcmnotify/index.html">Manage Notifications</ulink>.
tr: Bildirimleri yapılandırma ile ilgili daha fazla bilgi için &systemsettings; <ulink url="help:/kcontrol/kcmnotify/index.html">Bildirimleri Yönet</ulink> modülünün belgelendirmesini okuyun.

source: <guimenu>Settings</guimenu><guimenuitem>Configure <replaceable>Application</replaceable>...</guimenuitem>
tr: <guimenu>Ayarlar</guimenu><guimenuitem><replaceable>“Uygulama”</replaceable> Uygulamasını Yapılandır…</guimenuitem>

source: Opens the configuration panel for the currently running application.
tr: Şu anda çalışan uygulamanın yapılandırma panelini açar.

source: The Help Menu
tr: Yardım Menüsü

source: The <guimenu>Help</guimenu> menu gives you access to the application's documentation and other useful resources.
tr: <guimenu>Yardım</guimenu> menüsü, uygulamanın belgelendirmesine ve başka kullanışlı özkaynaklara erişmenizi sağlar.

source: <shortcut> <keycombo action="simul"><keycap>F1</keycap></keycombo> </shortcut> <guimenu>Help</guimenu> <guimenuitem><replaceable>Application</replaceable> Handbook</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>F1</keycap></keycombo> </shortcut> <guimenu>Yardım</guimenu> <guimenuitem><replaceable>Uygulama</replaceable> El Kitabı</guimenuitem>

source: <action>Invokes the KDE Help system</action> starting at the running application's handbook.
tr: Çalışan uygulamanın el kitabını gösteren <action>KDE Yardım</action> sistemini çağırır.

source: <shortcut> <keycombo action="simul">&Shift;<keycap>F1</keycap></keycombo> </shortcut> <guimenu>Help</guimenu> <guimenuitem>What's This?</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Shift;<keycap>F1</keycap></keycombo> </shortcut> <guimenu>Yardım</guimenu> <guimenuitem>Bu Nedir?</guimenuitem>

source: <action>Changes the mouse cursor to a combination arrow and question mark.</action> Clicking on items within the application; will open a help window (if one exists for the particular item) explaining the item's function.
tr: <action>Fare imlecini, bir ok ve soru işaretinden oluşan yeni bir işarete dönüştürür.</action> Uygulama içindeki ögelere tıklamak, o ögenin işlevlerini açıklayan bir yardım penceresi açar (o öge için varsa).

source: <guimenu>Help</guimenu> <guimenuitem>Tip of the Day</guimenuitem>
tr: <guimenu>Yardım</guimenu> <guimenuitem>Günün İpucu</guimenuitem>

source: This command <action>opens the <guilabel>Tip of the Day</guilabel> dialog</action>. You can page through all the tips by using the buttons on the dialog and select to show the tips at startup.
tr: Bu komut, <action><guilabel>Günün İpucu</guilabel> iletişim kutusunu açar</action>. İletişim kutusundaki düğmeleri kullanarak tüm ipuçlarını tarayabilir ve başlangıçta ipuçlarını gösterilmesini seçebilirsiniz.

source: Note: Not all applications provide these tips.
tr: Not: Tüm uygulamalar bu ipuçlarını sağlamaz.

source: <guimenu>Help</guimenu> <guimenuitem>Report Bug...</guimenuitem>
tr: <guimenu>Yardım</guimenu> <guimenuitem>Hata Bildir…</guimenuitem>

source: <action>Opens the Bug report dialog</action> where you can report a bug or request a <quote>wishlist</quote> feature.
tr: <action>Hata bildirme iletişim kutusunu açar</action>, buradan bir hata bildirebilir veya özellik <quote>isteği</quote> yapabilirsiniz.

source: <guimenu>Help</guimenu> <guimenuitem>Donate</guimenuitem>
tr: <guimenu>Yardım</guimenu> <guimenuitem>Bağış Yap</guimenuitem>

source: Opens the <ulink url="https://www.kde.org/community/donations">Donations page</ulink> where you can support &kde; and its projects.
tr: &kde;’ye ve projelerine doğrudan bağış yapabileceğiniz bir <ulink url="https://www.kde.org/community/donations">Bağış</ulink> sayfasını açar.

source: <guimenu>Help</guimenu> <guimenuitem>Switch Application Language...</guimenuitem>
tr: <guimenu>Yardım</guimenu> <guimenuitem>Dili Yapılandır…</guimenuitem>

source: <action>Opens a dialog</action> where you can edit the <guilabel>Primary language</guilabel> and <guilabel>Fallback language</guilabel> for this application.
tr: Açık uygulamanın <guilabel>Birincil dil</guilabel>’ini ve <guilabel>Yedek dil</guilabel>’ini yapılandırabileceğiniz bir <action>iletişim kutusu açar</action>.

source: <guimenu>Help</guimenu> <guimenuitem>About <replaceable>Application</replaceable></guimenuitem>
tr: <guimenu>Yardım</guimenu> <guimenuitem><replaceable>“Uygulama”</replaceable> Hakkında</guimenuitem>

source: This will display version and author information for the running application.
tr: Bu, çalışan uygulamanın sürüm ve yazar bilgisini görüntüler

source: <guimenu>Help</guimenu> <guimenuitem>About KDE</guimenuitem>
tr: <guimenu>Yardım</guimenu> <guimenuitem>KDE Hakkında</guimenuitem>

source: This displays the &kde; Development Platform version and other basic information.
tr: Bu, &kde; Geliştirme Platformu sürümünü ve diğer temel bilgileri görüntüler.

source: Thanks and Acknowledgments
tr: Teşekkürler ve Destek Olanlar

source: Special thanks to an anonymous Google Code-In 2011 participant for writing much of this documentation.
tr: Bu belgelendirmenin çoğunu yazdığı için anonim bir Google Code-In 2011 katılımcısına özellikle teşekkür ederiz.

source: Common Keyboard Shortcuts
tr: Ortak Klavye Kısayolları

source: The &plasma-workspaces; provide keyboard shortcuts that allow you to perform many tasks without touching your mouse. If you use your keyboard frequently, using these can save you lots of time.
tr: &plasma-workspaces;, farenize dokunmadan birçok görevi yerine getirebilmenizi sağlayan klavye kısayolları sağlar. Klavyenizi sıklıkla kullanıyorsanız bunları kullanmak size bayağı zaman kazandırabilir.

source: This list contains the most common shortcuts supported by the workspace itself and many applications available within. Every application also provides its own shortcuts, so be sure to check their manuals for a comprehensive listing.
tr: Bu liste, çalışma alanının kendisi tarafından desteklenen en yaygın kısayolları ve içinde bulunan birçok uygulamayı içerir. Her uygulamanın kendi kısayolları da vardır; bu nedenle kapsamlı bir liste için kılavuzlarını denetlediğinizden emin olun.
