Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/fundamentals_config.po
Languages: tr

source: Customizing &kde; software
tr: &kde; Yazılımlarını Özelleştirmek

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Serdar</firstname><surname>Soytetir</surname><affiliation><address><email>tulliana@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Customizing Toolbars
tr: Araç Çubuklarını Özelleştirmek

source: The &gwenview; Toolbar
tr: &gwenview; Araç Çubuğu

source: The &gwenview; toolbar.
tr: &gwenview; araç çubuğu.

source: The toolbar in <ulink url="https://kde.org/applications/graphics/gwenview/">&gwenview;</ulink>.
tr: <ulink url="https://kde.org/applications/graphics/gwenview/">&gwenview;</ulink> uygulamasındaki araç çubuğu.

source: Modifying Toolbar Items
tr: Araç Çubuğu Ögelerini Değiştirmek

source: To customize an application's toolbars, go to <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Toolbars...</guimenuitem></menuchoice> or right-click on a toolbar and select <guimenuitem>Configure Toolbars...</guimenuitem>.
tr: Bir uygulamanın araç çubuklarını özelleştirmek için <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Araç Çubuklarını Yapılandır…</guimenuitem></menuchoice> seçeneğini kullanabilir veya bir araç çubuğuna sağ tıklayıp <guimenuitem>Araç Çubuklarını Yapılandır…</guimenuitem>’ı seçebilirsiniz.

source: On the left side of the toolbar configuration panel, the available items that you can put in your toolbar are shown. On the right, the ones that already appear on the toolbar are shown. At the top, you can select the toolbar you wish to modify or view.
tr: Araç çubuğu yapılandırma panelinin sol tarafında araç çubuğunuza ekleyebileceğiniz kullanılabilir ögeler gösterilir. Sağda, araç çubuğunda halihazırda görünenler vardır. Üst kısımda değiştirmek veya görüntülemek istediğiniz araç çubuğunu seçebilirsiniz.

source: Above each side of the panel there is a <guilabel>Filter</guilabel> text box you can use to easily find items in the list.
tr: Panelin her iki yanında da bir <guilabel>Süzgeç</guilabel> metin kutusu bulunur. Bu ögeleri kullanarak listedeki ögeler içerisinde kolayca arama yapabilirsiniz.

source: The Customize Toolbars Window
tr: Araç Çubuklarını Özelleştir Penceresi

source: The Customize Toolbars window.
tr: Araç çubuklarını özelleştir penceresi.

source: The Customize Toolbars window in &gwenview; with the <guibutton>Previous</guibutton> button selected.
tr: &gwenview; içindeki Araç Çubuklarını Özelleştir penceresi <guibutton>Önceki</guibutton> düğmesi seçiliyken.

source: Adding an Item
tr: Bir Öge Eklemek

source: You can add an item to your toolbar by selecting it from the left side and clicking on the right arrow button.
tr: Araç çubuğunuza bir öğeyi sol taraftan seçip sağ ok düğmesine tıklayarak ekleyebilirsiniz.

source: Removing an Item
tr: Bir Ögeyi Kaldırmak

source: You can remove an item by selecting it and clicking the left arrow button.
tr: Bir öğeyi seçip sol ok düğmesine tıklayarak kaldırabilirsiniz.

source: Changing the Position of Items
tr: Ögelerin Konumunu Değiştirmek

source: You can change the position of the items by moving them lower or higher in the list. To move items lower, press the down arrow button, while to move items higher press the up arrow button. You can also change items' position by dragging and dropping them.
tr: Ögeleri listede aşağı veya yukarı taşıyarak konumlarını değiştirebilirsiniz. Ögeleri aşağıya taşımak için aşağı ok düğmesine, ögeleri daha yükseğe taşımak için ise yukarı ok düğmesine basın. Ögelerin konumunu sürükleyip bırakarak da değiştirebilirsiniz.

source: On horizontal toolbars, the item that's on top will be the one on the left. On vertical toolbars, items are arranged as they appear in the toolbar.
tr: Yatay araç çubuklarında üstteki öge soldaki öge olacaktır. Dikey araç çubuklarında ögeler, araç çubuğunda göründükleri şekilde düzenlenir.

source: Adding a Separator
tr: Bir Ayırıcı Eklemek

source: You can add separator lines between items by adding a <guilabel>--- separator ---</guilabel> item to the toolbar.
tr: Araç çubuğuna bir <guilabel>--- ayırıcı---</guilabel> koyarak ögeler arasına ayırıcı çizgiler ekleyebilirsiniz.

source: Restoring Defaults
tr: Öntanımlıları Geri Yüklemek

source: You can restore your toolbar to the way it was when you installed the application by pressing the <guibutton>Defaults</guibutton> button at the bottom of the window and then confirming your decision.
tr: Pencerenin altındaki <guibutton>Öntanımlılar</guibutton> düğmesine basıp kararınızı onaylayarak araç çubuğunuzu uygulamayı yüklediğiniz zamanki haline geri yükleyebilirsiniz.

source: Changing Text and Icons
tr: Metni ve Simgeleri Değiştirmek

source: You can change the icon and text of individual toolbar items by selecting an item and clicking either the <guibutton>Change Icon...</guibutton> or <guibutton>Change Text...</guibutton> button.
tr: <guibutton>Simgeyi Değiştir…</guibutton> ve/veya <guibutton>Metni Değiştir…</guibutton> düğmelerine tıklayarak belirli bir araç çubuğu ögesinin simgesini ve/veya metnini değiştirebilirsiniz.

source: Customizing Toolbar Appearance
tr: Araç Çubuğu Görünüşünü Özelleştirmek

source: You can change the appearance of toolbars by right-clicking on a toolbar to access it's context menu.
tr: Bağlam menüsüne erişmek için bir araç çubuğuna sağ tıklayarak araç çubuklarının görünüşünü değiştirebilirsiniz.

source: Text Position
tr: Metin Konumu

source: You can change the appearance of text on toolbars in the <guisubmenu>Text Position</guisubmenu> submenu of a toolbar's context menu.
tr: Araç çubuklarındaki metnin görünüşünü, bir araç çubuğunun bağlam menüsünün <guisubmenu>Metin Konumu</guisubmenu> alt menüsünden değiştirebilirsiniz.

source: You can choose from:
tr: Seçenekler şunlardır:

source: <guimenuitem>Icons</guimenuitem> - only the icon for each toolbar item will appear.
tr: <guimenuitem>Simgeler</guimenuitem> — tüm araç çubuğu ögeleri için sadece simge gösterilir.

source: <guimenuitem>Text</guimenuitem> - only the text label for each toolbar item will appear.
tr: <guimenuitem>Metin</guimenuitem> — tüm araç çubuğu ögeleri için sadece metin gösterilir.

source: <guimenuitem>Text Alongside Icons</guimenuitem> - the text label will appear to the right of each toolbar item's icon
tr: <guimenuitem>Simge Yanında Metin</guimenuitem> — tüm araç çubuğu ögelerinin simgelerinin sağında metin gösterilir

source: <guimenuitem>Text Under Icons</guimenuitem> - the text label will appear underneath each toolbar item's icon
tr: <guimenuitem>Simge Altında Metin</guimenuitem> — tüm araç çubuğu ögelerinin simgelerinin altında metin gösterilir

source: You can also show or hide text for individual toolbar items by right-clicking on an item and checking or unchecking the item under <guilabel>Show Text</guilabel>.
tr: Ayrıca, bir ögeye sağ tıklayarak ve <guilabel>Metni Göster</guilabel> altında ögeyi işaretleyerek veya işaretini kaldırarak, tek tek araç çubuğu ögelerinin metnini gösterebilir veya gizleyebilirsiniz.

source: Icon Size
tr: Simge Boyutu

source: You can change the size of toolbar items' icons by selecting <guisubmenu>Icon Size</guisubmenu> from the toolbar's context menu.
tr: Araç çubuğu bağlam menüsünden <guisubmenu>Simge Boyutu</guisubmenu>’nu seçerek araç çubuğu ögelerinin simgelerinin boyutunu değiştirebilirsiniz.

source: You can choose from the following options: (each lists the icon size in pixels)
tr: Aşağıdaki seçenekler arasından seçim yapabilirsiniz: (her biri simge boyutunu piksel türünden listeler)

source: Small (16x16)
tr: Küçük (16 × 16)

source: <guimenuitem>Medium (22x22)</guimenuitem> [the default value]
tr: <guimenuitem>Orta (22 × 22)</guimenuitem> [öntanımlı değer]

source: Large (32x32)
tr: Büyük (32 × 32)

source: Huge (48x48)
tr: Çok Büyük (48 × 48)

source: Moving Toolbars
tr: Araç Çubuklarını Taşımak

source: In order to move toolbars, you must <quote>unlock</quote> them. To do so, uncheck <guimenuitem>Lock Toolbar Positions</guimenuitem> from a toolbar's context menu. To restore the lock, simply recheck this menu item.
tr: Araç çubuklarını taşımak için bunların <quote>kilidini açmanız</quote> gerekir. Bunu yapmak için araç çubuğunun içerik menüsünden <guimenuitem>Araç Çubuğu Konumlarını Kilitle</guimenuitem> seçeneğinin işaretini kaldırın. Kilidi geri yüklemek için bu menü öğesini yeniden işaretlemeniz yeterlidir.

source: You can change a toolbar's position from the <guisubmenu>Orientation</guisubmenu> submenu of its context menu.
tr: Bir araç çubuğunun konumunu, bağlam menüsünün <guisubmenu>Yönelim</guisubmenu> alt menüsünden değiştirebilirsiniz.

source: <guimenuitem>Top</guimenuitem> [the default in many applications]
tr: <guimenuitem>Üst</guimenuitem> [birçok uygulamada öntanımlıdır]

source: Left
tr: Sol

source: Right
tr: Sağ

source: Bottom
tr: Alt

source: You can also move a toolbar by clicking and holding onto the dotted line at the left of horizontal toolbars or the top of vertical toolbars and dragging it to your desired location.
tr: Ayrıca yatay araç çubuklarının solundaki veya dikey araç çubuklarının üst kısmındaki noktalı çizgiye tıklayıp basılı tutarak ve onu istediğiniz konuma sürükleyerek de bir araç çubuğunu taşıyabilirsiniz.

source: Show/Hide Toolbars
tr: Araç Çubuklarını Göster/Gizle

source: If your application has only one toolbar, you can hide a toolbar by deselecting <guimenuitem>Show Toolbar</guimenuitem> from either the toolbar's context menu or the <guimenu>Settings</guimenu> menu. To restore the toolbar, select <guimenuitem>Show Toolbar</guimenuitem> from the <guimenu>Settings</guimenu> menu. Note that toolbars must be <quote>unlocked</quote> to hide them from their context menu; see <xref linkend="toolbars-appearance-move"/> for more information.
tr: Uygulamanızda yalnızca bir araç çubuğu varsa araç çubuğunun bağlam menüsünden veya <guimenu>Ayarlar</guimenu> menüsünden <guimenuitem>Araç Çubuğunu Göster</guimenuitem> ögesinin seçimini kaldırarak bir araç çubuğunu gizleyebilirsiniz. Araç çubuğunu geri yüklemek için <guimenu>Ayarlar</guimenu> menüsünden <guimenuitem>Araç Çubuğunu Göster</guimenuitem> seçeneğini seçin.

source: If your application has more than one toolbar, a submenu called <guisubmenu>Toolbars Shown</guisubmenu> will appear in the context menu and <guimenu>Settings</guimenu> menu instead of the above menu entry. From that menu you may select individual toolbars to hide and show.
tr: Uygulamanın birden fazla araç çubuğu varsa bağlam menüsünde <guisubmenu>Gösterilen Araç Çubukları</guisubmenu> alt menü ögesi gösterilir ve üstteki menü ögesinin yerine <guimenu>Ayarlar</guimenu> menüsü gelir. Bu menüden belirli bir araç çubuğununun gösterilip gizlenmesini sağlayabilirsiniz.

source: Thanks and Acknowledgments
tr: Teşekkürler ve Destek Olanlar

source: Thanks to an anonymous Google Code-In 2011 participant for writing much of this section.
tr: Bu bölümün çoğunu yazdığı için anonim bir Google Code-In 2011 katılımcısına teşekkür ederiz.

source: Using and Customizing Shortcuts
tr: Kısayolları Kullanmak ve Özelleştirmek

source: Introduction
tr: Giriş

source: Many &kde; applications allow you to configure keyboard shortcuts. To open the standard keyboard shortcuts configuration panel, go to <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Shortcuts...</guimenuitem></menuchoice>.
tr: Birçok &kde; uygulaması, uygulama kısayollarını yapılandırmanıza izin verir. Standart klavye kısayolları panelini açmak için <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Kısayolları Yapılandır…</guimenuitem></menuchoice> yolunu izleyin.

source: In the Configure Shortcuts window, you will see a list of all the shortcuts available in the current application. You can use the search box at the top to search for the shortcut you want.
tr: Kısayolları Yapılandır penceresinde, geçerli uygulamada mevcut olan tüm kısayolların bir listesini göreceksiniz. İstediğiniz kısayolu aramak için üstteki arama kutusunu kullanabilirsiniz.

source: The Customize Shortcuts Window
tr: Kısayolları Özelleştir Penceresi

source: The Customize Shortcuts window.
tr: Kısayolları Özelleştir penceresi.

source: Searching for shortcuts with <userinput>file</userinput> in <ulink url="https://kde.org/applications/system/dolphin/">&dolphin;</ulink>.
tr: <ulink url="https://kde.org/applications/system/dolphin/">&dolphin;</ulink> içinde <userinput>dosya</userinput> içeren kısayolları bulmak.

source: Changing a Shortcut
tr: Bir Kısayolu Değiştirmek

source: To change a shortcut, first click on the name of a shortcut you want to change. You will see a radio group where you can choose whether to set the shortcut to its default value, or select a new shortcut for the selected action. To set a new shortcut, choose <guilabel>Custom</guilabel> and click on the button next to it. Then just type the shortcut you would like to use, and your changes will be saved.
tr: Bir kısayolu değiştirmek için öncelikle değiştirmek istediğiniz kısayolun adına tıklayın. Kısayolu öntanımlı değerine ayarlamayı veya seçilen eylem için yeni bir kısayol seçmeyi seçebileceğiniz bir radyo grubu göreceksiniz. Yeni bir kısayol ayarlamak için <guilabel>Özel</guilabel>’i seçin ve yanındaki düğmeye tıklayın. Daha sonra kullanmak istediğiniz kısayolu yazmanız yeterlidir; sonrasında değişiklikleriniz kaydedilir.

source: Setting a Shortcut
tr: Bir Kısayol Ayarlamak

source: The Customize Shortcuts window demonstrating how to set a shortcut.
tr: Kısayolun nasıl ayarlanacağını gösteren Kısayolları Özelleştir penceresi.

source: Resetting Shortcuts
tr: Kısayolları Sıfırlamak

source: There is a button at the bottom of the window, called <guibutton>Defaults</guibutton>. Clicking on this button will reset all your custom shortcuts to their default values.
tr: Pencerenin alt kısmında <guibutton>Öntanımlılar</guibutton> adında bir düğme bulunur. Bu düğmeye tıkladığınızda tüm özel kısayollarınız öntanımlı değerlerine sıfırlanır.

source: You can also reset an individual shortcut to its default value by selecting it, and choosing the <guilabel>Default</guilabel> radio button.
tr: Ayrıca tek bir kısayolu seçip <guilabel>Öntanımlı</guilabel> radyo düğmesini seçerek öntanımlı değerine sıfırlayabilirsiniz.

source: Removing a Shortcut
tr: Bir Kısayolu Kaldırmak

source: To remove a shortcut, select it from the list, then click the remove icon (a black arrow with a cross) to the right of the button that allows you to select a shortcut.
tr: Bir kısayolu kaldırmak için listeden seçin ve ardından kısayol seçmenizi sağlayan düğmenin sağındaki kaldır simgesine (çarpı işaretli siyah ok) tıklayın.

source: <title>Working with Schemes</title>
tr: <title>Şemalarla Çalışmak</title>

source: Schemes are keyboard shortcuts configuration profiles, so you can create several profiles with different shortcuts and switch between these profiles easily.
tr: Şemalar klavye kısayolu yapılandırma profilleridir; böylece farklı kısayollara sahip birkaç profil oluşturabilir ve bu profiller arasında kolayca geçiş yapabilirsiniz.

source: <screeninfo>Working with Schemes</screeninfo>
tr: <screeninfo>Şemalarla Çalışmak</screeninfo>

source: The Customize Shortcuts window displaying the scheme editing tools.
tr: Şema düzenleme araçlarını gösteren Kısayolları Özelleştir penceresi.

source: Editing a scheme called <userinput>work</userinput>.
tr: <userinput>work</userinput> adlı bir şemayı düzenlemek.

source: To see a menu allowing you to edit schemes, click on the <guibutton>Manage Schemes</guibutton> button at the bottom of the form. The following options will appear:
tr: Şemaları düzenlemenize izin veren bir menü görmek için formun altındaki <guibutton>Şemaları Yönet</guibutton> düğmesine tıklayın. Aşağıdaki seçenekler görünecektir:

source: Current Scheme
tr: Geçerli Şema

source: Allows you to switch between your schemes.
tr: Şemalar arasında geçiş yapmanızı sağlar.

source: New...
tr: Yeni…

source: Creates a new scheme. This opens a window that lets you select a name for your new scheme.
tr: Yeni bir şema oluşturur. Bu, yeni planınız için bir ad seçmenizi sağlayan bir pencere açar.

source: Delete
tr: Sil

source: Deletes the current scheme.
tr: Geçerli şemayı siler.

source: More Actions
tr: Daha Fazla Eylem

source: Opens the following menu:
tr: Şu menüyü açar:

source: Save Shortcuts to scheme
tr: Kısayolları Şemaya Kaydet

source: Save the current shortcuts to the current scheme.
tr: Geçerli kısayolları geçerli şemaya kaydedin.

source: Export Scheme...
tr: Şemayı Dışa Aktar…

source: Exports the current scheme to a file .
tr: Geçerli şemayı bir dosyaya dışa aktarır.

source: Import Scheme...
tr: Şema İçe Aktar…

source: Imports a scheme from a file .
tr: Bir dosyadan şema içe aktarır.

source: Printing Shortcuts
tr: Yazdırma Kısayolları

source: You can print out a list of shortcuts for easy reference by clicking the <guibutton>Print</guibutton> button at the bottom of the window.
tr: Pencerenin alt kısmındaki <guibutton>Yazdır</guibutton> düğmesine tıklayarak, kolay başvuru için kısayolların bir listesini yazdırabilirsiniz.

source: Special thanks to Google Code-In 2011 participant Alexey Subach for writing much of this section.
tr: Bu bölümün çoğunu yazdığı için Google Code-In 2011 katılımcısı Alexey Subach’a özellikle teşekkür ederiz.
