Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/gcompris.po
Languages: tr

source: The &gcompris; Administration Handbook
tr: &gcompris; Yönetimi El Kitabı

source: The &gcompris; Team
tr: &gcompris; Takımı

source: Developers
tr: Geliştiriciler

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: &gcompris; is a multi-activity educational software.
tr: &gcompris;, birden çok etkinlik içeren bir eğitim yazılımıdır.

source: education
tr: eğitim

source: children
tr: çocuklar

source: games
tr: oyunlar

source: Administration Handbook
tr: Yönetim El Kitabı

source: Introduction
tr: Giriş

source: &gcompris; is a rich educational software suite which contains a wide range of activities.
tr: &gcompris;, çok çeşitli etkinlikler içeren, zengin bir eğitim yazılım paketidir.

source: It offers various activities aimed at covering a variety of fields. The topics include reading and typing, arithmetics, geography, sciences, and other topics. It is meant to be used both at home and at school.
tr: Çeşitli alanları kapsamayı amaçlayan çeşitli etkinlikler sunar. Konular arasında okuma ve yazma, aritmetik, coğrafya, fen bilimleri ve diğer konular yer almaktadır. Hem evde hem de okulda kullanılmak üzere hazırlanmıştır.

source: The purpose of &gcompris; is to provide playful activities but always educational.
tr: &gcompris;’in amacı eğlenceli; ancak her zaman eğitici etkinlikler sunmaktır.

source: &gcompris; is part of &kde; project and is placed under the <ulink url="https://www.gnu.org/licenses/agpl-3.0.html">AGPLv3 license</ulink>. All the code, except the engine for analog electricity activity is under <ulink url="https://www.gnu.org/licenses/gpl.html">GPLv3 license</ulink>.
tr: &gcompris;, &kde; projesinin bir parçasıdır ve <ulink url="https://www.gnu.org/licenses/agpl-3.0.html">AGPLv3 lisansı</ulink> altında yayımlanır. Analog elektrik etkinliği dışındaki tüm kod <ulink url="https://www.gnu.org/licenses/gpl.html">GPLv3 lisansı</ulink> altındadır.

source: &gcompris; is available on the following operating systems: &GNU;/&Linux;, &BSD;, &macOS;, &Windows;, Android. It requires a 3D card with support of <emphasis>OpenGL 2.1</emphasis> or higher. 32 bits color depth is mandatory.
tr: &gcompris;, aşağıdaki işletim sistemlerinde kullanılabilirdir: &GNU;/&Linux;, &BSD;, &macOS;, &Windows;, Android. <emphasis>OpenGL 2.1</emphasis> veya daha yukarısı için destek içeren bir 3B kart gerektirir. 32 bitlik renk derinliği zorunludur.

source: Installation
tr: Kurulum

source: The software is delivered under several forms. Follow the process according to your case.
tr: Yazılım, birkaç biçimde sunulur. Sizin durumunuza uygun olanı aşağıdan seçin.

source: &GNU;/&Linux;: use the packages delivered by your &GNU;/&Linux; distribution. If &gcompris; is not packaged in your &Linux; distribution, please contact them to ask for the inclusion of &gcompris;.
tr: &GNU;/&Linux;: &GNU;/&Linux; dağıtımınız tarafından sağlanan paketleri kullanın. &gcompris; kullandığınız &Linux; dağıtımında yoksa lütfen &gcompris;’in içerilmesi için onlarla iletişime geçin.

source: &Windows;: delivered under a classic installer for &Windows; or via the Microsoft Store.
tr: &Windows;: Klasik bir &Windows; kurulum programı veya Microsoft Store üzerinden sağlanır.

source: &macOS;: delivered under a classic installer.
tr: &macOS;: Klasik bir disk kalıbı ile sağlanır.

source: Android: distributed by the F-Droid store or Google Play Store. APK file is also available.
tr: Android: F-Droid veya Google Play mağazası üzerinden sağlanır. APK dosyası da bulunur.

source: The User Interface
tr: Kullanıcı Arayüzü

source: The interface is designed for easy use by small children. &gcompris; is controlled with a mouse. Keyboard navigation is also available on most of the activities.
tr: Arayüz, küçük çocuklar tarafından kolay kullanım için tasarlanmıştır. &gcompris; bir fare ile denetlenir. Etkinliklerin çoğunda klavye ile dolaşım da bulunur.

source: Main window
tr: Ana pencere

source: When you start the program, &gcompris; shows a graphical interface which presents the list of activities with a control bar at the bottom.
tr: Programı başlattığınızda &gcompris;, etkinliklerin listesini sunan bir grafik arayüz ve altta bir denetim çubuğu gösterir.

source: Here’s a screenshot of &gcompris; main window
tr: Burada &gcompris;’in ana penceresinin bir ekran görüntüsünü görebilirsiniz.

source: &gcompris; Main Window
tr: &gcompris; Ana Penceresi

source: Each icon represents an activity. Around each one, you can find small icons which give additional information about the activity. A simple click on the icon will lead you to an activity or a menu of activities. There are 8 sections (categories) of activities, which are placed on the top or on the left (only if your orientation is portrait). For example, there is section “Board Games”, which includes board games, like Chess, Tic-Tac-Toe or Align Four.
tr: Her simge bir etkinliği temsil eder. Her birinin etrafında, etkinlik hakkında ek bilgi veren küçük simgeler bulabilirsiniz. Simgeye basit bir tıklama sizi bir etkinliğe veya etkinlikler menüsüne götürecektir. Üstte veya solda (yalnızca yönünüz dikey ise) yer alan 8 etkinlik bölümü (kategorisi) vardır. Örneğin, Satranç, Üç Taş veya Dördünü Hizala gibi masa oyunlarını içeren “Masa Oyunları” bölümü vardır.

source: Some categories have subcategories to better filter the activities. For math activities, we have three subcategories: numeration, arithmetic and measures.
tr: Bazı kategorilerde etkinlikleri daha iyi süzmek için alt kategoriler bulunur. Matematik etkinlikleri için üç alt kategorimiz bulunmaktadır: Sayılar, aritmetik ve ölçüler.

source: The stars indicate the age group for which each game is designed:
tr: Yıldızlar, her oyunun hangi yaş grubu için tasarlandığını göstermektedir:

source: 1, 2 or 3 yellow stars — for 2 to 6 years old.
tr: 1, 2 veya 3 sarı yıldız — 2–6 yaş arası için.

source: 1, 2 or 3 red stars — greater than 6 years old.
tr: 1, 2 veya 3 kırmızı yıldız — 6 yaş üzeri için.

source: At the bottom of the screen there is a control bar for &gcompris;. The possible icons are (the icons are only displayed if they are available in the activity):
tr: Ekranın alt kısmında &gcompris; için bir denetim çubuğu bulunur. Olası simgeler şunlardır (simgeler yalnızca etkinlikte varsa görüntülenir):

source: Home — Leaves the current activity, returns to the previous menu.
tr: Ana Sayfa — Geçerli etkinliği terk eder, önceki menüye döner.

source: “OK” — Validate, confirm your answer. Some activities do not detect automatically whether or not the child has completed the task. In this case, you have to click on this icon. You can also use the &Enter; key on your keyboard.
tr: “OK” — Doğrulayın, yanıtınızı onaylayın. Bazı etkinlikler çocuğun görevi tamamlayıp tamamlamadığını kendiliğinden algılamaz. Bu durumda, bu simgeye tıklamanız gerekir. Klavyenizdeki &Enter; düğmesini de kullanabilirsiniz.

source: Light — Display a hint for the activity. We can help the children on some activities to guide them to find the answers.
tr: Işık — Etkinlik için bir ipucu gösterin. Bazı etkinliklerde çocuklara yanıtları bulmaları için yardımcı olabiliriz.

source: Arrows — The present level is displayed. Click on one of the arrows to select another level. Generally, the activities offer several levels whose numbers depend on the activity. In &gcompris;, it is possible to go to the next level without having completed the current level.
tr: Oklar — Geçerli düzey görüntülenir. Başka bir düzey seçmek için oklardan birine tıklayın. Genel olarak etkinlikler, sayıları etkinliğe bağlı olan çeşitli düzeyler sunar. &gcompris;’te, geçerli düzeyi tamamlamadan bir sonraki düzeye geçmek olanaklıdır.

source: Lips — Ask &gcompris; to repeat the question.
tr: Dudaklar — &gcompris;’e soruyu yinelemesini söyleyin.

source: Question mark — Display the help dialog box. Sometimes, an activity can be too complex to be described easily in the description area. In this case, this function gives access to additional information.
tr: Soru işareti — Yardım iletişim kutusunu görüntüleyin. Bazen, bir etkinlik, açıklama bölümünde açıklamak için pek karmaşık olabilir. Bu durumda, bu işlev ek bilgiye erişim sağlar.

source: Tool box — Configuration menu. The configuration is saved in the user repository (folder) under the name <filename>.config/gcompris/gcompris-qt.conf</filename>. This is a text file which can be edited manually.
tr: Araç kutusu — Yapılandırma menüsü. Yapılandırma, <filename>.config/gcompris/gcompris-qt.conf</filename> adıyla kullanıcının kişisel klasörüne kaydedilir. Bu, elle düzenlenebilir bir metin dosyasıdır.

source: List item — Display the activity settings menu. There are two possible tabs here. First one, “Dataset”, allows to choose the levels of the activities depending on several objectives and the second one, “Options”, allows to update the configuration of the activity if available.
tr: Liste ögesi — Etkinlik ayarları menüsünü görüntüleyin. Burada iki olası sekme vardır. Birincisi, “Veri Kümesi”, çeşitli hedeflere bağlı olarak etkinliklerin düzeylerini seçmeye izin verir ve ikincisi, “Seçenekler”, varsa etkinliğin yapılandırmasını güncellemeye izin verir.

source: Capital “G” — Information box on &gcompris;, presents the main contributors and the version of the software.
tr: Büyük “G” harfi — &gcompris; yazılımının bilgi kutusu; ana katkıcıları ve yazılımın sürümünü görüntüler.

source: Power — Quit &gcompris;. You can also use the shortcut on your keyboard <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo>.
tr: Güç — &gcompris; uygulamasından çıkar. Ayrıca klavyenizdeki <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> kısayolunu da kullanabilirsiniz.

source: Kiosk Mode
tr: Otomat Kipi

source: When you use &gcompris; with small children or on a self-service kiosk, you can disable a certain number of options:
tr: &gcompris;’i çok küçük çocuklarla veya bir otomat üzerinde kullanıyorsanız bazı seçenekleri devre dışı bırakabilirsiniz:

source: <userinput><command>gcompris --enable-kioskmode</command></userinput>: disable the <guiicon>Quit</guiicon> and <guiicon>Configuration</guiicon> buttons.
tr: <userinput><command>gcompris --enable-kioskmode</command></userinput>: <guiicon>Çık</guiicon> ve <guiicon>Yapılandırma</guiicon> düğmelerini devre dışı bırakır.

source: <userinput><command>gcompris --disable-kioskmode</command></userinput>: enable the <guiicon>Quit</guiicon> and <guiicon>Configuration</guiicon> buttons.
tr: <userinput><command>gcompris --disable-kioskmode</command></userinput>: <guiicon>Çık</guiicon> ve <guiicon>Yapılandırma</guiicon> düğmelerini etkinleştirir.

source: <userinput><command>gcompris -f</command></userinput>: run &gcompris; in fullscreen mode
tr: <userinput><command>gcompris -f</command></userinput>: &gcompris;’i tam ekran kipinde çalıştırır.

source: <userinput><command>gcompris -C</command></userinput>: disable the cursor (touch screen mode)
tr: <userinput><command>gcompris -C</command></userinput>: İmleci devre dışı bırakır (dokunmatik ekran kipi).

source: These options can of course be combined.
tr: Bu seçenekler elbette birlikte kullanılabilir.

source: Keyboard Shortcuts
tr: Klavye Kısayolları

source: Shortcut
tr: Kısayol

source: Action
tr: Eylem

source: &Esc; or <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo>
tr: &Esc; veya <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo>

source: Quit the current activity or dialog then return to the main menu.
tr: Geçerli etkinlikten/iletişim kutusundan çıkın ve ana menüye dönün.

source: Quit &gcompris; without further notice.
tr: Herhangi bir bildirim olmaksızın &gcompris;’ten çıkın.

source: Toggle fullscreen mode.
tr: Tam ekran kipini açın/kapatın.

source: Toggle sound mute.
tr: Sesi açın/kapatın.

source: Display or hide the control bar.
tr: Denetim çubuğunu görüntüleyin veya gizleyin.

source: Notes on Internationalization
tr: Uluslararasılaştırma hakkında

source: &gcompris; is internationalized and is available in more than 35 languages. If you want to check if your language is available, you can start &gcompris; and select your language in the option of configuration.
tr: &gcompris; uluslararasılaştırılmıştır ve 35’ten fazla dilde kullanılabilir. Dilinizin var olup olmadığını denetleek istiyorsanız &gcompris;’i başlatabilir ve yapılandırma seçeneğinden bakabilirsiniz.

source: Be careful, some languages need specific fonts to be displayed correctly.
tr: Dikkatli olun; bazı diller düzgünce görüntülenebilmek için belirli yazıtiplerine gereksinim duyarlar.

source: If your language is not supported, you can contribute to the software and add the translation of your language. If you are interested, you can contact the <ulink url="https://l10n.kde.org/teams">translation team</ulink> of the &kde; project for your language. You can check the level of translation for your language on the <ulink url="https://l10n.kde.org/">&kde; translation web site</ulink>.
tr: Diliniz desteklenmiyorsa yazılıma katkıda bulunabilir ve dilinizin çevirisini ekleyebilirsiniz. İlgileniyorsanız diliniz için olan &kde; <ulink url="https://l10n.kde.org/teams">çeviri takımına</ulink> ulaşın. Dilinizin çeviri yüzdesini <ulink url="https://l10n.kde.org/">&kde; çevirileri web sitesinden</ulink> takip edebilirsiniz.

source: Language learning
tr: Dil öğrenimi

source: You can use &gcompris; in a foreign language that you are learning. Select a foreign language in the configuration menu. Do not forget to download the optional audio modules for this language.
tr: &gcompris;’i öğrenmekte olduğunuz bir yabancı dilde kullanabilirsiniz. Yapılandırma menüsünden başka bir dil seçin. Bu dil için olan isteğe bağlı ses modüllerini de indirmeyi unutmayın.

source: Customizing activities
tr: Etkinlikleri özelleştirmek

source: You can customize some activities using the configuration button in them. For example, you can set the locale in some text activities (like wordsgame), or make it show real car images instead of filled rectangles (traffic).
tr: İçlerindeki yapılandırma düğmesini kullanarak bazı etkinlikleri özelleştirebilirsiniz. Örneğin, bazı metin etkinliklerinde (sözcük oyunu gibi) yerel ayarlar yapabilir veya dolu dikdörtgenler (trafik) yerine gerçek araba görsellerini göstermesini sağlayabilirsiniz.

source: For multiple activities, you can choose several datasets in the configuration. Each one has a specific objective which is described.
tr: Birden çok etkinlik için yapılandırmada birkaç veri kümesi seçilebilir. Her birinin açıklanan belirli bir hedefi vardır.

source: <screeninfo>Dataset of activity “Count the items”</screeninfo>
tr: <screeninfo>“Ögeleri say” etkinliğinin veri kümesi</screeninfo>

source: <phrase>Dataset of activity “Count the items”</phrase>
tr: <phrase>“Ögeleri say” etkinliğinin veri kümesi</phrase>

source: You can choose the options for this activity.
tr: Bu etkinlik için olan seçenekleri yapılandırabilirsiniz.

source: <screeninfo>Select mode of activity “Count the items”</screeninfo>
tr: <screeninfo>“Ögeleri say” etkinliğinin seçim kipi</screeninfo>

source: <phrase>Select mode of activity “Count the items”</phrase>
tr: <phrase>“Ögeleri say” etkinliğinin seçim kipi</phrase>

source: Console Parameters
tr: Konsol parametreleri

source: Running &gcompris; from a command console with the “--help” option will display all the parameters it accepts:
tr: &gcompris;’i bir komut satırından “--help” seçeneğiyle çalıştırmak, kabul ettiği tüm parametreleri görüntüler.

source: Run &gcompris; in fullscreen mode.
tr: &gcompris;’i tam ekran kipinde çalıştırın.

source: Run &gcompris; in window mode.
tr: &gcompris;’i pencere kipinde çalıştırın.

source: Run &gcompris; with sound enabled.
tr: &gcompris;’i ses etkin olarak çalıştırın.

source: Run &gcompris; without sound.
tr: &gcompris;’i ses olmadan çalıştırın.

source: Run &gcompris; with the default system cursor.
tr: &gcompris;’i öntanımlı sistem imleciyle çalıştırın.

source: Run &gcompris; without cursor (touch screen mode).
tr: &gcompris;’i imleç olmadan çalıştırın (dokunmatik ekran kipi).

source: Print the version of &gcompris;.
tr: &gcompris;’in sürümünü yazdırın.

source: Outputs all the available activities on the standard output.
tr: Tüm kullanılabilir etkinliklerin bir listesini standart çıktıya verir.

source: Specify the activity when starting &gcompris;.
tr: &gcompris;’i başlatırken açılacak etkinliği belirtin.

source: --start-level level
tr: --start-level düzey

source: Specify the level on which to start the activity specified by “--launch” option when starting &gcompris;. Ignored if no “--launch” option, or if level specified is invalid.
tr: &gcompris; başlatılırken “--launch” seçeneğiyle belirtilen etkinliğin hangi düzeyinin açılacağını belirtin. “--launch” seçeneği yoksa veya verilen seçenek geçersizse yok sayılır.

source: --difficulty {value|min-max}
tr: --difficulty {değer|en az-en çok}

source: For the session, force &gcompris; activities difficulty to be either at value or between min and max values. The values must be between 1 and 6, and if the format is min-max, the min value must be lower than the max value. If it is not the case &gcompris; will not start.
tr: Bu oturum için &gcompris; etkinliklerinin zorluğunu ya bu değerde ya da bu iki değer arasında olmasını zorlayın. Değerleri 1–6 arasında olmalıdır ve eğer en az/en çok biçiminde verilmişse en az değer en çok değerden büyük olmamalıdır. Böyle değilse &gcompris; başlamaz.

source: Export activities as SQL.
tr: Etkinlikleri SQL olarak dışa aktarın.

source: Enable the kiosk mode (hides Quit and Configuration buttons).
tr: Otomat kipini etkinleştirin (Çık ve Yapılandırma düğmelerini gizler).

source: Disable the kiosk mode (default).
tr: Otomat kipini devre dışı bırakın (öntanımlı).

source: --renderer={renderer}
tr: --renderer={sunucu}

source: Specify which graphical renderer to use. On all platforms, “opengl” and software are available. On Windows, you can use “direct3d11” or “direct3d12” (if it was compiled with Qt ≥ 6.6). On &macOS;, you can use “metal”.
tr: Hangi grafiksel sunucunun kullanılacağını belirtin. “opengl” ve yazılım sunucusu tüm platformlarda vardır. Windows üzerinde “direct3d11” veya “direct3d12” kullanabilirsiniz (Qt ≥ 6.6 ile derlenmişse). &macOS; üzerinde “metal” kullanılabilir.

source: Use software renderer instead of OpenGL (should work with any graphical card). Deprecated, use “--renderer=software” instead.
tr: OpenGL yerine yazılım sunucusunu kullanın (herhangi bir grafik kartıyla çalışır). Bu seçenek kullanımdan kalkmıştır, yerine “--renderer=software” kullanın.

source: Use OpenGL renderer instead of software (faster and more graphical effects but can crash with some graphical cards). Deprecated, use “--renderer=opengl” instead.
tr: Yazılım yerine OpenGL sunucusunu kullanın (daha hızlıdır ve daha çok grafiksel efekt sunar; ancak bazı grafik kartlarıyla çökme yaşanabilir). Bu seçenek kullanımdan kalkmıştır, yerine “--renderer=opengl” kullanın.

source: &Windows; Example
tr: &Windows; örneği

source: You can add these switches in the desktop icon properties. Here is an example that runs &gcompris; in kiosk mode in full screen, without Configuration button and cursor:
tr: Bu bayrakları masaüstü simgesi özelliklerine ekleyebilirsiniz. İşte &gcompris;’i otomat kipinde ve tam ekranda, yapılandırma düğmesi ve imleç olmadan çalıştıran bir örnek:

source: &GNU;/&Linux; Example
tr: &GNU;/&Linux; örneği

source: Create an application launcher and configure the command line parameters. Here is an example that runs &gcompris; in kiosk mode in fullscreen, without Configuration button and cursor:
tr: Bir uygulama başlatıcısı oluşturun ve komut satırı parametrelerini yapılandırın. İşte &gcompris;’i otomat kipinde ve tam ekranda, yapılandırma düğmesi ve imleç olmadan çalıştıran bir örnek:

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Program copyright © 2000–2025 Timothée Giet and others
tr: © 2000–2025 Timothée Giet ve diğerleri

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Emir SARI<email>emir_sari@icloud.com</email></para>
