Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/ghostwriter_man-ghostwriter.1.po
Languages: tr

source: ghostwriter User's Manual
tr: ghostwriter Kullanıcı Kılavuzu

source: <firstname>Megan</firstname><surname>Conkle</surname> <contrib>ghostwriter man page.</contrib> <email>megan.conkle@kdemail.net</email>
tr: <firstname>Megan</firstname><surname>Conkle</surname> <contrib>ghostwriter man sayfası.</contrib> <email>megan.conkle@kdemail.net</email>

source: distraction-free text editor for Markdown
tr: Markdown için dikkat dağıtmayan metin düzenleyicisi

source: <command>ghostwriter</command> <arg choice="opt"><replaceable>FILE</replaceable></arg>
tr: <command>ghostwriter</command> <arg choice="opt"><replaceable>DOSYA</replaceable></arg>

source: Description
tr: Açıklama

source: <command>ghostwriter</command> is a Qt text editing application for Markdown that provides an aesthetic, distraction-free writing environment.
tr: <command>ghostwriter</command>, Markdown için estetik ve dikkat dağıtmayan bir yazım ortamı sağlayan bir Qt metin düzenleyici uygulamasıdır.

source: Create your own custom themes, write in fullscreen mode, or use focus mode to concentrate on just one or more lines.
tr: Kendi özel temalarınızı yaratın, tam ekran olarak yazın veya odak kipinde kullanarak yalnızca bir veya birkaç satıra konsantre olun.

source: A live HTML preview allows you to view the final formatting as you type. HTML preview and export options are provided by the built-in Markdown processor, cmark-gfm; but you may add more by installing Pandoc, MultiMarkdown, or cmark processors. The application will automatically detect their installation if their locations are in the system's PATH environment variable.
tr: Canlı bir HTML önizlemesi, yazarken son biçimlendirmeyi görüntülemenize olanak tanır. HTML önizleme ve dışa aktarma seçenekleri yerleşik Markdown işleyicisi olan cmark-gfm tarafından sağlanır; ancak Pandoc, MultiMarkdown veya cmark işlemcilerini de kurarak daha fazla ekleyebilirsiniz. Uygulama, konumları sistemin PATH çevre değişkenindeyse kurulumları kendiliğinden algılayıp kullanmaya başlayacaktır.

source: Options
tr: Seçenekler

source: Disable GPU acceleration.
tr: GPU ivmelendirmesini devre dışı bırakın.

source: Reporting bugs
tr: Hata Bildirme

source: You can report bugs and feature requests at <ulink url="https://bugs.kde.org">https://bugs.kde.org</ulink>
tr: Hataları ve özellik isteklerini <ulink url="https://bugs.kde.org">https://bugs.kde.org</ulink> adresinden bildirebilirsiniz.

source: See Also
tr: Ayrıca Bakınız

source: More detailed user documentation about markdown is available from <ulink url="https://ghostwriter.kde.org/documentation">https://ghostwriter.kde.org/documentation</ulink>
tr: Markdown üzerine daha ayrıntılı kullanıcı belgelendirmesine <ulink url="https://ghostwriter.kde.org/documentation">https://ghostwriter.kde.org/documentation</ulink> adresinden ulaşılabilir.

source: Copyright
tr: Telif Hakkı

source: Copyright &copy; 2022 Megan Conkle
tr: Telif hakkı &copy; 2022 Megan Conkle

source: License: GNU General Public Version 3 or later &lt;<ulink url="https://www.gnu.org/licenses/gpl-3.0.html">https://www.gnu.org/licenses/gpl-3.0.html</ulink>&gt;
tr: Lisans: GNU Genel Kamu Lisansı sürüm 3 veya sonrası &lt;<ulink url="https://www.gnu.org/licenses/gpl-3.0.html">https://www.gnu.org/licenses/gpl-3.0.html</ulink>&gt;
