Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/gwenview.po
Languages: tr

source: <guilabel>Show selection button only</guilabel> &mdash; Show select/unselect button only
tr: <guilabel>Yalnızca seçim düğmesini göster</guilabel> &mdash; Yalnızca seç/seçimi kaldır düğmesini göster

source: <guilabel>None</guilabel> &mdash; Do not show any thumbnail button
tr: <guilabel>Yok</guilabel> &mdash; Hiçbir küçük görsel düğmesi gösterme

source: <title>Image View</title>
tr: <title>Görsel Görünümü</title>

source: Show transparency with
tr: Saydamlığı şununla göster

source: Choose how the background of transparent raster or <abbrev>SVG</abbrev> images is rendered.
tr: Saydam raster veya <abbrev>SVG</abbrev> görsellerin arka planının nasıl sunulacağını seçin.

source: <guilabel>Surrounding background</guilabel> &mdash; Use background color from the <link linkend="configgeneral">General page</link>.
tr: <guilabel>Çevreleyen arka plan</guilabel> &mdash; <link linkend="configgeneral">Genel</link> sayfasındaki arka plan rengini kullanın.

source: <guilabel>Checkerboard background</guilabel> &mdash; Use the traditional checkerboard background.
tr: <guilabel>Dama tahtası arka plan</guilabel> &mdash; Geleneksel dama tahtası arka planını kullanın.

source: <guilabel>Solid color background</guilabel> &mdash; Use a color that can be chosen using the <ulink url="help:/fundamentals/colors.html">color selector</ulink>.
tr: <guilabel>Katı renk arka plan</guilabel> &mdash; <ulink url="help:/fundamentals/colors.html">Renk seçicisi</ulink> ile seçilebilen bir renk kullanın.

source: Mouse wheel behavior
tr: Fare tekerleği davranışı

source: Select how scrolling over an image in View mode behaves.
tr: Görüntüle kipinde bir görsel üzerinde sarmanın nasıl davranacağını seçin.

source: <guilabel>Scroll</guilabel> &mdash; When zoomed in, pan the image vertically. Otherwise, nothing will happen.
tr: <guilabel>Sar</guilabel> &mdash; Yakınlaştırıldığında görseli dikey olarak kaydırın. Aksi takdirde hiçbir şey olmaz.

source: <guilabel>Browse</guilabel> &mdash; Switch to the next or the previous image.
tr: <guilabel>Göz at</guilabel> &mdash; Sonraki veya önceki görsele geçin.

source: <guilabel>Zoom</guilabel> &mdash; Use mouse wheel to zoom in/out the current image.
tr: <guilabel>Yakınlaştır</guilabel> &mdash; Geçerli görseli yakınlaştırmak/uzaklaştırmak için fare tekerleğini kullanın.

source: Zoom mode
tr: Yakınlaştırma kipi

source: Allows choosing how zooming in View mode works.
tr: Görüntüle kipinde yakınlaştırmanın nasıl çalışacağını seçmenize olanak tanır.

source: <guilabel>Autofit each image</guilabel> &mdash; Automatically resize images to the view pane.
tr: <guilabel>Her bir görseli kendiliğinden sığdır</guilabel> &mdash; Görselleri görünüm bölmesine göre kendiliğinden yeniden boyutlandırın.

source: <guilabel>Keep same zoom and position</guilabel> &mdash; Use the same zoom level for all images.
tr: <guilabel>Aynı yakınlaştırmayı ve konumu koru</guilabel> &mdash; Tüm görseller için aynı yakınlaştırma düzeyini kullanın.

source: <guilabel>Per image zoom and position</guilabel> &mdash; Use individual zoom levels for each image.
tr: <guilabel>Görsel başına yakınlaştırma ve konum</guilabel> &mdash; Her bir görsel için ayrı yakınlaştırma düzeyleri kullanın.

source: <guilabel>Enlarge smaller images</guilabel> &mdash; check this item to make &gwenview; enlarge smaller images in View mode.
tr: <guilabel>Küçükçe görselleri büyüt</guilabel> &mdash; &gwenview;’ün Görüntüle kipinde küçük boyutlu görselleri genişletmesi için bu seçeneği işaretleyin.

source: Animations
tr: Canlandırmalar

source: Allows choosing how fading between images is done in View mode.
tr: Görüntüle kipinde görseller arasındaki soldurmanın nasıl yapılacağının seçilmesine olanak sağlar.

source: <guilabel>OpenGL</guilabel> &mdash; Use hardware accelerated animations.
tr: <guilabel>OpenGL</guilabel> &mdash; Donanım ivmelendirmeleri canlandırmalar kullanın.

source: <guilabel>Software</guilabel> &mdash; Do not use hardware accelerated animations. Select this option if <guilabel>OpenGL</guilabel> does not work satisfactory, but you still want to fade between images.
tr: <guilabel>Yazılım</guilabel> &mdash; Donanım ivmelendirmeli canlandırmalar kullanmayın.<guilabel>OpenGL</guilabel> çalışmaz ise ve görseller arasında yine de solmalı geçiş isterseniz bu seçeneği işaretleyin.

source: <guilabel>None</guilabel> &mdash; Do not use animations when switching between images.
tr: <guilabel>Yok</guilabel> &mdash; Görseller arasında geçiş yaparken canlandırma kullanmayın.

source: Thumbnail Bar
tr: Küçük Görsel Çubuğu

source: Allows configuring the thumbnail bar.
tr: Küçük görsel çubuğunu yapılandırmaya izin verir.

source: Orientation
tr: Yönelim

source: <guilabel>Horizontal</guilabel> &mdash; Show a horizontal thumbnail strip below the image.
tr: <guilabel>Yatay</guilabel> &mdash; Görselin altında yatay bir küçük görsel şeridi gösterin.

source: <guilabel>Vertical</guilabel> &mdash; Show a vertical thumbnail strip to the right of the image.
tr: <guilabel>Dikey</guilabel> &mdash; Görselin sağında dikey bir küçük görsel şeridi gösterin.

source: <guilabel>Row count</guilabel> &mdash; Use the spin box to change the number of rows on the thumbnail bar
tr: <guilabel>Satır sayısı</guilabel> &mdash; Küçük görsel çubuğundaki satır sayısını değiştirmek için döndürme kutusunu kullanın.

source: <title>Advanced</title>
tr: <title>Gelişmiş</title>

source: Thumbnails
tr: Küçük Görseller

source: Enable the <guilabel>Low resource usage mode</guilabel> option if you do not have a lot of disk space. This will avoid storing thumbnails on disk and will prefer embedded thumbnails of lower quality that are faster to load, if available.
tr: Pek fazla disk alanınız yoksa <guilabel>Düşük özkaynak kullanım kipi</guilabel> seçeneğini işaretleyin. Bu, küçük görsellerin diskte saklanmasını önler ve varsa daha hızlı yüklenen, daha düşük kaliteli gömülü küçük görselleri tercih eder.

source: Be careful: This will delete the folder named <filename>thumbnails</filename> in your <filename>.cache</filename> folder, removing all thumbnails previously generated by &gwenview; and other applications.
tr: Dikkatli olun: Bu, <filename>.cache</filename> klasörünüzdeki <filename>thumbnails</filename> siler ve daha önceden &gwenview; veya diğer uygulamalar tarafından oluşturulan tüm küçük görselleri kaldırır.

source: History
tr: Geçmiş

source: Check the <guilabel>Remember folders and URLs</guilabel> to make &gwenview; remember visited folders and &URL;s and show them on the <guilabel>Recent Folders</guilabel> pane.
tr: &gwenview;’ın ziyaret edilen &URL;’leri anımsamasını ve onları <guilabel>Son Kullanılan Klasörler</guilabel> bölmesinde göstermesini istiyorsanız <guilabel>Klasörleri ve URL’leri anımsa</guilabel> onay kutusunu işaretleyin.

source: Rendering intent
tr: Sunum amacı

source: Allows choosing the <ulink url="https://en.wikipedia.org/wiki/Color_management#Rendering_intent">rendering intent</ulink> for showing images.
tr: Görselleri göstermek üzere <ulink url="https://en.wikipedia.org/wiki/Color_management#Rendering_intent">sunum amacının</ulink> seçilmesine izin verir.

source: <guilabel>Perceptual</guilabel> &mdash; scale all colors equally to fit them within the active color profile's color gamut
tr: <guilabel>Algısal</guilabel> &mdash; Tüm renkleri etkin renk profilinin renk gamına uyacak şekilde eşit olarak ölçeklendir

source: <guilabel>Relative Colorimetric</guilabel> &mdash; squash colors that don't fit within the active color profile's color gamut, leaving other colors untouched
tr: <guilabel>Bağıl Renkölçüm</guilabel> &mdash; Etkin renk profilinin renk gamına uymayan renkleri tıkıştır, diğer renklere dokunulmaz

source: Color profile
tr: Renk profili

source: Allows choosing if you want to additionally apply the system-wide <ulink url="https://en.wikipedia.org/wiki/ICC_profile">color profile</ulink> to the color profile from the image file.
tr: Görsel dosyasındaki renk profiline sistem geneli <ulink url="https://en.wikipedia.org/wiki/ICC_profile">renk profilini</ulink> ek olarak uygulamak isteyip istemediğinizi seçmenize olanak tanır.

source: If the <guilabel>Apply only the profile embedded in the image file</guilabel> item is checked &gwenview; assumes that the system-wide color correction already applies monitor profile.
tr: <guilabel>Yalnızca görsel dosyasına gömülü profili uygula</guilabel> ögesi işaretliyse &gwenview;, sistem çapında renk düzeltmenin monitör profilini zaten uyguladığını varsayar.

source: Hidden Configuration Options
tr: Gizli Yapılandırma Seçenekleri

source: Some notes on hidden &gwenview; options can be found on <ulink url="http://userbase.kde.org/Special:myLanguage/Gwenview/Hidden_Configuration_Options">this page</ulink>.
tr: Gizli &gwenview; seçenekleri üzerine ek bilgi <ulink url="http://userbase.kde.org/Special:myLanguage/Gwenview/Hidden_Configuration_Options">bu sayfada</ulink> bulunabilir.

source: The options described on the above-mentioned page may help you tune &gwenview; for specific needs, but please keep in mind there is no warranty they will continue working from one version to another.
tr: Yukarıda belirtilen sayfada açıklanan seçenekler, &gwenview;’ü belirli gereksinimlere göre ayarlamanıza yardımcı olabilir; ancak lütfen bir sürümden diğerine çalışmayı sürdüreceklerinin hiçbir garantisinin olmadığını unutmayın.

source: Credits and Copyright
tr: Emeği Geçenler ve Telif Hakkı

source: &gwenview; is currently maintained by Aurélien Gâteau
tr: &gwenview; bakımı şu anda Aurélien Gâteau tarafından yapılmaktadır

source: This document was written by Christopher Martin
tr: Bu belge Christopher Martin tarafından yazılmıştır

source: This document was updated for &kde; 4 by Henry de Valence
tr: Bu belge Henry de Valence tarafından &kde; 4 için güncellenmiştir

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Gökhan HUZ <email>gokhanhuzz@gmail.com</email></para><para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
