Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/gwenview.po
Languages: tr

source: Gwenview User Manual
tr: Gwenview Kullanıcı Kılavuzu

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Gökhan</firstname><surname>HUZ</surname><affiliation><address><email>gokhanhuzz@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit><othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: &gwenview; is an image and video viewer.
tr: &gwenview; bir görsel ve video görüntüleyicisidir.

source: image
tr: görsel

source: viewer
tr: görüntüleyici

source: artist
tr: sanatçı

source: photo
tr: fotoğraf

source: picture
tr: resim

source: Introduction
tr: Giriş

source: What is &gwenview;
tr: &gwenview; Nedir

source: &gwenview; is a fast and easy to use image and video viewer.
tr: &gwenview; hızlı ve kullanımı kolay bir görsel ve video görüntüleyicisidir.

source: &gwenview; features two main modes: Browse and View. Both modes can be used in a normal application window and Full Screen. Browse Mode lets you navigate through your computer showing thumbnails of your images, View Mode lets you view images one at a time, and Full Screen lets you make quick slideshows. There is also a start screen that displays a list of recently opened folders and &URL;s as well as your places and tags.
tr: &gwenview; iki ana kip içerir: Göz At ve Görüntüle. Her iki kip de normal uygulama penceresinde ve Tam Ekran’da kullanılabilir. Göz At kipi, görsellerinizin küçük hallerini göstererek bilgisayarınızda dolaşmanızı sağlar; Görüntüle kipi, görselleri birer birer görüntülemenizi ve Tam Ekran, tez slayt gösterileri yapmanızı sağlar. Ayrıca, son açılan klasörlerin ve &URL;’lerin yanı sıra yerleriniz ve etiketlerinizin listesini görüntüleyen bir başlangıç ekranı da bulunmaktadır.

source: Image loading is handled by the &Qt; library, so &gwenview; supports all image formats your &Qt; installation supports. &gwenview; correctly displays images with an alpha channel (transparency) as well as animations.
tr: Görsel yüklemesi &Qt; kitaplığı tarafından halledilir; böylece &gwenview;, &Qt; kurulumunuzun desteklediği tüm görsel biçimlerini destekler. &gwenview;, hem alfa kanallı (saydam) hem de canlandırmaları düzgünce görüntüleyebilir.

source: &gwenview; supports the displaying and editing of EXIF comments in JPEG images. Lossless JPEG transforms such as rotations and mirroring are also supported.
tr: &gwenview; JPEG görsellerindeki EXIF yorumlarının görüntülenmesini ve düzenlenmesini destekler. Döndürme ve yansıtma gibi kayıpsız JPEG dönüşümleri de desteklenir.

source: &gwenview; can read embedded color profiles from PNG and JPEG files. It can use the image color profile together with the display color profile to output correct colors on the screen.
tr: &gwenview;, PNG ve JPEG dosyalarından gömülü renk profillerini okuyabilir. Ekranda doğru renklerin çıktısını almak için görsel renk profilini ekran renk profiliyle birlikte kullanabilir.

source: The Interface
tr: Arayüz

source: Start Page
tr: Başlangıç Sayfası

source: The start page lists recently opened folders and &URL;s on the left side, and your places and tags on the right side.
tr: Başlangıç sayfası, sol tarafta son açılan klasörleri ve URL’leri, sağ tarafta ise yerlerinizi ve etiketlerinizi listeler.

source: Start Page Screenshot
tr: Başlangıç Sayfası Ekran Görüntüsü

source: Image Operations
tr: Görsel İşlemleri

source: &gwenview; has a few features which are available in both Browse, View, and Full Screen view. &gwenview; has the capability to do basic alteration of your images.
tr: &gwenview;, Göz At, Görüntüle ve Tam Ekran görünümlerinde kullanılabilen birkaç özelliğe sahiptir. &gwenview; görsellerinizde temel değişiklikler uygulayabilir.

source: Rotate: A rotate operation will rotate the image either to the left or to the right, depending on whether you do <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Rotate Right</guimenuitem> </menuchoice> or <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Rotate Left</guimenuitem> </menuchoice>
tr: Döndür: Bir döndürme işlemi, görseli <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Sağa Döndür</guimenuitem> </menuchoice> veya <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Sola Döndür</guimenuitem> </menuchoice> yapmanıza bağlı olarak sağa veya sola döndürür

source: <menuchoice> <guimenu>Edit</guimenu> <guimenuitem>Mirror</guimenuitem> </menuchoice>: This operation will reflect the image along the vertical axis, as if you were seeing it in a mirror.
tr: <menuchoice> <guimenu>Düzen</guimenu> <guimenuitem>Yansıt</guimenuitem> </menuchoice>: Bu işlem, görseli sanki aynada görüyormuşsunuz gibi dikey eksen boyunca yansıtacaktır.

source: <menuchoice> <guimenu>Edit</guimenu> <guimenuitem>Flip</guimenuitem> </menuchoice>: This operation will reflect the image upside-down (a reflection along the horizontal axis)
tr: <menuchoice> <guimenu>Düzen</guimenu> <guimenuitem>Ters Çevir</guimenuitem> </menuchoice>:Bu işlem, görseli baş aşağı yansıtır (yatay eksen boyunca bir yansıma)

source: <menuchoice> <shortcut> <keycombo action="simul">&Shift;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Resize</guimenuitem> </menuchoice>: This operation will allow you to shrink or expand the image. Note that if you increase the size of an image, it may appear blurry and/or pixelated.
tr: <menuchoice> <shortcut> <keycombo action="simul">&Shift;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Yeniden Boyutlandır</guimenuitem> </menuchoice>: Bu işlem, görseli küçültmenize veya büyütmenize olanak tanır. Bir görselin boyutunu artırırsanız bulanık ve/veya pikselli görünebileceğini unutmayın.

source: These actions are also available on the <guilabel>Operations</guilabel> tab of the sidebar.
tr: Bu eylemler aynı zamanda kenar çubuğunun <guilabel>İşlemler</guilabel> sekmesinde de vardır.

source: If you have edited one or more images a bar with additional actions is displayed at the top of the image. You can undo or redo your changes, go to the previous or next modified image and there are three options to save the changed images.
tr: Bir veya daha fazla görseli düzenlediyseniz görselin üst kısmında ek eylemlerin bulunduğu bir çubuk görüntülenir. Değişikliklerinizi geri alabilir veya yineleyebilirsiniz, önceki veya sonraki değiştirilen görsele gidebilirsiniz; değiştirilen görselleri kaydetmek için üç seçenek vardır.

source: Actions bar for modified images
tr: Değiştirilmiş görseller için eylem çubuğu

source: Browse Mode
tr: Göz At Kipi

source: When in Browse Mode, you can easily navigate through your files and folders. The preview window shows thumbnails of the images in the current folder, as well as subfolders.
tr: Göz At kipindeyken dosyalarınız ve klasörleriniz arasında kolayca dolaşabilirsiniz. Önizleme penceresi, geçerli klasördeki ve alt klasörlerdeki görsellerin küçük hallerini gösterir.

source: Browse Mode Screenshot
tr: Göz At Kipi Ekran Görüntüsü

source: Moving the mouse over an image shows buttons to select or rotate the image as well as a button to enter Fullscreen Mode. Modified images are indicated by an icon down right, click it to save the changed image. Clicking on an image takes you into View Mode. You may select multiple images and switch to View Mode to view them side-by-side.
tr: Fareyi bir görselin üzerinde hareket ettirmek, görseli seçmek veya döndürmek için kullanılan düğmelerin yanı sıra Tam Ekran kipine girmek için bir düğme gösterir. Değiştirilen görseller sağ altta bir simgeyle gösterilir; değiştirilen görseli kaydetmek için buna tıklayın. Bir görsele tıklamak sizi Görüntüle kipine götürür. Birden fazla görsel seçip bunları yan yana görüntülemek için Görüntüle kipine geçebilirsiniz.

source: The slider at the bottom right allows you to change the size of the images. You can also filter the images by filename, date, tag or rating using the box on the lower left. The toolbar appears in both Browse mode as well as View mode and contains the most commonly used actions.
tr: Sağ alttaki sürgü, görsellerin boyutunu değiştirmenize olanak sağlar. Sol alttaki kutuyu kullanarak görselleri dosya adına, tarihe, etikete veya derecelendirmeye göre de süzebilirsiniz. Araç çubuğu, hem Göz At kipinde hem de Görüntüle kipinde görünür ve en sık kullanılan eylemleri içerir.

source: <guiicon>Start Page</guiicon>: Open the start page.
tr: <guiicon>Başlangıç Sayfası</guiicon>: Başlangıç sayfasını açar.

source: <guiicon>Browse</guiicon>: Switches to Browse Mode.
tr: <guiicon>Göz At</guiicon>: Göz At kipine geçer.

source: <guiicon>View</guiicon>: Switches to View Mode.
tr: <guiicon>Görüntüle</guiicon>: Görüntüle kipine geçer.

source: <guiicon>Previous</guiicon>: Clicking this icon will go to the previous image in the folder.
tr: <guiicon>Önceki</guiicon>: Bu simgeye tıklamak, klasördeki önceki görsele gider.

source: <guiicon>Next</guiicon>: Clicking this button will go to the next image in the folder.
tr: <guiicon>Sonraki</guiicon>: Bu simgeye tıklamak, klasördeki sonraki görsele gider.

source: <guiicon>Show Editing Tools</guiicon>: Clicking this button toggles the <link linkend="sidebar">Operations sidebar tab</link>.
tr: <guiicon>Düzenleme Araçlarını Göster</guiicon>: Bu düğmeye tıklamak <link linkend="sidebar">İşlemler</link> kenar çubuğu sekmesini açar/kapatır.

source: <guiicon>Full Screen</guiicon>: Switches to Full Screen Mode.
tr: <guiicon>Tam Ekran</guiicon>: Tam Ekran kipine geçer.

source: View Mode
tr: Görüntüle Kipi

source: View Mode displays full-size images. The same <link linkend="sidebar">sidebar</link> available in Browse Mode is displayed on the left. At the bottom, there is the Thumbnail Bar, which allows you to scroll through the images in the current folder. The Thumbnail Bar can be unfolded by clicking on the <guibutton>Show Thumbnails</guibutton> button. Clicking again will fold it. To change the size of the thumbnails move the splitter with the &LMB;.
tr: Görüntüle kipi, görselleri tam boyutlu olarak görüntüler. Göz At kipinde bulunan aynı <link linkend="sidebar">kenar çubuğu</link> solda görüntülenir. Altta, geçerli klasördeki görseller arasında gezinmenizi sağlayan Küçük Görsel Çubuğu bulunmaktadır. Küçük Görsel Çubuğu, <guibutton>Küçük Görselleri Göster</guibutton> düğmesine tıklanarak açılabilir. Yeniden tıkladığınızda katlanacaktır. Küçük görsellerin boyutunu değiştirmek için ayırıcıyı &LMB; ile hareket ettirin.

source: View Mode supports viewing multiple images side-by-side. You may select multiple images in Browse Mode before switching to View Mode, or you may click the <guibutton>+</guibutton> button that appears when hovering over images in the Thumbnail Bar to add a pane displaying that image. A <guibutton>-</guibutton> will then appear that will permit you to remove its pane.
tr: Görüntüle kipi, birden fazla görselin yan yana görüntülenmesini destekler. Görüntüle kipine geçmeden önce Göz At kipinde birden fazla görseli seçebilirsiniz veya Küçük Görsel Çubuğu’ndaki görsellerin üzerine geldiğinizde o görseli gösteren bir bölme eklemek için görünen <guibutton>+</guibutton> düğmesine tıklayabilirsiniz. Daha sonra bölmesini kaldırmanıza izin verecek bir <guibutton>-</guibutton> de görünecektir.

source: When multiple images are displayed, a small toolbar appears below each image that permits you to delete the image or remove its pane. You may perform zoom operations independently for each image, or synchronize them. Toggle this by checking the <guilabel>Synchronize</guilabel> to the left of the zoom slider or by pressing <keycombo action="simul">&Ctrl;<keycap>Y</keycap></keycombo>. You can switch images by clicking on their pane, or using your keyboard. To switch to the image on the right, press <keycombo action="simul">&Tab;</keycombo>. To switch to the image on the left, press <keycombo action="simul">&Shift;&Tab;</keycombo>.
tr: Birden çok görsel görüntülendiğinde, her görselin altında, görseli silmenize veya bölmesini kaldırmanıza olanak tanıyan küçük bir araç çubuğu görünür. Yakınlaştırma işlemlerini her görsel için bağımsız olarak gerçekleştirebilir veya eşzamanlayabilirsiniz. Yakınlaştırma sürgüsünün solundaki <guilabel>Eşzamanla</guilabel> seçeneğini işaretleyerek veya <keycombo action="simul">&Ctrl;<keycap>Y</keycap></keycombo> düğmelerine basarak bunu değiştirin. Bölmelerine tıklayarak veya klavyenizi kullanarak görseller arasında geçiş yapabilirsiniz. Sağdaki görsele geçmek için <keycombo action="simul">&Tab;</keycombo>, soldaki görsele geçiş yapmak için <keycombo action="simul">&Shift;&Tab;</keycombo> kısayollarını kullanın.

source: View Mode Screenshot
tr: Görüntüle Kipi Ekran Görüntüsü

source: The slider at the bottom right controls the zoom of the image. The <guibutton>Fit</guibutton>, <guibutton>Fill</guibutton> and <guibutton>100%</guibutton> buttons are next to the zoom slider and are three preset zoom levels. The <guibutton>Fit</guibutton> button zooms the current image to fit the size of the window, the <guibutton>Fill</guibutton> button zooms the image to fill the window by fitting width or height and the <guibutton>100%</guibutton> button zooms the image to the actual pixel size. The shortcut <keycap>F</keycap> toggles between <guibutton>Fit</guibutton> mode and <guibutton>100%</guibutton>, pressing <keycombo action="simul">&Shift;<keycap>F</keycap></keycombo> will toggle <guibutton>Fill</guibutton> respectively.
tr: Sağ ortadaki sürgü, görselin yakınlaştırma boyutunu denetler. <guibutton>Sığdır</guibutton>, <guibutton>Doldur</guibutton>, <guibutton>%​100</guibutton> ve üç önden ayarlanmış yakınlaştırma düzeyi için düğmeler sürgünün hemen yanında bulunur. <guibutton>Sığdır</guibutton> düğmesi, geçerli görseli pencerenin boyutuna yakınlaştırır; <guibutton>Doldur</guibutton> düğmesi, görseli görseli genişlik veya yüksekliğe sığdırır ve <guibutton>%​100</guibutton> düğmesi, görseli gerçek piksel boyutuna yakınlaştırır. <keycap>F</keycap> kısayolu ise <guibutton>Sığdır</guibutton> ve <guibutton>%​100</guibutton> kipi arasında geçiş yapar; <keycombo action="simul">&Shift;<keycap>F</keycap></keycombo> ise <guibutton>Doldur</guibutton> kipine geçer.

source: When an image is in zoom-to-fit mode, you can go to the previous and next image with the arrow keys. When you zoom in, arrow keys are used to scroll the image. This is very similar to the behavior provided by phones or digital cameras.
tr: Bir görsel sığdırmak için yakınlaştırma kipindeyken, ok düğmelerini kullanarak önceki ve sonraki görsele gidebilirsiniz. Yakınlaştırdığınızda görseli kaydırmak için ok düğmeleri kullanılır. Bu, telefonların veya sayısal kameraların sağladığı davranışa çok benzer.

source: When an image is zoomed in, a bird's eye view appears and lets you scroll the image using the mouse and the arrow keys. The bird's eye view automatically hides itself after a short delay, showing back only while zooming or scrolling. The bird's eye view can be disabled from the right click context menu or from <menuchoice><guimenu>View</guimenu><guimenuitem>Show Bird's Eye View When Zoomed In</guimenuitem></menuchoice>
tr: Bir görsel yakınlaştırıldığında kuşbakışı görünümü görüntülenir ve fare ve ok düğmelerini kullanarak görseli kaydırmanıza olanak tanır. Kuşbakışı görünüm, kısa bir gecikmenin ardından otomatik olarak kendini gizler ve yalnızca yakınlaştırma veya sarma sırasında geri gösterilir. Kuşbakışı görünüm, bağlam menüsünden veya <menuchoice><guimenu>Görünüm</guimenu><guimenuitem>SYakınlaştırıldığında Kuşbakışı Görünümü Göster</guimenuitem></menuchoice> seçeneğinden devre dışı bırakılabilir

source: You can define what happens when going to image B after having zoomed in on an area of image A using the options in the <guilabel>Zoom mode</guilabel> group on the <guimenuitem>Image View</guimenuitem> page of the &gwenview; configuration window which can be reached using the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &gwenview;...</guimenuitem></menuchoice>.
tr: <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>&gwenview; Uygulamasını Yapılandır…</guimenuitem></menuchoice> konumundan erişilebilen &gwenview; yapılandırma penceresinin .<guimenuitem>Görsel Görünümü</guimenuitem> sayfasındaki <guilabel>Yakınlaştırma kipi</guilabel> bölümünden, A görselinin bir bölümüne yakınlaştırdıktan sonra B görseline ne olacağını belirleyebilirsiniz.

source: If set to <guilabel>Autofit each image</guilabel>, image B is zoomed out to fit the screen.
tr: <guilabel>Her bir görseli kendiliğinden sığdır</guilabel> olarak ayarlanırsa B görseli ekrana sığması için uzaklaştırılır.

source: If set to <guilabel>Keep same zoom and position</guilabel>, all images share the same zoom and position: image B is set to the same zoom parameters as image A (and if these are changed, image A will then be displayed with the updated zoom and position).
tr: <guilabel>Aynı yakınlaştırmayı ve konumu koru</guilabel> olarak ayarlanırsa tüm görseller aynı yakınlaştırmayı ve konumu paylaşır: B görseli, A görseli ile aynı yakınlaştırma parametrelerine ayarlanır (ve bunlar değiştirilirse A görseli görüntülenir) güncellenmiş yakınlaştırma ve konumla).

source: If set to <guilabel>Per image zoom and position</guilabel>, all images remember their own zoom and position: image B is initially set to the same zoom parameters as image A, but will then remember its own zoom and position (if these are changed, image A will <emphasis>not</emphasis> be displayed with the updated zoom and position).
tr: <guilabel>Görsel başına yakınlaştırma ve konum</guilabel> olarak ayarlanırsa tüm görseller kendi yakınlaştırma ve konumlarını hatırlar: B görseli, başlangıçta A görseli ile aynı yakınlaştırma parametrelerine ayarlanır; ancak daha sonra kendi yakınlaştırma ve konumunu anımsar (eğer bunlar değiştirilirse A görseli güncellenmiş yakınlaştırma ve konumla <emphasis>görüntülenmeyecektir</emphasis>).

source: You can start directly in View mode by starting &gwenview; from a context menu like <guimenuitem>Open With</guimenuitem> in another program or by launching it from the command line with an image as an argument.
tr: Başka bir programdaki <guimenuitem>Birlikte Aç</guimenuitem> gibi bir bağlam menüsünden &gwenview;’ü başlatarak veya argüman olarak bir görseli komut satırından vererek doğrudan Görüntüle kipinde başlayabilirsiniz.

source: The following additional image operations are available only in View Mode:
tr: Aşağıdaki ek görsel işlemleri yalnızca Görüntüle kipinde kullanılabilir:

source: <menuchoice> <shortcut> <keycombo action="simul">&Shift;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Crop</guimenuitem> </menuchoice>: This operation lets you discard parts of the image you don't want.
tr: <menuchoice> <shortcut> <keycombo action="simul">&Shift;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Kırp</guimenuitem> </menuchoice>: Bu işlem, görselin istemediğiniz kısımlarını atmanıza olanak tanır.

source: You can access the advanced cropping parameters by ticking <guilabel>Advanced settings</guilabel> check box on the bottom popup pane. Use the corresponding fields to tune up the cropping operation.
tr: Alt açılır bölmedeki <guilabel>Gelişmiş ayarlar</guilabel> onay kutusunu işaretleyerek gelişmiş kırpma parametrelerine erişebilirsiniz. Kırpma işlemini ayarlamak için ilgili alanları kullanın.

source: It is also possible to adjust the cropped area by dragging the gray square handles on the borders of the image. You can move the cropped area by clicking and holding the &LMB; and drag it with the mouse pointer.
tr: Kırpılan alanı görselin kenarlarındaki gri kare tutaçları sürükleyerek de ayarlamak mümkündür. Kırpılan alana &LMB; ile tıklayıp basılı tutarak taşıyabilir ve fare işaretçisiyle sürükleyebilirsiniz.

source: Press the <guibutton>Crop</guibutton> button to see the results when you are ready. Use the upper popup pane to save the results or undo/redo the operation.
tr: Hazır olduğunuzda sonuçları görmek için <guibutton>Kırp</guibutton> düğmesine basın. Sonuçları kaydetmek veya işlemi geri almak/yeniden yapmak için üst açılır pencereyi kullanın.

source: <menuchoice> <guimenu>Edit</guimenu> <guimenuitem>Reduce Red Eye</guimenuitem> </menuchoice>: This operation reduces the "red eye" effect commonly found in photographs taken with a flash camera.
tr: <menuchoice> <guimenu>Düzen</guimenu> <guimenuitem>Kırmızı Gözü Azalt</guimenuitem> </menuchoice>: Bu işlem, flaşlı fotoğraf makinesiyle çekilen fotoğraflarda yaygın olarak görülen "kırmızı göz" etkisini azaltır.

source: Full Screen Modes
tr: Tam Ekran Kipleri

source: Access Full Screen by pressing the <guiicon>Full Screen</guiicon> button on the toolbar, or by <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Full Screen Mode</guimenuitem> </menuchoice>.
tr: Araç çubuğundaki <guiicon>Tam Ekran</guiicon> düğmesine basarak veya <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Tam Ekran Kipi</guimenuitem> </menuchoice> seçeneklerini kullanarak tam ekran kipine geçebilirsiniz.

source: To leave this mode press the &Esc; key.
tr: Bu kipten ayrılmak için &Esc; düğmesine basın.

source: Browse Mode Full Screen
tr: Tam Ekran Göz At Kipi

source: In Browse Mode you can switch to fullscreen also by clicking on the button that appears when you move the mouse over the thumbnails.
tr: Göz At kipinde, fareyi küçük görsellerin üzerine getirdiğinizde görünen düğmeye tıklayarak da tam ekrana geçebilirsiniz.

source: Full Screen View Mode Screenshot
tr: Tam Ekran Görüntüle Kipi Ekran Görüntüsü

source: Going fullscreen while browsing gives you a more immersive experience while you go through your pictures. It is quite nice on your regular computer, but makes even more sense when you connect your laptop to the big TV in the living room to show pictures to your guests.
tr: Göz atarken tam ekrana geçmek, görselleriniz arasında gezinirken size daha sürükleyici bir deneyim sunar. Normal bilgisayarınızda oldukça hoştur; ancak misafirlerinize resimler göstermek için dizüstü bilgisayarınızı oturma odasındaki büyük TV’ye bağladığınızda daha da anlamlı olur.

source: View Mode Full Screen
tr: Tam Ekran Görüntüle Kipi

source: The full screen View Mode shows a slideshow of your images. Access Full Screen Mode by clicking on the button that appears when you move the mouse over the thumbnails in Browse Mode, by pressing the <guiicon>Full Screen</guiicon> button on the taskbar.
tr: Tam ekran Görüntüle kipi, görselleriniz bir slayt gösterisini gösterir. Göz At kipinde fareyi küçük görsellerin üzerine getirdiğinizde görünen düğmeye tıklayarak veya görev çubuğundaki <guiicon>Tam Ekran</guiicon> düğmesine basarak Tam Ekran kipine erişin.

source: Full Screen Browse Mode Screenshot
tr: Tam Ekran Göz At Kipi Ekran Görüntüsü
