Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/gwenview.po
Languages: tr

source: The top bar will hide itself automatically; to show it simply move the mouse to the top of the screen. If the mouse cursor is over the top bar, it will not autohide. Most of the buttons on the bar are the same as the ones on the toolbar in Browse or View Modes, except for the <guiicon>Exit Full Screen Mode</guiicon> button which returns you to the &gwenview; window, the <guiicon>Pause/Resume Slideshow</guiicon> button, and the <guiicon>Configure Full Screen Mode</guiicon> button which shows a small settings dialog that allows you to easily and quickly configure the slideshow. The slideshow controls there are:
tr: Üst çubuk kendiliğinden gizlenecektir; göstermek için fareyi ekranın üstüne getirmeniz yeterlidir. Fare imleci üst çubuğun üzerindeyse kendiliğinden gizlenmez. Bazı düğmeler dışında, çubuktaki düğmeler Göz At veya Görüntüle kipindeki düğmeler ile aynıdır; farklı olanlar, sizi ana &gwenview; penceresine döndüren <guiicon>Tam Ekrandan Çık</guiicon> düğmesi, <guiicon>Slayt Gösterisini Duraklat/Sürdür</guiicon> düğmesi ve slayt gösterisini tez ve kolay yapılandırmanıza izin veren bir <guiicon>Tam ekran kipini yapılandır</guiicon> düğmesidir. Kullanılabilir slayt gösterisi denetimleri şunlardır:

source: The <guilabel>Interval</guilabel> slider controls how long &gwenview; will show an image before it move to the next one.
tr: <guilabel>Aralık</guilabel> sürgüsü, &gwenview;’ün bir sonraki görsele geçmeden önce bir görseli ne kadar süreyle göstereceğini denetler.

source: If the <guilabel>Loop</guilabel> check box is checked, when the end of the slideshow is reached, it will continue from the beginning instead of stopping.
tr: <guilabel>Döngü</guilabel> onay kutusu işaretliyse slayt gösterisinin sonuna gelindiğinde durmak yerine baştan sürecektir.

source: If the <guilabel>Random</guilabel> check box is checked, instead of progressing through the folder alphabetically, images will be shown in random order.
tr: <guilabel>Rastgele</guilabel> onay kutusu işaretliyse klasörde abecesel olarak ilerlemek yerine görseller rastgele sırada gösterilirler.

source: <guibutton>Select Image Information to Display</guibutton> allows you to define what metadata is displayed under the buttons on the toolbar.
tr: <guibutton>Görüntülenecek Görsel Bilgisini Seç</guibutton>, araç çubuğundaki düğmelerin altında hangi üst verinin görüntüleneceğini tanımlamanıza olanak tanır.

source: If the <guilabel>Show thumbnails</guilabel> check box is checked, thumbnails for all images in the current folder will be displayed to the right of the toolbar.
tr: <guilabel>Küçük görselleri göster</guilabel> onay kutusu işaretliyse geçerli klasördeki tüm görsellerin küçük halleri araç çubuğunun sağında görüntülenecektir.

source: The <guilabel>Height</guilabel> slider changes the size of the thumbnails displayed.
tr: <guilabel>Yükseklik</guilabel> sürgüsü, görüntülenen küçük görsellerin boyutunu değiştirir.

source: If enabled, an area that shows you the other images in the current folder will be shown on the top bar. Clicking on one will display it.
tr: Etkinleştirilirse üst çubukta geçerli klasördeki diğer görselleri gösteren bir alan gösterilecektir. Birine tıklamak onu gösterir.

source: Sidebar
tr: Kenar Çubuğu

source: The sidebar on the left is available in the Browse and View modes, but does not appear by default in Browse Mode. Its appearance can be toggled using <menuchoice> <shortcut> <keycap>F4</keycap> </shortcut> <guimenu>View</guimenu> <guimenuitem>Sidebar</guimenuitem> </menuchoice> or using the <guiicon>▮←</guiicon> / <guiicon>▮→</guiicon> button at the left side of the statusbar. When clicked it collapses or expands the sidebar. The sidebar contains several tabs:
tr: Soldaki kenar çubuğu, Göz At ve Görüntüle kiplerinde kullanılabilir; ancak Göz At kipinde öntanımlı olarak görünmez. Görünüşü, <menuchoice> <shortcut> <keycap>F4</keycap> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Kenar Çubuğu</guimenuitem> </menuchoice> seçenekleri kullanılarak veya durum çubuğunun solundaki <guiicon>▮←</guiicon> / <guiicon>▮→</guiicon> düğmesi kullanılarak açılabilir veya kapatılabilir. Tıklandığında, kenar çubuğunu genişletir veya daraltır. Kenar çubuğunda birkaç sekme bulunur:

source: Folders
tr: Klasörler

source: Displays a list of all folders on your system permitting you to switch between them. In Browse Mode thumbnails from the folder will be displayed, while in View Mode the first image in the folder will appear, from which you can browse through the folder using the <guibutton>Previous</guibutton> and <guibutton>Next</guibutton> buttons or shortcuts. Clicking on a folder multiple times toggles between View Mode and Browse Mode.
tr: Sisteminizdeki tüm klasörlerin bir listesini görüntüler ve bunlar arasında geçiş yapmanıza olanak tanır. Göz At kipinde klasörlerden küçük görseller görüntülenir; Görüntüle kipinde ise klasördeki ilk görsel görünür. Klasördeki görseller arasında kısayol veya <guibutton>Önceki</guibutton> ve <guibutton>Sonraki</guibutton> düğmelerini kullanarak geçiş yapabilirsiniz. Bir klasöre birçok kez tıklamak Görüntüle ve Göz At kipleri arasında geçiş yapar.

source: Information
tr: Bilgi

source: Displays <guilabel>Meta Information</guilabel> like the filename and size. The <guilabel>More...</guilabel> link permits you to view all available metadata and select which data appear in the sidebar.
tr: Dosya adı ve boyutu gibi <guilabel>Üst Bilgi</guilabel>’leri görüntüler. <guilabel>Daha Fazla…</guilabel> bağlantısı, kullanılabilir tüm üst veriyi görüntülemenize ve kenar çubuğunda hangi verinin görüneceğini seçmenize olanak tanır.

source: Operations
tr: İşlemler

source: This permits you to perform the <link linkend="image_operations">previously described global image operations</link> as well as those specific to View Mode. It also permits common file operations like copying, renaming, deleting, and creating new folders.
tr: Bu, <link linkend="image_operations">daha önce açıklanan genel görsel işlemlerinin</link> yanı sıra Görüntüle kipine özel işlemleri de gerçekleştirmenize olanak tanır. Ayrıca kopyalama, yeniden adlandırma, silme ve yeni klasör oluşturma gibi yaygın dosya işlemlerine de izin verir.

source: &gwenview; Importer
tr: &gwenview; İçe Aktarıcısı

source: The &gwenview; Importer allows you to import images from a digital camera or removable media. To launch it, select <guilabel>Download Photos with &gwenview;</guilabel> in the &kde; Device Notifier after connecting a supported device.
tr: &gwenview; içe aktarıcısı, görselleri bir sayısal kameradan veya çıkarılabilir ortamdan içe aktarmanıza izin verir. Başlatmak için desteklenen bir aygıtı bağladıktan sonra &kde; Aygıt Bildiricisi içindeki <guilabel>&gwenview; ile Fotoğrafları İndir</guilabel> seçeneğini seçin.

source: When you plug in a device the &gwenview; importer recursively lists all images and videos.
tr: Bir aygıt bağladığınızda, &gwenview; içe aktarıcısı tüm görselleri ve klasörleri özyineli olarak listeler.

source: This is not always what you expect, &eg; plugging a smartphone you do not want to list all medias of the device; but only the pictures you took, which are usually in a special subfolder.
tr: Bu her zaman beklediğiniz şey değildir; bir akıllı telefonu taktığınızda aygıttaki tüm ortamları değil de yalnızca, genellikle özel bir alt klasörde bulunan, çektiğiniz resimleri almak istersiniz.

source: Root Folder Picking
tr: Kök Klasör Seçimi

source: It is possible to select the root folder to list, and &gwenview; Importer will remember the last root folder for each device. This way, next time you plug a device in, only the relevant pictures and videos should be listed.
tr: Listelenecek kök klasörü seçmek olanaklıdır ve &gwenview; İçe Aktarıcısı, her aygıt için son kök klasörü anımsar. Böylece, bir sonrakinde aygıtı taktığınızda yalnızca ilgili resimler ve videolar listelenir.

source: Importing Images
tr: Görselleri İçe Aktarmak

source: &gwenview; Importer Screenshot
tr: &gwenview; İçe Aktarıcısı Ekran Görüntüsü

source: If you wish, you may select the images you want to import under <guilabel>Select the documents to import</guilabel> by pressing the <guiicon>+</guiicon> button that appears when hovering over an image. You may also select the folder that images are imported to in the text box at the bottom of the window. When you are done, click the <guibutton>Import Selected</guibutton> button to import only the images you have selected, or click <guibutton>Import All</guibutton> to import all images found on the device.
tr: Dilerseniz bir görselin üzerine fareyle geldiğinizde görünen <guiicon>+</guiicon> düğmesine basarak <guilabel>İçe aktarılacak belgeleri seç</guilabel> altında içe aktarmak istediğiniz belgeleri seçebilirsiniz. Ayrıca pencerenin altındaki metin kutusundan görsellerin içe aktarılacağı klasörü de seçebilirsiniz. İşiniz bittiğinde, yalnızca seçtiğiniz görselleri içe aktarmak için <guibutton>Seçiliyi İçe Aktar</guibutton> düğmesini veya aygıttaki tüm dosyaları içe aktarmak için <guibutton>Tümünü İçe Aktar</guibutton> düğmesine tıklayın.

source: Automatic Renaming
tr: Kendiliğinden Yeniden Adlandırma

source: &gwenview; Importer can rename your files according to a specified pattern. To configure this, select the <guibutton>Settings</guibutton> in the lower left corner. You may turn this feature on or off using the check box at the top. The <guilabel>Rename Format</guilabel> supports several special parameters, which will be replaced by metadata such as the date the image was created or its filename. They are listed below the text box. You may either click on the parameter name to enter it into the text box or type one manually.
tr: &gwenview; İçe Aktarıcısı, belirli bir dizgiye göre dosyaları yeniden adlandırabilir. Bunu yapılandırmak için sol alt köşeden <guibutton>Ayarlar</guibutton>’ı seçin. Bu özelliği, yukarıdaki onay kutusunu kullanarak açabilirsiniz veya kapatabilirsiniz. <guilabel>Yeniden Adlandırma Biçimi</guilabel>, birkaç parametreyi destekler; bunların arasında görselin oluşturma tarihi veya dosya adı olabilir. Bunlar metin kutusunun altında listelenirler. Metin kutusuna girmek için parametre adını tıklayabilirsiniz veya elle yazabilirsiniz.

source: Tips
tr: İpuçları

source: Using the mouse
tr: Fareyi kullanmak

source: Panning with the mouse
tr: Fare ile kaydırmak

source: Holding down the left mouse button on an image allows you to scroll the image.
tr: Bir görselin üzerinde farenin sol düğmesini basılı tutmak, görseli sarmanıza olanak tanır.

source: The mouse wheel will scroll the image up and down.
tr: Fare tekerleği, görseli yukarı ve aşağı saracaktır.

source: Zooming with the mouse
tr: Fare ile yakınlaştırmak

source: Clicking the middle mouse button will toggle the <guibutton>Fit</guibutton> zoom button. Hold down the &Shift; key and middle-click to toggle the <guibutton>Fill</guibutton> zoom button.
tr: Orta fare düğmesini tıklamak <guibutton>Sığdır</guibutton> yakınlaştırma düğmesini açar/kapatır. &Shift; düğmesini basılıp tutup orta fare düğmesine tıklarsanız <guibutton>Doldur</guibutton> seçeneği tetiklenir.

source: Hold down the &Ctrl; key, then either use the mouse wheel to zoom in and out or left click to zoom in and right click to zoom out.
tr: &Ctrl; düğmesini basılı tutun, ardından yakınlaştırmak ve uzaklaştırmak için fare tekerleğini kullanın veya yakınlaştırmak için sol tıklayın ve uzaklaştırmak için sağ tıklayın.

source: The mouse wheel, used while holding down the &Alt; key, will scroll the image horizontally.
tr: &Alt; düğmesi basılı tutulurken kullanılan fare tekerleği, görseli yatay olarak sarar.

source: Browsing with the mouse
tr: Fare ile göz atmak

source: When in Browse mode, clicking an image switches into View mode and shows that image.
tr: Göz At kipindeyken bir görsele tıklamak, Görüntüle kipine geçer ve o görseli gösterir.

source: When in Browse mode, scrolling the mouse wheel will scroll up or down the thumbnail view area.
tr: Göz At kipindeyken fare tekerleğini sarmak, küçük görsel görüntüleme alanını yukarı veya aşağı sarar.

source: If the <guilabel>Mouse wheel behavior</guilabel> option in <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &gwenview;</guimenuitem></menuchoice> is set to Browse, scrolling the mouse wheel while in View Mode will move you through the images in the folder.
tr: <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>&gwenview; Uygulamasını Yapılandır</guimenuitem></menuchoice> bölümündeki <guilabel>Fare tekerleği davranışı</guilabel> Göz At olarak ayarlanmışsa Görüntüle kipindeyken fare tekerleği ile sarmak, klasördeki görseller arasında dolaştırır.

source: Key bindings
tr: Düğme bağıntıları

source: &gwenview; comes with a range of keyboard shortcuts, all of which can be viewed and remapped by selecting <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Shortcuts...</guimenuitem></menuchoice>. Note that in the Files and Folders windows, all the normal &plasma; shortcuts are functional, unless otherwise remapped.
tr: &gwenview;, <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Kısayolları Yapılandır…</guimenuitem></menuchoice> bölümünden yapılandırılabilen ve yeniden eşlemlenebilen birçok klavye kısayolu ile birlikte gelir. Tüm dosyalar ve klasörler görünümünde olağan &plasma; kısayolları değiştirilmedikleri sürece kullanılabilirler.

source: A few of the most useful default bindings are:
tr: En kullanışlı düğme bağıntılarından bazıları şunlardır:

source: <keycap>Space</keycap>: Displays the next image in the directory.
tr: <keycap>Boşluk</keycap>: Dizindeki sonraki görsel görüntüler.

source: &Backspace;: Displays the previous image in the directory.
tr: &Backspace;: Dizindeki önceki görseli görüntüler.

source: <keycombo action="simul">&Alt;<keycap>Up</keycap></keycombo>: Moves to the parent folder of the current folder.
tr: <keycombo action="simul">&Alt;<keycap>Yukarı</keycap></keycombo>: Geçerli klasörün bir üst klasörüne geçer.

source: <keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo>: Switches into Full Screen Mode.
tr: <keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo>: Tam Ekran kipine geçer.

source: &Esc;: Switches back to Browse Mode.
tr: &Esc;: Göz At kipine geri döner.

source: <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo>: Show or hide the menubar.
tr: <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo>: Menü çubuğunu gösterin veya gizleyin.

source: <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo>: Show or hide the Thumbnail bar.
tr: <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo>: Küçük görsel çubuğunu gösterin veya gizleyin.

source: <keycap>F4</keycap>: Show or hide the Sidebar.
tr: <keycap>F4</keycap>: Kenar çubuğunu gösterin veya gizleyin.

source: <keycap>F6</keycap>: Make the Location bar editable so that you can directly type in a file path. You can return to the standard Location Bar by pressing the arrow at the right.
tr: <keycap>F6</keycap>: Doğrudan dosya yolunu yazabilmeniz için Konum Çubuğu’nu düzenlenebilir hale getirin. Sağdaki oka basarak standart Konum Çubuğu’na dönebilirsiniz.

source: <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo>: Rotate the current image to the right.
tr: <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo>: Geçerli görseli sağa döndürün.

source: <keycombo action="simul">&Ctrl;&Shift;<keycap>R</keycap></keycombo>: Rotate the current image to the left.
tr: <keycombo action="simul">&Ctrl;&Shift;<keycap>R</keycap></keycombo>: Geçerli görseli sola döndürün.

source: <keycombo action="simul">&Shift;<keycap>R</keycap></keycombo>: Resize the current image.
tr: <keycombo action="simul">&Shift;<keycap>R</keycap></keycombo>: Geçerli görseli yeniden boyutlandırın.

source: <keycombo action="simul">&Shift;<keycap>C</keycap></keycombo>: Crop the current image.
tr: <keycombo action="simul">&Shift;<keycap>C</keycap></keycombo>: Geçerli görseli kırpın.

source: <keycombo action="simul">&Ctrl;<keycap>Y</keycap></keycombo>: When multiple images are displayed in View Mode, this synchronizes their views.
tr: <keycombo action="simul">&Ctrl;<keycap>Y</keycap></keycombo>: Görüntüle kipinde birden çok görsel görüntülendiğinde, bu onların görünümlerini eşzamanlar.

source: <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo>: Save any changes made to the image.
tr: <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo>: Görselde yapılan değişiklikleri kaydedin.

source: <keycap>Del</keycap>: Move the current image to the trash.
tr: <keycap>Sil</keycap>: Geçerli görseli çöp kutusuna taşıyın.

source: <keycombo action="simul">&Shift;<keycap>Del</keycap></keycombo>: Permanently delete the image from the disk. Note that this operation is irreversible and cannot be undone.
tr: <keycombo action="simul">&Shift;<keycap>Sil</keycap></keycombo>: Görseli diskten kalıcı olarak silin. Bu işlemin geri döndürülemez olduğunu ve geri alınamayacağını unutmayın.

source: <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo>: Print the current image.
tr: <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo>: Geçerli görseli yazdırın.

source: <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo>: Open an image using the standard file selection dialog.
tr: <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo>: Standart dosya seçim iletişim kutusunu kullanarak bir görsel açın.

source: <keycap>F</keycap>: Pressing this shortcut toggles zoom-to-fit on and off.
tr: <keycap>F</keycap>: Bu kısayola basmak sığdırmak için yakınlaştırmayı açar ve kapatır.

source: <keycap>P</keycap>: Viewing a video this shortcut toggles playback on and off.
tr: <keycap>P</keycap>: Bir videoyu görüntülerken bu kısayol oynatmayı açar ve kapatır.

source: <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo>: Edit tags.
tr: <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo>: Etiketleri düzenleyin.

source: <keycap>F2</keycap>: Rename an image inline.
tr: <keycap>F2</keycap>: Bir görseli yerinde yeniden adlandırın.

source: <keycap>Del</keycap>: Move an image to the trash.
tr: <keycap>Sil</keycap>: Bir görseli çöp kutusuna taşıyın.

source: <keycombo action="simul">&Shift;<keycap>Del</keycap></keycombo>: Delete an image.
tr: <keycombo action="simul">&Shift;<keycap>Sil</keycap></keycombo>: Bir görseli silin.

source: <keycombo action="simul"><keycap>F7</keycap></keycombo>: Copy an image.
tr: <keycombo action="simul"><keycap>F7</keycap></keycombo>: Bir görseli kopyalayın.

source: <keycombo action="simul"><keycap>F8</keycap></keycombo>: Move an image.
tr: <keycombo action="simul"><keycap>F8</keycap></keycombo>: Bir görseli taşıyın.

source: <keycombo action="simul"><keycap>F9</keycap></keycombo>: Link an image.
tr: <keycombo action="simul"><keycap>F9</keycap></keycombo>: Bir görseli bağlantılayın.

source: Configuring &gwenview;
tr: &gwenview; Yapılandırması

source: Configuration overview
tr: Yapılandırma genel görünümü

source: You can configure &gwenview; by choosing <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &gwenview;...</guimenuitem></menuchoice>. The configuration dialog is split into three sections. This chapter describes the available options in detail.
tr: <menuchoice><guimenu>Ayarlar</guimenu> <guimenuitem>&gwenview; Uygulamasını Yapılandır…</guimenuitem></menuchoice> ögesini seçerek &gwenview; uygulamasını yapılandırabilirsiniz. Yapılandırma iletişim kutusu üç bölüme ayrılmıştır. Bu bölümde kullanılabilir seçenekler ayrıntılı olarak açıklanmaktadır.

source: <link linkend="configgeneral">General</link>
tr: <link linkend="configgeneral">Genel</link>

source: <link linkend="configview">Image View</link>
tr: <link linkend="configview">Görsel Görünümü</link>

source: <link linkend="configadvanced">Advanced</link>
tr: <link linkend="configadvanced">Gelişmiş</link>

source: <title>General</title>
tr: <title>Genel</title>

source: Videos
tr: Videolar

source: Check the <guilabel>Show videos</guilabel> checkbox to allow &gwenview; to show videos among the images.
tr: &gwenview;’ün görseller arasında video göstermesine izin vermek için <guilabel>Videoları göster</guilabel> onay kutusunu işaretleyin.

source: Uncheck the <guilabel>Automatically play</guilabel> checkbox to disable autoplaying videos. This prevents video from automatically starting when browsing.
tr: Videoların kendiliğinden oynatılmasını devre dışı bırakmak için <guilabel>Kendiliğinden oynat</guilabel> onay kutusunun işaretini kaldırın. Bu, tarama sırasında videonun kendiliğinden başlatılmasını engeller.

source: Notify after reaching the last image
tr: Son görsele ulaşınca bildir

source: Select the <guilabel>Never</guilabel> item to allow &gwenview; looping through the list of images without additional notifications.
tr: &gwenview;’ün ek bildirimler olmadan görseller listesinde dolaşmasına izin vermek için <guilabel>Asla</guilabel> ögesini seçin.

source: Select the <guilabel>Only during slideshows</guilabel> item if notifications about reaching the list end should be shown only in <link linkend="fullscreen">the slideshow mode</link>.
tr: Listenin sonuna ulaşmak ile ilgili bildirimlerin yalnızca <link linkend="fullscreen">slayt gösterisi kipinde</link> gösterilmesini istiyorsanız <guilabel>Yalnızca slayt gösterisi sırasında</guilabel> ögesini seçin.

source: Select the <guilabel>Always</guilabel> item if you want to receive the notifications unconditionally.
tr: Bildirimleri koşulsuz olarak almak istiyorsanız <guilabel>Her zaman</guilabel> ögesini seçin.

source: Background color
tr: Arka plan rengi

source: Move the slider to change the color of the gray background in Browse and View mode from black (the leftmost position) to white (the rightmost position).
tr: Göz At ve Görüntüle kiplerinde gri arka planın rengini siyahtan (en soldaki konum) beyaza (en sağdaki konum) değiştirmek için sürgüyü sürün.

source: Fullscreen background
tr: Tam ekran arka planı

source: <guilabel>Black</guilabel> &mdash; Set the background color in fullscreen mode to black.
tr: <guilabel>Siyah</guilabel> &mdash; Tam ekran kipinde arka plan rengini siyah olarak ayarlayın.

source: <guilabel>Dark gray texture</guilabel> &mdash; Set the background in fullscreen mode to a dark gray texture.
tr: <guilabel>Koyu gri doku</guilabel> &mdash; Tam ekran kipinde arka plan rengini koyu gri olarak ayarlayın.

source: Lossy image save quality
tr: Kayıplı görsel kaydetme kalitesi

source: Save/compression quality setting for lossy image formats like JPEG, WEBP, AVIF, HEIF, and HEIC, which can be temporarily overridden in the <guilabel>Save As</guilabel> dialog when saving a file in a lossy image format. When saving an existing lossy image with a new name or after performing a non-lossy edit (&eg; rotation, which only changes the EXIF rotation tag), the appearance of the file is not changed because no actual image manipulation is done.
tr: JPEG, WEBP, AVIF, HEIF ve HEIC gibi kayıplı görsel biçimleri için kaydetme/sıkıştırma kalitesi ayarı; bir dosyayı kayıplı görsel biçiminde kaydederken <guilabel>Farklı Kaydet</guilabel> iletişim kutusunda geçici olarak geçersiz kılınabilir. Var olan bir kayıplı görseli yeni bir adla kaydederken veya kayıpsız bir düzenleme (örneğin, yalnızca EXIF döndürme etiketini değiştiren döndürme) gerçekleştirdikten sonra, gerçek görsel üzerinde herhangi bir değişiklik yapılmadığından dosyanın görünümü değişmez.

source: Thumbnail actions
tr: Küçük görsel eylemleri

source: Whether the thumbnail action buttons should be shown as overlays above image thumbnails.
tr: Küçük görsel eylem düğmelerinin, görsel küçük halleri üzerinde katmanlar olarak gösterilip gösterilmeyeceği.

source: <guilabel>All buttons</guilabel> &mdash; Show all buttons
tr: <guilabel>Tüm düğmeler</guilabel> &mdash; Tüm düğmeleri göster
