Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kamoso.po
Languages: tr

source: The Kamoso Handbook
tr: Kamoso El Kitabı

source: <firstname>This documentation was converted from the KDE UserBase <ulink url="http://userbase.kde.org/Kamoso">Kamoso</ulink> page and updated by the &kde; documentation team.</firstname> <surname></surname>
tr: <firstname>Bu belgelendirme KDE Kullanıcı Tabanı<ulink url=" http://userbase.kde.org/Kamoso">Kamoso</ulink> sayfasından dönüştürülmüştür ve &kde; belgelendirme takımı tarafından güncellenmiştir.</firstname> <surname></surname>

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Volkan</firstname><surname>Gezer</surname><affiliation><address><email>volkangezer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Take a shot
tr: Resim çek

source: &kamoso; gives you an opportunity to make photos from your webcam and upload them to Internet
tr: &kamoso;, web kameranızdan fotoğraflar yapıp internete yüklemenizi sağlar

source: Record video
tr: Video kaydet

source: &kamoso; allows to record videos from your webcam and upload them to the Internet
tr: &kamoso;, web kameranızdan videolar kaydedip internete yüklemenizi sağlar

source: User Guide
tr: Kullanıcı Kılavuzu

source: Welcome to &kamoso;!
tr: &kamoso;'ya hoş geldiniz!

source: &kamoso; is a great program to use your webcam to take pictures or make videos. This guide will help you to use &kamoso; once you have installed it.
tr: &kamoso;, web kameranızı kullanarak fotoğraflar çekmek veya video yapmak için harika bir programdır. Bu kılavuz, kurulumdan sonra &kamoso;'yu kullanmanızda size yardımcı olacak.

source: Quick Start
tr: Hızlı Başlangıç

source: On launching &kamoso;, it displays this window with buttons at the bottom:
tr: &kamoso; başlatıldığında, alttaki düğmelerle bu pencereyi görüntüler:

source: Switch to <guibutton>Shoot</guibutton> mode to take one picture
tr: Bir fotoğraf çekmek için <guibutton>Resim Çek</guibutton> kipine geçin

source: Switch to <guibutton>Burst</guibutton> mode and take continuously pictures until you stop by clicking the middle button again
tr: <guibutton>Şipşak Çek</guibutton> kipine geçin ve yeniden orta düğmeye basarak durana kadar kesintisiz fotoğraflar çekin

source: Switch to <guibutton>Record</guibutton> mode to record a video
tr: Bir video kaydetmek için <guibutton>Video Kaydet</guibutton> kipine geçin

source: Start or stop taking pictures or recording a video
tr: Fotoğraf çekmeye veya video kaydetmeye başla ya da durdur

source: Show gallery
tr: Galeriyi göster

source: Show settings
tr: Ayarları göster

source: Pictures and videos are numbered consecutively and saved automatically in the <guilabel>Captures directory</guilabel> defined in the settings.
tr: Fotoğraflar ve videolar sıralı olarak numaralandırılırlar ve ayarlarda belirtilen <guilabel>Çekimler dizinine</guilabel> otomatik olarak kaydedilirler.

source: Managing Captures
tr: Çekimlerin Yönetimi

source: To view and manage your captured pictures or videos click the <guibutton>Show gallery</guibutton> button. In the context menu for each entry in the gallery you find actions to manage them:
tr: Çekilen fotoğraflarınız veya videolarınızı görüntülemek ve yönetmek için <guibutton>Galeriyi Göster</guibutton> düğmesine tıklayın. Galerideki her bir ögenin içerik menüsünde yönetim için eylemler bulacaksınız:

source: Use <guimenuitem>Open</guimenuitem> to view your captures in the associated application.
tr: Çekimlerinizi ilişkili uygulamada görüntülemek için <guimenuitem>Aç</guimenuitem> seçeneğini kullanın.

source: If you want to delete pictures and videos open the captures folder in the filemanager.
tr: Fotoğrafları ve videoları silmek isterseniz çekim dizininizi dosya yöneticisinde açın.

source: The next actions allow you to upload captures to the Internet or send them to a contact or device.
tr: Sıradaki eylemler çekimlerinizi internete yüklemenizi veya bir kişiye veya aygıta göndermenizi sağlar.

source: Use <guimenuitem>Save as</guimenuitem> to copy the complete content of the gallery to a new folder.
tr: Galerinin tüm içeriğini yeni bir dizine kopyalamak için <guimenuitem>Farklı Kaydet</guimenuitem> kullanın.

source: Customizing
tr: Özelleştirme

source: Click the <guibutton>Show settings</guibutton> button to open the settings panel. Click the button again to hide the settings panel.
tr: Ayarlar panosunu açmak için <guibutton>Ayarları Göster</guibutton> düğmesine tıklayın. Ayarlar panosunu gizlemek için düğmeye yeniden tıklayın.

source: If you want to change the folder where &kamoso; saves pictures and videos, change the <guilabel>Captures directory</guilabel> at the top.
tr: &kamoso;'nun fotoğrafları ve videoları sakladığı dizini değiştirmek isterseniz, yukarıdan <guilabel>Çekim dizinini</guilabel> değiştirin.

source: Enable <guibutton>Use flash</guibutton> to highlight the window before taking photos.
tr: Fotoğraf çekmeden önce pencereyi aydınlatmak için <guibutton>flaş kullan</guibutton> seçeneğini etkinleştirin.

source: Using the sliders you can modify camera settings like brightness, hue, contrast, saturation and gamma.
tr: Kaydırıcıları kullanarak aydınlık, ton, karşıtlık ve gama gibi kamera ayarlarını değiştirebilirsiniz.

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Documentation Copyright see the UserBase <ulink url="http://userbase.kde.org/index.php?title=Kamoso&amp;action=history">Kamoso page history</ulink>
tr: Belgelendirme telif hakkı için Kullanıcı Tabanı’nda <ulink url="http://userbase.kde.org/index.php?title=Kamoso&amp;action=history">Kamoso sayfa geçmişi</ulink>’ne bakın.

source: CREDIT_FOR_TRANSLATORS
tr: <para>Volkan Gezer<email>volkangezer@gmail.com</email></para>
