Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_menus.po
Languages: tr

source: <shortcut> <keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guisubmenu>Find Variants</guisubmenu> <guimenuitem>Find Previous</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guisubmenu>Benzerlerini Bul</guisubmenu> <guimenuitem>Öncekini Bul</guimenuitem>

source: This repeats the last find operation, if any, without calling the incremental search bar, and searching backwards instead of forwards through the document.
tr: Bu, artımlı arama çubuğunu çağırmadan ve belgede ileri yerine geriye doğru arama yapmadan, varsa son bulma işlemini yineler.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guisubmenu>Find Variants</guisubmenu> <guimenuitem>Find Selected</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guisubmenu>Benzerlerini Bul</guisubmenu> <guimenuitem>Seçiliyi Bul</guimenuitem>

source: Finds next occurrence of selected text.
tr: Seçili metnin bir sonraki oluşunu bulur.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guisubmenu>Find Variants</guisubmenu> <guimenuitem>Find Selected Backwards</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guisubmenu>Benzerlerini Bul</guisubmenu> <guimenuitem>Seçiliyi Geriye Doğru Bul</guimenuitem>

source: Finds previous occurrence of selected text.
tr: Seçili metnin bir önceki oluşunu bulur.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Replace...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Değiştir…</guimenuitem>

source: This command opens the power search and replace bar. On the upper left side of the bar is a button with an icon to close the bar, followed by a small text box for entering the search pattern.
tr: Bu komut, güçlü arama ve değiştirme çubuğunu açar. Çubuğun sol üst tarafında, çubuğu kapatmak için bir simgenin bulunduğu bir düğme ve ardından arama dizgisini girmek için küçük bir metin kutusu bulunur.

source: You can control the search mode by selecting <guilabel>Plain text</guilabel>, <guilabel>Whole words</guilabel>, <guilabel>Escape sequences</guilabel> or <guilabel>Regular expression</guilabel> from the drop down box.
tr: Arama kipini açılır menüden; <guilabel>Düz metin</guilabel>, <guilabel>Tüm sözcükler</guilabel>, <guilabel>Kaçış dizileri</guilabel> veya <guilabel>Düzenli ifade</guilabel> ögelerinden birini seçerek denetleyebilirsiniz.

source: If <guilabel>Escape sequences</guilabel> or <guilabel>Regular expression</guilabel> are selected, the <guibutton>Add...</guibutton> menuitem at the bottom of the context menu of the text boxes will be enabled and allows you to add escape sequences or regular expression items to the search or replace pattern from predefined lists.
tr: <guilabel>Kaçış dizileri</guilabel> veya <guilabel>Düzenli ifade</guilabel> seçiliyse metin kutularının bağlam menüsünün alt kısmındaki <guibutton>Ekle…</guibutton> menü ögesi etkinleştirilir ve önceden tanımlanmış listelerden aramaya kaçış dizileri veya düzenli ifade ögeleri eklemenize veya dizgileri değiştirmenize olanak tanır.

source: Enter the text to replace with in the text box labeled <guilabel>Replace</guilabel> and click the <guibutton>Replace</guibutton> button to replace only the highlighted text or the <guibutton>Replace All</guibutton> button to replace the search text in the whole document.
tr: Değiştirilecek metni <guilabel>Değiştir</guilabel> etiketli metin kutusuna girin ve yalnızca vurgulanan metni değiştirmek için <guibutton>Değiştir</guibutton> düğmesine veya arama metnini tüm belgede değiştirmek için <guibutton>Tümünü Değiştir</guibutton> düğmesine tıklayın.

source: You can modify the search and replace behavior by selecting different options at the bottom of the bar. Selecting <inlinemediaobject><imageobject><imagedata fileref="format-text-superscript-22.png" format="PNG"/></imageobject></inlinemediaobject> will limit finds to entries that match the case (upper or lower) of each of the characters in the search pattern. <inlinemediaobject><imageobject><imagedata fileref="edit-select-all-22.png" format="PNG"/></imageobject></inlinemediaobject> will search and replace within the current selection only. The <guilabel>Find All</guilabel> button highlights all matches in the document and shows the number of found matches in a small popup.
tr: Çubuğun altındaki farklı seçenekleri belirleyerek arama ve değiştirme davranışını değiştirebilirsiniz. <inlinemediaobject><imageobject><imagedata fileref="format-text-superscript-22.png" format="PNG"/></imageobject></inlinemediaobject> seçmek, arama dizgisindeki karakterlerin her birinin BÜYÜK/küçük harfle (BÜYÜK veya küçük) eşleşen girişlerle bulmaya sınırlandıracaktır. <inlinemediaobject><imageobject><imagedata fileref="edit-select-all-22.png" format="PNG"/></imageobject></inlinemediaobject>, yalnızca geçerli seçim içinde arama yapacak ve değiştirecektir. <guilabel>Tümünü Bul</guilabel> düğmesi belgedeki tüm eşleşmeleri vurgular ve bulunan eşleşmelerin sayısını küçük bir açılır pencerede gösterir.

source: Click on the <inlinemediaobject><imageobject><imagedata fileref="configure-shortcuts-22.png" format="PNG"/></imageobject></inlinemediaobject> button at the right side of the power search and replace bar to switch to the incremental search bar.
tr: Artımlı arama çubuğuna geçmek için güçlü arama ve değiştirme çubuğunun sağ tarafındaki <inlinemediaobject><imageobject><imagedata fileref="configure-shortcuts-22.png" format="PNG"/></imageobject></inlinemediaobject> düğmesine tıklayın.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>6</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guisubmenu>Go To</guisubmenu> <guimenuitem>Go to Matching Bracket</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>6</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guisubmenu>Git</guisubmenu> <guimenuitem>Ayracın Eşine Git</guimenuitem>

source: Move the cursor to the associated opening or closing bracket.
tr: İmleci ilgili açılış veya kapanış ayracına taşıyın.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>6</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guisubmenu>Go To</guisubmenu> <guimenuitem>Select to Matching Bracket</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>6</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guisubmenu>Git</guisubmenu> <guimenuitem>Ayracın Eşine Kadar Seç</guimenuitem>

source: Selects the text between associated opening and closing brackets.
tr: İlgili açılış ve kapanış ayraçları arasındaki metni seçer.

source: <guimenu>Edit</guimenu> <guisubmenu>Go To</guisubmenu> <guimenuitem>Go to Previous Modified Line</guimenuitem>
tr: <guimenu>Düzen</guimenu> <guisubmenu>Git</guisubmenu> <guimenuitem>Önceki Düzenlenmiş Satıra Git</guimenuitem>

source: Lines that were changed since opening the file are called modified lines. This action jumps the previous modified line.
tr: Dosya açıldıktan sonra değiştirilen satırlara modifiye satırlar denir. Bu eylem önceki değiştirilen satıra atlar.

source: <guimenu>Edit</guimenu> <guisubmenu>Go To</guisubmenu> <guimenuitem>Go to Next Modified Line</guimenuitem>
tr: <guimenu>Düzen</guimenu> <guisubmenu>Git</guisubmenu> <guimenuitem>Sonraki Düzenlenmiş Satıra Git</guimenuitem>

source: Lines that were changed since opening the file are called modified lines. This action jumps the next modified line.
tr: Dosya açıldıktan sonra değiştirilen satırlara modifiye satırlar denir. Bu eylem sonraki değiştirilen satıra atlar.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guisubmenu>Go To</guisubmenu> <guimenuitem>Go to Line...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guisubmenu>Git</guisubmenu> <guimenuitem>Satıra Git…</guimenuitem>

source: This opens the goto line bar at the bottom of the window which is used to have the cursor jump to a particular line (specified by number) in the document. The line number may be entered directly into the text box or graphically by clicking on the up or down arrow spin controls at the side of the text box. The little up arrow will increase the line number and the down arrow decrease it. Close the bar with a click on the button with an icon on the left side of the bar.
tr: Bu, imlecin belgedeki belirli bir satıra (numarayla belirtilen) atlaması için kullanılan, pencerenin alt kısmındaki satıra git çubuğunu açar. Satır numarası doğrudan metin kutusuna girilebilir veya metin kutusunun yan tarafındaki yukarı veya aşağı ok döndürme denetimlerine tıklanarak grafiksel olarak girilebilir. Küçük yukarı ok satır numarasını artıracak, aşağı ok ise azaltacaktır. Çubuğun sol tarafında simge bulunan düğmeye tıklayarak çubuğu kapatın.

source: The View Menu
tr: Görünüm Menüsü

source: <guimenu>View</guimenu> <guimenuitem>New Window</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Yeni Pencere</guimenuitem>

source: <action>Opens another instance of &kate;</action>. The new instance will be identical to your previous instance.
tr: <action>&kate;’in başka bir örneğini açar</action>. Yeni örnek önceki örneğinizle aynı olacaktır.

source: <shortcut> <keycombo action="simul">&Alt;&Right;</keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Next Tab</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;&Right;</keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Sonraki Sekme</guimenuitem>

source: Activates the next tab in the tabbar.
tr: Sekme çubuğundaki sonraki sekmeyi etkinleştirir.

source: <shortcut> <keycombo action="simul">&Alt;&Left;</keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Previous Tab</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;&Left;</keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Önceki Sekme</guimenuitem>

source: Activates the previous tab in the tabbar.
tr: Sekme çubuğundaki önceki sekmeyi etkinleştirir.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>T</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Reopen Latest Closed Document</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>T</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Son Kapatılan Belgeleri Yeniden Aç</guimenuitem>

source: Reopens the latest closed document or documents.
tr: Yakın zamanda kapatılan belgeyi/belgeleri yeniden açar.

source: <shortcut> <keycombo action="simul">&Ctrl;&Alt;<keycap>O</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Quick Open</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Alt;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Tez Aç</guimenuitem>

source: Show a search field and a list of opened files in the editor area. While entering text in the search field the document names and document &URL;s are searched for matching text. While entering text in the search field you can use the cursor keys &Up; and &Down; to navigate in the list view. Pressing the &Enter; key or double clicking on an item in the list switches the view to the document selected in the list view. This makes switching between documents easier, if there are a lot of them open.
tr: Düzenleyici alanında bir arama alanı ve açılan dosyaların listesini gösterin. Arama alanına metin girerken, eşleşen metin için belge adları ve belge &URL;’leri aranır. Arama alanına metin girerken liste görünümünde gezinmek için &Up; ve &Down; ok düğmelerini kullanabilirsiniz. &Enter; düğmesine basmak veya listedeki bir ögeye çift tıklamak, görünümü liste görünümünde seçili belgeye geçirir. Bu, eğer çok sayıda açık belge varsa belgeler arasında geçiş yapmayı kolaylaştırır.

source: This action is available also using the <inlinemediaobject><imageobject><imagedata fileref="quickopen-22.png" format="PNG"/></imageobject></inlinemediaobject> icon at the top right of the editor window.
tr: Bu eyleme düzenleyici penceresinin sağ üst köşesindeki <inlinemediaobject><imageobject><imagedata fileref="quickopen-22.png" format="PNG"/></imageobject></inlinemediaobject> simgesi kullanılarak da ulaşılabilir.

source: <shortcut> <keycombo action="simul">&Shift;<keycap>F8</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guisubmenu>Split View</guisubmenu> <guimenuitem>Previous Split View</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Shift;<keycap>F8</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guisubmenu>Bölünmüş Görünüm</guisubmenu> <guimenuitem>Önceki Bölünmüş Görünüm</guimenuitem>

source: Focus the previous document view, if you have split the editor area in more views.
tr: Düzenleyici alanını birden çok görünüme böldüyseniz önceki belge görünümüne odaklanın.

source: <shortcut> <keycap>F8</keycap> </shortcut> <guimenu>View</guimenu> <guisubmenu>Split View</guisubmenu> <guimenuitem>Next Split View</guimenuitem>
tr: <shortcut> <keycap>F8</keycap> </shortcut> <guimenu>Görünüm</guimenu> <guisubmenu>Bölünmüş Görünüm</guisubmenu> <guimenuitem>Sonraki Bölünmüş Görünüm</guimenuitem>

source: Focus the next document view, if you have split the editor area in more views.
tr: Düzenleyici alanını birden çok görünüme böldüyseniz sonraki belge görünümüne odaklanın.

source: <guimenu>View</guimenu> <guisubmenu>Split View</guisubmenu> <guimenuitem>Left Split View</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Bölünmüş Görünüm</guisubmenu> <guimenuitem>Sol Bölünmüş Görünüm</guimenuitem>

source: Focus the split view intuitively on the left, using the cursor position to disambiguate if necessary.
tr: Gerekirse belirsizliği gidermek için imleç konumunu kullanarak bölünmüş görünümü sezgisel olarak sola odaklayın.

source: <guimenu>View</guimenu> <guisubmenu>Split View</guisubmenu> <guimenuitem>Right Split View</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Bölünmüş Görünüm</guisubmenu> <guimenuitem>Sağ Bölünmüş Görünüm</guimenuitem>

source: Focus the split view intuitively on the right, using the cursor position to disambiguate if necessary.
tr: Gerekirse belirsizliği gidermek için imleç konumunu kullanarak bölünmüş görünümü sezgisel olarak sağa odaklayın.

source: <guimenu>View</guimenu> <guisubmenu>Split View</guisubmenu> <guimenuitem>Upward Split View</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Bölünmüş Görünüm</guisubmenu> <guimenuitem>Yukarı Bölünmüş Görünüm</guimenuitem>

source: Focus the split view intuitively upward, using the cursor position to disambiguate if necessary.
tr: Gerekirse belirsizliği gidermek için imleç konumunu kullanarak bölünmüş görünümü sezgisel olarak yukarı odaklayın.

source: <guimenu>View</guimenu> <guisubmenu>Split View</guisubmenu> <guimenuitem>Downward Split View</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Bölünmüş Görünüm</guisubmenu> <guimenuitem>Aşağı Bölünmüş Görünüm</guimenuitem>

source: Focus the split view intuitively downward, using the cursor position to disambiguate if necessary.
tr: Gerekirse belirsizliği gidermek için imleç konumunu kullanarak bölünmüş görünümü sezgisel olarak aşağı odaklayın.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>L</keycap></keycombo></shortcut> <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu> <guimenuitem>Split Vertical</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>L</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu><guisubmenu>Bölünmüş Görünüm</guisubmenu> <guimenuitem>Dikey Olarak Böl</guimenuitem>

source: This will split the frame (which may be the main editing area) in two equally sized frames, the new one to the left of the current one. The new frame gets the focus, and will display the same document as the old one.
tr: Bu, çerçeveyi (ana düzenleme alanı olabilir) iki eşit boyutlu çerçeveye böler; yenisi geçerli çerçevenin soluna yerleştirilir. Yeni çerçeve odağı alır ve eski belgeyle aynı belgeyi görüntüler.

source: See also <link linkend="kate-mdi">Working with the &kate; MDI</link>.
tr: Ayrıca <link linkend="kate-mdi">&kate; MDI ile çalışmak</link> belgesine bir göz atın.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>T</keycap></keycombo></shortcut> <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu> <guimenuitem>Split Horizontal</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>T</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu><guisubmenu>Bölünmüş Görünüm</guisubmenu> <guimenuitem>Yatay Olarak Böl</guimenuitem>

source: Splits the current frame (which may be the main editing area) in two equally sized frames, the new one below the current one. The new frame gets the focus, and displays the same document as the old one.
tr: Bu, çerçeveyi (ana düzenleme alanı olabilir) iki eşit boyutlu çerçeveye böler; yenisi geçerli çerçevenin altına yerleştirilir. Yeni çerçeve odağı alır ve eski belgeyle aynı belgeyi görüntüler.

source: See also <link linkend="kate-mdi">Working with the &kate; MDI</link>
tr: Ayrıca <link linkend="kate-mdi">&kate; MDI ile çalışmak</link> belgesine bir göz atın.

source: <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu> <guimenuitem>Move Document to New Vertical Split</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guisubmenu>Bölünmüş Görünüm</guisubmenu> <guimenuitem>Belgeyi Yeni Dikey Bölüntüye Taşı</guimenuitem>

source: This will split the currently active view vertically into two views and move the currently active document to right view.
tr: Bu, geçerli etkin görünümü dikey olarak iki görünüme bölecek ve geçerli etkin belgeyi sağ görünüme taşıyacaktır.

source: <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu> <guimenuitem>Move Document to New Horizontal Split</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guisubmenu>Bölünmüş Görünüm</guisubmenu> <guimenuitem>Belgeyi Yeni Yatay Bölüntüye Taşı</guimenuitem>

source: This will split the currently active view horizontally into two views and move the currently active document to view below.
tr: Bu, geçerli etkin görünümü dikey olarak iki görünüme bölecek ve geçerli etkin belgeyi aşağı görünüme taşıyacaktır.

source: <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu> <guimenuitem>Toggle Orientation</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guisubmenu>Bölünmüş Görünüm</guisubmenu> <guimenuitem>Yönelimi Değiştir</guimenuitem>

source: Switch between horizontal and vertical split.
tr: Yatay ve dikey bölüntüler arasında geçiş yapın.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>R</keycap></keycombo></shortcut> <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu> <guimenuitem>Close Current View</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>R</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu><guisubmenu>Bölünmüş Görünüm</guisubmenu> <guimenuitem>Geçerli Görünümü Kapat</guimenuitem>

source: Closes the active frame, which can be identified as the one displaying a blinking cursor. This is disabled, if there is only one frame (the main editing area).
tr: Yanıp sönen imleci görüntüleyen çerçeveyi olarak tanımlanabilecek etkin çerçeveyi kapatır. Yalnızca bir kare (ana düzenleme alanı) varsa bu devre dışı bırakılır.

source: No documents get closed by closing a frame &ndash; they will still be available in the <link linkend="view-menu"><guimenu>View</guimenu> Menu</link> as well as in the File List.
tr: Hiçbir belge bir çerçeve kapatılarak kapatılmaz; belgelere dosya listesinin yanı sıra <link linkend="view-menu"><guimenu>Görünüm</guimenu></link> menüsünden de ulaşılabilir.

source: <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu> <guimenuitem>Close Inactive Views</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guisubmenu>Bölünmüş Görünüm</guisubmenu> <guimenuitem>Etkin Olmayan Görünümleri Kapat</guimenuitem>

source: Closes all frames except the active frame (the one with a blinking cursor). This is disabled, if there is only one frame (the main editing area).
tr: Etkin çerçeve (yanıp sönen imlecin bulunduğu çerçeve) dışındaki tüm çerçeveleri kapatır. Yalnızca bir kare (ana düzenleme alanı) varsa bu devre dışı bırakılır.

source: <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu> <guimenuitem>Hide Inactive Views</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guisubmenu>Bölünmüş Görünüm</guisubmenu> <guimenuitem>Etkin Olmayan Görünümleri Gizle</guimenuitem>

source: This hides all split views except the currently active one.
tr: Bu, şu anda etkin olan dışındaki tüm bölünmüş görünümleri gizler.

source: <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu> <guimenuitem>Move Splitter Left</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guisubmenu>Bölünmüş Görünüm</guisubmenu> <guimenuitem>Bölücüyü Sola Taşı</guimenuitem>

source: When Split View is enabled, this will move the border between two vertically split documents further left.
tr: Bölünmüş Görünüm etkinleştirildiğinde, bu, dikey olarak bölünmüş iki belge arasındaki kenarlığı daha sola kaydırır.

source: <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu> <guimenuitem>Move Splitter Right</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guisubmenu>Bölünmüş Görünüm</guisubmenu> <guimenuitem>Bölücüyü Sağa Taşı</guimenuitem>

source: When Split View is enabled, this will move the border between two vertically split documents further right.
tr: Bölünmüş Görünüm etkinleştirildiğinde, bu, dikey olarak bölünmüş iki belge arasındaki kenarlığı daha sağa kaydırır.

source: <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu> <guimenuitem>Move Splitter Up</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guisubmenu>Bölünmüş Görünüm</guisubmenu> <guimenuitem>Bölücüyü Yukarı Taşı</guimenuitem>

source: When Split View is enabled, this will move the border between two horizontally split documents further up.
tr: Bölünmüş Görünüm etkinleştirildiğinde, bu, dikey olarak bölünmüş iki belge arasındaki kenarlığı daha yukarı kaydırır.

source: <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu> <guimenuitem>Move Splitter Down</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guisubmenu>Bölünmüş Görünüm</guisubmenu> <guimenuitem>Bölücüyü Aşağı Taşı</guimenuitem>

source: When Split View is enabled, this will move the border between two horizontally split documents further down.
tr: Bölünmüş Görünüm etkinleştirildiğinde, bu, dikey olarak bölünmüş iki belge arasındaki kenarlığı daha aşağı kaydırır.

source: Some common actions in the <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu> menu are available using the <guiicon><inlinemediaobject><imageobject><imagedata fileref="view-split-left-right-22.png" format="PNG"/> </imageobject></inlinemediaobject></guiicon> button at the top right corner of the editor window
tr: <guimenu>Görünüm</guimenu><guisubmenu>Bölünmüş Görünüm</guisubmenu> menüsündeki bazı yaygın kullanılan eylemlere, düzenleyici penceresinin sağ üst köşesinde bulunan <guiicon><inlinemediaobject><imageobject><imagedata fileref="view-split-left-right-22.png" format="PNG"/> </imageobject></inlinemediaobject></guiicon> düğmesinden de ulaşılabilir

source: <guimenu>View</guimenu> <guisubmenu>Tool Views</guisubmenu>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Araç Görünümleri</guisubmenu>
