Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_man-kate.1.po
Languages: tr

source: &kate; User's Manual
tr: &kate; Kullanıcı Kılavuzu

source: Advanced text editor by &kde;
tr: &kde; tarafından yapılan gelişmiş bir metin düzenleyicisi

source: <command>kate</command> <group choice="opt"><option>-s, --start</option> <replaceable> name</replaceable> </group> <group choice="opt"><option>--startanon</option></group> <group choice="opt"><option>-n, --new</option></group> <group choice="opt"><option>-b, --block</option></group> <group choice="opt"><option>-p, --pid</option><replaceable> pid</replaceable></group> <group choice="opt"><option>-e, --encoding</option> <replaceable> name</replaceable></group> <group choice="opt"><option>-l, --line</option> <replaceable> line</replaceable></group> <group choice="opt"><option>-c, --column</option> <replaceable> column</replaceable></group> <group choice="opt"><option>-i, --stdin</option></group> <group choice="opt"><option>--tempfile</option></group> <group choice="opt"><option><replaceable>file</replaceable></option></group>
tr: <command>kate</command> <group choice="opt"><option>-s, --start</option> <replaceable> ad</replaceable> </group> <group choice="opt"><option>--startanon</option></group> <group choice="opt"><option>-n, --new</option></group> <group choice="opt"><option>-b, --block</option></group> <group choice="opt"><option>-p, --pid</option><replaceable> pid</replaceable></group> <group choice="opt"><option>-e, --encoding</option> <replaceable> ad</replaceable></group> <group choice="opt"><option>-l, --line</option> <replaceable> satır</replaceable></group> <group choice="opt"><option>-c, --column</option> <replaceable> sütun</replaceable></group> <group choice="opt"><option>-i, --stdin</option></group> <group choice="opt"><option>--tempfile</option></group> <group choice="opt"><option><replaceable>dosya</replaceable></option></group>

source: Description
tr: Açıklama

source: &kate; is the &kde; Advanced Text Editor.
tr: &kate;, &kde; Gelişmiş Metin Düzenleyicisi’dir.

source: &kate; also provides the editor part for various applications, under the name &kwrite;.
tr: Ayrıca &kate;, &kwrite; adı altında çeşitli uygulamalar için bir düzenleyici de sağlamaktadır.

source: Some of &kate;'s many features include configurable syntax highlighting for languages ranging from C and C++ to &HTML; to bash scripts, the ability to create and maintain projects, a multiple document interface (<acronym>MDI</acronym>), and a self-contained terminal emulator.
tr: &kate;’in özellikleri arasında; C, C++, &HTML; ve bash betikleri de bulunan uzun bir dil listesi için yapılandırılabilir sözdizim vurgulaması, proje oluşturma ve sürdürme yeteneği, çoklu belge arayüzü (<acronym>MDI</acronym>) ve kendi içinde yerleşik bir uçbirim öykünücüsü bulunur.

source: But &kate; is more than a programmer's editor. Its ability to open several files at once makes it ideal for editing &UNIX;'s many configuration files. This document was written in &kate;.
tr: &kate;, bir programcının düzenleyicisinden çok daha fazlasıdır. Aynı anda birden çok dosyayı açabilme özelliği, onu &UNIX; yapılandırma dosyalarını düzenlemek için ideal kılar. Bu belge, &kate; ile yazılmıştır.

source: Options
tr: Seçenekler

source: <option>-s</option>, <option>--start</option> <replaceable>name</replaceable>
tr: <option>-s</option>, <option>--start</option> <replaceable>ad</replaceable>

source: Start &kate; with a given session.
tr: &kate;’i verilen oturum ile başlat

source: Start &kate; with a new anonymous session, implies <option>-n</option>.
tr: &kate; uygulamasını yeni bir anonim oturum ile başlat, <option>-n</option> ima eder.

source: Force start of a new &kate; instance (is ignored if <option>start</option> is used and another &kate; instance already has the given session opened), forced if no parameters and no URLs are given at all.
tr: Yeni bir &kate; örneğinin başlatılmasını zorla (<option>start</option> kullanılmışsa ve başka bir &kate; örneği verilen oturumu halihazırda açmışsa yok sayılır), herhangi bir URL veya parametre verilmemişse bu zorlanır.

source: If using an already running &kate; instance, block until it exits, if URLs given to open.
tr: Açmak için URL’ler verilmişse ve halihazırda çalışan bir &kate; örneği kullanılıyorsa o çıkana kadar engelle.

source: Only try to reuse kate instance with this <replaceable>pid</replaceable> (is ignored if <option>start</option> is used and another &kate; instance already has the given session opened).
tr: Kate örneğini yalnızca bu <replaceable>pid</replaceable> ile yeniden kullanmaya çalış (<option>start</option> kullanılmışsa ve başka bir &kate; örneği verilen oturumu halihazırda açmışsa yok sayılır).

source: <option>-e, --encoding</option> <replaceable> name</replaceable>
tr: <option>-e, --encoding</option> <replaceable> ad</replaceable>

source: Set encoding for the file to open.
tr: Açılacak dosya için kodlamayı ayarla.

source: You can use this to force a file opened in utf-8 format, for instance. (The command <command>iconv -l</command> provides a list of encodings, which may be helpful to you.)
tr: Örneğin utf-8 biçiminde açılan bir dosyayı zorlamak için bunu kullanabilirsiniz. (<command>iconv -l</command> komutu, size yardımcı olabilecek kodlamaların bir listesini sağlar.)

source: <option>-l, --line</option> <replaceable> line</replaceable>
tr: <option>-l, --line</option> <replaceable> satır</replaceable>

source: Navigate to this line.
tr: Bu satıra git.

source: <option>-c, --column</option> <replaceable> column</replaceable>
tr: <option>-c, --column</option> <replaceable> sütun</replaceable>

source: Navigate to this column.
tr: Bu sütuna git.

source: Read the contents of <filename>stdin</filename>.
tr: <filename>stdin</filename> içeriğini oku.

source: The files/&URL;s opened by the application will be deleted after use.
tr: Uygulama tarafından açılan dosyalar/&URL;’ler, kullanımdan sonra silinir.

source: file
tr: dosya

source: File to open.
tr: Açılacak dosya.

source: See Also
tr: Ayrıca

source: More detailed user documentation is available from <ulink url="help:/kate">help:/kate</ulink> (either enter this &URL; into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>help:/kate</parameter></userinput>).
tr: Ayrıntılı kullanıcı belgelendirmesine <ulink url="help:/kate">help:/kate</ulink> üzerinden ulaşılabilir (ya bu &URL;’yi &konqueror;’a girin veya <userinput><command>khelpcenter</command> <parameter>help:/kate</parameter></userinput> komutunu çalıştırın).

source: There is also further information available at the <ulink url="https://kate-editor.org/">&kate; website</ulink>.
tr: <ulink url="https://kate-editor.org/">&kate; web sitesinde</ulink> ek bilgiler bulabilirsiniz.

source: Examples
tr: Örnekler

source: To open a file named <filename>source.cpp</filename> at column 15, line 25, in an existing &kate; window, you could use:
tr: Geçerli &kate; penceresinde, <filename>kaynak.cpp</filename> dosyasının 15. sütun, 25. satırda açmak için şunu kullanabilirsiniz:

source: <userinput><command>kate</command> <option>-c 15</option> <option>-l 25</option> <filename>source.cpp</filename></userinput>
tr: <userinput><command>kate</command> <option>-c 15</option> <option>-l 25</option> <filename>kaynak.cpp</filename></userinput>

source: If you have an active internet connection, you can take advantage of &kde;'s network transparency to open a file from an &FTP; site. If you do not have write permission on the remote server, the file will be opened read only and you will be prompted for a local filename to save to if you make changes. If you do have write permission, changes will be saved transparently over the network.
tr: Etkin bir internet bağlantınız varsa bir &FTP; sitesinden dosya açmak için &kde;’nin ağ saydamlığından yararlanabilirsiniz. Uzak sunucuda yazma izniniz yoksa dosya saltokunur olarak açılacak ve değişiklik yaptığınızda kaydedilecek yerel bir dosya adı istenecektir. Yazma izniniz varsa değişiklikler ağ üzerinden saydam bir biçimde kaydedilir.

source: <userinput><command>kate</command> <option><replaceable>&kde-ftp;README</replaceable></option></userinput>
tr: <userinput><command>kate</command> <option><replaceable>&kde-ftp;BENİOKU</replaceable></option></userinput>

source: Authors
tr: Yazarlar

source: The maintainer of &kate; is &Christoph.Cullmann; &Christoph.Cullmann.mail;. A comprehensive list of authors and contributors is available in the complete user manual mentioned above.
tr: &kate; proje yürütücüsü, &Christoph.Cullmann; &Christoph.Cullmann.mail;. Yazarların ve katkıda bulunanların kapsamlı bir listesi yukarıda belirtilen kullanım kılavuzunun tamamında vardır.
