Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_fundamentals.po
Languages: tr

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit><othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: The Fundamentals
tr: Temel Bilgiler

source: If you have ever used a text editor, you will have no problem using &kate;. In the next two sections, <link linkend="starting-kate">Starting &kate; </link> and in <link linkend="working-with-kate">Working with &kate;</link>, we will show you everything you need to get up and running quickly.
tr: Daha önce bir metin düzenleyicisi kullandıysanız &kate; kullanırken hiçbir sorun yaşamazsınız. Sonraki iki bölümde (<link linkend="starting-kate">&kate;’i Başlatmak</link> ve <link linkend="working-with-kate">&kate; ile Çalışmak</link>), hemen alışmanızı sağlamak için gereksiniminiz olacak her şeyi göstereceğiz.

source: Starting &kate;
tr: &kate;’i Başlatmak

source: You can start &kate; from the application launcher or from the command line.
tr: &kate; uygulamasını, uygulama başlatıcısından veya komut satırından başlatabilirsiniz.

source: From the Menu
tr: Menüden

source: Open the &kde; program menu by clicking on the application launcher icon on the toolbar at the bottom left of your screen. This will raise a menu. Move your cursor up the menu to the <menuchoice><guimenu>Applications</guimenu><guisubmenu>Utilities</guisubmenu> <guimenuitem>Advanced Text Editor &kate;</guimenuitem></menuchoice> menu item.
tr: Ekranınızın sol altındaki araç çubuğundaki uygulama başlatıcısı simgesine tıklayarak &kde; programları menüsünü açın. İmleci <menuchoice><guimenu>Uygulamalar</guimenu><guisubmenu>İzlenceler</guisubmenu><guimenuitem>&kate; Gelişmiş Metin Düzenleyicisi</guimenuitem></menuchoice> ögesine getirin.

source: From the Command Line
tr: Komut Satırından

source: You can start &kate; by typing its name on the command line. If you give it a file name, as in the example below, it will open or create that file.
tr: Komut satırına adını yazarak &kate;’i başlatabilirsiniz. Aşağıdaki örnekte olduğu gibi bir dosya adı verirseniz o dosyayı açar veya oluşturur.

source: <prompt>%</prompt><userinput><command>kate</command> <option><replaceable>myfile.txt</replaceable></option></userinput>
tr: <prompt>%</prompt><userinput><command>kate</command> <option><replaceable>dosyam.txt</replaceable></option></userinput>

source: If you have an active connection, and permission, you can take advantage of &kde;'s network transparency to open files on the internet.
tr: Etkin bir bağlantınız ve izinleriniz varsa &kde;’nin ağ saydamlığından yararlanarak internetteki dosyaları da açabilirsiniz.

source: <prompt>%</prompt><userinput><command>kate</command> <option><replaceable>&kde-ftp;README</replaceable></option></userinput>
tr: <prompt>%</prompt><userinput><command>kate</command> <option><replaceable>dosyam.txt</replaceable></option></userinput>

source: To change the directory for temporary files, which defaults to <filename class="directory">/tmp</filename> set the <envar>TMPDIR</envar> environment variable before starting &kate;, &eg;
tr: Geçici dosyalar dizinini değiştirmek için (öntanımlı olarak <filename class="directory">/tmp</filename>) &kate;’i başlatmadan önce <envar>TMPDIR</envar> çevre değişkenini ayarlayın; &eg;

source: Command Line Options
tr: Komut Satırı Seçenekleri

source: &kate; accepts following command line options:
tr: &kate;, aşağıdaki komut satırı seçeneklerini kabul eder:

source: This lists the options available at the command line.
tr: Bu, komut satırındaki kullanılabilir seçenekleri listeler.

source: <command>kate</command> <option>-s</option> <option>--start</option> <parameter>name</parameter>
tr: <command>kate</command> <option>-s</option> <option>--start</option> <parameter>ad</parameter>

source: Starts &kate; with the session <parameter>name</parameter>. The session is created if it does not exist already. If a &kate; instance running the specified session exists, the specified files are loaded in that instance.
tr: &kate;’i <parameter>ad</parameter> oturumuyla başlatır. Oturum halihazırda yoksa oluşturulur. Belirtilen oturumu çalıştıran bir &kate; örneği varsa belirtilen dosyalar bu örneğe yüklenir.

source: Only reuses an instance with the specified PID (Process ID).
tr: Yalnızca belirtilen PID’ye (Süreç Kimliği) sahip bir örneği yeniden kullanır.

source: <command>kate</command> <option>-e</option> <option>--encoding</option> <parameter>encoding</parameter> <parameter>URL</parameter>
tr: <command>kate</command> <option>-e</option> <option>--encoding</option> <parameter>kodlama</parameter> <parameter>URL</parameter>

source: Uses the specified encoding for the document.
tr: Belge için belirtilen kodlamayı kullanır.

source: <command>kate</command> <option>-l</option> <option>--line</option> <parameter>line</parameter> <parameter>URL</parameter>
tr: <command>kate</command> <option>-l</option> <option>--line</option> <parameter>satır</parameter> <parameter>URL</parameter>

source: Navigates to the specified line after opening the document.
tr: Belgeyi açtıktan sonra belirtilen satıra gider.

source: <command>kate</command> <option>-c</option> <option>--column</option> <parameter>column</parameter> <parameter>URL</parameter>
tr: <command>kate</command> <option>-c</option> <option>--column</option> <parameter>sütun</parameter> <parameter>URL</parameter>

source: Navigates to the specified column after opening the document.
tr: Belgeyi açtıktan sonra belirtilen sütuna gider.

source: Reads the document content from STDIN. This is similar to the common option <option>-</option> used in many command line programs, and allows you to pipe command output into &kate;.
tr: Belgeyi standart girdi’den okur. Bu, çoğu komut satırı programında bulunan <option>-</option> seçeneğine benzerdir ve komut çıktısını &kate;’e veriyolu yapmanıza olanak tanır.

source: Start &kate; with a new anonymous session, implies <option>-n</option>.
tr: &kate;’i yeni bir anonim oturum ile başlat, <option>-n</option> ima eder.

source: Force start of a new &kate; instance (is ignored if <option>start</option> is used and another &kate; instance already has the given session opened), forced if no parameters and no URLs are given at all.
tr: Yeni bir &kate; örneğinin başlatılmasını zorla (<option>start</option> kullanılırsa ve verilen oturum başka bir &kate; örneğinde halihazırda açıksa yok sayılır), hiçbir parametre ve hiçbir URL belirtilmemişse zorlanır.

source: If using an already running &kate; instance, block until it exits, if URLs given to open.
tr: Halihazırda çalışan bir &kate; örneği kullanıyorsanız URL’ler açılmaları için verilmişse çıkana kadar engelleyin.

source: You can use &kate; with this option as editor for typing in commit messages for version control systems like &git; or <application>Subversion</application>. These systems expect to block the editor till you have entered your message, because they then open the temporary file, which would be empty if &kate; immediately returned to the caller.
tr: Bu seçenekle, &git; veya <application>Subversion</application> gibi sürüm denetim sistemleri için işleme iletileri yazmak amacıyla düzenleyici olarak &kate;’i kullanabilirsiniz. Bu sistemler, siz iletinizi girene kadar düzenleyiciyi engellerler; çünkü o zaman &kate; çağırana hemen geri dönerse boş olacak olan geçici dosyayı açarlar.

source: This option is also needed with KIO (&kde; Input/Output), if you open a remote file (which has been downloaded to a temporary) and should be reuploaded, after you saved it.
tr: Bu seçenek, uzak bir dosyayı (geçici olarak indirilmiş olan) açarsanız ve kaydettikten sonra yeniden karşıya yüklenmesi gerekiyorsa KIO (&kde; Giriş/Çıkış) için de gereklidir.

source: When used, the specified files are treated as temporary files and deleted (if they are local files and you have sufficient permissions) when closed, unless they were modified since they were opened.
tr: Kullanıldığında, belirtilen dosyalar geçici dosyalar olarak kabul edilir ve açıldıktan sonra değiştirilmedikleri sürece kapatıldığında (yerel dosyalarsa ve yeterli izinleriniz varsa) silinir.

source: <command>kate</command> <option>--desktopfile</option> <parameter>filename</parameter>
tr: <command>kate</command> <option>--desktopfile</option> <parameter>dosya-adı</parameter>

source: The base file name of the desktop entry for this application.
tr: Bu uygulamanın masaüstü girdisinin temel dosya adı.

source: This is in particular useful for wrapper applications and applications having in general multiple desktop files. Thus each desktop file can have its own command line for the <option>Exec</option> entry.
tr: Bu özellikle sarmalayıcı uygulamalar ve genel olarak birden fazla masaüstü dosyasına sahip uygulamalar için kullanışlıdır. Böylece her masaüstü dosyası <option>Exec</option> girdisi için kendi komut satırına sahip olabilir.

source: Lists &kate;'s authors in the terminal window.
tr: &kate;’in yazarlarını uçbirim penceresinde listeler.

source: Lists version information for &kate;.
tr: &kate;’in sürüm bilgisini listeler.

source: Shows license information.
tr: Lisans bilgisini gösterir.

source: Drag and Drop
tr: Sürükle ve Bırak

source: &kate; uses the &kde; Drag and Drop protocol. Files may be dragged and dropped onto &kate; from the Desktop, the filemanager &dolphin; or some remote &FTP; site opened in one of &dolphin;'s windows.
tr: &kate;, &kde;’nin Sürükle ve Bırak protokolünü kullanır. Dosyalar &kate; üzerine Masaüstü’nden, &dolphin; dosya yöneticisinden veya &dolphin; pencerelerinde açılmış kimi FTP sitelerinden sürüklenip bırakılabilir.

source: Working with &kate;
tr: &kate; ile Çalışmak

source: <link linkend="quick-start">Quick Start</link> will show you how to toggle four simple options that will let you configure some of &kate;'s more powerful features right away. <link linkend="keystroke-commands"> Shortcuts</link> lays out some of the default keystroke shortcuts for those who can't or don't want to use a mouse.
tr: <link linkend="quick-start">Tez Başlat</link>, &kate;’in daha güçlü özelliklerini yapılandırmanızı sağlayan dört basit seçeneği nasıl değiştireceğinizi gösterir. <link linkend="keystroke-commands"> Kısayollar</link>, fare kullanmak istemeyen ve kullanmayanlar için öntanımlı klavye kısayollarını gösterir.

source: Quick Start
tr: Tez Başlangıç

source: This section will describe some of the items on the <guimenu>View</guimenu> menu so that you can quickly configure &kate; to work the way you want it.
tr: Bu bölüm, &kate;’i, onunla çalışmak isteyebileceğiniz biçimde tez yapılandırabilmeniz için <guimenu>Görünüm</guimenu> menüsündeki bazı ögeleri açıklar.

source: When you start &kate; for the first time you will see two windows with white backgrounds. Above the two windows is a toolbar with the usual labeled icons. And above that, a menubar.
tr: &kate;’i ilk başlattığınızda, beyaz arka planlı iki pencere göreceksiniz. İki pencerenin üstünde, her zamanki etiketli simgelerin yer aldığı bir araç çubuğu bulunur. Onun üstünde de bir menü çubuğu vardır.

source: The left-hand window is a side bar. It combines the <guilabel>Documents</guilabel> and <guilabel>Filesystem Browser</guilabel> windows. Switch between the two by clicking on the tabs to the left of the window.
tr: Soldaki pencere bir kenar çubuğudur. <guilabel>Belgeler</guilabel> ve <guilabel>Dosya Sistemi Tarayıcısı</guilabel> pencerelerini birleştirir. Pencerenin solundaki sekmelere tıklayarak ikisi arasında geçiş yapın.

source: If you've started &kate; with a file, the right-hand window will show the file you are editing and the <guilabel>Documents</guilabel> on the side bar will show the name of the file. Use the <guilabel>Filesystem Browser</guilabel> window to open files.
tr: &kate;’i bir dosya ile başlatırsanız sağdaki pencere düzenlediğiniz dosyayı ve kenar çubuğundaki <guilabel>Belgeler</guilabel> dosyanın adını gösterir. Dosyaları açmak için <guilabel>Dosya Sistemi Tarayıcısı</guilabel>’nı kullanın.

source: You can toggle all sidebar windows on and off in <menuchoice><guimenu>View</guimenu><guisubmenu>Tool Views</guisubmenu></menuchoice> menu or use <keycombo action="simul">&Ctrl;&Alt;&Shift;<keycap>F</keycap></keycombo>. This menu offers you your first glimpse into &kate;'s power and flexibility.
tr: <menuchoice><guimenu>Görünüm</guimenu><guisubmenu>Araç Görünümleri</guisubmenu></menuchoice> menüsünü veya <keycombo action="simul">&Ctrl;&Alt;&Shift;<keycap>F</keycap></keycombo> kısayolunu kullanarak tüm kenar çubuğu pencerelerini açıp kapatabilirsiniz. Bu menü, &kate;’in gücüne ve esnekliğine bir giriş niteliğindedir.

source: In <guisubmenu>Tool Views</guisubmenu> you have a list of all enabled plugins. Click the checkbox in front of each item or click with the &LMB; on the tool buttons in the sidebar to toggle this tool view on and off.
tr: <guisubmenu>Araç Görünümü</guisubmenu> bölümünde tüm etkin eklentilerin bir listesi vardır. Bu araç görünümünü açıp kapatmak için her bir ögenin önündeki onay kutularına veya kenar çubuğundaki araç düğmelerine &LMB; ile tıklayın.

source: Shortcuts
tr: Kısayollar

source: Many of &kate;'s keystroke commands (shortcuts) are configurable by way of the <link linkend="settings-help-menu">Settings</link> menu. By default &kate; honors the following key bindings.
tr: &kate;’in düğme vuruşu komutlarının (kısayollarının) çoğu <link linkend="settings-help-menu">Ayarlar</link> menüsü ile yapılandırılabilirdir. Öntanımlı olarak &kate; aşağıdaki düğme bağıntılarını izler.

source: Help
tr: Yardım

source: What's this?
tr: Bu Nedir?

source: <link linkend="file-new">New</link> document
tr: <link linkend="file-new">Yeni</link> Belge

source: Save All
tr: Tümünü Kaydet

source: Open a document
tr: Belge Aç

source: <para>Quick Open</para>
tr: <para>Tez Aç</para>

source: Full Screen Mode
tr: Tam Ekran Kipi

source: Configure &kate;
tr: &kate; Uygulamasını Yapılandır

source: Close
tr: Kapat

source: Quit - close active copy of editor
tr: Çık — Düzenleyicinin etkin kopyasını kapat

source: Show Sidebars
tr: Kenar Çubuklarını Göster

source: Split Horizontal
tr: Yatay Böl

source: Split Vertical
tr: Dikey Böl

source: Next Split View
tr: Sonraki Bölünmüş Görünüm

source: Previous Split View
tr: Önceki Bölünmüş Görünüm

source: Close Current View
tr: Geçerli Görünümü Kapat

source: Next Tab
tr: Sonraki Sekme

source: Previous Tab
tr: Önceki Sekme

source: Reopen Latest Closed Document(s)
tr: Son Kapatılan Belgeleri Yeniden Aç

source: Additionally you can use the shortcuts provided by the <ulink url="help:/katepart/keybindings.html">&katepart;</ulink> component and by all activated <link linkend="plugins">&kate; plugins</link>.
tr: Ek olarak, <ulink url="help:/katepart/keybindings.html">&katepart;</ulink> bileşeni ve tüm etkin <link linkend="plugins">&kate; eklentileri</link> tarafından sağlanan klavye kısayollarını da kullanabilirsiniz.

source: Working With the &kate; <acronym>MDI</acronym>
tr: &kate; <acronym>MDI</acronym> ile Çalışmak

source: Overview
tr: Genel Görünüm

source: Window, View, Document, Frame, Editor... What are they all in the terminology of &kate;, and how do you get the most out of it? This chapter will explain all of that, and even more.
tr: Pencere, Görünüm, Belge, Çerçeve, Düzenleyici …; &kate; terminolojisinde bunlar nedir ve bunların çoğunu nasıl anlarsınız? Bu bölüm, bunların tümünü ve çok daha fazlasını anlatacaktır.

source: The Main Window
tr: Ana Pencere

source: Main window
tr: Ana pencere

source: The &kate; Main Window is a standard &kde; application window, with the addition of side bars containing tool views. It has a menubar with all the common menus, and some more, and a toolbar providing access to commonly used commands.
tr: &kate; Ana Penceresi, araç görünümlerini içeren kenar çubuklarının eklendiği standart bir &kde; uygulaması penceresidir. Tüm ortak menüleri ve daha fazlasını içeren bir menü çubuğuna ve yaygın olarak kullanılan komutlara erişim sağlayan bir araç çubuğuna sahiptir.

source: The most important part of the window is the editing area, by default displaying a single text editor component, in which you can work with your documents.
tr: Pencerenin en önemli kısmı; belgelerinizle çalışabileceğiniz, öntanımlı olarak tek bir metin düzenleyicisi bileşeninin görüntülendiği düzenleme alanıdır.

source: The docking capabilities of the window is used for the tool windows of any plugin enabled in the settings dialog.
tr: Pencerenin yerleştirilebilme yetenekleri, ayarlar iletişim kutusunda etkinleştirilen herhangi bir eklentinin araç pencereleri için kullanılır.

source: Tool views can be positioned in any sidebar, to move a tool right click its sidebar button and select from the &RMB; menu
tr: Araç görünümleri herhangi bir kenar çubuğuna yerleştirilebilir; bir aracı taşımak için kenar çubuğu düğmesine sağ tıklayın ve &RMB; menüsünden seçim yapın.

source: A tool view can be marked as <emphasis>persistent</emphasis> in the &RMB; menu for its sidebar button. The sidebar can contain more tools at one time so that when a tool is persistent other tools can be shown simultaneously.
tr: Bir araç görünümü, kendi &RMB; menüsünde <emphasis>kalıcı</emphasis> olarak imlenebilir. Kenar çubuğu herhangi bir anda birden çok araç içerebilir, böylece bir araç kalıcı olduğunda diğer araçlar da onunla aynı anda gösterilebilir.

source: If a plugin has configuration options you can use the first item in the context menu to open the corresponding page in &kate;'s settings dialog.
tr: Bir eklentinin yapılandırma seçenekleri varsa &kate;’in ayarlar iletişim kutusunda ilgili sayfayı açmak için bağlam menüsündeki ilk ögeyi kullanabilirsiniz.

source: The Editor area
tr: Düzenleyici alanı

source: Editing Area
tr: Düzenleme Alanı

source: &kate; is capable of having more than one document open at the same time, and also of splitting the editing area into any number of frames, similar to how for example &konqueror; or the popular <application>emacs</application> text editor works. This way you can view several documents at the same time, or more instances of the same document, handy for example if your document contains definitions in the top that you want to see often for reference. Or you could view a program source header in one frame, while editing the implementation file in another.
tr: &kate;, &konqueror;’un veya popüler metin düzenleyicisi <application>emacs</application>’in çalışma biçimine benzer olarak, aynı anda birden çok belgeyi açabilir ve düzenleme alanını istediğiniz sayıda çerçeveye bölebilir. Böylece, aynı anda birden çok belgeyi veya aynı belgenin birden çok örneğini görüntüleyebilirsiniz. Bu örneğin, belgeniz en üstte tanımlar ve altta da tanımlara başvurular içeriyorsa ikisini aynı anda görebilmek için yararlıdır. Başka bir örnek olarak, bir program kaynağı üstbilgisini bir çerçevede görebilir, uygulanmasını da başka bir çerçevede düzenleyebilirsiniz.

source: When a document is available in more than one editor, changes made in one editor will immediately be reflected in the others as well. This includes changing the text as well as selecting text. Search operations or cursor movement is only reflected in the current editor.
tr: Bir belge birden fazla düzenleyicide kullanıldığında, bir düzenleyicide yapılan değişiklikler anında diğerlerine de yansıtılacaktır. Bunda metin değiştirmenin yanı sıra metin seçme de içerilir. Arama işlemleri veya imleç hareketi yalnızca geçerli düzenleyiciye yansıtılır.

source: It is currently not possible to have more instances of the same document open in the sense that one instance will be edited while the other will not.
tr: Bir örneğin düzenlenirken diğerinin düzenlenmeyeceği anlamında aynı belgenin daha fazla örneğinin açık olması şu anda olanaklı değildir.

source: When splitting an editor into two frames, it is divided into two equally sized frames, both displaying the current document of that editor. The new frame will be at the bottom (in the case of a horizontal split) or at the right (for a vertical split). The new frame gets the focus, which is visualized by the blinking cursor bar in the focused frame.
tr: Bir düzenleyiciyi iki çerçeveye böldüğünüzde, her ikisi de o düzenleyicinin geçerli belgesini görüntüleyen eşit boyutlu iki çerçeveye bölünür. Yeni çerçeve altta (yatay bölme durumunda) veya sağda (dikey bölme durumunda) olacaktır. Yeni kare, odaklanılan karedeki yanıp sönen imleç çubuğuyla görselleştirilen odağı alır.

source: Using Sessions
tr: Oturumları Kullanmak

source: Sessions is how &kate; lets you keep more than one list of files and &GUI; configuration around. You can have as many named sessions as you want, and you can use unnamed or anonymous sessions for files you want to use only once. Currently &kate; can save the list of open files, and the general window configuration in the session; future versions of &kate; may add more features that can be saved in sessions. With the introduction of sessions, &kate; also allows you to open any number of instances of the application instead of just one as it used to do as the default behavior.
tr: Oturumlar, &kate;’in birden çok dosya listesini ve &GUI; yapılandırmasını saklamanıza olanak sağlamasıdır. İstediğiniz sayıda adlı oturuma sahip olabilirsiniz ve yalnızca bir kez kullanmak istediğiniz dosyalar için adsız veya anonim oturumlar kullanabilirsiniz. Şu anda &kate;, açık dosyaların listesini ve oturumdaki genel pencere yapılandırmasını kaydedebilir; &kate;’in gelecekteki sürümleri, oturumlara kaydedilebilecek daha fazla özellik ekleyebilir. Oturumların kullanılmaya başlanmasıyla &kate; ayrıca, öntanımlı davranış olarak eskiden olduğu gibi uygulamanın yalnızca bir örneğini açmak yerine istediğiniz sayıda örneğini açmanıza da olanak tanır.

source: Sessions are supported in three areas:
tr: Oturumlar üç alanda desteklenir:

source: <link linkend="command-line-options"><emphasis>Command line options</emphasis></link> that lets you select and start sessions when launching &kate; from the command line.
tr: &kate;’i komut satırından başlatırken oturumları seçmenizi ve onları başlatmanızı sağlayan <link linkend="command-line-options"><emphasis>komut satırı seçeneklerinde</emphasis></link>.

source: <link linkend="sessions-menu"><emphasis>The Sessions menu</emphasis></link> that lets you switch, save, start and manage your sessions.
tr: Oturumlar arasında geçiş yapmanızı, onları kaydetmenizi, başlatmanızı ve yönetmenizi sağlayan <link linkend="sessions-menu"><emphasis>oturumlar menüsü</emphasis></link>.

source: <link linkend="config-dialog-sessions"><emphasis>Configuration options</emphasis></link> that lets you decide how sessions generally should behave.
tr: Oturumların genel olarak nasıl davranması gerektiğini belirleyebileceğiniz <link linkend="config-dialog-sessions"><emphasis>yapılandırma seçenekleri</emphasis></link>.
