Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_plugins.po
Languages: tr

source: If the option <guilabel>Add errors and warnings to Diagnostics</guilabel> is enabled in the plugin's settings page in Kate settings, the errors and warnings will also be added to the diagnostics view. To navigate to the previous error in the diagnostics view, press <keycombo action="simul">&Alt;&Shift;&Left;</keycombo>. To navigate to the next error, press <keycombo action="simul">&Alt;&Shift;&Right;</keycombo>.
tr: Kate ayarlarının eklenti sayfasında <guilabel>Tanılara hataları ve uyarıları ekle</guilabel> etkinleştirilmişse hatalar ve uyarılar da tanı görünümüne eklenir. Tanı görünümünde bir önceki hataya gitmek için <keycombo action="simul">&Alt;&Shift;&Left;</keycombo>, bir sonraki hataya gitmek için <keycombo action="simul">&Alt;&Shift;&Right;</keycombo> kısayollarını kullanın.

source: Menu Structure
tr: Menü Yapısı

source: <guimenu>Build</guimenu><guisubmenu>Select Target...</guisubmenu>
tr: <guimenu>Yapı</guimenu><guisubmenu>Hedef Seç…</guisubmenu>

source: The target selection filter is focused in the Target Settings tab. Typing a name will filter out targets that do not match the typed string. It is also possible to use the arrow keys to navigate the tree of targets. When the wanted target is selected, pressing <guilabel>Return</guilabel> or <guilabel>Enter</guilabel> will execute and run the selected target.
tr: Hedef seçim süzgeci, Hedef Ayarları sekmesine odaklanmıştır. Bir ad yazmak, yazılan diziyle eşleşmeyen hedefleri süzer. Hedef ağacında gezinmek için ok düğmelerini kullanmak da olanaklıdır. İstenen hedef seçildiğinde, <guilabel>Dönüş</guilabel> veya <guilabel>Giriş</guilabel> düğmelerine basmak seçilen hedefi yürütecek ve çalıştıracaktır.

source: <guimenu>Build</guimenu><guimenuitem>Build Selected Target</guimenuitem>
tr: <guimenu>Yapı</guimenu><guimenuitem>Seçili Hedefi Yap</guimenuitem>

source: Builds the last selected target. If none has been selected, it works as <guilabel>Select Target...</guilabel>
tr: Son seçilen hedefi yapar. Seçili hedef yoksa <guilabel>Hedef Seç…</guilabel> olarak çalışır.

source: <guimenu>Build</guimenu><guimenuitem>Build and Run Selected Target</guimenuitem>
tr: <guimenu>Yapı</guimenu><guimenuitem>Seçili Hedefi Yap ve Çalıştır</guimenuitem>

source: Builds the last selected target and run the run command after the build command has finished successfully.
tr: Son seçilen hedefi yapar ve derleme komutu başarıyla tamamlandıktan sonra çalıştır komutunu çalıştırır.

source: <guimenu>Build</guimenu><guimenuitem>Compile Current File</guimenuitem>
tr: <guimenu>Yapı</guimenu><guimenuitem>Geçerli Dosyayı Derle</guimenuitem>

source: Try to compile the current file by searching for a command in a possible compile_commands.json.
tr: Olası bir compile_commands.json içinde bir komut arayarak geçerli dosyayı derlemeyi deneyin.

source: <guimenu>Build</guimenu><guimenuitem>Stop</guimenuitem>
tr: <guimenu>Yapı</guimenu><guimenuitem>Durdur</guimenuitem>

source: Stop building a target.
tr: Bir hedefi yapmayı durdurun.

source: <guimenu>Build</guimenu><guimenuitem>Focus Next Tab to the Left</guimenuitem>
tr: <guimenu>Yapı</guimenu><guimenuitem>Sonraki Sekmeyi Sola Odakla</guimenuitem>

source: Focus the next build plugin tab to the left. Or open the build plugin tool-view if it is hidden.
tr: Bir sonraki yapı eklentisi sekmesini sola odaklayın; gizliyse yapı eklentisi araç görünümünü açın.

source: <guimenu>Build</guimenu><guimenuitem>Focus Next Tab to the Right</guimenuitem>
tr: <guimenu>Yapı</guimenu><guimenuitem>Sonraki Sekmeyi Sağa Odakla</guimenuitem>

source: Focus the next build plugin tab to the right. Or open the build plugin tool-view if it is hidden.
tr: Bir sonraki yapı eklentisi sekmesini sağa odaklayın; gizliyse yapı eklentisi araç görünümünü açın.

source: <guimenu>Build</guimenu><guimenuitem>Load targets from CMake Build Dir</guimenuitem>
tr: <guimenu>Yapı</guimenu><guimenuitem>CMake Yapı Dizininden Hedefler Yükle</guimenuitem>

source: Opens the file dialog and let's the user select a <guilabel>CMakeCache.txt</guilabel>. When a file is selected, the plugin generates cmake build command targets that can be executed in the build directory for the CMake based project.
tr: Dosya iletişim kutusunu açar ve kullanıcının bir <guilabel>CMakeCache.txt</guilabel> seçmesine olanak tanır. Bir dosya seçildiğinde, eklenti CMake tabanlı proje için olan yapı dizininde yürütülebilecek CMake yapı komutu hedefleri üretir.

source: Thanks and Acknowledgments
tr: Teşekkürler ve Destek Olanlar

source: The &kate; Build Plugin was written by Kåre Särs.
tr: &kate; Yapı Eklentisi, Kåre Särs tarafından yazıldı.

source: Special thanks to Google Code-In 2011 participant Salma Sultana for writing much of this section.
tr: Bu bölümün çoğunu yazdığı için Google Code-In 2011 katılımcısı Salma Sultana’ya özellikle teşekkür ederiz.

source: Close Except/Like Plugin
tr: Dışındakileri/Benzerleri Kapat Eklentisi

source: This plugin allows you to close a group of documents based on their extension and path.
tr: Bu eklenti, bir grup belgeyi uzantılarına ve yollarına göre kapatmanıza olanak tanır.

source: Using the Close Except/Like Plugin
tr: Dışındakileri/Benzerleri Kapat eklentisini kullanmak

source: Assumed you have these documents opened in &kate;:
tr: &kate;’de aşağıdaki belgeleri açtığınızı varsayalım:

source: Then you have the following options to close documents as displayed in the screenshot:
tr: Ardından, ekran görüntüsünde gösterildiği gibi belgeleri kapatmak için aşağıdaki seçeneklere sahipsiniz:

source: Close Except
tr: Dışındakileri Kapat

source: Use the checkbox in the last item of the list to enable or disable a confirmation dialog. The selected option will be applied to both close actions.
tr: Onay iletişim kutusunu etkinleştirmek veya devre dışı bırakmak için listenin son ögesindeki onay kutusunu kullanın. Seçili seçenek her iki kapatma işlemine de uygulanacaktır.

source: <guimenu>File</guimenu> <guisubmenu>Close Except</guisubmenu>
tr: <guimenu>Dosya</guimenu> <guisubmenu>Dışındakileri Kapat</guisubmenu>

source: <action>Close</action> all open documents, <emphasis>except</emphasis> those which match the path or file extension selected from the submenu.
tr: Alt menüden seçili yol veya dosya uzantısıyla eşleşenler <emphasis>dışındaki</emphasis> tüm açık belgeleri <action>kapatın</action>.

source: <guimenu>File</guimenu> <guisubmenu>Close Like</guisubmenu>
tr: <guimenu>Dosya</guimenu> <guisubmenu>Benzerleri Kapat</guisubmenu>

source: <action>Close</action> all open documents which match the path or file extension selected from the submenu.
tr: Alt menüden seçili yol veya dosya uzantısıyla eşleşen tüm açık belgeleri <action>kapatın</action>.

source: Color Picker Plugin
tr: Renk Seçicisi Eklentisi

source: This plugin adds an inline color preview/picker to colors in the text (&eg;, <literal>#FFFFFF</literal>, <literal>white</literal>).
tr: Bu eklenti, metindeki renklere satır içi renk önizlemesi/seçicisi ekler (&eg;, <literal>#FFFFFF</literal>, <literal>white</literal>).

source: To load this plugin open &kate;'s configuration dialog under <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &kate;...</guimenuitem></menuchoice>. Then select <guilabel>Color Picker</guilabel> and close the dialog.
tr: Bu eklentiyi yüklemek için <menuchoice><guimenu>Ayarlar</guimenu> <guimenuitem>&kate; Uygulamasını Yapılandır…</guimenuitem></menuchoice> altından &kate;’in yapılandırma iletişim kutusunu açın. Sonrasında, <guilabel>Renk Seçicisi</guilabel>’ni seçin ve iletişim kutusunu kapatın.

source: On the Color Picker settings page in &kate;'s configuration, you can configure the following options of the plugin behavior.
tr: &kate;’in yapılandırmasındaki Renk Seçicisi ayarları sayfasında eklenti davranışının aşağıdaki seçeneklerini yapılandırabilirsiniz.

source: Show preview for known color names
tr: Bilinen renkler için önizlemeyi göster

source: Whether to show the color picker for known color names (&eg;, <literal>skyblue</literal>). See <ulink url="https://www.w3.org/TR/SVG11/types.html#ColorKeywords">this page</ulink> for the list of colors.
tr: Bilinen renk adları için renk seçicinin gösterilip gösterilmeyeceği (&eg;, <literal>skyblue</literal>). Renk listesi için <ulink url="https://www.w3.org/TR/SVG11/types.html#ColorKeywords">bu sayfaya</ulink> bakın.

source: Place preview after text color
tr: Metin renginden sonra önizlemeyi getir

source: Whether to place the inline preview after text color in the text.
tr: Satır içi önizlemenin metinde metin renginden sonra gelip gelmeyeceği.

source: Hex color matching
tr: Onaltılı renk eşleşmesi

source: Here, you can choose the best matching option for the colors used in your code.
tr: Burada kodunuzda kullanılan renklere en uygun olanı seçebilirsiniz.

source: Colored Brackets
tr: Renkli Ayraçlar

source: Colored brackets plugin colors matching bracket pairs in different colors to enhance readability. However, not all brackets get colored. A bracket whose matching opener or closer is not visible will be ignored. Similarly, a bracket pair that is the sole bracket pair on a line will not get colored.
tr: Okunabilirliği artırmak için farklı renklerdeki ayraç çiftleriyle eşleşen renkli ayraç eklentisi. Ancak tüm ayraçlar renklendirilmez. Eşleşen açıcısı veya kapatıcısı görünmeyen bir ayraç dikkate alınmayacaktır. Benzer şekilde, bir çizgideki tek ayraç çifti olan ayraç çifti renklendirilmez.

source: The plugin doesn't provide any configurations.
tr: Bu eklenti, herhangi bir yapılandırma seçeneği sunmaz.

source: CTags Plugin
tr: CTags Eklentisi

source: <ulink url="https://en.wikipedia.org/wiki/Ctags">CTags</ulink> generates an index (or tag) file of language objects found in source files that allows these items to be quickly and easily located using this plugin in &kate;.
tr: <ulink url="https://en.wikipedia.org/wiki/Ctags">CTags</ulink>, &kate;’deki bu eklentiyi kullanarak kaynak dosyalardaki ögelerin kolaylıkla bulunabilmesini sağlayan bir dil nesneleri indeksi (veya etiketi) üretir.

source: A tag signifies a language object for which an index entry is available (or, alternatively, the index entry created for that object).
tr: Etiket, bir dizin girdisinin kullanılabilir olduğu bir dil nesnesini (veya alternatif olarak o nesne için oluşturulan dizin girdisini) belirtir.

source: Tag generation is supported for these <ulink url="http://ctags.sourceforge.net/languages.html">programming languages</ulink>.
tr: Etiket üretimi, bu <ulink url="http://ctags.sourceforge.net/languages.html">programlama dilleri</ulink> için desteklenir.

source: The CTags plugin uses two different database files for the index.
tr: CTags eklentisi, indeksleme için iki farklı veritabanı dosyası kullanır.

source: On the CTags settings page in &kate;'s configuration you can add or remove directories containing the source code and regenerate the common CTags database.
tr: &kate;’in yapılandırmasındaki CTags ayarları sayfasında, kaynak kodunu içeren dizinleri ekleyebilir veya kaldırabilir ve ortak CTags veritabanını yeniden oluşturabilirsiniz.

source: Common Index
tr: Genel İndeks

source: CTags Settings
tr: CTags Ayarları

source: Configure CTags Global Database
tr: CTags Genel Veritabanını Yapılandır

source: At the bottom of the settings page you can adapt the <guilabel>CTags command</guilabel>.
tr: Ayarlar sayfasının alt kısmında <guilabel>CTags komutunu</guilabel> uyarlayabilirsiniz.

source: For more information about all available options please read the CTags man page. This man page is available in &khelpcenter; and you can also enter the &URL; <emphasis>man:/ctags</emphasis> directly into &konqueror;
tr: Kullanılabilir tüm seçenekler için lütfen CTags man sayfasını okuyun. Bu man sayfasına &khelpcenter; içinden erişilebilir veya <emphasis>man:/ctags</emphasis> &URL;’sini doğrudan &konqueror;’a girebilirsiniz.

source: Clicking <guibutton>Update</guibutton> will start indexing. When indexing is finished, close the dialog.
tr: <guibutton>Güncelle</guibutton>’ye tıklamak indekslemeyi başlatacaktır. Dizin oluşturma tamamlandığında iletişim kutusunu kapatın.

source: Session Index
tr: Oturum İndeksi

source: To configure the session index open the <guilabel>CTags</guilabel> view.
tr: Oturum indeksini yapılandırmak için <guilabel>CTags</guilabel> görünümünü açın.

source: Index Targets
tr: İndeksleme Hedefleri

source: On this tab you can add or remove directories containing the source code and manually regenerate the session specific CTags database.
tr: Bu sekmede kaynak kodunu içeren dizinleri ekleyebilir veya kaldırabilir ve oturuma özel CTags veritabanını elle yeniden üretebilirsiniz.

source: Database
tr: Veritabanı

source: Database Settings
tr: Veritabanı Ayarları

source: Configure CTags Session Database
tr: Ctags Oturum Veritabanını Yapılandır

source: Select another CTags database file, configure the CTags command or revert to the default command.
tr: Başka bir CTags veritabanı dosyası seçin, CTags komutunu yapılandırın veya öntanımlı komuta geri dönün.

source: Using the CTags Plugin
tr: CTags Eklentisini kullanmak

source: You place the mouse cursor on the language object like function, symbol &etc; that you are interested in and then select one of the actions in the <guimenu>CTags</guimenu> menu to jump to the line and file where the object is defined or declared.
tr: Fare imlecini ilgilendiğiniz işlev, sembol vb. dil nesnesinin üzerine yerleştirirsiniz ve ardından nesnenin tanımlandığı veya beyan edildiği satıra ve dosyaya geçmek için <guimenu>CTags</guimenu> menüsündeki eylemlerden birini seçersiniz.

source: By default the actions in the <guimenu>CTags</guimenu> menu have no shortcuts assigned. Use the <ulink url="help:/fundamentals/shortcuts.html">keyboard shortcut editor</ulink> to configure your own shortcuts.
tr: Öntanımlı olarak, <guimenu>CTags</guimenu> menüsündeki eylemlerde atanan klavye kısayolları yoktur. Kendi kısayollarınızı yapılandırmak için <ulink url="help:/fundamentals/shortcuts.html">klavye kısayolları düzenleyicisini</ulink> kullanın.

source: Alternatively use the search field on the <guilabel>Lookup</guilabel> tab of the CTags view.
tr: Alternatif olarak CTags görünümünün <guilabel>Arama</guilabel> sekmesindeki arama alanını kullanın.

source: Entering characters into the search field will start the search and display matching names of language objects like functions, classes, symbols &etc; together with type and filename.
tr: Arama alanına karakterlerin girilmesi, aramayı başlatacak ve işlevler, sınıflar, semboller vb. gibi dil nesnelerinin eşleşen adlarını tür ve dosya adıyla birlikte görüntüleyecektir.

source: Select an item in the list to jump to the corresponding line in the source file.
tr: Kaynak dosyadaki ilgili satıra atlamak için listeden bir öge seçin.

source: <guimenu>CTags</guimenu> <guisubmenu>Jump back one step</guisubmenu>
tr: <guimenu>CTags</guimenu> <guisubmenu>Bir Adım Geri Git</guisubmenu>

source: Navigate back in the history to the last visited tag.
tr: Geçmişte ziyaret edilen son etikete geri dönün.

source: <guimenu>CTags</guimenu> <guisubmenu>Lookup Current Text</guisubmenu>
tr: <guimenu>CTags</guimenu> <guisubmenu>Geçerli Metni Ara</guisubmenu>

source: Opens the <guilabel>Lookup</guilabel> tab of the CTags view and displays all language objects matching the current text selection in the list.
tr: CTags görünümünün <guilabel>Arama</guilabel> sekmesini açar ve listedeki geçerli metin seçimiyle eşleşen tüm dil nesnelerini görüntüler.

source: <guimenu>CTags</guimenu> <guisubmenu>Go to Declaration</guisubmenu>
tr: <guimenu>CTags</guimenu> <guisubmenu>Beyana Git</guisubmenu>

source: If the cursor is in a definition object this will open the document containing the corresponding declaration if needed, activate its view and place the cursor at the start of the declaration.
tr: İmleç bir tanım nesnesinin içindeyse bu, gerekirse karşılık gelen beyanı içeren belgeyi açar, görünümünü etkinleştirir ve imleci beyanın başlangıcına yerleştirir.

source: <guimenu>CTags</guimenu> <guisubmenu>Go to Definition</guisubmenu>
tr: <guimenu>CTags</guimenu> <guisubmenu>Tanıma Git</guisubmenu>

source: If the cursor is in a declaration object this will open the document containing the corresponding definition if needed, activate its view and place the cursor at the start of the definition.
tr: İmleç bir beyan nesnesinin içindeyse bu, gerekirse karşılık gelen tanımı içeren belgeyi açar, görünümünü etkinleştirir ve imleci tanımın başlangıcına yerleştirir.

source: Document Preview Plugin
tr: Belge Önizlemesi Eklentisi

source: The plugin enables a live preview of the currently edited text document in the final format in the sidebar. So when editing &eg; a &Markdown; text or an &SVG; image, the result is instantly visible next to the source text.
tr: Eklenti, halihazırda düzenlenen metin belgesinin kenar çubuğunda son biçiminin canlı önizlemesini sağlar. Örneğin, bir &Markdown; metni veya &SVG; görseli düzenlerken, çıktı, kaynak metnin yanında anında görünür.

source: For the display the plugin uses that &kparts; plugin which is currently selected as the preferred one for the &MIME; type of the document. If there is no &kparts; plugin for that type, no preview is possible.
tr: Görüntüleme için eklenti, şu anda belgenin &MIME; türü için tercih edilen olarak seçili &kparts; eklentisini kullanır. Bu tür için &kparts; eklentisi yoksa önizleme olanaklı değildir.

source: To change the preferred plugin open the <guilabel>File Associations</guilabel> module in the &systemsettings; and edit the <guilabel>Services Preference Order</guilabel> on the <guilabel>Embedding</guilabel> tab.
tr: Tercih edilen eklentiyi değiştirmek için &systemsettings; içindeki <guilabel>Dosya İlişkilendirmeleri</guilabel> modülünü açın ve <guilabel>Gömme</guilabel> sekmesindeki <guilabel>Hizmetler Tercih Sırası</guilabel> bölümünü düzenleyin.

source: Some available &kparts; plugins
tr: Bazı kullanılabilir &kparts; eklentileri

source: &MIME; type
tr: &MIME; türü

source: &kparts; plugin
tr: &kparts; eklentisi

source: &Markdown; text
tr: &Markdown; metni

source: KMarkdownWebViewPart or OkularPart
tr: KMarkdownWebViewPart veya OkularPart

source: &SVG; image
tr: &SVG; görseli

source: &Qt; UI files
tr: &Qt; UI dosyaları

source: &DOT; graph files
tr: &DOT; grafik dosyaları

source: <guimenu>View</guimenu><guisubmenu>Tool Views</guisubmenu> <guimenuitem>Show Preview</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Araç Görünümleri</guisubmenu> <guimenuitem>Önizleme</guimenuitem>

source: Toggle the display of &kate;'s Document preview in a sidebar.
tr: Kenar çubuğunda, &kate;’in belge önizlemesinin görüntülenmesini açar/kapatır.

source: Interface
tr: Arayüz

source: The buttons at the top of the preview window provide these actions:
tr: Önizleme penceresinin üstündeki düğmeler şu eylemleri sağlar:

source: Lock the preview to a given document. Selecting this option ensures that if switching the focus to the view of another document in the same &kate; window, the preview will not follow to that document, but keep previewing this document.
tr: Önizlemeyi belirli bir belgeye kilitleyin. Bu seçeneğin seçilmesi, odağın aynı &kate; penceresindeki başka bir belgenin görünümüne değiştirilmesi durumunda önizlemenin o belgeyi takip etmemesini; ancak bu belgenin önizlemesini sürdürmesini sağlar.

source: Enable or disable updates of the preview of the current document content
tr: Geçerli belge içeriğinin önizlemesinin güncellemelerini etkinleştir veya devre dışı bırak

source: Manually update the preview of the current document content
tr: Geçerli belge içeriğinin önizlemesini elle güncelle

source: A dropdown menu with actions from the &kparts; plugin
tr: &kparts; eklentisindeki işlemleri içeren bir açılır menü

source: Document Switcher Plugin
tr: Belge Değiştiricisi Eklentisi

source: <shortcut> <keycombo action="simul">&Ctrl;&Tab;</keycombo> </shortcut> <guimenu>View</guimenu> <guisubmenu>Last Used Views</guisubmenu>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Tab;</keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guisubmenu>Son Kullanılan Görünümler</guisubmenu>

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;&Tab;</keycombo> </shortcut> <guimenu>View</guimenu> <guisubmenu>Last Used Views (Reverse)</guisubmenu>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;&Tab;</keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guisubmenu>Son Kullanılan Görünümler (Ters)</guisubmenu>

source: <action>Opens</action> a list with the last viewed documents:
tr: Son görüntülenen belgeleri içeren bir liste <action>açar</action>:

source: Last viewed documents
tr: Son Görüntülenen Belgeler

source: Keep the &Ctrl; key pressed and use the &Tab; key to cycle forward through the list. Additionally press the &Shift; key to reverse the direction.
tr: Listede ilerlemek için &Ctrl; düğmesini basılı tutun ve &Tab; düğmesine basın. Ayrıca yönü tersine çevirmek için &Shift; düğmesini kullanın.

source: Keep the shortcut <keycombo action="simul">&Ctrl;&Tab;</keycombo> pressed and can use the &Up;, &Down;, &Home; or &End; keys to navigate in the list. Pressing a char key consecutively will cycle through all items with the first matching in the list. If you release the shortcut keys the view will switch to the selected document in the list.
tr: Listede dolaşmak için <keycombo action="simul">&Ctrl;&Tab;</keycombo> kısayolunu basılı tutarken &Up;, &Down;, &Home; veya &End; düğmelerine basın. Bir karakter düğmesine art arda basıldığında, listedeki ilk eşleşen tüm ögeler arasında geçiş yapılır. Kısayol düğmelerini bırakırsanız görünüm, listede seçilen belgeye geçiş yapar.

source: File System Browser
tr: Dosya Sistemi Tarayıcısı

source: The File System Browser is a folder viewer, allowing you to open files from a displayed folder in the current frame.
tr: Dosya Sistemi Tarayıcısı, geçerli çerçevede görüntülenen bir klasördeki dosyaları açmanıza olanak tanıyan bir klasör görüntüleyicisidir.

source: <guimenu>View</guimenu><guisubmenu>Tool Views</guisubmenu> <guimenuitem>Show Filesystem Browser</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guisubmenu>Araç Görünümleri</guisubmenu> <guimenuitem>Dosya Sistemi</guimenuitem>

source: Toggle the display of &kate;'s Filesystem Browser.
tr: &kate;’in Dosya Sistemi Tarayıcısı’nın görüntülenmesini açar/kapatır.

source: From the top down, the Filesystem Browser consists of the following elements:
tr: Yukarıdan aşağıya doğru, Dosya Sistemi Tarayıcısı aşağıdaki ögelerden oluşur:

source: A Toolbar
tr: Bir Araç Çubuğu

source: This contains standard navigations tool buttons:
tr: Bu, standart dolaşım aracı düğmelerini içerir:

source: Back
tr: Geri

source: Causes the folder view to <command>cd</command> to the previously displayed folder in the history. This button is disabled, if there is no previous item.
tr: Klasör görünümünün geçmişte daha önce görüntülenen klasöre <command>cd</command> yapmasına neden olur. Önceki öge yoksa bu düğme devre dışı bırakılır.

source: Forward
tr: İleri

source: Causes the folder view to <command>cd</command> to the next folder in the history. This button is disabled, if there is no next folder.
tr: Klasör görünümünün geçmişteki sonraki klasöre <command>cd</command> yapmasına neden olur. Sonraki öge yoksa bu düğme devre dışı bırakılır.

source: Bookmarks
tr: Yer İmleri

source: Opens a submenu to edit or add bookmarks and to add a new bookmark folder.
tr: Yer imlerini düzenlemek veya eklemek ve yeni bir yer imi klasörü eklemek için bir alt menü açar.

source: Current Document Folder
tr: Geçerli Belge Klasörü
