Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_plugins.po
Languages: tr

source: <userinput>Date:ISO</userinput>: The current date (ISO).
tr: <userinput>Date:ISO</userinput>: Geçerli tarih (ISO).

source: <userinput>Date:&lt;value&gt;</userinput>: The current date (<ulink url="https://doc.qt.io/qt-5/qdate.html#toString">QDate formatstring</ulink>).
tr: <userinput>Date:&lt;value&gt;</userinput>: Geçerli tarih (<ulink url="https://doc.qt.io/qt-5/qdate.html#toString">QDate biçim dizisi</ulink>).

source: <userinput>Time:Locale</userinput>: The current time in current locale format.
tr: <userinput>Time:Locale</userinput>: Geçerli yerel ayar biçimindeki geçerli zaman.

source: <userinput>Time:ISO</userinput>: The current time (ISO).
tr: <userinput>Time:ISO</userinput>: Geçerli zaman (ISO).

source: <userinput>Time:&lt;value&gt;</userinput>: The current time (<ulink url="https://doc.qt.io/qt-5/qtime.html#toString">QTime formatstring</ulink>).
tr: <userinput>Time:&lt;value&gt;</userinput>: Geçerli zaman (<ulink url="https://doc.qt.io/qt-5/qtime.html#toString">QTime biçim dizisi</ulink>).

source: <userinput>ENV:&lt;value&gt;</userinput>: Access to environment variables.
tr: <userinput>ENV:&lt;value&gt;</userinput>: Çevre değişkenlerine erişim.

source: <userinput>JS:&lt;expression&gt;</userinput>: Evaluate simple JavaScript statements.
tr: <userinput>JS:&lt;expression&gt;</userinput>: Basit JavaScript ifadelerini değerlendirin.

source: <userinput>PercentEncoded:&lt;text&gt;</userinput>: Percent encoded text.
tr: <userinput>PercentEncoded:&lt;text&gt;</userinput>: Yüzde kodlamalı metin.

source: <userinput>UUID</userinput>: Generate a new UUID.
tr: <userinput>UUID</userinput>: Yeni bir UUID üretin.

source: List of Default Tools
tr: Öntanımlı Araçların Listesi

source: Several tools are shipped by default. However, if you have more useful tools please contribute those to <email>kwrite-devel@kde.org</email> so that we can add them to this list. All default tools are visible in the list view by default. However, all tools can be changed to your liking, including the category or even deleting tools. Deleted tools can be added back again by clicking on the <guibutton>Add</guibutton> button in the config page as described above.
tr: Öntanımlı olarak çeşitli araçlar sağlanır. Ancak, daha yararlı araçlarınız varsa lütfen bunları <email>kwrite-devel@kde.org</email> adresine gönderin, böylece onları bu listeye ekleyebiliriz. Tüm öntanımlı araçlar öntanımlı olarak liste görünümünde görünür. Bununla birlikte, kategori ve hatta araçların silinmesi de dahil olmak üzere tüm araçlar beğeninize göre değiştirilebilir. Silinen araçlar, yukarıda anlatıldığı gibi yapılandırma sayfasındaki <guibutton>Ekle</guibutton> düğmesine basılarak yeniden eklenebilir.

source: git-cola is a graphical git client that enables you to easily stage and commit changes. If installed, it is available also through the command line by typing <userinput>git-cola</userinput>
tr: git-cola, değişiklikleri kolayca hazırlamanıza ve işlemenize olanak tanıyan grafiksel bir git istemcisidir. Kuruluysa komut satırından <userinput>git-cola</userinput> yazılarak da kullanılabilir.

source: <userinput>Name</userinput>: git-cola
tr: <userinput>Ad</userinput>: git-cola

source: <userinput>Icon</userinput>: git-cola
tr: <userinput>Simge</userinput>: git-cola

source: <userinput>Executable</userinput>: git-cola
tr: <userinput>Yürütülebilir</userinput>: git-cola

source: <userinput>Arguments</userinput>: -r %{Document:Path}
tr: <userinput>Argümanlar</userinput>: -r %{Document:Path}

source: <userinput>Editor command</userinput>: git-cola
tr: <userinput>Düzenleyici komutu</userinput>: git-cola

source: gitk is a git client as well that allows to nicely visualize the git history.
tr: gitk, git geçmişini güzel bir şekilde görselleştirmeye olanak tanıyan bir git istemcisidir.

source: <userinput>Name</userinput>: gitk
tr: <userinput>Ad</userinput>: gitk

source: <userinput>Icon</userinput>: git-gui
tr: <userinput>Simge</userinput>: git-gui

source: <userinput>Executable</userinput>: gitk
tr: <userinput>Yürütülebilir</userinput>: gitk

source: <userinput>Working directory</userinput>: %{Document:Path}
tr: <userinput>Çalışma dizini</userinput>: %{Document:Path}

source: <userinput>Editor command</userinput>: gitk
tr: <userinput>Düzenleyici komutu</userinput>: gitk

source: Starts git blame to easily follow git changes in the current file.
tr: Geçerli dosyadaki git değişikliklerini kolayca takip etmek için git blame’i başlatır.

source: <userinput>Name</userinput>: git blame
tr: <userinput>Ad</userinput>: git blame

source: <userinput>Executable</userinput>: git
tr: <userinput>Yürütülebilir</userinput>: git

source: <userinput>Arguments</userinput>: gui blame %{Document:FileName}
tr: <userinput>Argümanlar</userinput>: gui blame %{Document:FileName}

source: <userinput>Save</userinput>: Current Document
tr: <userinput>Kaydet</userinput>: Geçerli belge

source: <userinput>Editor command</userinput>: git-blame
tr: <userinput>Düzenleyici komutu</userinput>: git-blame

source: Run Shell Script
tr: Kabuk Betiği Çalıştır

source: Starts an external konsole in which the current document is executed. The script needs to state the interpreter in the first line via a shebang <userinput>#!/path/interpreter</userinput>.
tr: Geçerli belgenin yürütüldüğü dış bir konsol başlatır. Betiğin ilk satırda yorumlayıcıyı bir shebang <userinput>#!/yorumlayıcı/yolu</userinput> aracılığıyla belirtmesi gerekir.

source: <userinput>Name</userinput>: Run Shell Script
tr: <userinput>Ad</userinput>: Kabuk Betiği Çalıştır

source: <userinput>Icon</userinput>: system-run
tr: <userinput>Simge</userinput>: system-run

source: <userinput>Executable</userinput>: konsole
tr: <userinput>Yürütülebilir</userinput>: konsole

source: <userinput>Arguments</userinput>: -e sh -c &quot;cd %{Document:Path} &amp;&amp; pwd &amp;&amp; chmod -vc a+x %{Document:FileName} &amp;&amp; ./%{Document:FileName} ; echo Press any key to continue. &amp;&amp; read -n 1&quot;
tr: <userinput>Argümanlar</userinput>: -e sh -c &quot;cd %{Document:Path} &amp;&amp; pwd &amp;&amp; chmod -vc a+x %{Document:FileName} &amp;&amp; ./%{Document:FileName} ; echo Sürdürmek için herhangi bir düğmeye basın… &amp;&amp; read -n 1&quot;

source: <userinput>Editor command</userinput>: run-script
tr: <userinput>Düzenleyici komutu</userinput>: run-script

source: Google Selected Text
tr: Seçili Metni Google ile Ara

source: Search in google for the selected text.
tr: Seçili metni Google ile arayın.

source: <userinput>Name</userinput>: Google Selected Text
tr: <userinput>Ad</userinput>: Seçili Metni Google ile Ara

source: <userinput>Icon</userinput>: globe
tr: <userinput>Simge</userinput>: globe

source: <userinput>Executable</userinput>: xdg-open
tr: <userinput>Yürütülebilir</userinput>: xdg-open

source: <userinput>Arguments</userinput>: &quot;https://www.google.com/search?q=%{Document:Selection:Text}&quot;
tr: <userinput>Argümanlar</userinput>: &quot;https://www.google.com/search?q=%{Document:Selection:Text}&quot;

source: <userinput>Editor command</userinput>: google
tr: <userinput>Düzenleyici komutu</userinput>: google

source: Insert UUID
tr: UUID Ekle

source: Inserts a new UUID each time this action is invoked.
tr: Bu eylem her çağrıldığında yeni bir UUID ekler.

source: <userinput>Name</userinput>: Insert UUID
tr: <userinput>Ad</userinput>: UUID Ekle

source: <userinput>Executable</userinput>: echo
tr: <userinput>Yürütülebilir</userinput>: echo

source: <userinput>Arguments</userinput>: %{UUID}
tr: <userinput>Argümanlar</userinput>: %{UUID}

source: <userinput>Output</userinput>: Insert at Cursor Position
tr: <userinput>Çıktı</userinput>: İmleç Konumunda Ekle

source: <userinput>Editor command</userinput>: uuid
tr: <userinput>Düzenleyici komutu</userinput>: uuid

source: Clang Format Full File
tr: Tüm Dosyayı Clang Format’la

source: Runs clang-format on the current file on disk. The document is reloaded afterwards.
tr: Diskteki geçerli dosyada clang-format’ı çalıştırır. Belge daha sonra yeniden yüklenir.

source: <userinput>Name</userinput>: Clang Format Full File
tr: <userinput>Ad</userinput>: Tüm Dosyayı Clang Format’la

source: <userinput>Executable</userinput>: clang-format
tr: <userinput>Yürütülebilir</userinput>: clang-format

source: <userinput>Arguments</userinput>: -i %{Document:FileName}
tr: <userinput>Argümanlar</userinput>: -i %{Document:FileName}

source: <userinput>Reload</userinput>: Yes
tr: <userinput>Yeniden yükle</userinput>: Evet

source: <userinput>Editor command</userinput>: clang-format-file
tr: <userinput>Düzenleyici komutu</userinput>: clang-format-file

source: Clang Format Selected Text
tr: Seçili Metni Clang Format’la

source: Runs clang-format just on the selected text in the current document.
tr: Geçerli belgedeki seçili metinde clang-format’ı çalıştırır.

source: <userinput>Name</userinput>: Clang Format Selected Text
tr: <userinput>Ad</userinput>: Seçili Metni Clang Format’la

source: <userinput>Arguments</userinput>: -assume-fileName: %{Document:FileName}
tr: <userinput>Argümanlar</userinput>: --assume-fileName: %{Document:FileName}

source: <userinput>Input</userinput>: %{Document:Selection:Text}
tr: <userinput>Girdi</userinput>: %{Document:Selection:Text}

source: <userinput>Output</userinput>: Replace Selected Text
tr: <userinput>Çıktı</userinput>: Seçili Metni Değiştir

source: <userinput>Editor command</userinput>: clang-format-selection
tr: <userinput>Düzenleyici komutu</userinput>: clang-format-selection

source: Qt Quick 2 Preview (qmlscene)
tr: Qt Quick 2 Önizlemesi (qmlscene)

source: Previews the current qml file in qmlscene.
tr: Geçerli qml dosyasını qmlscene’de önizler.

source: <userinput>Name</userinput>: Qt Quick 2 Preview (qmlscene)
tr: <userinput>Ad</userinput>: Qt Quick 2 Önizlemesi (qmlscene)

source: <userinput>Executable</userinput>: qmlscene
tr: <userinput>Yürütülebilir</userinput>: qmlscene

source: <userinput>Arguments</userinput>: %{Document:FileName}
tr: <userinput>Argümanlar</userinput>: %{Document:FileName}

source: <userinput>Editor command</userinput>: qml-preview
tr: <userinput>Düzenleyici komutu</userinput>: qml-preview

source: JSON Format Full File
tr: Tüm Dosyayı JSON’la

source: Format the entire JSON file.
tr: Tüm JSON dosyasını biçimlendir.

source: <userinput>Name</userinput>: JSON Format Full File
tr: <userinput>Ad</userinput>: Tüm Dosyayı JSON’la

source: <userinput>Icon</userinput>: application-json
tr: <userinput>Simge</userinput>: application-json

source: <userinput>Executable</userinput>: jq
tr: <userinput>Yürütülebilir</userinput>: jq

source: <userinput>Output</userinput>: Replace Current Document
tr: <userinput>Çıktı</userinput>: Geçerli Belgeyi Değiştir

source: <userinput>Editor command</userinput>: json-format-file
tr: <userinput>Düzenleyici komutu</userinput>: json-format-file

source: XML Format Full File
tr: Tüm Dosyayı XML’le

source: Format the entire XML file.
tr: Tüm XML dosyasını biçimlendir.

source: <userinput>Icon</userinput>: application-xml
tr: <userinput>Simge</userinput>: application-xml

source: <userinput>Executable</userinput>: xmllint
tr: <userinput>Yürütülebilir</userinput>: xmllint

source: <userinput>Arguments</userinput>: --format %{Document:FileName}
tr: <userinput>Argümanlar</userinput>: --format %{Document:FileName}

source: <userinput>Editor command</userinput>: xml-format-file
tr: <userinput>Düzenleyici komutu</userinput>: xml-format-file

source: Backtrace Browser Plugin
tr: Geri İz Tarayıcısı Eklentisi

source: Using the Backtrace Browser Plugin
tr: Geri İz Tarayıcısı Eklentisini Kullanmak

source: This plugin is meant for developers and probably of little use for users. It shows a backtrace delivered by gdb in a listview in a &kate; toolview. Clicking on an item opens the selected file and jumps to the correct line number. It works for backtraces generated on your own machine, but it will also work for backtraces from other people, &ie; with <filename>/home/dummy/qt-copy/…/qwidget.cpp</filename> will still be found on other machines. For that to work, you have to index the directories where the source code is located.
tr: Bu eklenti geliştiricilere yöneliktir ve büyük olasılıkla düz kullanıcılar için pek kullanışlı değildir. &kate; araç görünümündeki liste görünümünde gdb tarafından sağlanan bir geri izi gösterir. Bir ögeye tıklamak seçili dosyayı açar ve doğru satır numarasına atlar. Hem kendi makinenizde oluşturulan geri izler hem de başkalarından gelen geri izler için de çalışır; yani <filename>/home/dummy/qt-copy/…/qwidget.cpp</filename> başka makinelerde de bulunur. Bunun çalışması için kaynak kodun bulunduğu dizinleri indekslemeniz gerekir.

source: Sometimes there are several files with the same name, &eg;
tr: Bazen aynı ada sahip birden çok dosya olabilir; &eg;,

source: To pick the right choice, the plugin picks the last two parts of the &URL;, in this case this would be
tr: Doğru seçimi seçmek için eklenti &URL;’nin son iki bölümünü seçer; bu durumda bu şu şekilde olur:

source: And then usually the plugin finds the correct one.
tr: Ve sonra genellikle eklenti doğru olanı bulur.

source: Indexing master and a branches of course will lead to a clash.
tr: Ana dal ve diğer dalları indekslemek elbette bir çatışmaya yol açacaktır.

source: Configuration
tr: Yapılandırma

source: On the configuration page add the directories containing the source code.
tr: Yapılandırma sayfasında kaynak kodunu içeren dizinleri ekleyin.

source: Backtrace Browser
tr: Geri İz Tarayıcısı

source: Configure Paths in Backtrace browser tool view
tr: Geri iz tarayıcısı araç görünümünde yolları yapılandır

source: Clicking <guibutton>OK</guibutton> will start indexing. When indexing is finished, open the toolview <guilabel>Backtrace Browser</guilabel>.
tr: <guibutton>Tamam</guibutton>’a tıklamak indekslemeyi başlatır. İndeksleme bittiğinde <guilabel>Geri İz Tarayıcısı</guilabel> araç görünümünü açın.

source: Now you can load a backtrace from the clipboard (&eg;, when you clicked <guibutton>Copy to Clipboard</guibutton> in &drkonqi;) or from a file.
tr: Artık panodan (&eg;, &drkonqi;’de <guibutton>Panoya Kopyala</guibutton>’ya tıkladığınız zaman) veya bir dosyadan bir geri iz yükleyebilirsiniz.

source: Build Plugin
tr: Yapı Eklentisi

source: Introduction
tr: Giriş

source: The Build plugin allows you to run actions like build, clean and compile on a project. You can also automatically run the generated applications. The plugin basically gives you a way to configure sets of commands to run and it can parse the output for links to files and specific lines and columns in those files. So even if the plugin is originally created for compiling C/C++ and mostly tested with it, the plugin can also be useful for other purposes and languages.
tr: Yapı eklentisi, bir projede yapma, temizleme ve derleme gibi eylemleri çalıştırmanıza olanak tanır. Üretilen uygulamaları kendiliğinden de çalıştırabilirsiniz. Eklenti temel olarak size çalıştırılacak komut kümelerini yapılandırmanın bir yolunu sunar ve dosyalara ve bu dosyalardaki belirli satırlara ve sütunlara bağlantılar için çıktıyı ayrıştırabilir. Bu nedenle, eklenti başlangıçta C/C++ derlemek için oluşturulmuş ve çoğunlukla onunla sınanmış olsa bile, eklenti diğer amaçlar ve diller için de yararlı olabilir.

source: Using the Build Plugin
tr: Yapı eklentisini kullanmak

source: The Build plugin adds a <guilabel>Build</guilabel> tool view at the bottom and a <guimenu>Build</guimenu> menu on the menu bar. The tool view can be used to select and configure build targets, while the menu and its shortcuts can be used to select and execute the configured shell commands.
tr: Yapı eklentisi, alt kısma bir <guilabel>Yapı</guilabel> araç görünümü ve menü çubuğuna bir <guimenu>Yapı</guimenu> menüsü ekler. Araç görünümü, yapı hedeflerini seçip yapılandırmak için ve menü/kısayollar ise yapılandırılan kabuk komutlarını seçip yürütmek için kullanılabilir.

source: Build Output
tr: Yapı Çıktısı

source: The <guilabel>Build</guilabel> tool view has two static tabs:
tr: <guilabel>Yapı</guilabel> araç görünümünde iki durağan sekme vardır:

source: Target Settings
tr: Hedef Ayarları

source: Output
tr: Çıktı

source: Target Settings tab
tr: Hedef Ayarları sekmesi

source: The target settings tab can be used to configure various build targets and define target sets.
tr: Hedef ayarları sekmesi, çeşitli yapı hedefleri yapılandırmak ve hedef kümeleri tanımlamak için kullanılabilir.

source: A target-set is a group of commands that can be run in a specified working directory. Target sets can be added under either <guilabel>Projects</guilabel> or <guilabel>Session</guilabel>. The custom target-sets added under <guilabel>Projects</guilabel> are stored in a <guilabel>.kateproject.build</guilabel> file in the project root directory and are restored when the project is re-opened. The target-sets added under <guilabel>Session</guilabel> are stored in the current Kate session configuration.
tr: Bir hedef küme, belirli bir çalışma dizininde çalıştırılabilecek bir komutlar grubudur. Hedef kümeler, <guilabel>Projeler</guilabel> veya <guilabel>Oturum</guilabel> altında eklenebilir. <guilabel>Projeler</guilabel> altında eklenen özel hedef kümeler, kök proje dizinindeki bir <guilabel>.kateproject.build</guilabel> dosyasında saklanır ve proje yeniden açıldığında geri yüklenir. <guilabel>Oturum</guilabel> altında eklenen hedef kümeler ise geçerli Kate oturumu yapılandırmasında depolanır.

source: The first row, in a target-set, contains a name for the set in column one, and in column two we have the directory where the commands should be executed. On each following row, we have a name for the command in column one, a build command in column two and a run command in column three. To edit one of these, double-click on the entry or use the edit shortcut (often <keycap>F2</keycap>).
tr: Bir hedef kümedeki ilk satır, birinci sütundaki küme için bir ad içerir ve ikinci sütunda, komutların yürütülmesi gereken dizin bulunur. Aşağıdaki her satırda, birinci sütunda komut için bir ad, ikinci sütunda bir yapı komutu ve üçüncü sütunda bir çalıştırma komutu vardır. Bunlardan birini düzenlemek için girdiye çift tıklayın veya düzenleme kısayolunu kullanın (genellikle <keycap>F2</keycap> olur).

source: Working Directory
tr: Çalışma Dizini

source: The second column of the first row in a target-set, is used to configure the working directory used for compiling and running commands. If the project plugin is enabled, the working directory string can also contain placeholders for the project base directory path: <guilabel>%B</guilabel> and name: <guilabel>%b</guilabel>
tr: Bir hedef kümedeki ilk satırın ikinci sütunu, komutları derlemek ve çalıştırmak için kullanılan çalışma dizinini yapılandırmak için kullanılır. Proje eklentisi etkinleştirilirse çalışma dizini dizesi proje temel dizin yolu için yer tutucular da içerebilir: <guilabel>%B</guilabel> ve ad: <guilabel>%b</guilabel>

source: Build Command
tr: Yapı Komutu

source: The second column in the "non-first rows", contains the shell command to run in the working directory. Note the word shell. Almost any shell command will do. The build command can contain placeholders. <guilabel>%f</guilabel> for the current file, <guilabel>%d</guilabel> for directory of the current file and <guilabel>%n</guilabel> for the base-name of the current file (file name without suffix).
tr: “İlk satır olmayan” satırlardaki ikinci sütun, çalışma dizininde çalıştırılacak kabuk komutunu içerir. Kabuk lafına dikkat edin. Herhangi bir kabuk komutu burada çalışabilir. Yapı komutu yer tutucular içerebilir. Geçerli dosya için <guilabel>%f</guilabel>, geçerli dosyanın dizini için <guilabel>%d</guilabel> ve geçerli dosyanın taban adı için <guilabel>%n</guilabel> (soneksiz dosya adı).

source: Run Command
tr: Çalıştırma Komutu

source: The third column in the "non-first rows", can contain a shell command, for execution in an actual terminal in the target-set working directory. The terminal is opened as a tab. The plugin will try to reuse the terminal tab, if the same command is executed and the previous application has exited.
tr: “İlk satır olmayan” satırlardaki üçüncü sütun, hedef kümenin çalışma dizinindeki bir uçbirimde yürütülmek üzere bir kabuk komutu içerebilir. Uçbirim bir sekme olarak açılır. Eklenti, bir önceki uygulama çıkmış ve aynı komut yürütülürse uçbirim sekmesini yeniden kullanmaya çalışır.

source: On the top of the <guilabel>Target Settings</guilabel> tab, we have a toolbar with a target filter and the following buttons:
tr: <guilabel>Hedef Ayarları</guilabel> sekmesinin üst kısmında, bir hedef süzgeci ve aşağıdaki düğmeleri içeren bir araç çubuğu bulunur:

source: <guiicon><inlinemediaobject><imageobject><imagedata fileref="run-build-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Build the selected target
tr: <guiicon><inlinemediaobject><imageobject><imagedata fileref="run-build-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Seçili hedefi yap

source: <guiicon><inlinemediaobject><imageobject><imagedata fileref="media-playback-start-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Build and run the selected target
tr: <guiicon><inlinemediaobject><imageobject><imagedata fileref="media-playback-start-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Seçili hedefi yap ve çalıştır

source: <guiicon><inlinemediaobject><imageobject><imagedata fileref="list-add-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Add a new build target
tr: <guiicon><inlinemediaobject><imageobject><imagedata fileref="list-add-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Yeni yapı hedefi ekle

source: <guiicon><inlinemediaobject><imageobject><imagedata fileref="document-new-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Create a new set of targets
tr: <guiicon><inlinemediaobject><imageobject><imagedata fileref="document-new-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Yeni hedef kümesi oluştur

source: <guiicon><inlinemediaobject><imageobject><imagedata fileref="edit-copy-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Copy a command or target set
tr: <guiicon><inlinemediaobject><imageobject><imagedata fileref="edit-copy-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Komutu veya hedef kümesini kopyala

source: <guiicon><inlinemediaobject><imageobject><imagedata fileref="edit-delete-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Delete the current command or target set
tr: <guiicon><inlinemediaobject><imageobject><imagedata fileref="edit-delete-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Geçerli hedefi veya hedef kümelerini sil

source: Output tab
tr: Çıktı sekmesi

source: The <guilabel>Output</guilabel> tab shows the console output generated by the running (build) command. If a line contains a file location, that line will be clickable. If the line in the output also shows an error or warning, the line will have a different color.
tr: <guilabel>Çıktı</guilabel> sekmesi, çalıştırma (yapı) komutu tarafından oluşturulan konsol çıktısını gösterir. Bir satır bir dosya konumu içeriyorsa bu satır tıklanabilir olacaktır. Çıktıdaki satır da bir hata veya uyarı gösteriyorsa çizgi farklı bir renge sahip olur.
