Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_configuring.po
Languages: tr

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit><othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Configuring &kate;
tr: &kate; Yapılandırması

source: Overview
tr: Genel Bakış

source: configure
tr: yapılandır

source: settings
tr: ayarlar

source: preferences
tr: tercihler

source: &kate; offers several means of tweaking the application to behave as desired. The most important ones are:
tr: &kate;, uygulamanın istediğiniz gibi davranması için çeşitli yöntemler sunar. En önemlileri şunlardır:

source: The Configuration Dialog
tr: Yapılandırma İletişim Kutusu

source: The main configuration tool, allowing you to configure the &kate; application, the editor component and the usage of plugins.
tr: Ana yapılandırma aracı, &kate; uygulamasını, düzenleyici bileşenini ve eklentilerin kullanımını yapılandırmanızı sağlar.

source: The <guimenu>Settings</guimenu> Menu
tr: <guimenu>Ayarlar</guimenu> Menüsü

source: Allows you to change often used settings, and to launch the configuration dialogs.
tr: Sık kullanılan ayarları değiştirmenize ve yapılandırma pencerelerini başlatmanıza izin verir.

source: The <guimenu>View</guimenu> Menu
tr: <guimenu>Görünüm</guimenu> Menüsü

source: Allows you to split the current frame, as well as to display the icons and line numbers pane for the currently edited document.
tr: Geçerli çerçeveyi bölmenize, ayrıca şu anda düzenlenen belgenin simgelerini ve satır numaraları bölmesini görüntülemenize olanak tanır.

source: The embedded terminal uses the configuration defined in the &systemsettings;, and may also be configured by clicking the &RMB; to display a context menu.
tr: Gömülü uçbirim, &systemsettings; içinde tanımlanmış olan yapılandırmayı kullanır ve bağlam menüsünün görüntülenmesi için &RMB; ile tıklanarak yapılandırılabilir.

source: The Main Configuration Dialog
tr: Ana Yapılandırma İletişim Kutusu

source: The &kate; configuration dialog displays a tree of topics on the left, and a configuration page corresponding to the selected topic on the right.
tr: &kate; yapılandırma iletişim kutusu, solda konular ağacını ve sağda seçili konuyla ilgili bir yapılandırma sayfası görüntüler.

source: The configuration is divided into two groups, namely:
tr: Yapılandırma iki gruba ayrılır; bunların adları:

source: Application configuration
tr: Uygulama yapılandırması

source: Editor component configuration
tr: Düzenleyici bileşeni yapılandırması

source: The &kate; Application Configuration
tr: &kate; Uygulaması Yapılandırması

source: This group contains pages to configure the main &kate; application
tr: Bu grup, ana &kate; uygulaması yapılandırması sayfalarını içerir

source: General
tr: Genel

source: This section contains a few global options for &kate;
tr: Bu bölüm, &kate; için bir kaç global seçenek içerir

source: Behavior
tr: Davranış

source: Open each document in its own window
tr: Her bir belgeyi kendi penceresinde aç

source: If enabled, each document will be opened in its own window. If not enabled, each document will be opened in a new tab in the current window.
tr: Etkinleştirilmişse her bir belge kendi penceresinde açılır. Etkinleştirilmemişse belgeler geçerli pencerede yeni bir sekmede açılır.

source: Switch to output view upon message type
tr: Şu ileti türünde çıktı görünümüne geç

source: This option allows configuring when &kate; should show an output pane depending on the type of action output.
tr: Bu seçenek, eylem çıktısının türüne bağlı olarak &kate;’in ne zaman çıktı bölmesi göstermesi gerektiğini yapılandırmaya izin verir.

source: It is possible to choose between <guimenuitem>Never</guimenuitem>, <guimenuitem>Error</guimenuitem> (on error), <guimenuitem>Warning</guimenuitem> (on warning or above), <guimenuitem>Info</guimenuitem> (on info or above), and <guimenuitem>Log</guimenuitem> (on log or above).
tr: <guimenuitem>Asla</guimenuitem>, <guimenuitem>Hata</guimenuitem> (hata durumunda), <guimenuitem>Uyarı</guimenuitem> (uyarı durumunda veya yukarıdakinde), <guimenuitem>Bilgi</guimenuitem> (bilgi varken veya yukarıdakinde) ve <guimenuitem>Günlük</guimenuitem> (günlük durumunda veya yukarıdakinde) seçenekleri kullanılabilirdir.

source: Use a separate dialog for handling externally modified files
tr: Dışarıdan değiştirilen dosyaları işlemek için ayrı bir iletişim kutusu kullan

source: When enabled, &kate; will notify you with a modal dialog about all files modified from outside the application whenever the main window receives input focus. You will be able to deal with several modified files at once, you can reload, save or discard changed files in groups.
tr: Etkinleştirildiğinde &kate;, ana pencere giriş odağını aldığında uygulamanın dışından değiştirilen tüm dosyalar hakkında kalıcı bir iletişim kutusuyla sizi bilgilendirecektir. Değiştirilen birkaç dosyayla aynı anda ilgilenebileceksiniz; değiştirilenleri yeniden yükleyebilir, kaydedebilir veya gruplar halinde dosyaları atabilirsiniz.

source: If not enabled, &kate; will individually ask you what to do for each modified file only when that file's view receives focus.
tr: Etkinleştirilmemişse &kate;, yalnızca o dosyanın görünümü odaklandığında, değiştirilen her dosya için ne yapmanız gerektiğini ayrı ayrı soracaktır.

source: Quick Open
tr: Tez Aç

source: Match Mode
tr: Eşleşme Kipi

source: Set the list mode for the <link linkend="view-quick-open">Quick Open</link> tool. The files can be matched by their name or by their path.
tr: <link linkend="view-quick-open">Tez Aç</link> aracı için liste kipini ayarlayın. Dosyalar hem adları hem de yollarıyla eşleştirilebilir.

source: List Mode
tr: Liste Kipi

source: Set the list mode for the <link linkend="view-quick-open">Quick Open</link> tool. It is possible to choose from <guilabel>Current Project Files</guilabel> and <guilabel>All Projects Files</guilabel>.
tr: <link linkend="view-quick-open">Tez Aç</link> aracı için liste kipini ayarlayın. <guilabel>Geçerli Proje Dosyaları</guilabel> ve <guilabel>Tüm Projelerin Dosyaları</guilabel> arasında seçim yapılabilir.

source: Tabs
tr: Sekmeler

source: Limit number of tabs
tr: Sekme sayısını sınırla

source: Set the maximum number of tabs. Choose <guimenuitem>Unlimited</guimenuitem> if you do not want to restrict this number.
tr: Olabilecek en çok sekme sayısını ayarlayın. Herhangi bir sınır koymak istemiyorsanız <guimenuitem>Sınırsız</guimenuitem> seçebilirsiniz.

source: Auto hide tabs
tr: Sekmeleri otomatik gizle

source: When checked tabs will be hidden if only one document is open.
tr: İşaretlendiğinde, yalnızca tek bir belge açıksa sekmeler gizlenir.

source: Show close button
tr: Kapat düğmesini göster

source: When checked each tab will display a close button.
tr: İşaretlendiğinde, her bir sekme bir kapat düğmesi gösterir.

source: Expand tabs
tr: Sekmeleri genişlet

source: When checked tabs take as much size as possible.
tr: İşaretlendiğinde, sekmeler olabildiğince çok yer kaplar.

source: Double click opens a new document
tr: Çift tıklama yeni bir belge açar

source: When checked double click opens a new document.
tr: İşaretlendiğinde, çift tıklama yeni bir belge açar.

source: Middle click closes a document
tr: Orta tık belgeyi kapatır

source: When checked middle click closes a document.
tr: İşaretlendiğinde, orta tıklama bir belgeyi kapatır.

source: Allow tab scrolling
tr: Sekme sarımına izin ver

source: When checked this will allow scrolling in tab bar when number of tabs is large.
tr: İşaretlendiğinde, pek çok sekme varsa sekme çubuğunu sarmaya izin verir.

source: Elide tab text
tr: Sekme metnini yuvarla

source: When checked tab text might be elided if its too long.
tr: İşaretlendiğinde, sekme metni pek uzunsa yuvarlanabilir.

source: Backward button pressed
tr: Geri düğmesine basıldığında

source: Allows selecting the mouse back button action between the <guimenuitem>Previous tab</guimenuitem> and the <guimenuitem>History back</guimenuitem> items.
tr: Fare geri düğmesi eylemini <guimenuitem>Önceki sekme</guimenuitem> ve <guimenuitem>Geri geçmiş</guimenuitem> düğmeleri arasında seçmeye izin verir.

source: Forward button pressed
tr: İleri düğmesine basıldığında

source: Allows selecting the mouse forward button action between the <guimenuitem>Next tab</guimenuitem> and the <guimenuitem>History forward</guimenuitem> items.
tr: Fare ileri düğmesi eylemini <guimenuitem>Sonraki sekme</guimenuitem> ve <guimenuitem>İleri geçmiş</guimenuitem> düğmeleri arasında seçmeye izin verir.

source: Session
tr: Oturum

source: This section contains options related to <link linkend="fundamentals-using-sessions">using sessions</link>.
tr: Bu bölüm, <link linkend="fundamentals-using-sessions">oturumları kullanmak</link> ile ilişkili seçenekleri içerir.

source: Application Startup Behavior
tr: Uygulama Başlangıcı Davranışı

source: Select how you want &kate; to behave at startup. This setting can be overridden by specifying what to do on the <link linkend="command-line-options">command line</link>.
tr: &kate;’in başlangıçta nasıl davranmasını istediğinizi seçin. Bu ayar, <link linkend="command-line-options">command line</link> seçenekleri verilerek geçersiz kılınabilir.

source: Start new session
tr: Yeni oturum başlat

source: With this option, &kate; will start a new, unnamed session when you start the application.
tr: Bu seçenek ile &kate;, yeni adsız bir oturum başlatacaktır.

source: Load last-used session
tr: Son kullanılan oturumu yükle

source: &kate; will use the most recently opened session at startup. This is good if you want to use the same session always or switch rarely.
tr: &kate;, başlangıçta en son açılan oturumu kullanır. Her zaman aynı oturumu kullanmak veya nadiren geçiş yapmak istiyorsanız bu iyi bir seçimdir.

source: Manually choose a session
tr: Elle oturum seç

source: &kate; will display a small dialog that lets you choose your preferred session, or load the default session if none have been saved. This is the default behavior. Nice if you use a lot of different sessions frequently.
tr: &kate;, tercih ettiğiniz oturumu seçmenizi veya kaydedilmemişse öntanımlı oturumu yüklemenizi sağlayan küçük bir iletişim kutusu görüntüleyecektir. Bu, öntanımlı davranıştır. Çok sayıda farklı oturumu sık sık kullanıyorsanız yararlıdır.

source: Application Startup/Shutdown Behavior
tr: Uygulama Başlatma/Kapatma Davranışı

source: Select how you want &kate; to behave at shutdown. It is possible to define what &kate; should <guilabel>Automatically save and restore</guilabel>.
tr: &kate;’in kapatma sırasında nasıl davranmasını istediğinizi seçin. &kate;’in neyi <guilabel>Kendiliğinden kaydet ve geri yükle</guilabel> yapmasını tanımlamak olanaklıdır.

source: Newly-created unsaved files
tr: Yeni oluşturulan kaydedilmemiş dosyalar

source: With this item checked, &kate; will automatically save all newly-created unsaved files.
tr: Bu öge işaretlendiğinde &kate; tüm yeni oluşturulan kaydedilmemiş dosyaları kendiliğinden kaydeder.

source: Files with unsaved changes
tr: Kaydedilmemiş değişiklikli dosyalar

source: This item allows configuring &kate; for automatically saving all files with unsaved changes on shutdown.
tr: Bu öge, kapatma sırasında kaydedilmemiş değişiklikler içeren tüm dosyaların kendiliğinden kaydedilmesi için &kate;’in yapılandırılmasına olanak tanır.

source: Close Kate entirely when the last file is closed
tr: Son dosya kapatıldığında uygulamayı tümüyle kapat

source: If enabled, &kate; will shutdown when the last file being edited is closed, otherwise a blank page will open so that you can start a new file.
tr: Etkinleştirilmişse &kate;, düzenlenen son dosya kapatıldığında çıkar. Aksi takdirde yeni bir dosya başlatabilmeniz için boş bir sayfa açılır.

source: Session Elements
tr: Oturum Ögeleri

source: Include window configuration
tr: Pencere ayarlarını içer

source: If enabled, &kate; will save the window configuration with each session.
tr: Etkinleştirilmişse &kate;, her bir oturum için pencere yapılandırmalarını kaydedecektir.

source: Keep meta-information past sessions
tr: Geçmiş oturumlardaki üstbilgiyi sakla

source: When enabled, &kate; will store meta data such as bookmarks and session configuration even when you close your documents. The data will be used if the document is unchanged when reopened.
tr: Etkinleştirildiğinde &kate;, belgelerinizi kapattığınızda bile yer imleri ve oturum yapılandırması gibi üst veriyi depolar. Belge yeniden açıldığında değiştirilmemişse veri kullanılacaktır.

source: Delete unused meta-information after
tr: Kullanılmayan üstbilgiyi sil

source: Set the maximum number of days to keep meta information for previously opened files. This helps keep the database of meta information reasonably sized.
tr: Önceden açılmış dosyalara ilişkin üstbilginin saklanacağı en çok gün sayısını ayarlayın. Bu, üstbilgi veritabanının makul boyutta tutulmasına yardımcı olur.

source: Any changes to the session data (opened files and, if enabled, window configuration) will always be saved.
tr: Oturum verilerinde yapılan herhangi bir değişiklik (açık dosyalar ve etkinse pencere/yapılandırma) her zaman kaydedilecektir.

source: Plugins
tr: Eklentiler

source: This page provides a list of installed plugins for the &kate; application. Each plugin is represented with its name and a short description. You can check the checkbox with an item to enable the plugin it represents.
tr: Bu sayfa, &kate; uygulamasında kurulu eklentilerin bir listesini sağlar. Her eklenti, adı ve kısa bir açıklamasıyla temsil edilir. Temsil ettiği eklentiyi etkinleştirmek için onay kutusunu bir ögeyle işaretleyebilirsiniz.

source: If a plugin provides configuration options, a section to access those will appear as a child of this page.
tr: Bir eklenti yapılandırma seçenekleri sağlıyorsa bunlara erişebileceğiniz bir bölüm bu sayfanın alt öğesi olarak görünecektir.

source: For more information about the available plugins, see <xref linkend="plugins"/>.
tr: Eklentiler hakkında daha fazla bilgi için: <xref linkend="plugins"/>.

source: The Editor Component Configuration
tr: Düzenleyici Bileşeni Yapılandırması

source: For information about this section of the configuration dialog, see the <ulink url="help:/katepart/config-dialog.html">Editor Component Configuration section of the &katepart; Handbook</ulink>.
tr: Yapılandırma iletişim kutusunun bu bölümü hakkında bilgi almak için <ulink url="help:/katepart/config-dialog.html">&katepart; El Kitabı’nın Düzenleyici Bileşeni Yapılandırması</ulink> bölümüne bakın.

source: Configuring With Document Variables
tr: Belge Değişkenleriyle Yapılandırma

source: For information about using document variables with &kate;, see the <ulink url="help:/katepart/config-variables.html">Configuring with Document Variables section of the &katepart; Handbook</ulink>.
tr: &kate; ile belge değişkenlerinin kullanımı hakkında bilgi almak için <ulink url="help:/katepart/config-variables.html">&katepart; El Kitabı’nın Belge Değişkenleriyle Yapılandırma</ulink> bölümüne bakın.
