Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_plugins.po
Languages: tr

source: LSP Server Troubleshooting
tr: LSP Sunucusu Sorun Giderme

source: It is one thing to describe how to configure a (custom) LSP server for any particular language, it is another to end up with the server running smoothly. Usually, the latter is fortunately the case. Sometimes, however, problems may arise due to either some "silly" misconfiguration or a more fundamental problem with the server itself. The latter might typically manifest itself as a couple of attempts at starting the server, as so reported in &kate; Output tab. The latter, however, is only meant to convey high-level messages or progress rather than to provide detailed diagnostics, and even less so for what is in fact another process (the LSP server).
tr: Belirli bir dil için (özel) bir LSP sunucusunun nasıl yapılandırılacağını açıklamak bir şeydir, sunucunun sorunsuz çalışmasını sağlamak başka bir şeydir. Şans eseri genellikle durum ikincisidir. Ancak bazen “aptalca” bir yanlış yapılandırma veya sunucunun kendisiyle ilgili daha temel bir sorun nedeniyle sorunlar ortaya çıkabilir. İkincisi, &kate; Çıktı sekmesinde bildirildiği gibi, genellikle sunucuyu başlatmaya yönelik birkaç girişim olarak kendini gösterebilir. Ancak ikincisi, ayrıntılı tanı sağlamaktan ziyade yalnızca üst düzey iletileri veya ilerlemeyi iletmeyi amaçlamaktadır ve aslında başka bir süreç (LSP sunucusu) için bu daha da azdır.

source: The usual way to diagnose this is to add some flag(s) to the startup command (of the language server) that enables (additional) logging (to some file or standard error), in as far as it does not do so by default. If &kate; is then started on the command line, then one might be able to obtain more (in)sight in what might be going wrong.
tr: Bunu tanılamanın genel yolu, öntanımlı olarak ayarlanmadığı sürece (bazı dosyalara veya standart hatalara) (ek) günlüğe kaydetmeyi olanaklı kılan (dil sunucusunun) başlangıç komutuna bazı bayrak(lar) eklemektir. Eğer &kate; daha sonra komut satırında başlatılırsa neyin yanlış gittiğine dair daha fazla görüş elde edilebilir.

source: It may also be informative to examine the protocol exchange between &kate;'s LSP client and the LSP server. Again, the latter usually has ways to trace that. The LSP client also provides additional debug tracing (to stderr) when &kate; is invoked with the following <literal>LSPCLIENT_DEBUG=1</literal> suitably <literal>export</literal>'ed.
tr: &kate;’in LSP istemcisi ile LSP sunucusu arasındaki protokol alışverişini incelemek de bilgilendirici olabilir. Yine, ikincisinin genellikle bunun izini sürmenin yolları vardır. LSP istemcisi ayrıca &kate;, <literal>LSPCLIENT_DEBUG=1</literal> ile <literal>export</literal> yapıldığında ek hata ayıklama izlemesi (stderr’e) sağlar:

source: Search &amp; Replace
tr: Ara ve Değiştir

source: &kate;'s Search &amp; Replace plugin allows you to search for text or <ulink url="help:/katepart/regular-expressions.html">regular expressions</ulink> in many different files at once. You can search all open files, all the files in one directory and optionally its subdirectories, or in the active file. You can even filter by filename, for instance searching only files that end with a particular file extension.
tr: &kate;’in Ara ve Değiştir eklentisi, birçok farklı dosyadaki metni veya <ulink url="help:/katepart/regular-expressions.html">düzenli ifadeleri</ulink> aynı anda aramanıza olanak tanır. Tüm açık dosyaları, bir dizindeki ve isteğe bağlı olarak alt dizinlerindeki tüm dosyaları veya etkin dosyadaki tüm dosyaları arayabilirsiniz. Hatta dosya adına göre süzebilirsiniz; örneğin, yalnızca belirli bir dosya uzantısıyla biten dosyaları arayabilirsiniz.

source: Search Query
tr: Arama Sorgusu

source: The following options are always displayed at the top of the Search in Files tool view:
tr: Aşağıdaki seçenekler her zaman Dosyalarda Arama aracı görünümünün üst kısmında görüntülenir:

source: You can have as many searches as you want open at the same time. Simply click the new tab button at the top-left corner of the Search tool view and a new results tab will open permitting you to perform another search.
tr: Aynı anda istediğiniz kadar arama açabilirsiniz. Arama aracı görünümünün sol üst köşesindeki yeni sekme düğmesini tıklamanız yeterlidir; başka bir arama yapmanıza olanak tanıyan yeni bir sonuçlar sekmesi açılacaktır.

source: The button in the top right-corner of the Search in Files tool view will toggle the bottom half of the tool view between displaying additional options for the Search in Folder mode and the results of your search.
tr: Dosyalarda Arama aracı görünümünün sağ üst köşesindeki düğme, araç görünümünün alt yarısında Klasörde Arama kipine yönelik ek seçeneklerin görüntülenmesi ile aramanızın sonuçları arasında geçiş yapar.

source: Find
tr: Bul

source: This is where you type in what you want to find. You may enter standard text, or a regular expression if enabled.
tr: Bulmak istediğiniz şeyi yazacağınız yer burasıdır. Etkinleştirilmişse standart metin veya düzenli ifade girebilirsiniz.

source: <guilabel>Replace</guilabel> (text box)
tr: <guilabel>Değiştir</guilabel> (metin kutusu)

source: Replacement text that will be added to file(s) in place of the text in the <guilabel>Find</guilabel> text box.
tr: <guilabel>Bul</guilabel> metin kutusundaki metnin yerine dosya(lar)a eklenecek yedek metin.

source: Search
tr: Ara

source: When you've finished configuring everything, just press the <guibutton>Search</guibutton> button to perform your search; to perform the search in a new tab press and hold &Ctrl; before pressing the <guibutton>Search</guibutton> button. You may also press &Enter; in the <guilabel>Find</guilabel> text box to do the same (similarly pressing <keycombo action="simul">&Ctrl;&Enter;</keycombo> will perform the search in a new tab).
tr: Her şeyi yapılandırmayı bitirdiğiniz zaman, aramanızı gerçekleştirmek için yalnızca <guibutton>Ara</guibutton> düğmesine basın. Aramayı yeni bir sekmede gerçekleştirmek için <guibutton>Ara</guibutton> düğmesine basmadan önce &Ctrl; düğmesini basılı tutun. Aynısını yapmak için <guilabel>Bul</guilabel> metin kutusundayken &Enter; düğmesine de basabilirsiniz (benzer bir biçimde <keycombo action="simul">&Ctrl;&Enter;</keycombo> yapmak, aramayı yeni bir sekmede yapar).

source: Replace
tr: Değiştir

source: When you've finished configuring everything, just press the <guibutton>Replace</guibutton> button to replace the text entered in the <guilabel>Find</guilabel> text box with that of the <guilabel>Replace</guilabel> text box. You may also press &Enter; in the <guilabel>Replace</guilabel> text box to do the same.
tr: Her şeyi yapılandırmayı bitirdiğiniz zaman, <guilabel>Bul</guilabel> metin kutusuna girdiğiniz metni <guilabel>Değiştir</guilabel> kutusuna girdiğiniz metinle değiştirmek için <guilabel>Değiştir</guilabel> düğmesine basın. <guilabel>Değiştir</guilabel> metin kutusunda &Enter; düğmesine basmak da aynı işi görür.

source: Next
tr: Sonraki

source: Go to the next match of your search query, switching files if necessary.
tr: Gerekirse başka bir dosyaya geçerek arama sorgunuzun bir sonraki eşleşmesine gidin.

source: Replace Checked
tr: İşaretleneni Değiştir

source: The same as <guibutton>Replace</guibutton>, but will only perform replacements in files that are checked in the pane below.
tr: <guibutton>Değiştir</guibutton> ile aynıdır; ancak yalnızca aşağıdaki bölmede işaretli olan dosyalarda değişiklikler gerçekleştirir.

source: Search in Folder Options
tr: Klasörde Ara Seçenekleri

source: These options are displayed below the aforementioned query options. If search results are being displayed instead, press the <guiicon><inlinemediaobject><imageobject> <imagedata fileref="games-config-options-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> button to display them.
tr: Bu seçenekler, yukarıda belirtilen sorgu seçeneklerinin altında görüntülenir. Bunun yerine arama sonuçları görüntüleniyorsa onları görüntülemek için <guiicon><inlinemediaobject><imageobject> <imagedata fileref="games-config-options-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> düğmesine basın.

source: Search in
tr: Şurada ara

source: This has three options. Select <guilabel>Open Files</guilabel> to search all files currently open in &kate;. Select <guilabel>Folder</guilabel> to search inside a folder and optionally its subfolders. Select <guilabel>Current File</guilabel> to search only in the active file.
tr: Burada üç seçenek vardır. Şu anda &kate; içinde açık olan tüm dosyaları aramak için <guilabel>Açık Dosyalarda</guilabel> seçeneğini kullanın. Bir klasör ve isteğe bağlı olarak tüm alt klasörlerinin içinde aramak için <guilabel>Klasörde</guilabel> seçeneğini, yalnızca etkin dosyada arama yapmak içinse <guilabel>Geçerli Dosyada</guilabel> yolunu izleyin.

source: If the <guilabel>Projects</guilabel> plugin is loaded, you can also search in the <guilabel>Current Project</guilabel> or in <guilabel>All Open Projects</guilabel>.
tr: <guilabel>Projeler</guilabel> eklentisi yüklüyse <guilabel>Geçerli Proje</guilabel> veya <guilabel>Tüm Açık Projeler</guilabel> içinde de arama yapabilirsiniz.

source: Match case
tr: BÜYÜK/küçük harf eşleştir

source: Restricts search results to only those that have the exact same combination of upper and lower case letters as your search query.
tr: Arama sonuçlarını yalnızca arama sorgunuzla tümüyle aynı BÜYÜK ve küçük harf kombinasyonuna sahip olanlarla sınırlandırır.

source: Regular expressions
tr: Düzenli ifadeler

source: Permits you to use <ulink url="help:/katepart/regular-expressions.html">regular expressions</ulink> instead of simple text as your search query.
tr: Arama sorgusu olarak basit metin yerine <ulink url="help:/katepart/regular-expressions.html">düzenli ifadeler</ulink> kullanmanıza izin verir.

source: Expand results
tr: Sonuçları genişlet

source: Display all the results found in each file, instead of just a list of files that contain the search query.
tr: Yalnızca arama sorgusunu içeren dosyaların listesi yerine, her dosyada bulunan tüm sonuçları görüntüleyin.

source: Folder
tr: Klasör

source: You may enter the path of the folder you wish to search. For instance, you might enter <userinput>~/development/kde/kate/</userinput> if you wished to search the &kate; source code. This option is only available when using <guilabel>in Folder</guilabel> mode.
tr: Aramak istediğiniz klasörün yolunu girebilirsiniz. Örneğin, &kate; kaynak kodunda arama yapmak için <userinput>~/development/kde/kate/</userinput> yolunu girin. Bu seçenek yalnızca <guilabel>Klasörde</guilabel> kipi etkinse kullanılabilirdir.

source: Open file dialog
tr: Dosya iletişim kutusunu aç

source: Press this button to locate the folder in your desktop's folder browser. This button only works when using <guilabel>Folder</guilabel> mode.
tr: Klasörü masaüstünüzün klasör tarayıcısında bulmak için bu düğmeye basın. Bu düğme yalnızca <guilabel>Klasörde</guilabel> kipi kullanıldığında çalışır.

source: Press this button to change <guilabel>Folder</guilabel> to the parent of the currently selected folder. This button only works when using <guilabel>Folder</guilabel> mode.
tr: <guilabel>Klasör</guilabel>’ü geçerli seçili klasörün üst ögesi olarak değiştirmek için bu düğmeye basın. Bu düğme yalnızca <guilabel>Klasörde</guilabel> kipi kullanıldığında çalışır.

source: This button will set the <guilabel>Folder</guilabel> entry to the folder in which the currently open document is located. This button only works when using <guilabel>Folder</guilabel> mode.
tr: Bu düğme, <guilabel>Klasör</guilabel> girdisini o anda açık olan belgenin bulunduğu klasöre ayarlayacaktır. Bu düğme yalnızca <guilabel>Klasörde</guilabel> kipi kullanıldığında çalışır.

source: Filter
tr: Süz

source: This permits you to only search filenames that match a particular pattern. For instance, to only search files written in C++, change it to <userinput>*.cpp</userinput>. To search only files beginning with <literal>kate</literal>, change it to <userinput>kate*</userinput>. You can enter multiple filters separated with a comma (<userinput>,</userinput>). This option is not available when using <guilabel>Open files</guilabel> mode.
tr: Bu, yalnızca belirli bir dizgiyle eşleşen dosya adlarını aramanıza izin verir. Örneğin, C++ ile yazılmış dosyaları aramak için onu <userinput>*.cpp</userinput> olarak değiştirin. Başlangıcı yalnızca <literal>kate</literal> ile eşleşen dosyaları aramak için onu <userinput>kate*</userinput> olarak değiştirin. Virgülle ayrılmış birden çok süzgeç (<userinput>,</userinput>) girebilirsiniz. Bu seçenek, <guilabel>Açık Dosyalarda</guilabel> kipindeyken kullanılamaz.

source: Exclude
tr: Dışla

source: The opposite of <guilabel>Filter</guilabel>, this prevents &kate; from searching files that match the specified patterns. As with <guilabel>Filter</guilabel>, you can enter multiple patterns separated with a comma (<userinput>,</userinput>). This option is not available when using <guilabel>Open files</guilabel> mode.
tr: <guilabel>Süz</guilabel>’ün tersi olarak, bu &kate;’in belirli bir dizgiyle eşleşen dosyaları aramasını engeller. <guilabel>Süz</guilabel>’de olduğu gibi, virgülle ayrılan (<userinput>,</userinput>) birden çok dizgi girebilirsiniz. Bu seçenek, <guilabel>Açık Dosyalarda</guilabel> kipindeyken kullanılamaz.

source: Recursive
tr: Özyineli

source: If this option is enabled, &kate; will also search in all subfolders of the selected folder. This option is only available when using <guilabel>Folder</guilabel> mode.
tr: Bu seçenek etkinleştirilirse &kate;, seçili klasörün tüm alt klasörlerinde de arama yapar. Bu seçenek yalnızca <guilabel>Klasörde</guilabel> kipi etkinse kullanılabilir.

source: Include hidden
tr: Gizlileri içer

source: If this option is enabled, &kate; will also search in files or folders that are typically hidden by your &OS;. This option is only available when using <guilabel>Folder</guilabel> mode.
tr: Bu seçenek etkinleştirilirse &kate;, normalde &OS; tarafından gizlenen dosyalarda/klasörlerde de arama yapar. Bu seçenek yalnızca <guilabel>Klasörde</guilabel> kipi etkinse kullanılabilir.

source: Follow symbolic links
tr: Sembolik bağlantıları izle

source: The Search in Files plugin typically does not follow <ulink url="https://en.wikipedia.org/wiki/Symbolic_link">symbolic links</ulink>. When this option is enabled, the plugin will follow them instead and search inside the files or folders they reference. This option is only available when using <guilabel>Folder</guilabel> mode.
tr: Dosyalarda Ara eklentisi normalde <ulink url="https://en.wikipedia.org/wiki/Symbolic_link">sembolik bağlantıları</ulink> izlemez. Bu seçenek etkinleştirildiğinde, eklenti onları izleyecek ve başvurdukları dosyaların/klasörlerin içinde de arama yapacaktır. Bu seçenek yalnızca <guilabel>Klasörde</guilabel> kipi etkinse kullanılabilir.

source: It's possible for symbolic links to reference a folder that is the parent of the folder currently being searched, or other folders that contain symbolic links to their parent. If there is such a link in the folder being searched and this option is enabled, &kate; will repeatedly follow the link and search the folder, and the search will never complete.
tr: Sembolik bağlantıların, aranmakta olan klasörün üst ögesi olan bir klasöre veya üst ögelerine sembolik bağlantılar içeren diğer klasörlere başvurması olanaklıdır. Aranan klasörde böyle bir bağlantı varsa ve bu seçenek etkinleştirilirse &kate; bağlantıyı hep izleyecek ve klasörü arayacaktır ve arama hiçbir zaman tamamlanmayacaktır.

source: Include binary files
tr: İkili dosyaları içer

source: If enabled, &kate; will also search in files that do not appear to be text files.
tr: Etkinleştirilirse &kate;, metin dosyasına benzemeyen dosyalarda da arama yapacaktır.

source: Search Results
tr: Arama Sonuçları

source: The results of your search are displayed below the query options. If options for Search in Folder mode are displayed, simply press the <guiicon><inlinemediaobject><imageobject><imagedata fileref="games-config-options-22.png" format="PNG"/> </imageobject></inlinemediaobject></guiicon> button to display them. They will also automatically be displayed as soon as a search is performed.
tr: Aramanızın sonuçları sorgu seçeneklerinin altında görüntülenir. Klasörde kipinde arama seçenekleri görüntüleniyorsa onları görüntülemek için <guiicon><inlinemediaobject><imageobject><imagedata fileref="games-config-options-22.png" format="PNG"/> </imageobject></inlinemediaobject></guiicon> düğmesine basın. Ayrıca bir arama gerçekleştirildiği anda kendiliğinden görüntüleneceklerdir.

source: The search results display a list of files that contains text that matches your search query, followed by the number of matches found in that file.
tr: Arama sonuçları, arama sorgunuzla eşleşen metni içeren dosyaların bir listesini ve ardından o dosyada bulunan eşleşme sayısını görüntüler.

source: To see a list of matches in that file, simply click the expansion arrow to the left of the file name. (If you selected the <guilabel>Expand results</guilabel> option, this will already be done for you.) The line number each match is found on will be displayed, followed by the contents of that line, with your search query indicated in bold text.
tr: Bu dosyadaki eşleşmelerin listesini görmek için dosya adının solundaki genişletme okuna tıklamanız yeterlidir. (<guilabel>Sonuçları genişlet</guilabel> seçeneğini seçtiyseniz bu sizin için zaten yapılır.) Her eşleşmenin bulunduğu satır numarası, ardından o satırın içeriği ve arama sorgunuz kalın metinle belirtilecektir.

source: To open the file your result was found in, simply double-click it. &kate; will open the file if needed. You can also move the cursor to the location of a particular match by double-clicking on its listing instead of the file name.
tr: Sonucunuzun bulunduğu dosyayı açmak için çift tıklamanız yeterlidir. &kate; gerekirse dosyayı açacaktır. Ayrıca, dosya adı yerine listeye çift tıklayarak imleci belirli bir eşleşmenin konumuna taşıyabilirsiniz.

source: <shortcut> <keycombo action="simul">&Ctrl;&Alt;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Search in Files</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Alt;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Dosyalarda Ara</guimenuitem>

source: Launches the Search and Replace tool view.
tr: Ara ve Değiştir araç görünümünü başlatır.

source: <guimenu>Edit</guimenu> <guimenuitem>Go to Next Match</guimenuitem>
tr: <guimenu>Düzen</guimenu> <guimenuitem>Sonraki Eşleşmeye Git</guimenuitem>

source: Go to the next match in a search performed by the Search and Replace plugin.
tr: Ara ve Değiştir eklentisi tarafından gerçekleştirilen aramada bir sonraki eşleşmeye gidin.

source: <guimenu>Edit</guimenu> <guimenuitem>Go to Previous Match</guimenuitem>
tr: <guimenu>Düzen</guimenu> <guimenuitem>Önceki Eşleşmeye Git</guimenuitem>

source: Go to the previous match in a search performed by the Search and Replace plugin.
tr: Ara ve Değiştir eklentisi tarafından gerçekleştirilen aramada bir önceki eşleşmeye gidin.

source: <guimenu>View</guimenu><guisubmenu>Tool Views</guisubmenu> <guimenuitem>Show Search and Replace</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guisubmenu>Araç Görünümleri</guisubmenu> <guimenuitem>Ara ve Değiştir</guimenuitem>

source: Toggle the display of &kate;'s <guilabel>Search and Replace</guilabel> tool.
tr: &kate;’in <guilabel>Ara ve Değiştir</guilabel> aracını açar/kapatır.

source: &kate; Scripts &amp; Snippets
tr: &kate; Betikleri ve Parçacıkları

source: The &kate; Scripts &amp; Snippets plugin allows you to add, and manage your own bits of automation. This can range from static re-useable pieces of plain text, over sophisticated templates with custom automated and scriptable fields, to fully custom &javascript; scripts to modify the contents of your document.
tr: &kate; Betikler ve Parçacıkları eklentisi, kendi özel otomatikleştirme iş akışınızı eklemenize ve yönetmenize olanak tanır. Bu, belgenizin içeriğinde değişiklik yapmak için durağan yeniden kullanılabilir metin parçalarından, özel olarak otomatikleştirilmiş betik alanları içeren aşırı sofistike &javascript; şablonlarına kadar gidebilir.

source: For the most part, these types of content are managed in exactly the same way. Therefore, for ease of reading, the following discussion does not differentiate between static snippets, scripted snippets, and scripts. Rather, the term <quote>snippet</quote> is used to refer to all of them.
tr: Çoğu zaman, bu tür içerikler hep aynı şekilde yönetilir. Okuma kolaylığı adına aşağıdaki açıklamalar, durağan parçacıklar, betikleştirilmiş parçacıklar ve betikler arasında herhangi bir ayrım gütmez. <quote>Parçacık</quote> terimi, bu üçü için de kullanılır.

source: The plugin also supports assigning keyboard shortcuts, and inserting snippets via code completion. Further, you can download collections of snippets (so-called repositories) from the internet.
tr: Eklenti ayrıca, klavye kısayollarını ve kod tamamlama ile parçacıklar yerleştirmeyi destekler. Ek olarak, internetten parçacıklar koleksiyonları indirebilirsiniz (bunlara depolar denir).

source: <guimenu>View</guimenu><guisubmenu>Tool Views</guisubmenu> <guimenuitem>Show Snippets</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guisubmenu>Araç Görünümleri</guisubmenu> <guimenuitem>Parçacıklar</guimenuitem>

source: Shows snippets panel containing all snippets in your repository that are for the currently opened file type.
tr: Şu anda açık olan dosya türü için deponuzdaki tüm parçacıkları içeren kod parçacıkları panelini gösterir.

source: <guimenu>Tools</guimenu> <guimenuitem>Create Snippet</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Parçacık Oluştur</guimenuitem>

source: Create a new snippet, which is a reusable chunk of text you may insert in any part of any document, or a small script.
tr: Herhangi bir belgenin herhangi bir bölümüne ekleyebileceğiniz yeniden kullanılabilir bir metin parçası olan yeni bir parçacık veya küçük bir betik oluşturun.

source: Snippets panel
tr: Parçacıklar panosu

source: &kate; Snippets Panel
tr: &kate; Parçacıklar Panosu

source: The &kate; snippets panel.
tr: &kate; parçacıklar panosu.

source: The panel for &kate; Snippets.
tr: &kate; parçacıkları için pano.

source: In the panel you should see a list of snippet repositories, along with options to create your own, get them from the Internet or load them from a local file. Each repository has a checkbox that can be used to activate or deactivate it. There are also buttons to edit and delete existing repositories.
tr: Panelde, parçacık depolarının bir listesini ve kendinizinkini oluşturma, bunları internetten alma veya yerel bir dosyadan yükleme seçeneklerini görmelisiniz. Her deponun, onu etkinleştirmek veya devre dışı bırakmak için kullanılabilecek bir onay kutusu vardır. Var olan depoları düzenlemek ve silmek için düğmeler de bulunur.

source: Loading Snippet Repository Files
tr: Parçacık Deposu Dosyalarını Yüklemek

source: You can download snippet repositories from the Internet. Just click <guibutton>Get New Snippets</guibutton> and a window with a list of snippet repositories will open. After downloading the desired snippet, make sure that you have activated it.
tr: Parçacık depolarını internetten indirebilirsiniz. <guibutton>Yeni Parçacıklar Al</guibutton>’a tıklamanız yeterlidir; parça depolarının listesini içeren bir pencere açılacaktır. İstediğiniz parçacığı indirdikten sonra etkinleştirdiğinizden emin olun.

source: Creating and Editing Repositories
tr: Depoları Oluşturmak ve Düzenlemek
