Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_advanced.po
Languages: tr

source: <command>char</command><arg choice="req">STRING identifier</arg>
tr: <command>char</command><arg choice="req">DİZİ tanımlayıcı</arg>

source: This command allows you to insert literal characters by their numerical identifier, in decimal, octal or hexadecimal form. To use it launch the Editing Command dialog and type <userinput>char: [number]</userinput> in the entry box, then hit <guibutton>OK</guibutton>.
tr: Bu komut, sayısal tanımlayıcılarına göre; ondalık, sekizlik veya onaltılık biçimde gerçek karakterleri eklemenizi sağlar. Bunu kullanmak için Düzenleme Komutu iletişim kutusunu başlatın ve giriş kutusuna <userinput>char: [number]</userinput> yazın, ardından <guibutton>Tamam</guibutton>’a basın.

source: <command>char</command> examples
tr: <command>char</command> örnekleri

source: Input: <userinput>char:234</userinput>
tr: Girdi: <userinput>char:234</userinput>

source: Output: <computeroutput>&#234;</computeroutput>
tr: Çıktı: <computeroutput>&#234;</computeroutput>

source: Input: <userinput>char:0x1234</userinput>
tr: Girdi: <userinput>char:0x1234</userinput>

source: Output: <computeroutput>&#x1234;</computeroutput>
tr: Çıktı: <computeroutput>&#x1234;</computeroutput>

source: replace, sed style
tr: sed biçeminde değiştirme

source: search, sed style
tr: sed biçeminde arama

source: This command does a sed-like search/replace operation on the current line, or on the whole file (<command>%s///</command>).
tr: Bu komut, geçerli satırda veya tüm dosyada sed benzeri arama/değiştirme işlemi yapar (<command>%s///</command>).

source: In short, the text is searched for text matching the <emphasis>search pattern</emphasis>, the regular expression between the first and the second slash, and when a match is found, the matching part of the text is replaced with the expression between the second and last slash. Parentheses in the search pattern create <emphasis>back references</emphasis>, that is the command remembers which part of the string matched in the parentheses; these strings can be reused in the replace pattern, referred to as <userinput>\1</userinput> for the first set of parentheses, <userinput>\2</userinput> for the second and so on.
tr: Kısacası metinde, birinci ve ikinci eğik çizgi arasındaki normal ifade olan <emphasis>arama dizgisi</emphasis> ile eşleşen metin aranır ve bir eşleşme bulunduğunda metnin eşleşen kısmı, ikinci ve son eğik çizgi arasındaki ifadeyle değiştirilir. Arama dizgisindeki parantezler <emphasis>geriye başvurular</emphasis> oluşturur; yani komut, parantez içinde eşleşen dizinin hangi bölümünün anımsanacağını bilir; bu diziler, ilk parantez kümesi için <userinput>\1</userinput>, ikinci parantez kümesi için <userinput>\2</userinput> olarak anılan değiştirme dizgisinde yeniden kullanılabilir.

source: To search for a literal <literal>(</literal> or <literal>)</literal>, you need to <emphasis>escape</emphasis> it using a backslash character: <userinput>\(\)</userinput>
tr: Bir gerçek karakter aramak için <literal>(</literal> veya <literal>)</literal> onu bir ters eğik çizgi karakteriyle <emphasis>kaçırmalısınız</emphasis>: <userinput>\(\)</userinput>

source: If you put an <userinput>i</userinput> at the end of the expression, the matching will be case insensitive. If you put a <userinput>g</userinput> at the end, all occurrences of the pattern will be replaced, otherwise only the first occurrence is replaced.
tr: İfadenin sonuna <userinput>i</userinput> koyarsanız eşleştirme BÜYÜK/küçük harfe duyarlı olmayacaktır. Eğer sona bir <userinput>g</userinput> koyarsanız dizginin tüm oluşları değiştirilecektir, aksi takdirde yalnızca ilk oluş değiştirilir.

source: Replacing text in the current line
tr: Geçerli satırda metin değiştirmek

source: Your friendly compiler just stopped, telling you that the class <classname>myClass</classname> mentioned in line 3902 in your source file is not defined.
tr: Dost canlısı derleyiciniz, kaynak dosyanızda 3902. satırda bahsedilen <classname>sınıfım</classname> sınıfının tanımlanmadığını söyleyerek durdu.

source: &quot;Buckle!&quot; you think, it is of course <classname>MyClass</classname>. You go to line 3902, and instead of trying to find the word in the text, you launch the Editing Command Dialog, enter <userinput>s/myclass/MyClass/i</userinput>, hit the <guibutton>OK</guibutton> button, save the file and compile &ndash; successfully without the error.
tr: “Tüh!”, tabii ki <classname>Sınıfım</classname> olması gerek diye düşündünüz. 3902. satıra gittiniz ve metinde sözcüğü bulmak yerine Düzenleme Komutu iletişim kutusunu açarak <userinput>s/sınıfım/Sınıfım/i</userinput> yazdınız ve <guibutton>Tamam</guibutton> düğmesine bastınız; artık dosyayı kaydedip hatasız şekilde derleyebilirsiniz.

source: Replacing text in the whole file
tr: Tüm dosyada metin değiştirmek

source: Imagine that you have a file, in which you mention a <quote>Miss Jensen</quote> several times, when someone comes in and tells you that she just got married to <quote>Mr Jones</quote>. You want, of course, to replace each and every occurrence of <quote>Miss Jensen</quote> with <quote>Ms Jones</quote>.
tr: Birkaç kez <quote>Bayan Gökçen</quote>’den söz ettiğiniz bir dosyanız olduğunu ve birisinin gelip size <quote>Bay Gökmen</quote> ile yeni evlendiğini söylediğini hayal edin. Elbette, <quote>Bayan Gökçen</quote> ifadesinin her bir örneğini <quote>Bayan Gökmen</quote> ile değiştirmek istersiniz.

source: Enter the command line and issue the command <userinput>%s/Miss Jensen/Ms Jones/</userinput> and hit return, you are done.
tr: Komut satırına girin ve <userinput>%s/Gökçen/Gökmen/</userinput> komutunu çalıştırın, işiniz bitti.

source: A More Advanced Example
tr: Daha Gelişmiş Bir Örnek

source: This example makes use of <emphasis>back references</emphasis> as well as a <emphasis>character class</emphasis> (if you do not know what that is, please refer to the related documentation mentioned below).
tr: Bu örnekte <emphasis>geriye başvuruların</emphasis> yanı sıra <emphasis>karakter sınıfının</emphasis> kullanımı kullanılmaktadır (bunun ne olduğunu bilmiyorsanız lütfen aşağıda belirtilen ilgili belgelere bakın).

source: Suppose you have the following line:
tr: Aşağıdaki gibi bir satırınız olduğunu düşünün:

source: Now you realize that this is not nice code, and decide that you want to use the <constant>const</constant> keyword for all <quote>address of</quote> arguments, those characterized by the &amp; operator in front of the argument name. You would also like to simplify the white space, so that there is only 1 whitespace character between each word.
tr: Bunun pek güzel bir kod olmadığını anladınız ve argüman adının önünde &amp; ile karakterize edilen tüm <quote>address of</quote> argümanları için <constant>const</constant> anahtar sözcüğünü kullanmaya karar verdiniz. Ayrıca, her sözcük arasında yalnızca 1 boşluk karakteri olacak şekilde beyaz alanı basitleştirmek istediniz.

source: Launch the Editing Command Dialog, and enter: <userinput>s/\s+(\w+)\s+(&amp;)/ const \1 \2/g</userinput> and hit the <guibutton>OK</guibutton> button. The <userinput>g</userinput> at the end of the expression makes the regular expression recompile for each match to save the <emphasis>backreferences</emphasis>.
tr: Düzenleme Komut iletişim kutusunu açın ve <userinput>s/\s+(\w+)\s+(&amp;)/ const \1 \2/g</userinput> yazarak <guibutton>Tamam</guibutton> düğmesine tıklayın. İfadenin sonundaki <userinput>g</userinput> <emphasis>geriye başvuruların</emphasis> kaydedilmesi için düzenli ifadenin her eşleşmede yeniden derlenmesini sağlar.

source: Output: <computeroutput>void MyClass::DoStringOps( const String &amp;foo, const String &amp;bar, String *p, const int &amp;a, const int &amp;b )</computeroutput>
tr: Çıktı: <computeroutput>void MyClass::DoStringOps( const String &amp;foo, const String &amp;bar, String *p, const int &amp;a, const int &amp;b )</computeroutput>

source: Mission completed! Now, what happened? Well, we looked for some white space (<literal>\s+</literal>) followed by one or more alphabetic characters (<literal>\w+</literal>) followed by some more whitespace (<literal>\s+</literal>) followed by an ampersand, and in the process saved the alphabetic chunk and the ampersand for reuse in the replace operation. Then we replaced the matching part of our line with one whitespace followed by <quote>const</quote> followed by one whitespace followed by our saved alphabetical chunk (<literal>\1</literal>) followed by one whitespace followed by our saved ampersand (<literal>\2</literal>)
tr: Görev tamamlandı! Şimdi ne yaptık? İlk olarak, biraz boşluk (<literal>\s+</literal>), sonrasında bir veya daha çok abecesel karakterler (<literal>\w+</literal>), sonrasında biraz daha boşluk (<literal>\s+</literal>), sonrasında bir ve işareti aradık; bu süreçte abecesel parçayı ve ve işaretini değiştirme işleminde yeniden kullanım için sakladık. Sonrasında, satırımızın eşleşen kısmını bir boşluk ve sonrasında <quote>const</quote> ile bir boşluk daha ve abecesel parça ile izledik (<literal>\1</literal>); bunlardan sonra yine bir boşluk ve kaydettiğimiz ve işaretini koyduk (<literal>\2</literal>)

source: Now in some cases the alphabetical chunk was <quote>String</quote>, in some <quote>int</quote>, so using the character class <literal>\w</literal> and the <literal>+</literal> quantifier proved a valuable asset.
tr: Bazı durumlarda bu abecesel parça bir <quote>String</quote>, bazı durumlarda ise <quote>int</quote> idi, böylece <literal>\w</literal> karakter sınıfını ve <literal>+</literal> niceleyicisi bize çok yararlı oldu.

source: Sorts the selected text or entire document.
tr: Seçili metni veya tüm belgeyi sıralar.

source: Sort the selected lines or entire document naturally.
tr: Seçili satırları veya tüm belgeyi doğal olarak sıralayın.

source: <command>sort</command> vs. <command>natsort</command>
tr: <command>sort</command> ve <command>natsort</command>

source: <userinput><command>sort</command>(a10, a1, a2)</userinput> results in <computeroutput>a1, a10, a2</computeroutput>
tr: <userinput><command>sort</command>(a10, a1, a2)</userinput>, <computeroutput>a1, a10, a2</computeroutput> sonucunu verir

source: <userinput><command>natsort</command>(a10, a1, a2)</userinput> results in <computeroutput>a1, a2, a10</computeroutput>
tr: <userinput><command>natsort</command>(a10, a1, a2)</userinput>, <computeroutput>a1, a2, a10</computeroutput> sonucunu verir

source: Move selected lines down.
tr: Seçili satırları aşağı taşıyın.

source: Move selected lines up.
tr: Seçili satırları yukarı taşıyın.

source: Remove duplicated lines from the selected text or the whole document.
tr: Seçili metinden veya tüm belgeden yinelenen satırları kaldırın.

source: Remove trailing space from the selected text or the whole document.
tr: Seçili metnin veya tüm belgenin sonundaki gereksiz boşluğu kaldırın.

source: Remove leading space from the selected text or the whole document.
tr: Seçili metnin ya da tüm belgenin başındaki boşlukları kaldırın.

source: <command>join</command><arg choice="opt">STRING separator</arg>
tr: <command>join</command><arg choice="opt">DİZİ ayırıcı</arg>

source: Join selected lines or whole document. Optionally takes a parameter defining a separator, for example: <userinput><command>join</command> ', '</userinput>
tr: Seçili satırları veya tüm belgeyi birbirine katın. İsteğe bağlı olarak bir ayırıcı tanımlayan bir parametre alır; örneğin <userinput><command>join</command> ', '</userinput>

source: Remove all blank spaces from the selected text or the whole document.
tr: Seçili metinden veya tüm belgeden boş boşlukları kaldırın.

source: This command aligns lines in the selected block or whole document on the column given by a regular expression given as an argument.
tr: Bu komut, seçilen bloktaki veya belgenin tamamındaki satırları, argüman olarak verilen normal bir ifadeyle verilen sütunda hizalar.

source: If you give an empty pattern it will align on the first non-blank character by default.
tr: Boş bir dizgi verirseniz öntanımlı olarak ilk boş olmayan karaktere hizalanır.

source: If the pattern has a capture it will indent on the captured match.
tr: Dizginin bir yakalaması varsa yakalanan eşleşmeye girintili olacaktır.

source: Examples:
tr: Örnekler:

source: <userinput>alignon -</userinput> will insert spaces before the first '-' of each lines to align them all on the same column.
tr: <userinput>alignon -</userinput>, tümünü aynı sütunda hizalamak için her bir satırın önündeki “-” öncesinde boşluklar ekler.

source: <userinput>alignon :\\s+(.)</userinput> will insert spaces before the first non-blank character that occurs after a colon to align them all on the same column.
tr: <userinput>alignon :\\s+(.)</userinput>, tümünü aynı sütunda hizalamak için bir noktalı virgülden sonra oluşan ilk boş olmayan karakterin öncesine boşluklar ekler.

source: Unwrap the selected text or the whole document.
tr: Seçili metnin veya tüm belgenin kaydırmasını geri alın.

source: <command>each</command><arg choice="req">STRING script</arg>
tr: <command>each</command><arg choice="req">DİZİ betik</arg>

source: Given a &javascript; function as an argument, call that for the list of selected lines and replace them with the return value of that callback.
tr: Argüman olarak bir &javascript; işlevi verildiğinde, seçili satırların listesi için bunu çağırın ve bunları, o geri çağırmanın dönüş değeriyle değiştirin.

source: Join selected lines
tr: Seçili satırları birbirine kat

source: Or, more briefly:
tr: Veya kısaca:

source: <command>filter</command><arg choice="req">STRING script</arg>
tr: <command>filter</command><arg choice="req">DİZİ betik</arg>

source: Given a &javascript; function as an argument, call that for the list of selected lines and remove those where the callback returns false.
tr: Argüman olarak bir &javascript; işlevi verildiğinde, seçili satırların listesi için bunu çağırın ve geri çağırmanın false döndürdüğü satırları kaldırın.

source: Remove blank lines
tr: Boş satırları kaldır

source: <command>map</command><arg choice="req">STRING script</arg>
tr: <command>map</command><arg choice="req">DİZİ betik</arg>

source: Given a &javascript; function as an argument, call that for the list of selected lines and replace the line with the value of the callback.
tr: Argüman olarak bir &javascript; işlevi verildiğinde, seçili satırların listesi için bunu çağırın ve satırı geri çağırmanın değeriyle değiştirin.

source: Duplicate the selected lines above the current selection.
tr: Seçili satırları geçerli seçim üzerine çoğaltın.

source: Duplicate the selected lines below the current selection.
tr: Seçili satırları geçerli seçimin altına çoğaltın.

source: Commands for navigation
tr: Dolaşım için komutlar

source: <command>goto</command><arg choice="req">INT line</arg>
tr: <command>goto</command><arg choice="req">TAMSAYI satır</arg>

source: This command navigates to the specified line.
tr: Bu komut, belirtilen satıra gider.

source: <command>grep</command> <arg choice="req">STRING pattern</arg>
tr: <command>grep</command> <arg choice="req">DİZİ dizgi</arg>

source: Search the document for the regular expression <userinput>pattern</userinput>. For more information, see <xref linkend="regular-expressions"/>.
tr: Belgeyi, <userinput>dizgi</userinput> düzenli ifadesi için arayın. Daha fazla bilgi için <xref linkend="regular-expressions"/> bölümüne bakın.

source: <command>find</command><arg choice="req">STRING pattern</arg>
tr: <command>find</command><arg choice="req">DİZİ dizgi</arg>

source: This command navigates to the first occurrence of <userinput>pattern</userinput> according to the configuration. Following occurrences can be found using <menuchoice><guimenu>Edit</guimenu><guimenuitem>Find Next</guimenuitem></menuchoice> (the default shortcut is <keycap>F3</keycap>).
tr: Bu komut, yapılandırmaya göre <userinput>dizgi</userinput>’nin ilk oluşuna gider. İzleyen oluşlar, <menuchoice><guimenu>Düzen</guimenu><guimenuitem>Sonrakini Bul</guimenuitem></menuchoice> ile bulunabilir (öntanımlı kısayol: <keycap>F3</keycap>).

source: The find command can be configured by appending a colon followed by one or more options, the form is <userinput>find:options pattern</userinput>. The following options are supported:
tr: Bul komutu, iki nokta üst üste ve ardından bir veya daha fazla seçeneğin eklenmesiyle yapılandırılabilir; komutun biçimi <userinput>find:seçenekler dizgi</userinput> biçimindedir. Aşağıdaki seçenekler desteklenir:

source: <command>ifind</command><arg choice="req">STRING pattern</arg>
tr: <command>ifind</command><arg choice="req">DİZİ dizgi</arg>

source: This command provides <quote>as-you-type</quote> searching. You can configure the behavior of the search by appending a colon followed by one or more options, like this: <userinput>ifind:options pattern</userinput>. Allowed options are:
tr: Bu komut, <quote>yazdıkça</quote> aramayı sağlar. Aramanın davranışını bir sütun ve seçenekleri ekleyerek yapılandırabilirsiniz; şöyledir: <userinput>ifind:seçenekler dizgi</userinput>. İzin verilen seçenekler:

source: Do regular expression search.
tr: Düzenli ifade araması yapın.

source: Commands for Basic Editor Functions (These depend on the application the editor component is used in)
tr: Temel Düzenleyici İşlevleri için Komutlar (Bunlar düzenleyici bileşenin kullanıldığı uygulamaya göre değişir)

source: Save the current document.
tr: Geçerli belgeyi kaydedin.

source: Save all currently open documents.
tr: Tüm geçerli açık belgeleri kaydedin.

source: Close the current document.
tr: Geçerli belgeyi kapatın.

source: Close all open documents.
tr: Tüm açık belgeleri kapatın.

source: Save and close the current document.
tr: Geçerli belgeyi kaydedin ve kapatın.

source: Save and close all currently open documents.
tr: Tüm geçerli açık belgeleri kaydedin ve kapatın.

source: Save and close the current document only if it has changed.
tr: Geçerli belgeyi yalnızca değiştiyse kaydedin ve kapatın.

source: Save and close all currently open documents only if they have changed.
tr: Geçerli açık olan tüm belgeleri yalnızca değiştiyse kaydedin ve kapatın.

source: Go to the previous document in the documents list.
tr: Belgeler listesindeki önceki belgeye gidin.

source: Go to the next document in the documents list.
tr: Belgeler listesindeki sonraki belgeye gidin.

source: Open a new document in horizontal split view.
tr: Yatay bölünmüş görünümde yeni bir belge açın.

source: Open a new document in vertical split view.
tr: Dikey bölünmüş görünümde yeni bir belge açın.

source: Reload the current document if it has changed on disk.
tr: Geçerli belge diskte değiştiyse yeniden yükleyin.

source: Edit a new document.
tr: Yeni bir belge düzenleyin.

source: Open the Print dialog to print the current document.
tr: Geçerli belgeyi yazdırmak için Yazdır iletişim kutusunu açın.

source: Using Code Folding
tr: Kod Katlamayı Kullanmak

source: Code folding allows you to hide parts of a document in the editor, making it easier to overview large documents. In &kappname; the foldable regions are calculated using rules defined in the syntax highlight definitions, and therefore it is only available in some formats - typically program source code, XML markup and similar. Most highlight definitions supporting code folding also lets you manually define foldable regions, typically using the <userinput>BEGIN</userinput> and <userinput>END</userinput> keywords.
tr: Kod katlama, bir belgenin bölümlerini düzenleyicide gizlemenize olanak tanıyarak büyük belgelere genel bakışı kolaylaştırır. &kappname;’de katlanabilir bölgeler, sözdizim vurgulama tanımlarında tanımlanan kurallar kullanılarak hesaplanır ve bu nedenle yalnızca bazı biçimlerde kullanılabilir — tipik olarak program kaynak kodu, XML işaretlemesi ve benzeri. Kod katlamayı destekleyen çoğu vurgu tanımı, genellikle <userinput>BEGIN</userinput> ve <userinput>END</userinput> anahtar sözcüklerini kullanarak katlanabilir bölgeleri elle tanımlamanıza da olanak tanır.

source: To use the code folding feature, activate the folding markers using <menuchoice><guimenu>View</guimenu><guimenuitem>Show Folding Markers</guimenuitem></menuchoice> menu item if they are not already visible. The Folding Markers Pane on the left side of the screen displays a graphical view of the foldable regions, with triangle symbols to indicate the possible operation on a given region: a top down triangle means that the region is expanded, clicking it will collapse the region and a right pointing triangle will be displayed instead.
tr: Kod katlama özelliğini kullanmak için halihazırda görünmüyorsa <menuchoice><guimenu>Görünüm</guimenu><guimenuitem>Katlama İmleyicilerini Göster</guimenuitem></menuchoice> menü ögesini kullanarak katlama imleyicilerini etkinleştirin. Ekranın sol tarafındaki Katlama İmleyicileri Bölmesi, belirli bir bölgedeki olası işlemi belirtmek için üçgen sembolleriyle katlanabilir bölgelerin grafiksel bir görünümünü görüntüler: Yukarıdan aşağıya bir üçgen, bölgenin genişletildiği anlamına gelir; tıklandığında bölge daraltılır ve bunun yerine sağa işaret eden bir üçgen görüntülenir.

source: Three commands are provided to manipulate the state of folding regions, see the <link linkend="view-code-folding">menu documentation</link>.
tr: Katlama bölgelerinin durumunu değiştirmek için üç komut sağlanır; ek bilgi için <link linkend="view-code-folding">menü belgelendirmesine</link> bakın.

source: The folded lines are remembered when a file is closed, so when you reopen the file the folded nodes will still be folded. This applies to reload operations as well.
tr: Katlanmış çizgiler, bir dosya kapatıldığında anımsanır, böylece dosyayı yeniden açtığınızda katlanmış düğümler hâlâ katlanmış olacaktır. Bu aynı zamanda yeniden yükleme işlemleri için de geçerlidir.

source: If you do not want to use the code folding feature, you can disable the <guilabel>Show folding markers (if available)</guilabel> option in the <link linkend="appearance">Appearance</link> page of the editor configuration.
tr: Kod katlama özelliğini kullanmak istemiyorsanız düzenleyici yapılandırmasının <link linkend="appearance">Görünüş</link> bölümündeki <guilabel>Katlama imleyicilerini göster</guilabel> seçeneğini kullanabilirsiniz.
