Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_development.po
Languages: tr

source: Joins the lines from <replaceable>startLine</replaceable> to <replaceable>endLine</replaceable>. Two succeeding text lines are always separated with a single space.
tr: <replaceable>başlangıçSatırı</replaceable> konumundan <replaceable>bitişSatırı</replaceable> konumuna kadar olan satırları birbirine katar. İki birbirini izleyen metin satırı her zaman bir boşluk ile ayrılır.

source: Returns the number of lines in the document.
tr: Belgedeki satır sayısını döndürür.

source: bool document.isLineModified(<parameter>int <replaceable>line</replaceable></parameter>);
tr: bool document.isLineModified(<parameter>int <replaceable>satır</replaceable></parameter>);

source: Returns <literal>true</literal>, if <replaceable>line</replaceable> currently contains unsaved data.
tr: <replaceable>satır</replaceable> şu anda kaydedilmemiş veri içeriyorsa <literal>true</literal> döndürür.

source: Since: &kde; 5.0
tr: Eklendiği sürüm: &kde; 5.0

source: bool document.isLineSaved(<parameter>int <replaceable>line</replaceable></parameter>);
tr: bool document.isLineSaved(<parameter>int <replaceable>satır</replaceable></parameter>);

source: Returns <literal>true</literal>, if <replaceable>line</replaceable> was changed, but the document was saved. Hence, the line currently does not contain any unsaved data.
tr: <replaceable>line</replaceable> değiştirildi ve belge kaydedildiyse <literal>true</literal> döndürür. Böylece, satırda şu anda kaydedilmeyen bir veri kalmamış olur.

source: bool document.isLineTouched(<parameter>int <replaceable>line</replaceable></parameter>);
tr: bool document.isLineTouched(<parameter>int <replaceable>satır</replaceable></parameter>);

source: Returns <literal>true</literal>, if <replaceable>line</replaceable> currently contains unsaved data or was changed before.
tr: <replaceable>line</replaceable> içinde şu anda kaydedilmemiş veri varsa veya daha önce değiştirildiyse <literal>true</literal> döndürür.

source: bool document.findTouchedLine(<parameter>int <replaceable>startLine</replaceable></parameter>, <parameter>bool <replaceable>down</replaceable></parameter>);
tr: bool document.findTouchedLine(<parameter>int <replaceable>başlangıçSatırı</replaceable></parameter>, <parameter>bool <replaceable>aşağı</replaceable></parameter>);

source: Search for the next touched line starting at <replaceable>line</replaceable>. The search is performed either upwards or downwards depending on the search direction specified in <replaceable>down</replaceable>.
tr: <replaceable>line</replaceable> konumundan başlayan sonraki dokunulmuş satırı arar. Arama, <replaceable>down</replaceable> içinde belirtilen yöne göre aşağı veya yukarı doğru yapılır.

source: Returns the number of characters in the document.
tr: Belgedeki karakter sayısını döndürür.

source: int document.lineLength(<parameter>int <replaceable>line</replaceable></parameter>);
tr: int document.lineLength(<parameter>int <replaceable>satır</replaceable></parameter>);

source: Returns the <replaceable>line</replaceable>'s length.
tr: <replaceable>satır</replaceable>’ın uzunluğunu döndürür.

source: Starts an edit group for undo/redo grouping. Make sure to always call <function>editEnd()</function> as often as you call <function>editBegin()</function>. Calling <function>editBegin()</function> internally uses a reference counter, &ie;, this call can be nested.
tr: Geri Al/Yinele gruplaması için bir düzenleme grubu başlatır. Hem <function>editEnd()</function> hem de <function>editBegin()</function> işlevlerini aynı sayıda çağırdığınızdan emin olun. <function>editBegin()</function> işlevini çağırmak içsel olarak bir başvuru sayacı kullanır; demeli, bu çağrı iç içe geçirilebilir.

source: Ends an edit group. The last call of <function>editEnd()</function> (&ie; the one for the first call of <function>editBegin()</function>) finishes the edit step.
tr: Bir düzenleme grubunu sonlandırır. <function>editEnd()</function> işlevinin son çağrısı (&ie; <function>editBegin()</function> işlevinin ilk çağrısı için olan) düzenleme adımını bitirir.

source: int document.firstColumn(<parameter>int <replaceable>line</replaceable></parameter>);
tr: int document.firstColumn(<parameter>int <replaceable>satır</replaceable></parameter>);

source: Returns the first non-whitespace column in the given <replaceable>line</replaceable>. If there are only whitespaces in the line, the return value is <literal>-1</literal>.
tr: Verilen <replaceable>satır</replaceable>’daki ilk boşluk olmayan sütunu döndürür. Satırda yalnızca boşluklar varsa <literal>-1</literal> döndürülür.

source: int document.lastColumn(<parameter>int <replaceable>line</replaceable></parameter>);
tr: int document.lastColumn(<parameter>int <replaceable>satır</replaceable></parameter>);

source: Returns the last non-whitespace column in the given <replaceable>line</replaceable>. If there are only whitespaces in the line, the return value is <literal>-1</literal>.
tr: Verilen <replaceable>satır</replaceable>’daki son boşluk olmayan sütunu döndürür. Satırda yalnızca boşluklar varsa <literal>-1</literal> döndürülür.

source: int document.prevNonSpaceColumn(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); int document.prevNonSpaceColumn(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: int document.prevNonSpaceColumn(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); int document.prevNonSpaceColumn(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Returns the column with a non-whitespace character starting at the given cursor position and searching backwards.
tr: Verilen imleç konumundan başlayıp geriye doğru arama yaparak boşluk olmayan karakter içeren sütunu döndürür.

source: int document.nextNonSpaceColumn(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); int document.nextNonSpaceColumn(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: int document.nextNonSpaceColumn(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); int document.nextNonSpaceColumn(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Returns the column with a non-whitespace character starting at the given cursor position and searching forwards.
tr: Verilen imleç konumundan başlayıp ileriye doğru arama yaparak boşluk olmayan karakter içeren sütunu döndürür.

source: int document.prevNonEmptyLine(<parameter>int <replaceable>line</replaceable></parameter>);
tr: int document.prevNonEmptyLine(<parameter>int <replaceable>satır</replaceable></parameter>);

source: Returns the next non-empty line containing non-whitespace characters searching backwards.
tr: Verilen imleç konumundan başlayıp geriye doğru arama yaparak sonraki boş olmayan satırı döndürür.

source: int document.nextNonEmptyLine(<parameter>int <replaceable>line</replaceable></parameter>);
tr: int document.nextNonEmptyLine(<parameter>int <replaceable>satır</replaceable></parameter>);

source: Returns the next non-empty line containing non-whitespace characters searching forwards.
tr: Verilen imleç konumundan başlayıp ileriye doğru arama yaparak sonraki boş olmayan satırı döndürür.

source: bool document.isInWord(<parameter>String <replaceable>character</replaceable></parameter>, <parameter>int <replaceable>attribute</replaceable></parameter>);
tr: bool document.isInWord(<parameter>String <replaceable>karakter</replaceable></parameter>, <parameter>int <replaceable>öznitelik</replaceable></parameter>);

source: Returns <literal>true</literal>, if the given <replaceable>character</replaceable> with the given <replaceable>attribute</replaceable> can be part of a word, otherwise <literal>false</literal>.
tr: Verilen <replaceable>öznitelik</replaceable>’i içeren <replaceable>karakter</replaceable> bir sözcüğün parçası olabiliyorsa <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: bool document.canBreakAt(<parameter>String <replaceable>character</replaceable></parameter>, <parameter>int <replaceable>attribute</replaceable></parameter>);
tr: bool document.canBreakAt(<parameter>String <replaceable>karakter</replaceable></parameter>, <parameter>int <replaceable>öznitelik</replaceable></parameter>);

source: Returns <literal>true</literal>, if the given <replaceable>character</replaceable> with the given <replaceable>attribute</replaceable> is suited to wrap a line, otherwise <literal>false</literal>.
tr: Verilen <replaceable>öznitelik</replaceable>’i içeren <replaceable>karakter</replaceable> bir satırı kaydırmak için uygunsa <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: bool document.canComment(<parameter>int <replaceable>startAttribute</replaceable></parameter>, <parameter>int <replaceable>endAttribute</replaceable></parameter>);
tr: bool document.canComment(<parameter>int <replaceable>başlangıçÖzniteliği</replaceable></parameter>, <parameter>int <replaceable>bitişÖzniteliği</replaceable></parameter>);

source: Returns <literal>true</literal>, if a range starting and ending with the given attributes is suited to be commented out, otherwise <literal>false</literal>.
tr: Verilen özniteliklerle başlayan ve biten bir erim, yorum olarak imlenebiliyorsa <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: String document.commentMarker(<parameter>int <replaceable>attribute</replaceable></parameter>);
tr: String document.commentMarker(<parameter>int <replaceable>öznitelik</replaceable></parameter>);

source: Returns the comment marker for single line comments for a given <replaceable>attribute</replaceable>.
tr: Verilen bir <replaceable>öznitelik</replaceable> için tek satırlık yorumlar için olan yorum imleyicisini döndürür.

source: String document.commentStart(<parameter>int <replaceable>attribute</replaceable></parameter>);
tr: String document.commentStart(<parameter>int <replaceable>öznitelik</replaceable></parameter>);

source: Returns the comment marker for the start of multi-line comments for a given <replaceable>attribute</replaceable>.
tr: Verilen bir <replaceable>öznitelik</replaceable> için çok satırlık yorum başlangıçı için olan yorum imleyicisini döndürür.

source: String document.commentEnd(<parameter>int <replaceable>attribute</replaceable></parameter>);
tr: String document.commentEnd(<parameter>int <replaceable>öznitelik</replaceable></parameter>);

source: Returns the comment marker for the end of multi-line comments for a given <replaceable>attribute</replaceable>.
tr: Verilen bir <replaceable>öznitelik</replaceable> için çok satırlık yorum bitişi için olan yorum imleyicisini döndürür.

source: Returns a range that encompasses the whole document.
tr: Tüm belgeyi kapsayan bir erim döndürür.

source: Returns a cursor positioned at the last column of the last line in the document.
tr: Belgedeki son satırın son sütununda konumlanan imleci döndürür.

source: bool isValidTextPosition(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); bool isValidTextPosition(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: bool isValidTextPosition(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); bool isValidTextPosition(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Returns <literal>true</literal>, if the given cursor position is positioned at a valid text position. A text position is valid only if it locate at the start, in the middle, or the end of a valid line. Further, a text position is invalid if it is located in a Unicode surrogate.
tr: Verilen imleç konumu geçerli bir metin konumundaysa <literal>true</literal> değerini döndürür. Bir metin konumu yalnızca geçerli bir satırın başında, ortasında veya sonunda bulunuyorsa geçerlidir. Ayrıca bir metin konumu, bir Unicode vekilinde bulunuyorsa geçersizdir.

source: int document.attribute(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); int document.attribute(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: int document.attribute(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); int document.attribute(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Returns the attribute at the given cursor position.
tr: Verilen imleç konumundaki özniteliği döndürür.

source: bool document.isAttribute(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>, <parameter>int <replaceable>attribute</replaceable></parameter>); bool document.isAttribute(<parameter>Cursor <replaceable>cursor</replaceable></parameter>, <parameter>int <replaceable>attribute</replaceable></parameter>);
tr: bool document.isAttribute(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>, <parameter>int <replaceable>öznitelik</replaceable></parameter>); bool document.isAttribute(<parameter>Cursor <replaceable>imleç</replaceable></parameter>, <parameter>int <replaceable>öznitelik</replaceable></parameter>);

source: Returns <literal>true</literal>, if the attribute at the given cursor position equals <replaceable>attribute</replaceable>, otherwise <literal>false</literal>.
tr: Verilen imleç konumundaki öznitelik <replaceable>attribute</replaceable> ile eşitse <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: String document.attributeName(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); String document.attributeName(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: String document.attributeName(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); String document.attributeName(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Returns the attribute name as human readable text. This is equal to the <literal>itemData</literal> name in the syntax highlighting files.
tr: Öznitelik adını insanlar tarafından okunabilir metin olarak döndürür. Bu, sözdizim vurgulama dosyalarındaki <literal>itemData</literal> adına eşittir.

source: bool document.isAttributeName(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>, <parameter>String <replaceable>name</replaceable></parameter>); bool document.isAttributeName(<parameter>Cursor <replaceable>cursor</replaceable></parameter>, <parameter>String <replaceable>name</replaceable></parameter>);
tr: bool document.isAttributeName(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>, <parameter>String <replaceable>ad</replaceable></parameter>); bool document.isAttributeName(<parameter>Cursor <replaceable>imleç</replaceable></parameter>, <parameter>String <replaceable>ad</replaceable></parameter>);

source: Returns <literal>true</literal>, if the attribute name at a certain cursor position matches the given <replaceable>name</replaceable>, otherwise <literal>false</literal>.
tr: Belirli bir imleç konumundaki öznitelik adı verilen <replaceable>ad</replaceable> ile eşleşiyorsa <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: String document.variable(<parameter>String <replaceable>key</replaceable></parameter>);
tr: String document.variable(<parameter>String <replaceable>anahtar</replaceable></parameter>);

source: Returns the value of the requested document variable <replaceable>key</replaceable>. If the document variable does not exist, the return value is an empty string.
tr: İstenen belge değişkeni <replaceable>anahtar</replaceable>’ın değerini döndürür. Belge değişkeni yoksa dönüş değeri boş bir dizidir.

source: void document.setVariable(<parameter>String <replaceable>key</replaceable></parameter>, <parameter>String <replaceable>value</replaceable></parameter>);
tr: void document.setVariable(<parameter>String <replaceable>anahtar</replaceable></parameter>, <parameter>String <replaceable>değer</replaceable></parameter>);

source: Set the value of the requested document variable <replaceable>key</replaceable>.
tr: İstenen belge değişkeni <replaceable>anahtar</replaceable>’ın değerini ayarla.

source: See also: <link linkend="config-variables">Kate document variables</link>
tr: Ayrıca bakınız: <link linkend="config-variables">Kate belge değişkenleri</link>

source: Since: &kde; 4.8
tr: Eklendiği sürüm: &kde; 4.8

source: int document.firstVirtualColumn(<parameter>int <replaceable>line</replaceable></parameter>);
tr: int document.firstVirtualColumn(<parameter>int <replaceable>satır</replaceable></parameter>);

source: Returns the virtual column of the first non-whitespace character in the given line or <literal>-1</literal>, if the line is empty or contains only whitespace characters.
tr: Verilen satırdaki boşluk olmayan ilk karakterin sanal sütununu veya satır boşsa veya yalnızca boşluk karakterleri içeriyorsa <literal>-1</literal> döndürür.

source: int document.lastVirtualColumn(<parameter>int <replaceable>line</replaceable></parameter>);
tr: int document.lastVirtualColumn(<parameter>int <replaceable>satır</replaceable></parameter>);

source: Returns the virtual column of the last non-whitespace character in the given line or <literal>-1</literal>, if the line is empty or contains only whitespace characters.
tr: Verilen satırdaki boşluk olmayan son karakterin sanal sütununu veya satır boşsa veya yalnızca boşluk karakterleri içeriyorsa <literal>-1</literal> döndürür.

source: int document.toVirtualColumn(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); int document.toVirtualColumn(<parameter>Cursor <replaceable>cursor</replaceable></parameter>); Cursor document.toVirtualCursor(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: int document.toVirtualColumn(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); int document.toVirtualColumn(<parameter>Cursor <replaceable>imleç</replaceable></parameter>); Cursor document.toVirtualCursor(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Converts the given <quote>real</quote> cursor position to a virtual cursor position, either returning an int or a Cursor object.
tr: Verilen <quote>gerçek</quote> imleç konumunu, bir int veya Cursor nesnesi döndürerek sanal bir imleç konumuna dönüştürür.

source: int document.fromVirtualColumn(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>virtualColumn</replaceable></parameter>); int document.fromVirtualColumn(<parameter>Cursor <replaceable>virtualCursor</replaceable></parameter>); Cursor document.fromVirtualCursor(<parameter>Cursor <replaceable>virtualCursor</replaceable></parameter>);
tr: int document.fromVirtualColumn(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sanalSütun</replaceable></parameter>); int document.fromVirtualColumn(<parameter>Cursor <replaceable>sanalİmleç</replaceable></parameter>); Cursor document.fromVirtualCursor(<parameter>Cursor <replaceable>sanalİmleç</replaceable></parameter>);

source: Converts the given virtual cursor position to a <quote>real</quote> cursor position, either returning an int or a Cursor object.
tr: Verilen sanal imleç konumunu, bir int veya Cursor nesnesi döndürerek <quote>gerçek</quote> imleç konumuna dönüştürür.

source: Cursor document.anchor(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>, <parameter>Char <replaceable>character</replaceable></parameter>); Cursor document.anchor(<parameter>Cursor <replaceable>cursor</replaceable></parameter>, <parameter>Char <replaceable>character</replaceable></parameter>);
tr: Cursor document.anchor(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>, <parameter>Char <replaceable>karakter</replaceable></parameter>); Cursor document.anchor(<parameter>Cursor <replaceable>imleç</replaceable></parameter>, <parameter>Char <replaceable>karakter</replaceable></parameter>);

source: Searches backward for the given character starting from the given cursor. As an example, if '(' is passed as character, this function will return the position of the opening '('. This reference counting, &ie; other '(...)' are ignored.
tr: Verilen imleçten başlayarak verilen karakteri geriye doğru arar. Örnek olarak, eğer “(” karakter olarak iletilirse bu işlev “(” açılışının konumunu döndürecektir. Bu başvuru sayımı, yani diğer “(…)” yok sayılır.

source: Cursor document.rfind(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>, <parameter>String <replaceable>text</replaceable></parameter>, <parameter>int <replaceable>attribute</replaceable> = -1</parameter>); Cursor document.rfind(<parameter>Cursor <replaceable>cursor</replaceable></parameter>, <parameter>String <replaceable>text</replaceable></parameter>, <parameter>int <replaceable>attribute</replaceable> = -1</parameter>);
tr: Cursor document.rfind(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>, <parameter>String <replaceable>metin</replaceable></parameter>, <parameter>int <replaceable>öznitelik</replaceable> = -1</parameter>); Cursor document.rfind(<parameter>Cursor <replaceable>imleç</replaceable></parameter>, <parameter>String <replaceable>metin</replaceable></parameter>, <parameter>int <replaceable>öznitelik</replaceable> = -1</parameter>);

source: Find searching backwards the given text with the appropriate <replaceable>attribute</replaceable>. The argument <replaceable>attribute</replaceable> is ignored if it is set to <literal>-1</literal>. The returned cursor is invalid, if the text could not be found.
tr: Verilen metni uygun <replaceable>öznitelik</replaceable> ile geriye doğru arayarak bulun. Argüman <replaceable>özniteliği</replaceable>, <literal>-1</literal> olarak ayarlanmışsa yok sayılır. Metin bulunamadığında döndürülen imleç geçersizdir.

source: int document.defStyleNum(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); int document.defStyleNum(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: int document.defStyleNum(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); int document.defStyleNum(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Returns the default style used at the given cursor position.
tr: Verilen imleç konumunda kullanılan öntanımlı biçemi döndürür.
