Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_menus.po
Languages: tr

source: This item will add one to the currently selected text, if it is a number. For example, if <userinput>5</userinput> is selected, it will become <computeroutput>6</computeroutput>.
tr: Bu öge bir sayıysa o anda seçili olan metne 1 ekler. Örneğin, <userinput>5</userinput> seçiliyse <computeroutput>6</computeroutput> olur.

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Increment number by 10</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Sayıyı 10 Artır</guimenuitem>

source: This item will add 10 to the currently selected text, if it is a number. For example, if <userinput>5</userinput> is selected, it will become <computeroutput>15</computeroutput>.
tr: Bu öge bir sayıysa o anda seçili olan metne 10 ekler. Örneğin, <userinput>5</userinput> seçiliyse <computeroutput>15</computeroutput> olur.

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Increment number by 0.1</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Sayıyı 0,1 Artır</guimenuitem>

source: This item will add 0.1 to the currently selected text, if it is a number. For example, if <userinput>4.5</userinput> is selected, it will become <computeroutput>4.6</computeroutput>.
tr: Bu öge bir sayıysa o anda seçili olan metne 0,1 ekler. Örneğin, <userinput>4,5</userinput> seçiliyse <computeroutput>4,6</computeroutput> olur.

source: <shortcut> <keycap>F7</keycap> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Switch to Command Line</guimenuitem>
tr: <shortcut> <keycap>F7</keycap> </shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Komut Satırına Geç</guimenuitem>

source: Displays the &katepart; command line at the bottom of the window. In the command line, type <userinput>help</userinput> to get help and <userinput>help list</userinput> to get a list of commands. For more information on the command line, see <link linkend="advanced-editing-tools-commandline">The Editor Component Command Line</link>.
tr: Pencerenin altında &katepart; komut satırını görüntüler. Yardım almak için <userinput>help</userinput> ve komutların bir listesini almak için <userinput>help list</userinput> komutlarını komut satırına girin. Komut satırı üzerine daha fazla bilgi için <link linkend="advanced-editing-tools-commandline">Düzenleyici Bileşeni Komut Satırı</link> bölümüne bakın.

source: <shortcut> <keycombo action="simul">&Ctrl;&Space;</keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Invoke Code Completion</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Space;</keycombo> </shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Kod Tamamlamayı Başlat</guimenuitem>

source: Manually invoke command completion, usually by using a shortcut bound to this action.
tr: Genellikle bu eyleme bağlı bir kısayol kullanarak komut tamamlamayı elle çağırın.

source: <guimenu>Tools</guimenu> <guimenuitem>Word Completion</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Sözcük Tamamlama</guimenuitem>

source: <guimenuitem>Reuse Word Below</guimenuitem> (<keycombo action="simul">&Ctrl; <keycap>9</keycap></keycombo>) and <guimenuitem>Reuse Word Above</guimenuitem> (<keycombo action="simul">&Ctrl; <keycap>8</keycap></keycombo>) complete the currently typed text by searching for similar words backward or forward from the current cursor position. <guimenuitem>Shell Completion</guimenuitem> pops up a completion box with matching entries.
tr: <guimenuitem>Aşağıdaki Sözcüğü Yeniden Kullan</guimenuitem> (<keycombo action="simul">&Ctrl; <keycap>9</keycap></keycombo>) ve <guimenuitem>Yukarıdaki Sözcüğü Yeniden Kullan</guimenuitem> (<keycombo action="simul">&Ctrl; <keycap>8</keycap></keycombo>) şu anda girilen sözcüğü, imlecin önünden veya arkasından benzer sözcükleri arayarak tamamlamaya çalışır. <guimenuitem>Kabuk Tamamlama</guimenuitem>, eşleşen girdilerle bir tamamlama kutusu açar.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guisubmenu>Spelling</guisubmenu> <guimenuitem>Automatic Spell Checking</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Araçlar</guimenu> <guisubmenu>Yazım Denetimi</guisubmenu> <guimenuitem>Kendiliğinden Yazım Denetimi</guimenuitem>

source: When <guimenuitem>Automatic Spell Checking</guimenuitem> is enabled, wrongly spelled text is underlined in the document on-the-fly.
tr: <guimenuitem>Kendiliğinden Yazım Denetimi</guimenuitem> etkinleştirildiğinde, yanlış yazılan sözcüklerin altı anında çizilir.

source: <guimenu>Tools</guimenu> <guisubmenu>Spelling</guisubmenu> <guimenuitem>Spelling...</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Yazım Denetimi</guisubmenu> <guimenuitem>Yazım Denetimi…</guimenuitem>

source: <action>This initiates the spellchecking program - a program designed to help the user catch and correct any spelling errors.</action> Clicking on this entry will start the checker and bring up the speller dialog box through which the user can control the process. There are four settings lined up vertically in the center of the dialog with their corresponding labels just to the left. Starting at the top they are:
tr: <action>Bu, kullanıcının yazım hatalarını yakalayıp düzeltmesine yardımcı olmak için tasarlanmış bir program olan yazım denetimi programını başlatır.</action> Bu girişin tıklanması denetleyiciyi başlatır ve kullanıcının süreci denetleyebileceği yazım denetimi iletişim kutusunu açar. İletişim kutusunun ortasında dikey olarak sıralanmış dört ayar vardır ve bunların karşılık gelen etiketleri hemen soldadır. En üstten başlayarak bunlar:

source: Unknown word:
tr: Bilinmeyen sözcük:

source: Here, the spellchecker indicates the word currently under consideration. This happens when the checker encounters a word not in its dictionary - a file containing a list of correctly spelled words against which it compares each word in the editor.
tr: Burada yazım denetleyicisi, incelenen sözcüğü belirtir. Bu, denetleyici, sözlüğünde bulamadığı bir sözcüğe rast geldiğinde olur. Sözlük, denetleyicinin belgedeki sözcükleri denetlemek için kullandığı girdileri içerir.

source: Replace with:
tr: Şununla değiştir:

source: If the checker has any similar words in its dictionary the first one will be listed here. The user can accept the suggestion, type in his or her own correction, or choose a different suggestion from the next box.
tr: Eğer denetleyicinin sözlüğünde benzer sözcükler varsa ilki burada listelenecektir. Kullanıcı öneriyi kabul edebilir, kendi düzeltmesini yazabilir veya bir sonraki kutudan farklı bir öneri seçebilir.

source: Language:
tr: Dil:

source: If you have installed multiple dictionaries, here you can select which dictionary/language should be used.
tr: Birden fazla sözlük kurduysanız burada hangi sözlüğün/dilin kullanılması gerektiğini seçebilirsiniz.

source: On the right side of the dialog box are 6 buttons that allow the user to control the spellcheck process. They are:
tr: İletişim kutusunun sağ tarafında kullanıcının yazım denetimi işlemini denetlemesine olanak tanıyan 6 düğme bulunur. Bunlar:

source: Add to Dictionary
tr: Sözlüğe Ekle

source: Pressing this button adds the <guilabel>Unknown word </guilabel> to the checker's dictionary. This means that in the future the checker will always consider this word to be correctly spelled.
tr: Bu düğmeye basmak, <guilabel>Bilinmeyen sözcük</guilabel>’ü denetleyicinin sözlüğüne ekler. Bu, denetleyicinin ileride bu sözcüğü her zaman doğru olacağını varsayacağınız anlamına gelir.

source: Suggest
tr: Öner

source: The checker may list here a number of possible replacements for the word under consideration. Clicking on any one of the suggestions will cause that word to be entered in the <guilabel>Replace with</guilabel> box, above.
tr: Denetleyici, burada incelenmekte olan sözcüğün olası düzeltmelerini listeleyebilir. Önerilerden herhangi birine tıklamak, o sözcüğün yukarıdaki <guilabel>Şununla değiştir</guilabel> kutusuna girilmesine neden olacaktır.

source: Replace
tr: Değiştir

source: This button has the checker replace the word under consideration in the document with the word in the <guilabel>Replace with</guilabel> box.
tr: Bu düğme, denetleyicinin belgede incelenen sözcüğü <guilabel>Şununla değiştir</guilabel> kutusundaki sözcükle değiştirmesini sağlar.

source: Replace All
tr: Tümünü Değiştir

source: This button causes the checker to replace not only the current <guilabel>Unknown word:</guilabel> but to automatically make the same substitution for any other occurrences of this <guilabel>Unknown word</guilabel> in the document.
tr: Bu düğme, denetleyicinin yalnızca geçerli <guilabel>Bilinmeyen sözcük:</guilabel>’ü değil de <guilabel>Bilinmeyen sözcük</guilabel>’ün belgedeki tüm oluşlarının değiştirilmesini sağlar.

source: Ignore
tr: Yok Say

source: Activating this button will have the checker move on without making any changes.
tr: Bu düğmeyi etkinleştirmek, denetçinin herhangi bir değişiklik yapmadan sürdürmesini sağlar.

source: Ignore All
tr: Tümünü Yok Say

source: This button tells the checker to do nothing with the current <guilabel>Unknown word:</guilabel> and to pass over any other instances of the same word.
tr: Bu düğme denetleyiciye geçerli <guilabel>Bilinmeyen sözcük:</guilabel> ile hiçbir şey yapmamasını ve aynı sözcüğün diğer örneklerini atlamasını söyler.

source: This only applies to the current spellcheck run. If the checker is run again later it will stop on this same word.
tr: Bu yalnızca geçerli yazım denetimi çalıştırması için geçerlidir. Eğer denetleyici daha sonra yeniden çalıştırılırsa aynı sözcük üzerinde duracaktır.

source: Three more buttons are located horizontally along the bottom of the spellcheck dialog. They are:
tr: Yazım denetimi iletişim kutusunun alt kısmında yatay olarak üç düğme daha bulunur. Bunlar:

source: Help
tr: Yardım

source: This invokes the &kde; help system with the help page for this dialog.
tr: Bu, bu iletişim kutusunun yardım sayfasıyla birlikte &kde; yardım sistemini çağırır.

source: Finished
tr: Bitti

source: This button ends the spellcheck process, and returns to the document.
tr: Bu düğme, yazım denetim sürecini bitirerek belgeye geri döner.

source: Cancel
tr: İptal

source: This button cancels the spellcheck process, all modifications are reverted, and you will return to your document.
tr: Bu düğme, yazım denetim sürecini iptal eder, tüm değişiklikler geri alınır ve belgeye geri dönersiniz.

source: <guimenu>Tools</guimenu> <guisubmenu>Spelling</guisubmenu> <guimenuitem>Spelling (from cursor)...</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Yazım Denetimi</guisubmenu> <guimenuitem>Yazım Denetimi (İmleçten Sonra)…</guimenuitem>

source: This initiates the spellchecking program but it starts where your cursor is instead of at the beginning of the document.
tr: Bu, yazım denetimi programını belgenin başlangıcı yerine imlecinizin bulunduğu yerden başlatır.

source: <guimenu>Tools</guimenu> <guisubmenu>Spelling</guisubmenu> <guimenuitem>Spellcheck Selection...</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Yazım Denetimi</guisubmenu> <guimenuitem>Seçimin Yazımını Denetle…</guimenuitem>

source: Spellchecks the current selection.
tr: Geçerli seçimin yazımını denetler.

source: <guimenu>Tools</guimenu> <guisubmenu>Spelling</guisubmenu> <guimenuitem>Change Dictionary</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Yazım Denetimi</guisubmenu> <guimenuitem>Sözlüğü Değiştir</guimenuitem>

source: Displays a drop down box with all available dictionaries for spellchecking at the bottom of the editor window. This allows easy switching of the spellcheck dictionary &eg; for automatic spellcheck of text in different languages.
tr: Düzenleyici penceresinin alt kısmında yazım denetimi için kullanılabilir tüm sözlükleri içeren bir açılır kutu görüntüler. Bu, yazım denetimi sözlüğünün farklı dillerdeki metinlerin kendiliğinden yazımının denetimi için kolayca değiştirilmesine olanak tanır.

source: The Settings and Help Menu
tr: Ayarlar ve Yardım Menüsü

source: <guimenu>Settings</guimenu> <guisubmenu>Editor Color Theme</guisubmenu>
tr: <guimenu>Ayarlar</guimenu> <guisubmenu>Düzenleyici Renk Teması</guisubmenu>

source: This menu lists the available color schemes. You can change the schema for the current view here, to change the default schema you need to use the <ulink url="help:/katepart/config-dialog-editor.html#prefcolors">Fonts &amp; Colors</ulink> page of the config dialog.
tr: Bu menü, kullanılabilir renk şemalarını listeler. Geçerli görünümün şemasını buradan değiştirebilirsiniz; öntanımlı şemayı değiştirmek için yapılandırma iletişim kutusunun <ulink url="help:/katepart/config-dialog-editor.html#prefcolors">Yazıtipleri ve Renkler</ulink> sayfasını kullanmanız gerekmektedir.

source: &katepart; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/menus.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/menus.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
tr: &katepart;, ortak &kde; <guimenu>Ayarlar</guimenu> ve <guimenu>Yardım</guimenu> menü ögelerine sahiptir; daha fazla bilgi için &kde; Temelleri’nin <ulink url="help:/fundamentals/menus.html#menus-settings">Ayarlar Menüsü</ulink> ve <ulink url="help:/fundamentals/menus.html#menus-help">Yardım Menüsü</ulink> bölümlerini okuyun.
