Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_development.po
Languages: tr

source: Returns the selected text. If no text is selected, the returned string is empty.
tr: Seçilen metni döndürür. Hiçbir metin seçilmezse döndürülen dizi boştur.

source: Returns <literal>true</literal>, if the view has selected text, otherwise <literal>false</literal>.
tr: Görünümde seçili metin varsa <literal>true</literal> değerini, aksi takdirde <literal>false</literal> değerini döndürür.

source: Returns the selected text range. The returned range is invalid if there is no selected text.
tr: Seçili metin erimini döndürür. Seçili metin yoksa döndürülen erim geçersizdir.

source: void view.setSelection(<parameter>Range <replaceable>range</replaceable></parameter>);
tr: void view.setSelection(<parameter>Range <replaceable>erim</replaceable></parameter>);

source: Set the selected text to the given range.
tr: Seçili metni verilen erime ayarla.

source: Remove the selected text. If the view does not have any selected text, this does nothing.
tr: Seçili metni kaldır. Görünümde seçili metin yoksa bu hiçbir şey yapmaz.

source: Selects the entire text in the document.
tr: Belgedeki tüm metni seçer.

source: Clears the text selection without removing the text.
tr: Metni kaldırmadan metin seçimini temizler.

source: Set block selection mode on or off.
tr: Blok seçim kipini açar/kapatır.

source: Returns <literal>true</literal>, if block selection mode is on, otherwise <literal>false</literal>.
tr: Blok seçim kipi açıksa <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: void view.align(<parameter>Range <replaceable>range</replaceable></parameter>);
tr: void view.align(<parameter>Range <replaceable>erim</replaceable></parameter>);

source: Properly re-indent lines within <replaceable>range</replaceable> according to current indentation settings.
tr: Geçerli girintileme ayarlarına göre <replaceable>erim</replaceable>’i düzgünce yeniden girintile.

source: void view.alignOn(<parameter>Range <replaceable>range</replaceable></parameter>, <parameter>String <replaceable>pattern</replaceable> = &quot;&quot;</parameter>);
tr: void view.alignOn(<parameter>Range <replaceable>erim</replaceable></parameter>, <parameter>String <replaceable>dizgi</replaceable> = &quot;&quot;</parameter>);

source: Aligns lines in <replaceable>range</replaceable> on the column given by the regular expression <replaceable>pattern</replaceable>. With an empty <replaceable>pattern</replaceable> it will align on the first non-blank character by default. If the pattern has a capture it will indent on the captured match.
tr: Düzenli ifade <replaceable>dizgi</replaceable> verdiği sütundaki <replaceable>erim</replaceable>’deki satırları hizalar. Boş bir <replaceable>dizgi</replaceable> ile öntanımlı olarak ilk boş olmayan karaktere hizalanır. Dizginin bir yakalaması varsa yakalanan eşleşmeye girintili olacaktır.

source: Examples:
tr: Örnekler:

source: <literal>view.alignOn(document.documentRange(), '-');</literal> will insert spaces before the first <literal>-</literal> of each lines to align them all on the same column.
tr: <literal>view.alignOn(document.documentRange(), '-');</literal>, tümünü aynı sütunda hizalamak için her satırın ilk <literal>-</literal> satırından önce boşluk ekler.

source: <literal>view.alignOn(document.documentRange(), ':\\s+(.)');</literal> will insert spaces before the first non-blank character that occurs after a colon to align them all on the same column.
tr: <literal>view.alignOn(document.documentRange(), ':\\s+(.)');</literal>, tümünü aynı sütunda hizalamak için iki nokta üst üsteden sonra oluşan ilk boş olmayan karakterden önce boşluk ekler.

source: object view.executeCommand(<parameter>String <replaceable>command</replaceable></parameter>, <parameter>String <replaceable>args</replaceable></parameter>, <parameter>Range <replaceable>range</replaceable></parameter>);
tr: object view.executeCommand(<parameter>String <replaceable>komut</replaceable></parameter>, <parameter>String <replaceable>argümanlar</replaceable></parameter>, <parameter>Range <replaceable>erim</replaceable></parameter>);

source: Executes the <link linkend="advanced-editing-tools-commandline">command line command</link> <replaceable>command</replaceable> with the optional arguments <replaceable>args</replaceable> and the optional <replaceable>range</replaceable>. The returned <replaceable>object</replaceable> has a boolean property <replaceable>object.ok</replaceable> that indicates whether execution of the <replaceable>command</replaceable> was successful. In case of an error, the string <replaceable>object.status</replaceable> contains an error message.
tr: <replaceable>komut</replaceable> <link linkend="advanced-editing-tools-commandline">komut satırı komutunu</link> isteğe bağlı <replaceable>argümanlar</replaceable> ve <replaceable>erim</replaceable> ile yürütür. Döndürülen <replaceable>nesne</replaceable>’nin <replaceable>komut</replaceable> yürütmesinin başarılı olup olmadığını söyleyen bir <replaceable>object.ok</replaceable> Boole değeri vardır. Bir hata durumunda, <replaceable>object.status</replaceable> bir hata iletisi içerir.

source: Since: &kde-frameworks; 5.50
tr: Eklendiği sürüm: &kde-frameworks; 5.50

source: Range view.searchText(<parameter>Range <replaceable>range</replaceable></parameter>, <parameter>String <replaceable>pattern</replaceable></parameter>, <parameter>bool <replaceable>backwards</replaceable> = false</parameter>);
tr: Range view.searchText(<parameter>Range <replaceable>erim</replaceable></parameter>, <parameter>String <replaceable>dizgi</replaceable></parameter>, <parameter>bool <replaceable>backwards</replaceable> = false</parameter>);

source: Search for the first occurrence of <replaceable>pattern</replaceable> in <replaceable>range</replaceable> and returns the matched range. Search is performed backwards if the optional boolean parameter <replaceable>backwards</replaceable> is set to <literal>true</literal>.
tr: <replaceable>erim</replaceable>’de <replaceable>dizgi</replaceable>’nin ilk oluşunu ara ve eşleşen erimi döndür. İsteğe bağlı Boole değeri <replaceable>backwards</replaceable> <literal>true</literal> olarak ayarlanırsa arama geriye doğru yapılır.

source: The returned range is invalid (see Range.isValid()) if <replaceable>pattern</replaceable> is not found in <replaceable>range</replaceable>.
tr: <replaceable>dizgi</replaceable>, <replaceable>erim</replaceable>’de bulunamazsa döndürülen erim geçersizdir (bkz. Range.isValid()).

source: Since: &kde-frameworks; 5.97
tr: Eklendiği sürüm: &kde-frameworks; 5.97

source: The Document API
tr: Belge API’si

source: Whenever a script is being executed, there is a global variable <quote><literal>document</literal></quote> representing the current active document. The following is a list of all available Document functions.
tr: Ne zaman bir betik yürütülürse geçerli etkin belgeyi temsil eden bir <quote><literal>document</literal></quote> global değişkeni vardır. Tüm kullanılabilir Document işlevlerinin bir listesini aşağıda bulabilirsiniz.

source: Returns the document's filename or an empty string for unsaved text buffers.
tr: Kaydedilmemiş metin arabellekleri için belgenin dosya adını veya boş bir diziyi döndürür.

source: Returns the document's full &URL; or an empty string for unsaved text buffers.
tr: Belgenin tam URL’sini veya kaydedilmemiş metin arabellekleri için boş bir diziyi döndürür.

source: Returns the document's &MIME; type or the &MIME; type <literal>application/octet-stream</literal> if no appropriate &MIME; type could be found.
tr: Belgenin &MIME; türünü veya uygun &MIME; türü bulunamazsa <literal>application/octet-stream</literal> &MIME; türünü döndürür.

source: Returns the currently used encoding to save the file.
tr: Dosyayı kaydetmek için kullanılan geçerli kodlamayı döndürür.

source: Returns the global highlighting mode used for the whole document.
tr: Tüm belge için kullanılan global vurgulama kipini döndürür.

source: String document.highlightingModeAt(<parameter>Cursor <replaceable>pos</replaceable></parameter>);
tr: String document.highlightingModeAt(<parameter>Cursor <replaceable>konum</replaceable></parameter>);

source: Returns the highlighting mode used at the given position in the document.
tr: Belgedeki belirli konumda kullanılan vurgulama kipini döndürür.

source: Returns an array of highlighting modes embedded in this document.
tr: Bu belgeye gömülü bir dizi vurgulama modunu döndürür.

source: Returns <literal>true</literal>, if the document has unsaved changes (modified), otherwise <literal>false</literal>.
tr: Belgede kaydedilmemiş değişiklikler varsa <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: Returns the entire content of the document in a single text string. Newlines are marked with the newline character <quote><literal>\n</literal></quote>.
tr: Belgenin tüm içeriğini tek bir metin dizisinde döndürür. Yeni satırlar, <quote><literal>\n</literal></quote> yenisatır karakteriyle işaretlenir.

source: String document.text(<parameter>int <replaceable>fromLine</replaceable></parameter>, <parameter>int <replaceable>fromColumn</replaceable></parameter>, <parameter>int <replaceable>toLine</replaceable></parameter>, <parameter>int <replaceable>toColumn</replaceable></parameter>); String document.text(<parameter>Cursor <replaceable>from</replaceable></parameter>, <parameter>Cursor <replaceable>to</replaceable></parameter>); String document.text(<parameter>Range <replaceable>range</replaceable></parameter>);
tr: String document.text(<parameter>int <replaceable>satırdan</replaceable></parameter>, <parameter>int <replaceable>sütundan</replaceable></parameter>, <parameter>int <replaceable>satıra</replaceable></parameter>, <parameter>int <replaceable>sütuna</replaceable></parameter>); String document.text(<parameter>Cursor <replaceable>şuradan</replaceable></parameter>, <parameter>Cursor <replaceable>şuraya</replaceable></parameter>); String document.text(<parameter>Range <replaceable>erim</replaceable></parameter>);

source: Returns the text in the given range. It is recommended to use the cursor and range based version for better readability of the source code.
tr: Verilen erimdeki metni döndürür. Kaynak kodunun daha iyi okunabilmesi için imleç ve aralık tabanlı sürümün kullanılması önerilir.

source: String document.line(<parameter>int <replaceable>line</replaceable></parameter>);
tr: String document.line(<parameter>int <replaceable>satır</replaceable></parameter>);

source: Returns the given text line as string. The string is empty if the requested line is out of range.
tr: Verilen metin satırını dizi olarak döndürür. İstenen satır erim dışıysa dizi boştur.

source: String document.wordAt(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); String document.wordAt(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: String document.wordAt(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); String document.wordAt(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Returns the word at the given cursor position.
tr: Verilen imleç konumundaki sözcüğü döndürür.

source: Range document.wordRangeAt(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); Range document.wordRangeAt(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: Range document.wordRangeAt(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); Range document.wordRangeAt(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Return the range of the word at the given cursor position. The returned range is invalid (see Range.isValid()), if the text position is after the end of a line. If there is no word at the given cursor, an empty range is returned.
tr: Verilen imleç konumundaki sözcüğün erimini döndürür. Metin konumu bir satırın sonundan sonraysa döndürülen erim geçersizdir (bkz. Range.isValid()). Verilen imleçte sözcük yoksa boş bir erim döndürülür.

source: String document.charAt(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); String document.charAt(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: String document.charAt(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); String document.charAt(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Returns the character at the given cursor position.
tr: Verilen imleç konumundaki karakteri döndürür.

source: String document.firstChar(<parameter>int <replaceable>line</replaceable></parameter>);
tr: String document.firstChar(<parameter>int <replaceable>satır</replaceable></parameter>);

source: Returns the first character in the given <replaceable>line</replaceable> that is not a whitespace. The first character is at column 0. If the line is empty or only contains whitespace characters, the returned string is empty.
tr: Verilen <replaceable>satırdaki</replaceable> boşluk olmayan ilk karakteri döndürür. İlk karakter 0 sütunundadır. Satır boşsa veya yalnızca boşluk karakterleri içeriyorsa döndürülen dizi boştur.

source: String document.lastChar(<parameter>int <replaceable>line</replaceable></parameter>);
tr: String document.lastChar(<parameter>int <replaceable>satır</replaceable></parameter>);

source: Returns the last character in the given <replaceable>line</replaceable> that is not a whitespace. If the line is empty or only contains whitespace characters, the returned string is empty.
tr: Verilen <replaceable>satırdaki</replaceable> boşluk olmayan son karakteri döndürür. Satır boşsa veya yalnızca boşluk karakterleri içeriyorsa döndürülen dizi boştur.

source: bool document.isSpace(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); bool document.isSpace(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: bool document.isSpace(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); bool document.isSpace(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Returns <literal>true</literal>, if the character at the given cursor position is a whitespace, otherwise <literal>false</literal>.
tr: Verilen imleç konumundaki karakter boşluksa <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: bool document.matchesAt(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>, <parameter>String <replaceable>text</replaceable></parameter>); bool document.matchesAt(<parameter>Cursor <replaceable>cursor</replaceable></parameter>, <parameter>String <replaceable>text</replaceable></parameter>);
tr: bool document.matchesAt(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>, <parameter>String <replaceable>metin</replaceable></parameter>); bool document.matchesAt(<parameter>Cursor <replaceable>imleç</replaceable></parameter>, <parameter>String <replaceable>metin</replaceable></parameter>);

source: Returns <literal>true</literal>, if the given <replaceable>text</replaceable> matches at the corresponding cursor position, otherwise <literal>false</literal>.
tr: Verilen <replaceable>metin</replaceable> ilgili imleç konumunda eşleşiyorsa <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: bool document.startsWith(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>String <replaceable>text</replaceable></parameter>, <parameter>bool <replaceable>skipWhiteSpaces</replaceable></parameter>);
tr: bool document.startsWith(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>String <replaceable>metin</replaceable></parameter>, <parameter>bool <replaceable>skipWhiteSpaces</replaceable></parameter>);

source: Returns <literal>true</literal>, if the line starts with <replaceable>text</replaceable>, otherwise <literal>false</literal>. The argument <replaceable>skipWhiteSpaces</replaceable> controls whether leading whitespaces are ignored.
tr: Satır <replaceable>metin</replaceable> ile başlıyorsa <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür. <replaceable>skipWhiteSpaces</replaceable> argümanı, baştaki boşlukların yok sayılıp sayılmayacağını denetler.

source: bool document.endsWith(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>String <replaceable>text</replaceable></parameter>, <parameter>bool <replaceable>skipWhiteSpaces</replaceable></parameter>);
tr: bool document.endsWith(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>String <replaceable>metin</replaceable></parameter>, <parameter>bool <replaceable>skipWhiteSpaces</replaceable></parameter>);

source: Returns <literal>true</literal>, if the line ends with <replaceable>text</replaceable>, otherwise <literal>false</literal>. The argument <replaceable>skipWhiteSpaces</replaceable> controls whether trailing whitespaces are ignored.
tr: Satır <replaceable>metin</replaceable> ile bitiyorsa <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür. <replaceable>skipWhiteSpaces</replaceable> argümanı, sondaki boşlukların yok sayılıp sayılmayacağını denetler.

source: bool document.setText(<parameter>String <replaceable>text</replaceable></parameter>);
tr: bool document.setText(<parameter>String <replaceable>metin</replaceable></parameter>);

source: Sets the entire document text.
tr: Tüm belge metnini ayarlar.

source: Removes the entire text in the document.
tr: Belgedeki tüm metni kaldırır.

source: bool document.truncate(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); bool document.truncate(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: bool document.truncate(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); bool document.truncate(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Truncate the given line at the given column or cursor position. Returns <literal>true</literal> on success, or <literal>false</literal> if the given line is not part of the document range.
tr: Verilen satırı verilen sütun veya imleç konumunda keser. Başarı durumunda <literal>true</literal>, verilen satır belge aralığının parçası değilse <literal>false</literal> döndürür.

source: bool document.insertText(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>, <parameter>String <replaceable>text</replaceable></parameter>); bool document.insertText(<parameter>Cursor <replaceable>cursor</replaceable></parameter>, <parameter>String <replaceable>text</replaceable></parameter>);
tr: bool document.insertText(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>, <parameter>String <replaceable>metin</replaceable></parameter>); bool document.insertText(<parameter>Cursor <replaceable>imleç</replaceable></parameter>, <parameter>String <replaceable>metin</replaceable></parameter>);

source: Inserts the <replaceable>text</replaceable> at the given cursor position. Returns <literal>true</literal> on success, or <literal>false</literal>, if the document is in read-only mode.
tr: Verilen imleç konumunda <replaceable>metin</replaceable> metnini ekler. Başarı durumunda <literal>true</literal>, belge saltokunur kipteyse <literal>false</literal> döndürür.

source: bool document.removeText(<parameter>int <replaceable>fromLine</replaceable></parameter>, <parameter>int <replaceable>fromColumn</replaceable></parameter>, <parameter>int <replaceable>toLine</replaceable></parameter>, <parameter>int <replaceable>toColumn</replaceable></parameter>); bool document.removeText(<parameter>Cursor <replaceable>from</replaceable></parameter>, <parameter>Cursor <replaceable>to</replaceable></parameter>); bool document.removeText(<parameter>Range <replaceable>range</replaceable></parameter>);
tr: bool document.removeText(<parameter>int <replaceable>satırdan</replaceable></parameter>, <parameter>int <replaceable>sütundan</replaceable></parameter>, <parameter>int <replaceable>satıra</replaceable></parameter>, <parameter>int <replaceable>sütuna</replaceable></parameter>); bool document.removeText(<parameter>Cursor <replaceable>şuradan</replaceable></parameter>, <parameter>Cursor <replaceable>şuraya</replaceable></parameter>); bool document.removeText(<parameter>Range <replaceable>erim</replaceable></parameter>);

source: Removes the text in the given range. Returns <literal>true</literal> on success, or <literal>false</literal>, if the document is in read-only mode.
tr: Verilen erimdeki metni kaldırır. Başarı durumunda <literal>true</literal>, belge saltokunur kipteyse <literal>false</literal> döndürür.

source: bool document.insertLine(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>String <replaceable>text</replaceable></parameter>);
tr: bool document.insertLine(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>String <replaceable>metin</replaceable></parameter>);

source: Inserts text in the given line. Returns <literal>true</literal> on success, or <literal>false</literal>, if the document is in read-only mode or the line is not in the document range.
tr: Verilen satırda metin ekler. Başarı durumunda <literal>true</literal>, belge saltokunur kipteyse veya satır belge eriminde değilse <literal>false</literal> döndürür.

source: bool document.removeLine(<parameter>int <replaceable>line</replaceable></parameter>);
tr: bool document.removeLine(<parameter>int <replaceable>satır</replaceable></parameter>);

source: Removes the given text line. Returns <literal>true</literal> on success, or <literal>false</literal>, if the document is in read-only mode or the line is not in the document range.
tr: Verilen metin satırını kaldırır. Başarı durumunda <literal>true</literal>, belge saltokunur kipteyse veya satır belge eriminde değilse <literal>false</literal> döndürür.

source: bool document.wrapLine(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); bool document.wrapLine(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: bool document.wrapLine(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); bool document.wrapLine(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Wraps the line at the given cursor position. Returns <literal>true</literal> on success, otherwise <literal>false</literal>, &eg; if line &lt; 0.
tr: Verilen imleç konumunda satırı kaydırır. Başarı durumunda <literal>true</literal>, aksi takdirde; örneğin, satır &lt; 0 ise <literal>false</literal> döndürür.

source: void document.joinLines(<parameter>int <replaceable>startLine</replaceable></parameter>, <parameter>int <replaceable>endLine</replaceable></parameter>);
tr: void document.joinLines(<parameter>int <replaceable>başlangıçSatırı</replaceable></parameter>, <parameter>int <replaceable>bitişSatırı</replaceable></parameter>);
