Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_plugins.po
Languages: tr

source: <menuchoice><guimenu>Tools</guimenu><guimenuitem>Keyboard Macros</guimenuitem><guimenuitem>Play Named Macro...</guimenuitem></menuchoice>.
tr: <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Klavye Makroları</guimenuitem><guimenuitem>Adlı Makroyu Oynat…</guimenuitem></menuchoice>.

source: The plugin lists saved macros as items in this submenu, activating an item will play the corresponding macro without loading it.
tr: Eklenti, kaydedilen makroları bu alt menüdeki ögeler olarak listeler; bir ögenin etkinleştirilmesi, ilgili makroyu yüklemeden oynatır.

source: Note that each saved macros is an action that is part of the current action collection so that a custom shortcut can be assigned to it through the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Keyboard Shortcuts...</guimenuitem></menuchoice> interface.
tr: Kaydedilen her makronun, geçerli eylem koleksiyonunun parçası olan bir eylem olduğunu unutmayın; böylece onlara <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Klavye Kısayollarını Yapılandır…</guimenuitem></menuchoice> arayüzü aracılığıyla özel bir kısayol atanabilir.

source: The <userinput>kmplay <replaceable>name</replaceable></userinput> command will play the macro saved under the name <userinput><replaceable>name</replaceable></userinput> without loading it.
tr: <userinput>kmplay <replaceable>ad</replaceable></userinput> komutu, <userinput><replaceable>ad</replaceable></userinput> altında kayıtlı makroyu onu yüklemeden oynatır.

source: To wipe (i.e., delete) a saved macro:
tr: Bir makroyu silmek için:

source: <menuchoice><guimenu>Tools</guimenu><guimenuitem>Keyboard Macros</guimenuitem><guimenuitem>Wipe Named Macro...</guimenuitem></menuchoice>.
tr: <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Klavye Makroları</guimenuitem><guimenuitem>Adlı Makroyu Sil…</guimenuitem></menuchoice>.

source: The plugin lists saved macros as items in this submenu, activating an item will wipe (i.e., delete) the corresponding macro.
tr: Eklenti, kaydedilen makroları bu alt menüdeki ögeler olarak listeler; bir ögenin etkinleştirilmesi, ilgili makronun silinmesine neden olur.

source: The <userinput>kmwipe <replaceable>name</replaceable></userinput> command will wipe the macro saved under the name <userinput><replaceable>name</replaceable></userinput>.
tr: <userinput>kmwipe <replaceable>ad</replaceable></userinput> komutu, <userinput><replaceable>ad</replaceable></userinput> altında kayıtlı makroyu siler.

source: Tips for commands:
tr: Komut ipuçları:

source: Note that after the <userinput>km</userinput> prefix, all these commands use a different letter so you can efficiently call them using tab-completion!
tr: <userinput>km</userinput> önekinden sonra tüm komutlar farklı bir harfle başlar, böylece onları anında sekme tamamlamayı kullanarak çağırabilirsiniz.

source: Limitations
tr: Sınırlamalar

source: As of now, keyboard macros fail to play properly if some types of GUI widgets are used: QMenu, QuickOpenLineEdit, or TabSwitcherTreeView, for example. I'm not sure why but my first guess would be that these widgets work in a non-standard way regarding keyboard events.
tr: Şu an itibariyle, bazı grafik arayüz araç takımları türleri kullanıldığında klavye makroları düzgün şekilde oynatılamıyor: örneğin QMenu, QuickOpenLineEdit veya TabSwitcherTreeView. Neden olduğundan emin değilim; ancak ilk tahminim bu araç takımlarının klavye olayları açısından standart olmayan bir şekilde çalıştığı yönünde.

source: SQL Plugin
tr: SQL Eklentisi

source: The Structured Query Language (SQL) is a specialized language for updating, deleting, and requesting information from databases.
tr: Yapılandırılmış Sorgu Dili (SQL), veritabanlarından bilgi güncellemek, silmek ve talep etmek için özel bir dildir.

source: The &kate; SQL Plugin allows you to:
tr: &kate; SQL Eklentisi şunlara olanak tanır:

source: Create a database
tr: Bir veritabanı oluşturmak

source: Connect to existing databases
tr: Var olan veritabanlarına bağlanmak

source: Insert and delete data in the database
tr: Veritabanına bilgi eklemek ve silmek

source: Execute queries
tr: Sorgu çalıştırmak

source: Display results in a table
tr: Sonuçları bir tabloda göstermek

source: Connecting to a Database
tr: Bir veritabanına bağlanmak

source: Select <guibutton>Add Connection</guibutton> from the <guimenu>SQL</guimenu> menu or toolbar, and then select the &Qt; database driver you want to use (including QSQLITE, QMYSQL3, QMYSQL, QODBC3, QODBC, QPSQL7, and QPSQL). If you can't see the desired driver, you need to install it. Then, press <guibutton>Next</guibutton>.
tr: <guimenu>SQL</guimenu> menüsü veya araç çubuğundan <guibutton>Bağlantı Ekle</guibutton>’yi ve sonrasında kullanmak istediğiniz &Qt; veritabanı sürücüsünü seçin (QSQLITE, QMYSQL3, QMYSQL, QODBC3, QODBC, QPSQL7, and QPSQL içerilir). İstediğiniz sürücüyü göremiyorsanız onu kurmanız gerekir. Sonrasında <guibutton>Sonraki</guibutton> düğmesine basın.

source: If the database you selected uses a file, simply indicate the database's location and press the <guibutton>Next</guibutton> button. If it requires connecting to a server, you must enter the hostname of the server, your username and password, and any other information that particular driver may require. Then press <guibutton>Next</guibutton>.
tr: Seçtiğiniz veritabanı bir dosya kullanıyorsa veritabanının konumunu belirtmeniz ve <guibutton>Sonraki</guibutton> düğmesine basmanız yeterlidir. Bir sunucuya bağlanmayı gerektiriyorsa sunucunun makine adını, kullanıcı adınızı ve parolanızı ve belirli bir sürücünün gerektirebileceği diğer bilgileri girmeniz gerekir. Daha sonra <guibutton>Sonraki</guibutton>’ye basın.

source: Finally, give a name to your connection, and press <guibutton>Finish</guibutton>.
tr: Son olarak bağlantınıza bir ad verin ve <guibutton>Bitir</guibutton>’e basın.

source: Running Queries
tr: Sorgular Çalıştırmak

source: You can insert, delete, and update data using the SQL plugin just as you would from the command line or from within a program. Simply enter a query and press the <guibutton>Run query</guibutton> button in the toolbar or use <menuchoice><guimenu>SQL</guimenu><guimenuitem>Run query</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo>).
tr: Tıpkı komut satırından veya bir programın içinden yaptığınız gibi, SQL eklentisini kullanarak verileri ekleyebilir, silebilir ve güncelleyebilirsiniz. Yalnızca bir sorgu girin ve araç çubuğundaki <guibutton>Sorgu Çalıştır</guibutton> düğmesine basın veya <menuchoice><guimenu>SQL</guimenu><guimenuitem>Sorgu Çalıştır</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo>) menüsünü kullanın.

source: Some Example Queries
tr: Bazı Örnek Sorgular

source: INSERT INTO <replaceable>table_name</replaceable> ("<replaceable>feature1</replaceable>", "<replaceable>feature2</replaceable>", "<replaceable>feature3</replaceable>", "<replaceable>feature4</replaceable>", "<replaceable>feature5</replaceable>") VALUES ("<replaceable>value1</replaceable>", "<replaceable>value2</replaceable>", "<replaceable>value3</replaceable>", "<replaceable>value4</replaceable>", "<replaceable>value5</replaceable>" )
tr: INSERT INTO <replaceable>tablo_adı</replaceable> ("<replaceable>özellik1</replaceable>", "<replaceable>özellik2</replaceable>", "<replaceable>özellik3</replaceable>", "<replaceable>özellik4</replaceable>", "<replaceable>özellik5</replaceable>") VALUES ("<replaceable>değer1</replaceable>", "<replaceable>değer2</replaceable>", "<replaceable>değer3</replaceable>", "<replaceable>değer4</replaceable>", "<replaceable>değer5</replaceable>" )

source: DELETE FROM <replaceable>table_name</replaceable> WHERE name = "<replaceable>text</replaceable>"
tr: DELETE FROM <replaceable>table_adı</replaceable> WHERE name = "<replaceable>metin</replaceable>"

source: UPDATE <replaceable>table_name</replaceable> SET "<replaceable>feature1</replaceable>" = "<replaceable>text</replaceable>", "<replaceable>feature2</replaceable>" = "<replaceable>text</replaceable>", "<replaceable>feature3</replaceable>" = "<replaceable>text</replaceable>", "<replaceable>feature4</replaceable>" = "<replaceable>text</replaceable>", "<replaceable>feature5</replaceable>" = "<replaceable>text</replaceable>"
tr: UPDATE <replaceable>tablo_adı</replaceable> SET "<replaceable>özellik1</replaceable>" = "<replaceable>metin</replaceable>", "<replaceable>özellik2</replaceable>" = "<replaceable>metin</replaceable>", "<replaceable>özellik3</replaceable>" = "<replaceable>metin</replaceable>", "<replaceable>özellik4</replaceable>" = "<replaceable>metin</replaceable>", "<replaceable>özellik5</replaceable>" = "<replaceable>metin</replaceable>"

source: After running a <command>SELECT</command> query, you can view the results as a table that will appear in the <guilabel>SQL Data Output</guilabel> tool view at the bottom of &kate;, or as text in the <guilabel>SQL Text Output</guilabel>. If there is an error, you can see it in the text output.
tr: Bir <command>SELECT</command> sorgusu çalıştırdıktan sonra, sonuçları &kate;’in altındaki <guilabel>SQL Veri Çıktısı</guilabel> araç görünümünde belirecek bir tabloda veya <guilabel>SQL Metin Çıktısı</guilabel>’nda metin olarak görebilirsiniz. Bir hata varsa metin çıktısında bulunur.

source: Example <command>SELECT</command> Query
tr: Örnek <command>SELECT</command> Sorgusu

source: SELECT * FROM <replaceable>table_name</replaceable>
tr: SELECT * FROM <replaceable>tablo_adı</replaceable>

source: In the <guilabel>SQL Data Output</guilabel> tool view, there are several buttons:
tr: <guilabel>SQL Veri Çıktısı</guilabel> araç görünümünde çeşitli düğmeler vardır:

source: Resize columns to contents
tr: Sütunları içeriğe göre yeniden boyutlandır

source: Changes the size of columns to fit their contents.
tr: Sütunların boyutunu içeriklerine uyacak şekilde değiştirir.

source: Resize rows to contents
tr: Satırları içeriğe göre yeniden boyutlandır

source: Changes the size of rows to fit their contents.
tr: Satırların boyutunu içeriklerine uyacak şekilde değiştirir.

source: Copy
tr: Kopyala

source: Selects all of the table contents and copies it to the clipboard buffer.
tr: Tüm tablo içeriğini seçer ve pano arabelleğine kopyalar.

source: Export
tr: Dışa Aktar

source: Exports all of the table contents to a file, the clipboard, or the current document in the Comma Separated Values format.
tr: Tablo içeriğinin tümünü bir dosyaya, panoya veya geçerli belgeye Virgülle Ayrılmış Değerler biçiminde dışa aktarır.

source: Clear
tr: Temizle

source: Removes everything from the table view.
tr: Tablo görünümünden her şeyi kaldırır.

source: You can now change the colors displayed in the table in the <guilabel>SQL</guilabel> section of <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kate;...</guimenuitem> </menuchoice>.
tr: Artık tabloda görüntülenen renkleri <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>&kate; Uygulamasını Yapılandır…</guimenuitem> </menuchoice> iletişim kutusunun <guilabel>SQL</guilabel> bölümünden yapılandırabilirsiniz.

source: Browsing
tr: Tarama

source: You can browse your database using the <guilabel>Database schema</guilabel> browser tool view on the left. The information displayed varies depending on which database driver you are using.
tr: Soldaki <guilabel>Veritabanı şeması</guilabel> tarayıcı aracı görünümünü kullanarak veritabanınıza göz atabilirsiniz. Görüntülenen bilgiler, kullandığınız veritabanı sürücüsüne bağlı olarak değişir.

source: To refresh this list, right-click anywhere in the tool view and select <guimenuitem>Refresh</guimenuitem>. To generate a query on any entry in the list, right-click on an entry, select <guisubmenu>Generate</guisubmenu>, and select the query type (<guimenuitem>SELECT</guimenuitem>, <guimenuitem>UPDATE</guimenuitem>, <guimenuitem>INSERT</guimenuitem>, or <guimenuitem>DELETE</guimenuitem>) from the submenu that appears.
tr: Bu listeyi yenilemek için araç çubuğundaki herhangi bir yere sağ tıklayın ve <guimenuitem>Yenile</guimenuitem>’yi seçin. Listedeki bir öge için bir sorgu oluşturmak için bir ögeye sağ tıklayın, <guisubmenu>Oluştur</guisubmenu>’u seçin ve beliren alt menüden sorgu tipi (<guimenuitem>SELECT</guimenuitem>, <guimenuitem>UPDATE</guimenuitem>, <guimenuitem>INSERT</guimenuitem> veya <guimenuitem>DELETE</guimenuitem>) seçeneklerinden birini seçin.

source: <guimenu>SQL</guimenu><guimenuitem>Add connection...</guimenuitem>
tr: <guimenu>SQL</guimenu><guimenuitem>Bağlantı Ekle…</guimenuitem>

source: Adds a new connection using any database driver.
tr: Herhangi bir veritabanı sürücüsünü kullanarak yeni bir bağlantı ekler.

source: <guimenu>SQL</guimenu><guimenuitem>Remove connection</guimenuitem>
tr: <guimenu>SQL</guimenu><guimenuitem>Bağlantıyı Kaldır</guimenuitem>

source: Removes the selected connection.
tr: Seçili bağlantıyı kaldırır.

source: <guimenu>SQL</guimenu><guimenuitem>Edit connection...</guimenuitem>
tr: <guimenu>SQL</guimenu><guimenuitem>Bağlantıyı Düzenle…</guimenuitem>

source: Edits the current connection's settings.
tr: Geçerli bağlantının ayarlarını düzenler.

source: Connections
tr: Bağlantılar

source: All database connections you have created are listed between the <guimenuitem>Edit connection</guimenuitem> and <guimenuitem>Run query</guimenuitem> menu items. Select one to run queries or make modifications to it.
tr: Oluşturduğunuz tüm veritabanı bağlantıları <guimenuitem>Bağlantıyı Düzenle</guimenuitem> ve <guimenuitem>Sorgu Çalıştır</guimenuitem> menü ögeleri arasında listelenir. Sorguları çalıştırmak veya üzerinde değişiklik yapmak için birini seçin.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo></shortcut> <guimenu>SQL</guimenu><guimenuitem>Run query</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo></shortcut> <guimenu>SQL</guimenu><guimenuitem>Sorgu Çalıştır</guimenuitem>

source: Runs your query.
tr: Sorgunuzu çalıştırır.

source: The SQL Plugin was written by Marco Mentasti.
tr: SQL eklentisi, Marco Mentasti tarafından yazıldı.

source: Special thanks to Google Code-In 2011 participant Ömer Faruk ORUÇ for writing much of this section.
tr: Bu bölümün çoğunu yazan Google Code-In 2011 katılımcısı Ömer Faruk ORUÇ’a özellikle teşekkürler.

source: Symbol Viewer Plugin
tr: Sembol Görüntüleyicisi Eklentisi

source: It allows developers to view symbols (functions, macros and structures) from source code.
tr: Geliştiricilerin kaynak koddaki sembolleri (işlevler, makrolar ve yapılar) görüntülemesine olanak tanır.

source: By clicking the parsed information you can easily browse the code.
tr: Ayrıştırılan bilgilere tıklayarak koda kolayca göz atabilirsiniz.

source: At the moment the following languages are supported:
tr: Şu anda aşağıdaki diller desteklenmektedir:

source: Feature list:
tr: Özellik listesi:

source: List/Tree mode
tr: Liste/Ağaç kipi

source: Enable/disable sorting
tr: Sıralamayı etkinleştir/devre dışı bırak

source: Hide/Show Functions Parameters
tr: İşlev parametrelerini göster/gizle

source: Expand/collapse tree mode
tr: Ağaç kipini genişlet/daralt

source: Auto-update on document change
tr: Belge değişikliklerinde kendiliğinden güncelle

source: Code parsing is based on the Syntax-Highlighting framework from &kde-frameworks;
tr: Kod ayrıştırma, &kde-frameworks; içindeki sözdizim vurgulama çatısı temellidir

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>\</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guisubmenu>Tool Views</guisubmenu> <guimenuitem>Show Symbol List</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>\</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guisubmenu>Araç Görünümleri</guisubmenu> <guimenuitem>Sembol Listesi</guimenuitem>

source: Toggle the display of &kate;'s Symbol List displaying Functions, Macros and Structures of the source code in the active document.
tr: Etkin belgedeki kaynak kodu işlevlerini, makrolarını ve yapılarını görüntüleyen &kate;’in sembol listesi görüntülenmesini açın/kapatın.

source: Symbol Viewer
tr: Sembol Görüntüleyicisi

source: Choose the default parser options
tr: Öntanımlı ayrıştırıcı seçeneklerini seç

source: Terminal Tool View Plugin
tr: Uçbirim Araç Görünümü Eklentisi

source: Terminal emulator
tr: Uçbirim öykünücüsü

source: The built in Terminal Emulator is a copy of the &kde; &konsole; terminal application, for your convenience. It is available from the <menuchoice><guimenu>View</guimenu><guisubmenu>Tool Views</guisubmenu> <guimenuitem>Show Terminal Panel</guimenuitem></menuchoice> menu item and will get the focus whenever displayed. Additionally, if the <link linkend="konsole-config">Automatically synchronize the terminal with the current document when possible</link> option is enabled, it will change to the directory of the current document if possible when it is displayed, or when the current document changes.
tr: Yerleşik uçbirim öykünücüsü, size kolaylık sağlamak amacıyla &kde; &konsole; uçbirim uygulamasının bir kopyasıdır. <menuchoice><guimenu>Görünüm</guimenu><guisubmenu>Araç Görünümleri</guisubmenu> <guimenuitem>Uçbirim Panelini Göster</guimenuitem></menuchoice> menü ögesinden görüntülenir ve anında odağı alır. Ek olarak, <link linkend="konsole-config">Olanaklıysa uçbirimi geçerli belgeyle eşzamanla</link> seçeneği etkinleştirilirse görüntülendiğine veya geçerli belge değiştiğinde olanaklıysa geçerli belgenin dizinine geçer.

source: The default location in the &kate; window is at the bottom, below the editing area.
tr: &kate; dosyasındaki öntanımlı konumu en altta, düzenleme alanının altındadır.

source: You can configure the &konsole; using its &RMB; menu, for more information, see the <ulink url="help:/konsole/index.html">&konsole; manual</ulink>.
tr: &konsole;’u onun &RMB; menüsünü kullanarak yapılandırabilirsiniz; daha fazla bilgi için <ulink url="help:/konsole/index.html">&konsole; kılavuzuna</ulink> bakın.

source: The built-in terminal emulator is provided by the Terminal Tool View plugin.
tr: Yerleşik uçbirim öykünücüsü, Uçbirim Araç Görünümü eklentisi tarafından sağlanır.

source: <guimenu>View</guimenu><guisubmenu>Tool Views</guisubmenu> <guimenuitem>Show Terminal Panel</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guisubmenu>Araç Görünümleri</guisubmenu> <guimenuitem>Uçbirim</guimenuitem>

source: Toggles the display of the built-in terminal emulator.
tr: Yerleşik uçbirim öykünücüsünün görüntülenmesini açar/kapatır.

source: When activated for the first time, the terminal will be created.
tr: İlk kez etkinleştirildiğinde uçbirim oluşturulacaktır.

source: When the terminal emulator is displayed, it will get the focus, so that you can start typing in commands immediately. If the <link linkend="konsole-config">Automatically synchronize the terminal with the current document when possible</link> option is enabled in the <guilabel>Terminal</guilabel> page of the <link linkend="config-dialog">Main configuration dialog</link> the shell session will change to the directory of the active document, if it is a local file.
tr: Uçbirim öykünücüsü görüntülendiğinde odağı alır, böylecek doğrudan komutlar girmeye başlayabilirsiniz. <link linkend="config-dialog">Ana yapılandırma iletişim kutusunun</link> <guilabel>Uçbirim</guilabel> sayfasında <link linkend="konsole-config">Olanaklıysa uçbirimi geçerli belgeyle eşzamanla</link> seçeneği etkinleştirilirse kabuk oturumu yerel bir dosyaysa etkin belgenin dizinine geçer.

source: <guimenu>Tools</guimenu><guimenuitem>Pipe to Terminal</guimenuitem>
tr: <guimenu>Araçlar</guimenu><guimenuitem>Uçbirime Veriyolu Yap</guimenuitem>

source: Feed the currently selected text into the built-in terminal emulator. No newline is added after the text.
tr: Seçili olan metni yerleşik uçbirim öykünücüsüne besleyin. Metinden sonra yenisatır eklenmez.

source: <guimenu>Tools</guimenu> <guimenuitem>Synchronize Terminal with Current Document</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Uçbirimi Geçerli Belgeyle Eşzamanla</guimenuitem>

source: This will cause the built-in Terminal to <command>cd</command> into the directory of the active document.
tr: Bu, yerleşik uçbirimin etkin belgenin dizinine <command>cd</command> yapmasını sağlar.

source: Alternatively, you can configure &kate; to always keep the terminal in sync with the current document. See <xref linkend="konsole-config"/> for more information.
tr: Alternatif olarak &kate;’i, uçbirimi her zaman geçerli belgeyle eşzamanlı tutacak biçimde yapılandırabilirsiniz. Daha fazla bilgi için <xref linkend='konsole-config'/> bölümüne bakın.

source: <guimenu>Tools</guimenu> <guimenuitem>Run Current Document</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Geçerli Belgeyi Çalıştır</guimenuitem>

source: Run the current document in &konsole;. Only the local documents can be run. &kate; will show a warning before running document because this action can be a serious security threat.
tr: Geçerli belgeyi &konsole;’de çalıştırın. Yalnızca yerel belgeler çalıştırılabilir. Bu eylem ciddi bir güvenlik tehdidi olabileceğinden &kate; belgeyi çalıştırmadan önce bir uyarı gösterecektir.

source: <guimenu>Tools</guimenu> <guimenuitem>Focus/Defocus Terminal Panel</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Uçbirim Paneline Odaklan/Panelindeki Odağı Kaldır</guimenuitem>

source: Switch the focus from the current document to the terminal and vice versa.
tr: Odağı geçerli belgeden uçbirime veya tam tersi olacak biçimde değiştirin.

source: You can configure the Terminal Tool View plugin on the <guilabel>Terminal</guilabel> page of the <link linkend="configuring-kate">configuration dialog</link>.
tr: Uçbirim araç görünümü eklentisini <link linkend="configuring-kate">yapılandırma iletişim kutusunun</link> <guilabel>Uçbirim</guilabel> sayfasında yapılandırabilirsiniz.

source: The following options are available:
tr: Aşağıdaki seçenekler kullanılabilir:

source: Automatically synchronize the terminal with the current document when possible
tr: Olanaklıysa uçbirimi geçerli belgeyle eşzamanla

source: This will cause the built-in terminal to <command>cd</command> into the directory of the active document when launched and when a new document gets the focus. If not enabled, you have to do all your navigation in the terminal on your own.
tr: Bu, yerleşik uçbirimin başlatıldığında ve yeni bir belgeye odaklanıldığında etkin belgenin dizinine <command>cd</command> yapmasını sağlar. Etkinleştirilmemişse uçbirimdeki tüm dolaşımınızı kendi başınıza yapmanız gerekir.

source: Set EDITOR environment variable to 'kate -b'
tr: EDITOR çevre değişkenini “kate -b” olarak ayarla

source: This sets the <envar>EDITOR</envar> environment variable so programs run in the built-in terminal that automatically open a file in an editor will open them in &kate; instead of the default editor configured in your shell. You will not be able to continue using the terminal until you have closed the file in &kate;, so the calling program is aware you have finished editing the file.
tr: Bu, <envar>EDITOR</envar> çevre değişkenini, yerleşik uçbirimde çalışan ve bir dosyayı kendiliğinden bir düzenleyicide açan programların, bunları kabuğunuzda yapılandırılan öntanımlı düzenleyici yerine &kate;’de açmasını sağlayacak şekilde ayarlar. Dosyayı &kate;’de kapatana kadar uçbirimi kullanmayı sürdüremezsiniz, böylece çağıran program, dosyayı düzenlemeyi bitirdiğinizin farkında olacaktır.

source: Hide &konsole; on pressing 'Esc'
tr: ’Vazgeç’e basıldığında &konsole;’yi gizle
