Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_development.po
Languages: tr

source: You can see the full list of SPDX license identifiers <ulink url="https://spdx.org/licenses/">here</ulink>.
tr: SPDX lisans tanımlayıcılarının tam listesini <ulink url="https://spdx.org/licenses/">buradan</ulink> görebilirsiniz.

source: <userinput>copyright</userinput>: It is an <emphasis>array</emphasis> of <emphasis>strings</emphasis> that specifies the authors of the theme, using the identifier <userinput>SPDX-FileCopyrightText</userinput> from the standard <ulink url="https://spdx.dev/">SPDX license communication format</ulink>. It is optional.
tr: <userinput>copyright</userinput>: Temanın telif hakkını, standart <ulink url="https://spdx.dev/">SPDX lisans iletişim biçiminden alınan</ulink> <userinput>SPDX-License-Identifier</userinput> tanımlayıcısını kullanarak belirten bir <emphasis>diziler</emphasis> <emphasis>dizilişidir</emphasis>. İsteğe bağlıdır.

source: "metadata": { "name" : "Breeze Light", "revision" : 5, "copyright": [ "SPDX-FileCopyrightText: 2016 Volker Krause &lt;vkrause@kde.org&gt;", "SPDX-FileCopyrightText: 2016 Dominik Haumann &lt;dhaumann@kde.org&gt;" ], "license": "SPDX-License-Identifier: MIT" }
tr: "metadata": { "name" : "Esinti Açık", "revision" : 5, "copyright": [ "SPDX-FileCopyrightText: 2016 Volker Krause &lt;vkrause@kde.org&gt;", "SPDX-FileCopyrightText: 2016 Dominik Haumann &lt;dhaumann@kde.org&gt;" ], "license": "SPDX-License-Identifier: MIT" }

source: Colors in Detail
tr: Ayrıntılarla Renkler

source: This section details all the available color attributes and available color settings.
tr: Bu bölüm, tüm kullanılabilir renk özniteliklerini ve ayarlarını ayrıntılandırır.

source: Editor Colors
tr: Düzenleyici Renkleri

source: Corresponds to the colors of the <link linkend="kate-part">text editing area</link>.
tr: <link linkend="kate-part">Metin düzenleme alanı</link> renklerine karşılık gelir.

source: In the <link linkend="color-themes-json">&JSON; theme file</link>, the respective key <userinput>editor-colors</userinput> has as value an <emphasis>object</emphasis> where each key references an attribute color of the text editor. Here, <userinput>all available keys are mandatory</userinput>, their values are <userinput>strings</userinput> with hexadecimal color codes, like <quote>#00B5CF</quote>.
tr: <link linkend="color-themes-json">&JSON; tema dosyasında</link>, ilgili <userinput>editor-colors</userinput> anahtarının, her bir anahtarın metin düzenleyicisinin renk özniteliğine başvurduğu bir <emphasis>object</emphasis> değeri vardır. Burada, <userinput>tüm anahtarlar zorunludur</userinput>, değerleri ise <quote>#00B5CF</quote> gibi onaltılık renk değerlerine sahip <userinput>dizilerdir</userinput>.

source: In <link linkend="color-themes-gui">the &GUI; to manage themes of KTextEditor</link>, these attributes can be modified in the <userinput><guilabel>Colors</guilabel></userinput> tab.
tr: <link linkend="color-themes-gui">KTextEditor tema yönetim arayüzünde</link>, bu öznitelikler <userinput><guilabel>Renkler</guilabel></userinput> sekmesinde yapılandırılabilir.

source: The available keys are the following; the keys used in the <link linkend="color-themes-json">&JSON; file</link> are listed in <emphasis>bold</emphasis>, the names used in the <link linkend="color-themes-gui">&GUI;</link> are shown in parentheses.
tr: Kullanılabilir anahtarlar aşağıdaki gibidir; <link linkend="color-themes-json">&JSON; dosyasında</link> kullanılan anahtarlar <emphasis>kalın</emphasis> ile, <link linkend="color-themes-gui">grafik arayüzde</link> kullanılan adlar parantez içinde gösterilirler.

source: Editor Background Colors
tr: Düzenleyici Arka Plan Renkleri

source: <userinput>BackgroundColor</userinput> (<guilabel>Text Area</guilabel>)
tr: <userinput>BackgroundColor</userinput> (<guilabel>Metin Alanı</guilabel>)

source: This is the default background for the editor area, it will be the dominant color on the editor area.
tr: Bu, düzenleyici alanı için varsayılan arka plandır, düzenleyici alanındaki baskın renk olacaktır.

source: <userinput>TextSelection</userinput> (<guilabel>Selected Text</guilabel>)
tr: <userinput>TextSelection</userinput> (<guilabel>Seçili Metin</guilabel>)

source: This is the background for selected text.
tr: Bu, seçili metnin arka planıdır.

source: <userinput>CurrentLine</userinput> (<guilabel>Current Line</guilabel>)
tr: <userinput>CurrentLine</userinput> (<guilabel>Geçerli Satır</guilabel>)

source: Set the color for the current line. Setting this a bit different from the Normal text background helps to keep focus on the current line.
tr: Geçerli satırın rengini ayarlayın. Bunu normal metin arka planından biraz farklı bir şekilde ayarlamak, odağın geçerli satırda kalmasına yardımcı olur.

source: <userinput>SearchHighlight</userinput> (<guilabel>Search Highlight</guilabel>)
tr: <userinput>SearchHighlight</userinput> (<guilabel>Arama Vurgusu</guilabel>)

source: Set the color for the text that matches your last search.
tr: Son aramanızla eşleşen metnin rengini ayarlayın.

source: <userinput>ReplaceHighlight</userinput> (<guilabel>Replace Highlight</guilabel>)
tr: <userinput>ReplaceHighlight</userinput> (<guilabel>Değiştirme Vurgusu</guilabel>)

source: Set the color for the text that matches your last replace operation.
tr: Son değiştirme işleminizle eşleşen metnin rengini ayarlayın.

source: Icon Border
tr: Simge Kenarlığı

source: <userinput>IconBorder</userinput> (<guilabel>Background Area</guilabel>)
tr: <userinput>IconBorder</userinput> (<guilabel>Arka Plan Alanı</guilabel>)

source: This color is used for the marks, line numbers and folding marker borders in the left side of the editor view when they are displayed.
tr: Bu renk, görüntülendiğinde düzenleyici görünümünün sol tarafındaki imleyiciler, satır numaraları ve katlama imleyicisi kenarlıkları için kullanılır.

source: <userinput>LineNumbers</userinput> (<guilabel>Line Numbers</guilabel>)
tr: <userinput>LineNumbers</userinput> (<guilabel>Satır Numaraları</guilabel>)

source: This color is used to draw the line numbers on the left side of the view when displayed.
tr: Bu renk, görüntülendiğinde görünümün sol tarafındaki satır numaralarını çizmek için kullanılır.

source: <userinput>CurrentLineNumber</userinput> (<guilabel>Current Line Number</guilabel>)
tr: <userinput>CurrentLineNumber</userinput> (<guilabel>Geçerli Satır Numarası</guilabel>)

source: This color is used to draw the line number of the current line, on the left side of the view when displayed. Setting this a bit different from <quote>LineNumbers</quote> helps to keep focus on the current line.
tr: Bu renk, görüntülendiğinde görünümün sol tarafına geçerli satırın satır numarasını çizmek için kullanılır. Bunu <quote>LineNumbers</quote>’tan biraz farklı bir şekilde ayarlamak, geçerli satıra odaklanmaya yardımcı olur.

source: <userinput>Separator</userinput> (<guilabel>Separator</guilabel>)
tr: <userinput>Separator</userinput> (<guilabel>Ayırıcı</guilabel>)

source: This color is used to draw the vertical line that separates the icon border from the background of the text area.
tr: Bu renk, simge kenarlığını metin alanının arka planından ayıran dikey çizgiyi çizmek için kullanılır.

source: <userinput>WordWrapMarker</userinput> (<guilabel>Word Wrap Marker</guilabel>)
tr: <userinput>WordWrapMarker</userinput> (<guilabel>Sözcük Kaydırma İmleyicisi</guilabel>)

source: This color is used to draw a pattern to the left of dynamically wrapped lines when those are aligned vertically, as well as for the static word wrap marker.
tr: Bu renk, dikey olarak hizalandığında devingen olarak kaydırılan çizgilerin soluna bir desen çizmek ve durgun sözcük kaydırma imleyicisi için kullanılır.

source: <userinput>CodeFolding</userinput> (<guilabel>Code Folding</guilabel>)
tr: <userinput>CodeFolding</userinput> (<guilabel>Kod Katlama</guilabel>)

source: This color is used to highlight the section of code that would be folded when you click on the code folding arrow to the left of a document. For more information, see <link linkend="advanced-editing-tools-code-folding">the code folding documentation</link>.
tr: Bu renk, bir belgenin solundaki kod katlama okuna tıkladığınızda katlanacak kod bölümünü vurgulamak için kullanılır. Daha fazla bilgi için <link linkend="advanced-editing-tools-code-folding">kod katlama belgelendirmesine</link> bakın.

source: <userinput>ModifiedLines</userinput> (<guilabel>Modified Lines</guilabel>)
tr: <userinput>ModifiedLines</userinput> (<guilabel>Değiştirilen Satırlar</guilabel>)

source: This color is used to highlight to the left of a document lines that have been modified but not yet saved. For more information, see <xref linkend="kate-part-line-modification"/>.
tr: Bu renk, değiştirilmiş ancak henüz kaydedilmemiş bir belgenin sol tarafındaki satırları vurgulamak için kullanılır. Daha fazla bilgi için <xref linkend="kate-part-line-modification"/> bölümüne bakın.

source: <userinput>SavedLines</userinput> (<guilabel>Saved Lines</guilabel>)
tr: <userinput>SavedLines</userinput> (<guilabel>Kaydedilen Satırlar</guilabel>)

source: This color is used to highlight to the left of a document lines that have been modified this session and saved. For more information, see <xref linkend="kate-part-line-modification"/>.
tr: Bu renk, bu oturumda değiştirilen ve kaydedilen belgenin sol tarafındaki satırları vurgulamak için kullanılır. Daha fazla bilgi için <xref linkend="kate-part-line-modification"/> bölümüne bakın.

source: Text Decorations
tr: Metin Dekorasyonları

source: <userinput>SpellChecking</userinput> (<guilabel>Spelling Mistake Line</guilabel>)
tr: <userinput>SpellChecking</userinput> (<guilabel>Yazım Yanlışı Satırı</guilabel>)

source: This color is used to indicate spelling mistakes.
tr: Bu renk, yazım yanlışlarını belirtmek için kullanılır.

source: <userinput>TabMarker</userinput> (<guilabel>Tab and Space Markers</guilabel>)
tr: <userinput>TabMarker</userinput> (<guilabel>Sekme ve Boşluk İmleyicileri</guilabel>)

source: This color is used to draw white space indicators, when they are enabled.
tr: Bu renk, etkinleştirildiğinde beyaz alan göstergelerini çizmek için kullanılır.

source: <userinput>IndentationLine</userinput> (<guilabel>Indentation Line</guilabel>)
tr: <userinput>IndentationLine</userinput> (<guilabel>Girintileme Satırı</guilabel>)

source: This color is used to draw a line to the left of indented blocks, if <link linkend="appearance-general">that feature is enabled</link>.
tr: Bu renk, <link linkend="appearance-general">bu özellik etkinse</link> girintili blokların soluna bir çizgi çizmek için kullanılır.

source: <userinput>BracketMatching</userinput> (<guilabel>Bracket Highlight</guilabel>)
tr: <userinput>BracketMatching</userinput> (<guilabel>Ayraç Vurgusu</guilabel>)

source: This color is used to draw the background of matching brackets.
tr: Bu renk, eşleşen ayraçların arka planını çizmek için kullanılır.

source: Marker Colors
tr: İmleyici Renkleri

source: <userinput>MarkBookmark</userinput> (<guilabel>Bookmark</guilabel>)
tr: <userinput>MarkBookmark</userinput> (<guilabel>Yer İmi</guilabel>)

source: This color is used to indicate bookmarks. Note that this color has an opacity of 22% (and 33% for the current line) with respect to the background. For more information, see <xref linkend="kate-part-bookmarks"/>.
tr: Bu renk, yer imlerini belirtmek için kullanılır. Bu rengin arka plana göre %​22 (ve geçerli çizgi için %​33) matlığa sahip olduğunu unutmayın.

source: <userinput>MarkBreakpointActive</userinput> (<guilabel>Active Breakpoint</guilabel>)
tr: <userinput>MarkBreakpointActive</userinput> (<guilabel>Etkin Kesme Noktası</guilabel>)

source: This color is used by the GDB plugin to indicate an active breakpoint. Notice that this color has an opacity to the background. For more information, see <ulink url="help:/kate/kate-application-plugin-gdb.html">the GDB Plugin documentation</ulink>.
tr: Bu renk, GDB eklentisi tarafından etkin bir kesme noktasını belirtmek için kullanılır. Bu rengin arka planının mat olduğuna dikkat edin. Daha fazla bilgi için <ulink url="help:/kate/kate-application-plugin-gdb.html">GDB eklentisi belgelendirmesine</ulink> bakın.

source: <userinput>MarkBreakpointReached</userinput> (<guilabel>Reached Breakpoint</guilabel>)
tr: <userinput>MarkBreakpointReached</userinput> (<guilabel>Ulaşılan Kesme Noktası</guilabel>)

source: This color is used by the GDB plugin to indicate a breakpoint you have reached while debugging. Notice that this color has an opacity to the background. For more information, see <ulink url="help:/kate/kate-application-plugin-gdb.html">the GDB Plugin documentation</ulink>.
tr: Bu renk GDB eklentisi tarafından hata ayıklama sırasında ulaştığınız bir kesme noktasını belirtmek için kullanılır. Bu rengin arka planının mat olduğuna dikkat edin. Daha fazla bilgi için <ulink url="help:/kate/kate-application-plugin-gdb.html">GDB eklentisi belgelendirmesine</ulink> bakın.

source: <userinput>MarkBreakpointDisabled</userinput> (<guilabel>Disabled Breakpoint</guilabel>)
tr: <userinput>MarkBreakpointDisabled</userinput> (<guilabel>Devre Dışı Kesme Noktası</guilabel>)

source: This color is used by the GDB plugin to indicate an inactive breakpoint. Notice that this color has an opacity to the background. For more information, see <ulink url="help:/kate/kate-application-plugin-gdb.html">the GDB Plugin documentation</ulink>.
tr: Bu renk, GDB eklentisi tarafından etkin olmayan bir kesme noktasını belirtmek için kullanılır. Bu rengin arka planının mat olduğuna dikkat edin. Daha fazla bilgi için <ulink url="help:/kate/kate-application-plugin-gdb.html">GDB eklentisi belgelendirmesine</ulink> bakın.

source: <userinput>MarkExecution</userinput> (<guilabel>Execution</guilabel>)
tr: <userinput>MarkExecution</userinput> (<guilabel>Yürütme</guilabel>)

source: This color is used by the GDB plugin the line presently being executed. Notice that this color has an opacity to the background. For more information, see <ulink url="help:/kate/kate-application-plugin-gdb.html">the GDB Plugin documentation</ulink>.
tr: Bu renk, şu anda yürütülen satırdaki GDB eklentisi tarafından kullanılır. Bu rengin arka planının mat olduğuna dikkat edin. Daha fazla bilgi için <ulink url="help:/kate/kate-application-plugin-gdb.html">GDB eklentisi belgelendirmesine</ulink> bakın.

source: <userinput>MarkWarning</userinput> (<guilabel>Warning</guilabel>)
tr: <userinput>MarkWarning</userinput> (<guilabel>Uyarı</guilabel>)

source: This color is used by the build plugin to indicate a line that has caused a compiler warning. Notice that this color has an opacity to the background. For more information, see <ulink url="help:/kate/kate-application-plugin-build.html">the Build Plugin documentation</ulink>.
tr: Bu renk, yapı eklentisi tarafından derleyici uyarısına neden olan bir satırı belirtmek için kullanılır. Bu rengin arka planının mat olduğuna dikkat edin. Daha fazla bilgi için <ulink url="help:/kate/kate-application-plugin-build.html">yapı eklentisi belgelendirmesine</ulink> bakın.

source: <userinput>MarkError</userinput> (<guilabel>Error</guilabel>)
tr: <userinput>MarkError</userinput> (<guilabel>Hata</guilabel>)

source: This color is used by the build plugin to indicate a line that has caused a compiler error. Notice that this color has an opacity to the background. For more information, see <ulink url="help:/kate/kate-application-plugin-build.html">the Build Plugin documentation</ulink>.
tr: Bu renk, yapı eklentisi tarafından derleyici hatasına neden olan bir satırı belirtmek için kullanılır. Bu rengin arka planının mat olduğuna dikkat edin. Daha fazla bilgi için <ulink url="help:/kate/kate-application-plugin-build.html">yapı eklentisi belgelendirmesine</ulink> bakın.

source: Text Templates &amp; Snippets
tr: Metin Şablonları ve Parçacıkları

source: <userinput>TemplateBackground</userinput> (<guilabel>Background</guilabel>)
tr: <userinput>TemplateBackground</userinput> (<guilabel>Arka Plan</guilabel>)

source: This color is used by the &kate; Snippets plugin to mark the background of a snippet. For more information, see <ulink url="help:/kate/kate-application-plugin-snippets.html">the &kate; Snippets documentation</ulink>.
tr: Bu renk &kate; parçacıkları eklentisi tarafından bir parçacığın arka planını imlemek için kullanılır. Daha fazla bilgi için <ulink url="help:/kate/kate-application-plugin-snippets.html">&kate; parçacıkları belgelendirmesine</ulink> bakın.

source: <userinput>TemplatePlaceholder</userinput> (<guilabel>Editable Placeholder</guilabel>)
tr: <userinput>TemplatePlaceholder</userinput> (<guilabel>Düzenlenebilir Yer Tutucu</guilabel>)

source: This color is used by the &kate; Snippets plugin to mark a placeholder that you can click in to edit manually. For more information, see <ulink url="help:/kate/kate-application-plugin-snippets.html">the &kate; Snippets documentation</ulink>.
tr: Bu renk, &kate; parçacıklar eklentisi tarafından elle düzenlemek üzere tıklayabileceğiniz bir yer tutucuyu imlemek için kullanılır. Daha fazla bilgi için <ulink url="help:/kate/kate-application-plugin-snippets.html">&kate; parçacıkları belgelendirmesine</ulink> bakın.

source: <userinput>TemplateFocusedPlaceholder</userinput> (<guilabel>Focused Editable Placeholder</guilabel>)
tr: <userinput>TemplateFocusedPlaceholder</userinput> (<guilabel>Odaklı Düzenlenebilir Yer Tutucu</guilabel>)

source: This color is used by the &kate; Snippets plugin to mark the placeholder that you are presently editing. For more information, see <ulink url="help:/kate/kate-application-plugin-snippets.html">the &kate; Snippets documentation</ulink>.
tr: Bu renk, &kate; parçacıklar eklentisi tarafından şu anda düzenlediğiniz yer tutucuyu imlemek için kullanılır. Daha fazla bilgi için <ulink url="help:/kate/kate-application-plugin-snippets.html">&kate; parçacıkları belgelendirmesine</ulink> bakın.

source: <userinput>TemplateReadOnlyPlaceholder</userinput> (<guilabel>Not Editable Placeholder</guilabel>)
tr: <userinput>TemplateReadOnlyPlaceholder</userinput> (<guilabel>Düzenlenemez Yer Tutucu</guilabel>)

source: This color is used by the &kate; Snippets plugin to mark a placeholder that cannot be edited manually, such as one that is automatically populated. For more information, see <ulink url="help:/kate/kate-application-plugin-snippets.html">the &kate; Snippets documentation</ulink>.
tr: Bu renk, &kate; parçacıklar eklentisi tarafından düzenlenemez olan bir yer tutucuyu; örneğin, kendiliğinden doldurulan tutucular gibi, imlemek için kullanılır. Daha fazla bilgi için <ulink url="help:/kate/kate-application-plugin-snippets.html">&kate; parçacıkları belgelendirmesine</ulink> bakın.

source: Default Text Styles
tr: Öntanımlı Metin Biçemleri

source: The default text styles are inherited by the highlight text styles, allowing the editor to present text in a very consistent way, for example comment text is using the same style in almost all of the text formats that KSyntaxHighlighting can highlight.
tr: Öntanımlı metin biçemleri, vurgulanan metin biçemleri tarafından devralınır ve bu, düzenleyicinin metni çok tutarlı bir biçimde sunmasına olanak tanır; örneğin, yorum metni, KSyntaxHighlighting’in vurgulayabildiği hemen hemen tüm metin biçimlerinde aynı biçemi kullanır.

source: These text styles can be referenced from the <userinput>default styles</userinput> used in <link linkend="highlight">syntax highlighting</link> definition &XML; files, for example, the <quote>Normal</quote> attribute is equivalent to <quote>dsNormal</quote> in the &XML; files, and <quote>DataType</quote> is equivalent to <quote>dsDataType</quote>. See <xref linkend="kate-highlight-default-styles"/> in the syntax highlighting documentation.
tr: Bu metin biçemlerine, <link linkend="highlight">sözdizim vurgulama</link> &XML; tanım dosyalarında kullanılan <userinput>öntanımlı biçemlerden</userinput> başvurulabilir; örneğin, <quote>Normal</quote> özniteliği, &XML; dosyalarındaki <quote>dsNormal</quote> özniteliğine ve <quote>DataType</quote> ise <quote>dsDataType</quote>’a eşdeğerdir. Daha fazla bilgi için sözdizim vurgulama belgelendirmesindeki <xref linkend="kate-highlight-default-styles"/> bölümüne bakın.

source: Make sure to choose readable colors with good contrast especially in combination with the <userinput><link linkend="color-themes-editor-colors">Editor Colors</link></userinput>. See <xref linkend="color-themes-contrast"/>.
tr: Özellikle <userinput><link linkend="color-themes-editor-colors">Düzenleyici Renkleri</link></userinput> ile kombine edildiğinde iyi karşıtlık sağlayacak okunabilir renkler seçmeye dikkat edin. Daha fazla bilgi için <xref linkend="color-themes-contrast"/> bölümüne bakın.

source: In the <link linkend="color-themes-json">&JSON; file</link>, the respective key <userinput>text-styles</userinput> has as value an <emphasis>object</emphasis> where each key corresponds to the name of a <emphasis>default text style</emphasis>, which are equivalent to those used in the syntax highlighting definitions. Here, <userinput>all available text style keys are mandatory</userinput>, these are listed below.
tr: <link linkend="color-themes-json">&JSON; dosyasında</link>, ilgili <userinput>text-styles</userinput> anahtarının değeri bir <emphasis>object</emphasis>’e sahiptir; burada her anahtar, sözdizim vurgulama tanımlarında kullanılanlara eşdeğer olan bir <emphasis>öntanımlı metin biçeminin</emphasis> adına karşılık gelir. Burada, zorunlu olan <userinput>kullanılabilir tüm metin biçemi anahtarları</userinput> aşağıda listelenmiştir.

source: "text-styles": { "Normal" : { "text-color" : "#1f1c1b", "selected-text-color" : "#ffffff", "bold" : false, "italic" : false, "underline" : false, "strike-through" : false }, "Keyword" : { "text-color" : "#1f1c1b", "selected-text-color" : "#ffffff", "bold" : true }, "Function" : { "text-color" : "#644a9b", "selected-text-color" : "#452886" }, <replaceable>The other text style keys...</replaceable> }
tr: "text-styles": { "Normal" : { "text-color" : "#1f1c1b", "selected-text-color" : "#ffffff", "bold" : false, "italic" : false, "underline" : false, "strike-through" : false }, "Keyword" : { "text-color" : "#1f1c1b", "selected-text-color" : "#ffffff", "bold" : true }, "Function" : { "text-color" : "#644a9b", "selected-text-color" : "#452886" }, <replaceable>Diğer metin biçemi anahtarları…</replaceable> }

source: Each key of <emphasis>default text style</emphasis> has a &JSON; object as its value, where values such as <emphasis>color</emphasis>, <emphasis>bold</emphasis>, <emphasis>italic</emphasis>, etc. are specified. These keys are as follows:
tr: <emphasis>Öntanımlı metin biçeminin</emphasis> her bir anahtarının bir &JSON; nesnesi olan değerleri vardır; buralarda; örneğin, <emphasis>color</emphasis>, <emphasis>bold</emphasis>, <emphasis>italic</emphasis>, vb. değerler belirtilirler. Bu anahtarlar aşağıda listelenmiştir:

source: <userinput>text-color</userinput>: It is a <emphasis>string</emphasis> with the text color in hexadecimal color code. This key/value is required.
tr: <userinput>text-color</userinput>: Metin renginin onaltılık bir renk kodunda olduğu bir <emphasis>dizidir</emphasis>. Bu anahtar/değer zorunludur.
