Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_part.po
Languages: tr

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Working with the &kappname; editor
tr: &kappname; düzenleyicisiyle çalışmak

source: Overview
tr: Genel Görünüm

source: The &kappname; editor is the editing area of the &kappname; window. This editor is shared between &kate; and &kwrite;, and it can also be used in &konqueror; for displaying text files from your local computer, or from the network.
tr: &kappname; düzenleyicisi &kappname; penceresinin düzenleme alanıdır. Bu düzenleyici &kate; ve &kwrite; arasında paylaşılır ve aynı zamanda yerel bilgisayarınızdan veya ağdan gelen metin dosyalarını görüntülemek için &konqueror;’da da kullanılabilir.

source: The editor is composed of the following components:
tr: Düzenleyici aşağıdaki bileşenlerden oluşur:

source: The editing area
tr: Düzenleme Alanı

source: This is where the text of your document is located.
tr: Bu belgenizin metninin konumlandığı yerdir.

source: The Scrollbars
tr: Sarma Çubukları

source: The scrollbars indicate the position of the visible part of the document text, and can be used to move around the document. Dragging the scrollbars will not cause the insertion cursor to be moved.
tr: Sarma çubukları, belge metninin görünür kısmının konumunu belirtir ve belgede dolaşmak için kullanılabilir. Sarma çubuklarının sürüklenmesi, ekleme imlecinin hareket etmesine neden olmaz.

source: The scrollbars are displayed and hidden as required.
tr: Sarma çubukları gerektikçe görüntülenir veya gizlenir.

source: The Icon Border
tr: Simge Kenarlığı

source: The icon border is a small pane on the left side of the editor, displaying a small icon next to marked lines.
tr: Simge kenarlığı, düzenleyicinin sol tarafında, imli satırların yanında küçük bir simge görüntüleyen küçük bir bölmedir.

source: You can set or remove a <link linkend="kate-part-bookmarks">bookmark</link> in a visible line by clicking the &LMB; in the icon border next to that line.
tr: Görünür bir satırdaki <link linkend="kate-part-bookmarks">yer imini</link>, o satırın yanındaki simge kenarlığına &LMB; ile tıklayarak ayarlayabilir veya kaldırabilirsiniz.

source: The display of the icon border can be toggled using the <menuchoice><guimenu>View</guimenu> <guimenuitem>Show Icon Border</guimenuitem></menuchoice> menu item.
tr: Simge kenarlığının görüntülenmesi <menuchoice><guimenu>Görünüm</guimenu><guimenuitem>Simge Kenarlığını Göster</guimenuitem></menuchoice> menü ögesi ile açılıp kapatılabilir.

source: The Line Numbers Pane
tr: Satır Numaraları Bölmesi

source: The Line numbers pane shows the line numbers of all visible lines in the document.
tr: Satır numaraları bölmesi, belgedeki tüm görünür satırların satır numaralarını gösterir.

source: The display of the Line Numbers Pane can be toggled using the <menuchoice><guimenu>View</guimenu> <guimenuitem>Show Line Numbers</guimenuitem></menuchoice> menu item.
tr: Satır numaraları bölmesinin görüntülenmesi, <menuchoice><guimenu>Görünüm</guimenu><guimenuitem>Satır Numaralarını Göster</guimenuitem></menuchoice> menü ögesi ile açılıp kapatılabilir.

source: The Folding Pane
tr: Katlama Bölmesi

source: The folding pane allows you to collapse or expand foldable blocks of lines. The calculation of the foldable regions is done according to rules in the syntax highlight definition for the document.
tr: Katlama bölmesi, katlanabilir satır bloklarını daraltmanıza veya genişletmenize olanak tanır. Katlanabilir bölgelerin hesaplanması, belgenin sözdizim vurgulama tanımındaki kurallara göre yapılır.

source: Also in this Chapter:
tr: Yine bu fasılda:

source: <link linkend="kate-part-navigation">Navigating in the Text</link>
tr: <link linkend="kate-part-navigation">Metinde Dolaşmak</link>

source: <link linkend="kate-part-selection">Working with the Selection</link>
tr: <link linkend="kate-part-selection">Seçimle Çalışmak</link>

source: <link linkend="kate-part-copy-and-paste">Copying and Pasting Text</link>
tr: <link linkend="kate-part-copy-and-paste">Metin Kopyalamak ve Yapıştırmak</link>

source: <link linkend="kate-part-find-replace">Finding and Replacing Text</link>
tr: <link linkend="kate-part-find-replace">Metin Bul ve Değiştir</link>

source: <link linkend="kate-part-bookmarks">Using Bookmarks</link>
tr: <link linkend="kate-part-bookmarks">Yer İmlerini Kullanmak</link>

source: Automatically Wrapping Text
tr: Kendiliğinden Metin Kaydırma

source: <link linkend="kate-part-autoindent">Using automatic indenting</link>
tr: <link linkend="kate-part-autoindent">Otomatik girintileme kullanarak</link>

source: <title>Navigating in the Text</title>
tr: <title>Metinde Dolaşmak</title>

source: Moving around in the text in &kappname; is similar to most graphical text editors. You move the cursor using the arrow keys and the &PgUp;, &PgDn;, &Home; and &End; keys in combination with the &Ctrl; and &Shift; modifiers. The &Shift; key is always used to generate a selection, while the &Ctrl; key has different effects on different keys:
tr: &kappname;’de metinde dolaşmak çoğu grafik metin düzenleyicisi ile benzerdir. İmleci, &Ctrl; ve &Shift; niteleyicileriyle birlikte ok düğmelerini ve &PgUp;, &PgDn;, &Home; ve &End; düğmelerini kullanarak hareket ettirirsiniz. &Shift; düğmesi her zaman bir seçim üretmek için kullanılırken, &Ctrl; düğmesinin farklı düğmeler üzerinde farklı etkileri vardır:

source: For the &Up; and &Down; keys it means scroll rather than move the cursor.
tr: &Up; ve &Down; düğmeleri için imleci hareket ettirmekten ziyade sarma anlamına gelir.

source: For the &Left; and &Right; keys it means skip words rather than characters.
tr: &Left; ve &Right; düğmeleri için karakterler yerine sözcükleri atlama anlamına gelir.

source: For the &PgUp; and &PgDn; keys it means move to the visible edge of the view rather than browse.
tr: &PgUp; ve &PgDn; düğmeleri için tarama yerine görünümün görünür kenarına hareket etme anlamına gelir.

source: For the &Home; and &End; keys it means move to the beginning or end of the document rather than the beginning or end of the line.
tr: &Home; ve &End; düğmeleri için satır başı ve sonu yerine belgenin başına ve sonuna git anlamı taşır.

source: &kappname; also provides you with a way to quickly jump to a matching brace or parenthesis: place the cursor on the inside of a parenthesis or brace character, and press <keycombo action="simul">&Ctrl;<keycap>6</keycap></keycombo> to jump to the matching parenthesis or brace.
tr: &kappname; ayrıca eşleşen ayraç veya parantezlere tez atlamanın bir yolunu da sağlar: İmleci parantez veya ayraç karakterinin içine yerleştirin ve eşleşen parantez veya ayraca atlamak için <keycombo action="simul">&Ctrl;<keycap>6</keycap></keycombo> kısayolunu kullanın.

source: In addition you can use <link linkend="kate-part-bookmarks">bookmarks</link> to quickly jump to positions that you define on your own.
tr: Ek olarak, kendi tanımladığınız konumlara tez atlamak için <link linkend="kate-part-bookmarks">yer imlerini</link> kullanabilirsiniz.

source: <title>Working with the Selection</title>
tr: <title>Seçimle Çalışmak</title>

source: There are two basic ways of selecting text in &kappname;: using the mouse, and using the keyboard.
tr: &kappname; içinde iki temel metin seçim yolu bulunur: Fareyi ve klavyeyi kullanarak.

source: To select using the mouse, hold down the &LMB; while dragging the mouse cursor from where the selection should start, to the desired end point. The text gets selected as you drag.
tr: Fareyi kullanarak seçim yapmak için fare imlecini seçimin başlaması gereken yerden istenen bitiş noktasına sürüklerken &LMB;’ni basılı tutun. Siz sürükledikçe metin seçilir.

source: Double-clicking a word will select that word.
tr: Bir sözcüğe çift tıklamak o sözcüğü seçecektir.

source: Triple-clicking in a line will select the entire line.
tr: Bir satıra üç kez tıklamak tüm satırı seçecektir.

source: If &Shift; is held down while clicking, text will be selected:
tr: Tıklarken &Shift; basılı tutulursa metin seçilecektir:

source: If nothing is already selected, from the text cursor position to the mouse cursor position.
tr: Halihazırda bir şey seçili değilse metin imleci konumundan fare imleci konumuna kadar.

source: If there is a selection, from and including that selection to the mouse cursor position.
tr: Bir seçim varsa bu seçimden fare imleci konumuna kadar.

source: When selecting text by dragging the mouse, the selected text is copied to the clipboard, and can be pasted by clicking the middle mouse button in the editor, or in any other application to which you want to paste the text.
tr: Fareyi sürükleyerek metin seçerken, seçili metin panoya kopyalanır ve düzenleyicide veya metni yapıştırmak istediğiniz başka herhangi bir uygulamada farenin orta tuşuna basılarak yapıştırılabilir.

source: To select using the keyboard, hold down the &Shift; key while using the navigation keys (Arrow keys, &PgUp;, &PgDn;, &Home; and &End;, possibly in combination with &Ctrl; to extend the move of the text cursor).
tr: Klavyeyi kullanarak seçim yapmak için dolaşma (ok düğmeleri, &PgUp;, &PgDn;, &Home; ve &End;, metin imlecinin hareketini genişletmek için büyük olasılıkla &Ctrl; ile birlikte) düğmelerini kullanırken &Shift; düğmesini basılı tutun.

source: See also the section <link linkend="kate-part-navigation">Navigating in the Text</link> in this chapter.
tr: Bu fasıldaki <link linkend="kate-part-navigation">Metinde Dolaşmak</link> bölümüne de göz atın.

source: To <action>Copy</action> the current selection, use the <menuchoice><guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem></menuchoice> menu item or the keyboard shortcut (defaults to <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo>).
tr: Geçerli seçimi <action>kopyalamak</action> için <menuchoice><guimenu>Düzen</guimenu> <guimenuitem>Kopyala</guimenuitem></menuchoice> menü ögesini veya klavye kısayolunu kullanın (öntanımlı olarak <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo>).

source: To <action>Deselect</action> the current selection, use the <menuchoice><guimenu>Edit</guimenu> <guimenuitem>Deselect</guimenuitem></menuchoice> menu item, or the keyboard shortcut (default is <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo>), or click with the &LMB; in the editor.
tr: Geçerli seçimi <action>kaldırmak</action> için <menuchoice><guimenu>Seçim</guimenu> <guimenuitem>Seçimi Kaldır</guimenuitem></menuchoice> menü ögesini veya klavye kısayolunu kullanın (öntanımlı olarak <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo>) veya düzenleyicide &LMB; ile tıklayın.

source: Using Block Selection
tr: Blok Seçimi Kullanmak

source: When Block Selection is enabled, you can make <quote>vertical selections</quote> in the text, meaning selecting limited columns from multiple lines. This is handy for working with tab separated lines for example.
tr: Blok Seçim Kipi etkinleştirildiğinde, metinde <quote>dikey seçimler</quote> yapabilirsiniz; bu, birden çok satırdan sınırlı sayıda sütunların seçilebilmesi anlamına gelir. Bu; örneğin, sekmeyle ayrılmış satırlarla çalışmak için kullanışlıdır.

source: Block Selection can be toggled using the <menuchoice><guimenu>Edit</guimenu> <guimenuitem>Block Selection Mode</guimenuitem></menuchoice> menu item. The default keyboard shortcut is <keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap> </keycombo>.
tr: Blok Seçim Kipi <menuchoice><guimenu>Seçim</guimenu> <guimenuitem>Blok Seçim Kipi</guimenuitem></menuchoice> menü ögesiyle açılıp kapatılabilir. Öntanımlı klavye kısayolu: <keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap></keycombo>.

source: Using Overwrite Selection
tr: Seçimin Üzerine Yazmayı Kullanmak

source: If Overwrite Selection is enabled, typing or pasting text into the selection will cause the selected text to be replaced. If not enabled, new text will be added at the position of the text cursor.
tr: Seçimin Üzerine Yaz etkinleştirilirse seçime metin yazmak veya yapıştırmak, seçili metnin değiştirilmesine neden olur. Etkinleştirilmezse metin imlecinin konumuna yeni metin eklenir.

source: Overwrite Selection is enabled by default.
tr: Seçimin Üzerine Yaz öntanımlı olarak etkindir.

source: To change the setting for this option, use the <link linkend="pref-edit-cursor-selection">Cursor &amp; Selection</link> page of the <link linkend="config-dialog">Configuration Dialog</link>.
tr: Bu seçeneğin ayarını değiştirmek için <link linkend="config-dialog">Yapılandırma İletişim Kutusu</link>’ndaki <link linkend="pref-edit-cursor-selection">İmleç ve Seçim</link> sayfasını kullanın.

source: Using Persistent Selection
tr: Kalıcı Seçimi Kullanmak

source: When Persistent Selection is enabled, typing characters or moving the cursor will not cause the Selection to become deselected. This means that you can move the cursor away from the selection and type text.
tr: Kalıcı Seçim etkinleştirildiğinde, karakterler girmek veya imleci hareket ettirmek seçimin kaldırılmasına neden olmaz. Bu, imleci seçimden uzaklaştırıp metin yazabileceğiniz anlamına gelir.

source: Persistent Selection is disabled by default.
tr: Kalıcı Seçim öntanımlı olarak devre dışıdır.

source: Persistent Selection can be enabled in the <link linkend="pref-edit-cursor-selection">Cursor &amp; Selection</link> page of the <link linkend="config-dialog">Configuration Dialog</link>.
tr: Kalıcı Seçim, <link linkend="config-dialog">Yapılandırma İletişim Kutusu</link>’ndaki <link linkend="pref-edit-cursor-selection">İmleç ve Seçim</link> sayfasından etkinleştirilebilir.

source: If Persistent Selection and Overwrite Selection are both enabled, typing or pasting text when the text cursor is inside the selection will cause it to be replaced and deselected.
tr: Kalıcı Seçim ve Seçimin Üzerine Yaz etkinse metin imleci seçimin içindeyken yazmak veya metin yapıştırmak metnin değiştirilmesine ve seçimin kaldırılmasına neden olur.

source: <title>Copying and Pasting Text</title>
tr: <title>Metin Kopyalamak ve Yapıştırmak</title>

source: To copy text, select it and use the <menuchoice><guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem></menuchoice> menu item. Additionally, selecting text with the mouse will cause selected text to be copied to the X selection.
tr: Metin kopyalamak için metni seçin ve <menuchoice><guimenu>Düzen</guimenu> <guimenuitem>Kopyala</guimenuitem></menuchoice> menü ögesini kullanın. Ek olarak, metni fareyle seçmek, metnin X panosuna kopyalanmasıne neden olacaktır.

source: To paste the text currently in the clipboard, use the <menuchoice> <guimenu>Edit</guimenu><guimenuitem>Paste</guimenuitem></menuchoice> menu item.
tr: Şu anda panoda olan metni yapıştırmak için <menuchoice> <guimenu>Düzen</guimenu><guimenuitem>Yapıştır</guimenuitem></menuchoice> menü ögesini kullanın.

source: Additionally, text selected with the mouse may be pasted by clicking the &MMB; at the desired position.
tr: Ayrıca fareyle seçilen metin, &MMB; ile tıklanarak istenilen konuma yapıştırılabilir.

source: If you are using the &kde; desktop, you can retrieve earlier copied text from any application using the &klipper; icon in the system tray.
tr: &kde; masaüstünü kullanıyorsanız daha önceden kopyalanan metinleri sistem tepsisindeki &klipper; simgesine tıklayarak alabilirsiniz.

source: <title>Finding and Replacing Text</title>
tr: <title>Metin Bul ve Değiştir</title>

source: The Search and Replace Bars
tr: Ara ve Değiştir Çubukları

source: &kappname; has an incremental search bar and a power search and replace bar, which offers the means of entering a replacement string along with a few extra options.
tr: &kappname;’de artımlı bir arama çubuğu ve güçlü arama ve değiştirme çubuğu bulunur; bu, birkaç ek seçeneğin yanı sıra yeni bir dizi girme olanağı sunar.

source: The bars offer the following common options:
tr: Çubuklar şu ortak seçenekleri sunar:

source: Find
tr: Bul

source: This is where to enter the search string. The interpretation of the string depends on some of the options described below.
tr: Arama dizisinin girileceği yer burasıdır. Dizinin yorumlanması aşağıda açıklanan seçeneklerden bazılarına bağlıdır.

source: Match case
tr: BÜYÜK/küçük harf eşleştir

source: If enabled, the search will be limited to entries that match the case (upper or lower) of each of the characters in the search pattern.
tr: Etkinleştirilirse arama, arama dizgisindeki karakterlerin her birinin BÜYÜK/küçük harfiyle eşleşen girişlerle sınırlı olacaktır.

source: The power search and replace bar offers some additional options:
tr: Gelişmiş ara ve değiştir çubuğu bazı ek seçenekler sunar:

source: Plain Text
tr: Düz metin

source: Literally match any occurrence of the search string.
tr: Arama dizisinin herhangi bir örneğini eşleştirin.

source: Whole Words
tr: Tam sözcükler

source: If selected, the search will only match if there is a word boundary at both ends of the string matching, meaning not an alphanumeric character - either some other visible character or a line end.
tr: Seçilirse arama, yalnızca dizi eşleşmesinin her iki ucunda da bir sözcük sınırı varsa eşleşir; bu, abece-sayısal bir karakter anlamına gelmez — başka bir görünür karakter veya satır sonu olabilir.

source: Escape Sequences
tr: Kaçış dizileri

source: If selected, the <guibutton>Add</guibutton> menuitem at the bottom of the context menu of the text boxes will be enabled and allows you to add escape sequences to the search pattern from a predefined list.
tr: Seçilirse metin kutularının bağlam menüsünün altındaki <guibutton>Ekle</guibutton> menü ögesi etkinleştirilir ve önceden tanımlanmış bir listeden arama dizgisine kaçış dizileri eklemenize olanak tanınır.

source: Regular Expression
tr: Düzenli ifadeler

source: If selected, the search string is interpreted as a regular expression. The <guibutton>Add</guibutton> menuitem at the bottom of the context menu of the text boxes will be enabled and allows you to add regular expression items to the search pattern from a predefined list.
tr: Seçilirse arama dizisi, düzenli ifade olarak yorumlanır. Metin kutularının bağlam menüsünün altındaki <guibutton>Ekle</guibutton> menü ögesi etkinleştirilir ve arama dizgisine önceden tanımlanmış bir listeden düzenli ifade ögeleri eklemenize olanak tanınır.

source: See <link linkend="regular-expressions">Regular Expressions</link> for more on these.
tr: Bu konu hakkında daha fazla bilgi için <link linkend="regular-expressions">Düzenli İfadeler</link> bölümüne bakın.

source: Search in the selection only
tr: Yalnızca seçimde ara

source: If checked, the search and replace will be performed within the selected text only.
tr: İşaretlenirse ara ve değiştir yalnızca seçili metin içinde gerçekleştirilir.

source: Find all
tr: Tümünü bul

source: Clicking this button highlights all matches in the document and shows the number of found matches in a small popup.
tr: Bu düğmeye tıklamak, belgedeki tüm eşleşmeleri vurgular ve bulunan eşleşmelerin sayısını küçük bir açılır pencerede gösterir.

source: Finding Text
tr: Metin Bulmak

source: To find text, launch the incremental search bar with <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> or from the <menuchoice><guimenu>Edit</guimenu> <guimenuitem>Find...</guimenuitem></menuchoice> menu item.
tr: Metin bulmak için <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> klavye kısayoluyla veya <menuchoice><guimenu>Düzen</guimenu> <guimenuitem>Bul…</guimenuitem></menuchoice> menü ögesinden artımlı arama çubuğunu başlatın.

source: This opens the incremental search bar at the bottom of the editor window. On the left side of the bar is a button with an icon to close the bar, followed by a small text box for entering the search pattern.
tr: Bu, düzenleyici penceresinin altındaki artımlı arama çubuğunu açar. Çubuğun sol tarafında, çubuğu kapatmak için bir simgenin bulunduğu bir düğme ve ardından arama dizgisini girmek için küçük bir metin kutusu bulunur.

source: When you start entering the characters of your search pattern, the search starts immediately. If there is a match in the text this is highlighted and the background color of the entry field changes to light green. If the search pattern does not match any string in the text, this is indicated by a light red background color of the entry field.
tr: Arama dizginizin karakterlerini girmeye başladığınızda arama hemen başlar. Metinde bir eşleşme varsa bu vurgulanır ve giriş alanının arka plan rengi açık yeşil olarak değişir. Arama dizgisi herhangi bir diziyle eşleşmezse metinde bu, giriş alanının açık kırmızı arka plan rengiyle belirtilir.

source: Use the <inlinemediaobject><imageobject><imagedata fileref="arrow-up-double-22.png" format="PNG"/></imageobject></inlinemediaobject> or <inlinemediaobject><imageobject><imagedata fileref="arrow-down-double-22.png" format="PNG"/></imageobject></inlinemediaobject> button to jump to the next or previous match in the document.
tr: Belgedeki önceki veya sonraki eşleşmeye atlamak için <inlinemediaobject><imageobject><imagedata fileref="arrow-up-double-22.png" format="PNG"/></imageobject></inlinemediaobject> veya <inlinemediaobject><imageobject><imagedata fileref="arrow-down-double-22.png" format="PNG"/></imageobject></inlinemediaobject> düğmelerini kullanın.

source: Matches in the document are highlighted even when you close the search bar. To clear this highlighting, press the &Esc; key.
tr: Arama çubuğunu kapattığınızda bile belgedeki eşleşmeler vurgulanır. Bu vurgulamayı temizlemek için Esc; düğmesine basın.

source: You can choose whether the search should be case sensitive. Selecting <inlinemediaobject><imageobject><imagedata fileref="format-text-superscript-22.png" format="PNG"/></imageobject></inlinemediaobject> will limit finds to entries that match the case (upper or lower) of each of the characters in the search pattern.
tr: Aramanızın BÜYÜK/küçük harf duyarlı olup olmayacağını seçebilirsiniz. <inlinemediaobject><imageobject><imagedata fileref="format-text-superscript-22.png" format="PNG"/></imageobject></inlinemediaobject> seçmek, arama dizgisindeki her bir karakterin metindeki BÜYÜK/küçük harflerle eşleşip eşleşmeyeceğini seçmenize olanak tanır.

source: Click on the <inlinemediaobject><imageobject><imagedata fileref="configure-shortcuts-22.png" format="PNG"/></imageobject></inlinemediaobject> button at the right side of the incremental search bar to switch to the power search and replace bar.
tr: Gelişmiş ara ve değiştir çubuğuna geçmek için artımlı arama çubuğunun sağ tarafındaki <inlinemediaobject><imageobject><imagedata fileref="configure-shortcuts-22.png" format="PNG"/></imageobject></inlinemediaobject> düğmesine tıklayın.

source: To repeat the last find operation, if any, without calling the incremental search bar, use <menuchoice> <shortcut><keycombo action="simul"><keycap>F3</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Find Next</guimenuitem></menuchoice> or <menuchoice><shortcut> <keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Find Previous</guimenuitem></menuchoice>.
tr: Son bulma işlemini (varsa) artımlı arama çubuğunu çağırmadan yinelemek için <menuchoice> <shortcut><keycombo action="simul"><keycap>F3</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu><guimenuitem>Sonrakini Bul</guimenuitem></menuchoice> veya <menuchoice><shortcut> <keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu><guimenuitem>Öncekini Bul</guimenuitem></menuchoice> ögelerini kullanın.

source: Replacing Text
tr: Metni Değiştirmek
