Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_plugins.po
Languages: tr

source: To create a new snippet repository, click <guibutton>Add Repository</guibutton>. You should now see a dialog that asks for the name of the snippet file, license and author. After choosing the desired options, click <guibutton>OK</guibutton>.
tr: Yeni bir parçacık deposu oluşturmak için <guibutton>Depo Ekle</guibutton>’ye tıklayın. Artık parçacık dosyasının, lisansının ve yazarının adını soran bir iletişim kutusu görmelisiniz. İstediğiniz seçenekleri belirledikten sonra <guibutton>Tamam</guibutton>’a tıklayın.

source: Snippet Editor
tr: Parçacık Düzenleyicisi

source: The repository editor.
tr: Depo düzenleyicisi.

source: The repository editor interface.
tr: Depo düzenleyicisi arayüzü.

source: The snippet repository editor contains the following options:
tr: Parçacık deposu düzenleyicisi, aşağıdaki seçenekleri içerir:

source: Name
tr: Ad

source: Appears in the list of snippets in the tool view and is also searched when using the code completion feature.
tr: Araç görünümündeki parçacıklar listesinde görünür ve ayrıca kod tamamlama özelliği kullanılırken de aranır.

source: Namespace
tr: Ad Alanı

source: Prefix used while using code completion.
tr: Kod tamamlama kullanılırken kullanılan önek.

source: License
tr: Lisans

source: Select the license for you snippet repository.
tr: Parçacık deponuz için lisansı seçin.

source: Authors
tr: Yazarlar

source: Enter the name(s) of the author(s) of the snippet file.
tr: Parçacık dosyasının yazar(lar)ının ad(lar)ını girin.

source: File types
tr: Dosya türleri

source: Select the file type(s) you want the snippet repository to apply to. It is set to <quote></quote> by default, so the repository applies to all files. You can change it to something like <userinput>C++</userinput> for instance, or select from a list by clicking on the items. You can specify more than one file type pressing the &Shift; while adding types.
tr: Parçacık deposunun uygulanmasını istediğiniz dosya türlerini seçin. Öntanımlı olarak <quote></quote> olarak ayarlanmıştır, böylece depo tüm dosyalara uygulanır. Örneğin bunu <userinput>C++</userinput> gibi bir şeyle değiştirebilir veya ögelere tıklayarak listeden seçim yapabilirsiniz. Türleri eklerken &Shift; düğmesine basarak birden fazla dosya türü belirleyebilirsiniz.

source: Creating and Editing Snippets
tr: Parçacıkları Oluşturmak ve Düzenlemek

source: The snippet editor.
tr: Parçacık düzenleyicisi.

source: The snippet editor interface.
tr: Parçacık düzenleyicisi arayüzü.

source: The name as shown in the list of snippets, and in the completion list (required).
tr: Parçacıklar listesinde ve tamamlama listesinde görüleceği üzere ad (zorunlu).

source: Type
tr: Tür

source: Snippets may either be defined as text templates or scripts. Both types allow to use &javascript; functions (see below for details), and can thus be used to similar effect. However, as a rule of thumb, text templates will be more suitable if you mostly want to <emphasis>insert</emphasis> text, while scripts are often an easier solution if you want to <emphasis>modify</emphasis> text).
tr: Parçacıklar metin şablonları veya betikler olarak tanımlanabilir. Her iki tür de &javascript; işlevlerinin kullanılmasına izin verir (ayrıntılar için aşağıya bakın) ve bu nedenle benzer etki için kullanılabilir. Ancak, kural olarak, çoğunlukla metin <emphasis>eklemek</emphasis> istiyorsanız metin şablonları daha uygun olacaktır; ancak <emphasis>metni değiştirmek</emphasis> istiyorsanız betikler genellikle daha kolay bir çözümdür.

source: Kate needs to be compiled against KTextEditor version 6.15.0 or higher, for this feature to be available. For earlier versions, only text template snippets can be used.
tr: Bu özelliğin kullanılabilmesi için Kate’in KTextEditor sürüm 6.15.0 veya üzeri ile derlenmesi gerekir. Daha önceki sürümler için yalnızca metin şablonu parçacıkları kullanılabilir.

source: Shortcut
tr: Kısayol

source: Pressing this shortcut will insert (or run) the snippet into the current document.
tr: Bu kısayola basmak, parçacığı geçerli belgeye ekleyecektir (veya çalıştıracaktır).

source: <guilabel>Snippet</guilabel> (type <userinput>Text Template</userinput>)
tr: <guilabel>Parçacık</guilabel> (<userinput>Metin Şablonu</userinput> türünde)

source: The text your snippet will insert into the document.
tr: Parçacığınızın belgeye ekleyeceği metin.

source: A snippet can contain editable fields. They can be cycled by pressing &Tab;. The following expressions can be used in the template text to create fields:
tr: Bir parçacık düzenlenebilir alanlar içerebilir. &Tab; düğmesine basılarak bunlar arasında geçiş yapılabilir. Alan oluşturmak için şablon metninde aşağıdaki ifadeler kullanılabilir:

source: <userinput>${<replaceable>field_name</replaceable>}</userinput> creates a simple, editable field. All subsequent occurrences of the same <replaceable>field_name</replaceable> create fields which mirror the contents of the first during editing.
tr: <userinput>${<replaceable>field_name</replaceable>}</userinput>, basit, düzenlenebilir bir alan oluşturur. Aynı <replaceable>field_name</replaceable>’in tüm sonraki oluşları, düzenleme sırasında ilkini yansılayan alanlar oluşturur.

source: Field names may contain any character except for the closing curly bracket (<userinput>}</userinput>).
tr: Alanlar, süslü kapatma ayracı dışındaki (<userinput>}</userinput>) herhangi bir karakteri içerebilirler.

source: To insert <userinput>${text}</userinput> literally in a snippet, escape the <userinput>$</userinput> sign with a backslash: <userinput>\${text}</userinput>. The text will then not be turned into a field. To insert literal backslashes before a field, escape each individual backslash: <userinput>\\${field}</userinput>, <userinput>\\\\${field}</userinput>, and so on.
tr: Bir parçacığa <userinput>${text}</userinput> girdisini düz olarak yerleştirmek için <userinput>$</userinput> işaretini bir ters eğik çizgi ile kaçırın: <userinput>\${text}</userinput>. Metin sonrasında bir alana dönüştürülmeyecektir. Bir alandan önce düz ters eğik çizgiler eklemek için her bir ters eğik çizgiyi bireysel olarak kaçırın: <userinput>\\${field}</userinput>, <userinput>\\\\${field}</userinput>, vb.

source: <userinput>${func(<replaceable>other_field1</replaceable>, <replaceable>other_field2</replaceable>, ...)}</userinput> creates a field which evaluates a &javascript; function on each edit and is replaced by that function's return value. See the <link linkend="snippet-input-library"><guilabel>Script Library</guilabel></link> tab for more information.
tr: <userinput>${func(<replaceable>diğer_alan_1</replaceable>, <replaceable>diğer_alan_2</replaceable>, …)}</userinput>, her bir düzenlemede bir &javascript; işlevini değerlendiren bir alan oluşturur ve o işlevin dönüş değeri ile değiştirilir. Daha fazla bilgi için <link linkend="snippet-input-library"><guilabel>Betik Kitaplığı</guilabel></link> sekmesine bakın.

source: <userinput>${<replaceable>field_name=default</replaceable>}</userinput> sets a default value for the field. <replaceable>default</replaceable> is a &javascript; expression. Use quotes (<userinput>${<replaceable>field_name</replaceable>=<replaceable>"text"</replaceable>}</userinput>) to specify a fixed string as the default value.
tr: <userinput>${<replaceable>field_name=default</replaceable>}</userinput>, alan için öntanımlı bir değer ayarlar. <replaceable>default</replaceable> bir &javascript; ifadesidir. Öntanımlı değer olarak sabit bir dizi belirtmek için tırnak işaretleri (<userinput>${<replaceable>field_name</replaceable>=<replaceable>"text"</replaceable>}</userinput>) kullanın.

source: When using default values (<userinput>${<replaceable>field_name=default</replaceable>}</userinput>), keep in mind that the default value is evaluated immediately when the snippet is inserted into the document, and it is not updated later when fields are changed.
tr: Öntanımlı değerleri kullanırken (<userinput>${<replaceable>field_name=default</replaceable>}</userinput>), parçacık belgeye yerleştirildiğinde öntanımlı değerin anında değerlendirildiğini ve alanlar sonradan değiştiğinde güncellenmediğini aklınızda tutun.

source: You can reference other fields in default values if they are defined before the default value that is being evaluated. However, this will only give you access to the default value of these fields.
tr: Değerlendirilen öntanımlı değerden önce tanımlanmışlarsa öntanımlı değerlerdeki diğer alanlara da başvurabilirsiniz. Ancak bu, yalnızca bu alanların öntanımlı değerine erişmenizi sağlar.

source: If no custom default value is defined, the default value is a field's name.
tr: Özel bir öntanımlı değer tanımlanmamışsa öntanımlı değer bir alanın adıdır.

source: <userinput>${cursor}</userinput> marks the end position of the cursor after everything else was filled in. Inserting text at this position will finish editing. Plus after pressing &Esc; to finish editing, the cursor will jump to this position.
tr: <userinput>${cursor}</userinput>, her şey doldurulduktan sonra imlecin bitiş konumunu imler. Bu konuma bir metin yerleştirmek düzenlemeyi bitirir. Ek olarak, düzenlemeyi bitirmek için &Esc; düğmesine basınca imleç bu konuma atlar.

source: <guilabel>Snippet</guilabel> (type <userinput>Script</userinput>)
tr: <guilabel>Parçacık</guilabel> (<userinput>Betik</userinput> türünde)

source: The &javascript; code to evaluate for this snippet
tr: Bu parçacık için değerlendirilecek &javascript; kodu.

source: If this code contains a <userinput>return</userinput> statement, the returned string will be inserted at the current cursor position. You can also use the <ulink url="help:/katepart/dev-scripting.html#dev-scripting-api">&kate; scripting API</ulink> to modify the document directly.
tr: Bu kod bir <userinput>dönüş</userinput> ifadesi içeriyorsa döndürülen dizi, geçerli imleç konumuna yerleştirilir. Ayrıca belgeyi doğrudan düzenlemek için <ulink url="help:/katepart/dev-scripting.html#dev-scripting-api">&kate; betik yazımı API’sini</ulink> de kullanabilirsiniz.

source: Additionally, your code may use functions defined in the <link linkend="snippet-input-library"><guilabel>Script Library</guilabel></link> tab, which are shared between all snippets in a repository.
tr: Ek olarak, kodunuz, bir depodaki tüm parçacıklar tarafından ortak kullanılan <link linkend="snippet-input-library"><guilabel>Betik Kitaplığı</guilabel></link> sekmesinde tanımlı işlevleri de kullanabilir.

source: Script Library
tr: Betik Kitaplığı

source: &javascript; helper functions to use in your snippets. These functions are shared between all snippets in a repository.
tr: &javascript; parçacıklarınızda kullanmak üzere yardımcı işlevler. Bu işlevler, bir depodaki tüm parçacıklar tarafından ortak kullanılır.

source: You can use the <ulink url="help:/katepart/dev-scripting.html#dev-scripting-api">&kate; scripting API</ulink> to get the selected text, full text, file name, and more by using the appropriate methods of the <userinput>document</userinput> and <userinput>view</userinput> objects. Refer to the scripting API documentation for more information.
tr: <ulink url="help:/katepart/dev-scripting.html#dev-scripting-api">&kate; Betik Yazımı API’si</ulink> kullanılarak seçili metni, tam metni, dosya adını ve daha fazlasını <userinput>document</userinput> ve <userinput>view</userinput> nesnelerinin uygun yöntemlerini kullanarak elde edebilirsiniz. Daha fazla bilgi için betik yazımı API’si belgelendirmesine bakın.

source: When a function is called in a field of a <userinput>Text Template</userinput> snippet, its <emphasis>return</emphasis> value is inserted into the text.
tr: Bir <userinput>Metin Şablonu</userinput> parçacığının alanında bir işlev çağrıldığında onun <emphasis>dönüş</emphasis> değeri metne yerleştirilir.

source: Using functions in <userinput>Text Template</userinput> snippets:
tr: <userinput>Metin Şablonu</userinput> parçacıklarındaki işlevleri kullanmak:

source: Functions can access the up-to-date contents of all fields through the <userinput>fields</userinput> object: use <userinput>fields.my_field</userinput> or <userinput>fields["my_field"]</userinput>. When using a function as the default value for a field, only fields defined in the text before are available.
tr: İşlevler, <userinput>alanlar</userinput> nesnesi ile tüm alanların güncel içeriğine erişebilirler: <userinput>fields.alanım</userinput> veya <userinput>fields["alanım"]</userinput> kullanın. Bir alanın öntanımlı değeri olarak bir işlev kullanırken yalnızca daha önce metinde tanımlanmış alanlar kullanılabilirdir.

source: Fields can be passed as arguments to functions. The field name can be used directly if it is a valid &javascript; identifier and no variable with that name exists. Otherwise use the <userinput>fields</userinput> object: <userinput>${func(field)}</userinput>, <userinput>${func(fields.document)}</userinput>, <userinput>${func(fields["my field"])}</userinput>
tr: Alanlar, işlevlere argüman olarak geçirilebilirler. Geçerli bir &javascript; tanımlayıcısıysa ve aynı adlı başka bir değişken yoksa alan adı doğrudan kullanılabilir. Aksi takdirde <userinput>alanlar</userinput> nesnesini kullanın: <userinput>${func(field)}</userinput>, <userinput>${func(fields.document)}</userinput>, <userinput>${func(fields["alanım"])}</userinput>

source: Function fields (e.g. <userinput>${func()}</userinput>) are re-evaluated every time any field's contents are changed. However, this does not apply to function calls in default values: they are only evaluated once when the snippet is inserted into the document.
tr: İşlev alanları (örneğin, <userinput>${func()}</userinput>), herhangi bir alanın içeriği değiştirildiğinde her zaman yeniden değerlendirilirler. Ancak, bu, öntanımlı değerlerdeki işlev çağrılarına işlemez: Onlar, parçacık belgeye yerleştirildiğinde yalnızca bir kez değerlendirilirler.

source: For more complex scripts it may be important to understand that <emphasis>first</emphasis>, the raw snippet is inserted into the document, and <emphasis>then</emphasis> functions are being evaluated. E.g., if a function retrieves the text on the line where the snippet is being inserted, that text will also contain <userinput>${functionCall()}</userinput>. Where this causes complications, consider using a <userinput>Script</userinput>-type snippet, instead.
tr: Daha karmaşık betikler için <emphasis>önce</emphasis> ham parçacığın belgeye eklendiğini ve <emphasis>sonrasında</emphasis> işlevlerin değerlendirildiğini anlamak önemlidir; örneğin, bir işlev, parçacığın eklendiği satırdaki metni alıyorsa o metin ayrıca <userinput>${functionCall()}</userinput> içerecektir. Bu durum karmaşıklığa yol açıyorsa bunun yerine <userinput>Betik</userinput> türünde bir parçacık kullanmayı düşünün.

source: To simply wrap the currently selected text into tags, use: <userinput>&lt;strong&gt;${view.selectedText()}&lt;/strong&gt;</userinput>
tr: Geçerli olarak seçili metni künyelere sarmak için şunu kullanın: <userinput>&lt;strong&gt;${view.selectedText()}&lt;/strong&gt;</userinput>

source: Remember that only the <emphasis>return value</emphasis> of a function is inserted in a field.
tr: Yalnızca bir işlevin <emphasis>dönüş değerinin</emphasis> bir alana yerleştirildiğini anımsayın.

source: Description
tr: Açıklama

source: An optional description of what this snippet does. This will be shown in tooltips. The description may contain basic HTML formatting.
tr: Bu parçacığın ne yaptığına dair isteğe bağlı bir açıklama. Bu, araç ipuçlarında gösterilecektir. Açıklama, temel HTML biçimlendirmesi içerebilir.

source: Usage example
tr: Kullanım örneği

source: The following example invokes a script that wraps the selected text, or - if there is no selection - a default text, into tags (Snippet type <userinput>Script</userinput>):
tr: Aşağıdaki örnek, seçili metni veya —eğer seçim yoksa— öntanımlı metni künyelere saran bir betiği çağırır (<userinput>Betik</userinput> parçacık türünde):

source: Using Snippets
tr: Parçacıkları Kullanmak

source: &kate; Snippets in Action
tr: &kate; Parçacıkları Çalışırken

source: Accessing &kate; Snippets from a tool view and a drop down menu.
tr: &kate; parçacıklarına bir araç görünümünden ve açılır menüden erişmek.

source: Selecting from a list of snippets.
tr: Bir parçacıklar listesinden seçmek.

source: You can call snippets in several ways:
tr: Parçacıkları birkaç yolla çağırabilirsiniz:

source: By clicking on the snippet from the tool view.
tr: Araç görünümünden parçacığın üzerine tıklayarak,

source: Using a keyboard shortcut, if you have assigned one.
tr: Atanmış bir tane varsa bir klavye kısayolu kullanarak.

source: While writing, you can press <keycombo action="simul">&Ctrl; &Space;</keycombo>, which will display all the snippets in a convenient window from which you can choose. This key combination provides functionality similar to code completion.
tr: Yazı yazarken, <keycombo action="simul">&Ctrl; &Space;</keycombo> kısayoluna bastığınızda, parçacıkları içinden seçebileceğiniz kullanışlı bir pencere görüntülenir. Bu düğme kombinasyonu, kod tamamlamaya benzer bir işlevsellik sunar.

source: If the snippet contains variables (besides <literal>${cursor}</literal>) the cursor will automatically go to the first occurrence of a variable and will wait for you to write something. When you are done, you can press &Tab; to move to the next variable, and so on.
tr: Parçacık değişkenler içeriyorsa (<literal>${cursor}</literal> dışında) imleç otomatik olarak bir değişkenin ilk geçtiği yere gidecek ve bir şey yazmanızı bekleyecektir. İşiniz bittiğinde bir sonraki değişkene geçmek için &Tab; düğmesine basabilirsiniz.

source: &kate; Snippets was written by Joseph Wenninger.
tr: &kate; Parçacıkları, Joseph Wenninger tarafından yazıldı.

source: Keyboard Macros Plugin
tr: Klavye Makroları Eklentisi

source: Record and play keyboard macros (i.e., keyboard action sequences).
tr: Klavye makroları kaydet ve oynat (örn. klavye eylem sıralamaları)

source: Basic usage
tr: Temel kullanım

source: To start recording a keyboard macro:
tr: Bir klavye makrosu kaydetmeye başlamak için:

source: <menuchoice><guimenu>Tools</guimenu><guimenuitem>Keyboard Macros</guimenuitem><guimenuitem>Record Macro...</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;&Shift;<keycap>K</keycap></keycombo>).
tr: <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Klavye Makroları</guimenuitem><guimenuitem>Makro Kaydet…</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;&Shift;<keycap>K</keycap></keycombo>).

source: The plugin will record every key presses until you end recording.
tr: Eklenti, siz kaydı bitirene kadar her düğme basışınızı kaydedecektir.

source: To end recording:
tr: Kaydı bitirmek için:

source: <menuchoice><guimenu>Tools</guimenu><guimenuitem>Keyboard Macros</guimenuitem><guimenuitem>End Macro Recording</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;&Shift;<keycap>K</keycap></keycombo>).
tr: <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Klavye Makroları</guimenuitem><guimenuitem>Makro Kaydını Sonlandır</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;&Shift;<keycap>K</keycap></keycombo>).

source: The plugin will stop recording key presses and save the sequence as the current macro.
tr: Eklenti, düğme basışlarını kaydetmeyi durduracak ve sırayı geçerli makro olarak kaydedecektir.

source: To cancel recording:
tr: Kaydı iptal etmek için:

source: <menuchoice><guimenu>Tools</guimenu><guimenuitem>Keyboard Macros</guimenuitem><guimenuitem>Cancel Macro Recording</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;&Alt;&Shift;<keycap>K</keycap></keycombo>).
tr: <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Klavye Makroları</guimenuitem><guimenuitem>Makro Kaydını İptal Et</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;&Alt;&Shift;<keycap>K</keycap></keycombo>).

source: The plugin will stop recording key presses but the current macro won't change.
tr: Eklenti düğme basışlarını kaydetmeyi durdurur; ancak mevcut geçerli değişmez.

source: To play the current macro:
tr: Geçerli makroyu oynatmak için:

source: <menuchoice><guimenu>Tools</guimenu><guimenuitem>Keyboard Macros</guimenuitem><guimenuitem>Play Macro</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;&Alt;<keycap>K</keycap></keycombo>).
tr: <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Klavye Makroları</guimenuitem><guimenuitem>Makroyu Oynat</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;&Alt;<keycap>K</keycap></keycombo>).

source: The plugin will play the current macro.
tr: Eklenti geçerli makroyu oynatır.

source: The <userinput>kmplay</userinput> command without any arguments will also play the current macro.
tr: <userinput>kmplay</userinput> komutu da herhangi bir argüman olmadan geçerli makroyu oynatır.

source: Named macros
tr: Adlı makrolar

source: It is possible to save keyboard macros by giving them a name.
tr: Onlara bir ad vererek klavye makroları kaydedilebilir.

source: Named macros are persistent between Kate's sessions, they're saved in the <filename>keyboardmacros.json</filename> file in Kate's user data directory (usually <filename>~/.local/share/kate/</filename>).
tr: Adlı makrolar Kate oturumları arasında kalıcıdır ve Kate’in kullanıcı verileri dizinindeki <filename>keyboardmacros.json</filename> dosyasına kaydedilirler (genellikle <filename>~/.local/share/kate/</filename>).

source: To save the current macro:
tr: Geçerli makroyu kaydetmek için:

source: <menuchoice><guimenu>Tools</guimenu><guimenuitem>Keyboard Macros</guimenuitem><guimenuitem>Save Current Macro</guimenuitem></menuchoice> (<keycombo action="simul">&Alt;&Shift;<keycap>K</keycap></keycombo>).
tr: <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Klavye Makroları</guimenuitem><guimenuitem>Geçerli Makroyu Kaydet</guimenuitem></menuchoice> (<keycombo action="simul">&Alt;&Shift;<keycap>K</keycap></keycombo>).

source: The plugin will prompt you for a name and save the macro under it.
tr: Eklenti sizden bir ad isteyecek ve makroyu onun altına kaydedecektir.

source: The <userinput>kmsave <replaceable>name</replaceable></userinput> command will save the current macro under the name <userinput><replaceable>name</replaceable></userinput>.
tr: <userinput>kmsave <replaceable>ad</replaceable></userinput> komutu, geçerli makroyu <userinput><replaceable>ad</replaceable></userinput> olarak kaydeder.

source: To load a saved macro as the current one:
tr: Kaydedilen bir makroyu geçerli olarak yüklemek için:

source: <menuchoice><guimenu>Tools</guimenu><guimenuitem>Keyboard Macros</guimenuitem><guimenuitem>Load Named Macro...</guimenuitem></menuchoice>.
tr: <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Klavye Makroları</guimenuitem><guimenuitem>Adlı Makroyu Yükle…</guimenuitem></menuchoice>.

source: The plugin lists saved macros as items in this submenu, activating an item will load the corresponding macro as the current one.
tr: Eklenti, kaydedilen makroları bu alt menüde ögeler olarak listeler; bir ögenin etkinleştirilmesi, karşılık gelen makroyu geçerli makro olarak yükleyecektir.

source: The <userinput>kmload <replaceable>name</replaceable></userinput> command will load the macro saved under the name <userinput><replaceable>name</replaceable></userinput> as the current one.
tr: <userinput>kmload <replaceable>ad</replaceable></userinput> komutu, <userinput><replaceable>ad</replaceable></userinput> altında kayıtlı makroyu geçerli makro olarak yükler.

source: To play a saved macro without loading it:
tr: Kayıtlı bir makroyu onu yüklemeden oynatmak için:
