Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_development.po
Languages: tr

source: Cursor(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>);
tr: Cursor(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>);

source: Constructor. Returns a Cursor at position (line, column).
tr: Yapıcı. Belirli bir konumda (satır, sütun) bir imleç döndürür.

source: Example: <function>var cursor = new Cursor(3, 42);</function>
tr: Örnek: <function>var cursor = new Cursor(3, 42);</function>

source: Cursor(<parameter>Cursor <replaceable>other</replaceable></parameter>);
tr: Cursor(<parameter>Cursor <replaceable>diğer</replaceable></parameter>);

source: Copy constructor. Returns a copy of the cursor <replaceable>other</replaceable>.
tr: Yapıcıyı kopyala. <replaceable>diğer</replaceable> imlecinin bir kopyasını döndürür.

source: Example: <function>var copy = new Cursor(other);</function>
tr: Örnek: <function>var copy = new Cursor(other);</function>

source: Returns a clone of the cursor.
tr: İmlecin bir klonunu döndürür.

source: Example: <function>var clone = cursor.clone();</function>
tr: Örnek: <function>var clone = cursor.clone();</function>

source: Cursor.setPosition(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>);
tr: Cursor.setPosition(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>);

source: Sets the cursor position to <replaceable>line</replaceable> and <replaceable>column</replaceable>.
tr: İmleç konumunu <replaceable>satır</replaceable> ve <replaceable>sütun</replaceable> olarak ayarlar.

source: Since: &kde; 4.11
tr: Eklendiği sürüm: &kde; 4.11

source: Check whether the cursor is valid. The cursor is invalid, if line and/or column are set to <literal>-1</literal>.
tr: İmlecin geçerli olup olmadığını denetler. Satır ve/veya sütun <literal>-1</literal> olarak ayarlanırsa imleç geçersizdir.

source: Example: <function>var valid = cursor.isValid();</function>
tr: Örnek: <function>var valid = cursor.isValid();</function>

source: Returns a new invalid cursor located at <literal>(-1, -1)</literal>.
tr: <literal>(-1, -1)</literal> konumunda yeni geçersiz bir imleç döndürür.

source: Example: <function>var invalidCursor = cursor.invalid();</function>
tr: Örnek: <function>var invalidCursor = cursor.invalid();</function>

source: int Cursor.compareTo(<parameter>Cursor <replaceable>other</replaceable></parameter>);
tr: int Cursor.compareTo(<parameter>Cursor <replaceable>diğer</replaceable></parameter>);

source: Compares this cursor to the cursor <replaceable>other</replaceable>. Returns
tr: Bu imleci <replaceable>diğer</replaceable> imleç ile karşılaştırır. İmleç,

source: <literal>-1</literal>, if this cursor is located before the cursor <replaceable>other</replaceable>,
tr: <replaceable>diğer</replaceable> imlecinden önce konumlandırılmışsa <literal>-1</literal>,

source: <literal>0</literal>, if both cursors equal and
tr: her iki imleç de eşitse <literal>0</literal> ve

source: <literal>+1</literal>, if this cursor is located after the cursor <replaceable>other</replaceable>.
tr: bu imleç <replaceable>other</replaceable> imlecinden önce geliyorsa <literal>+1</literal> döndürür.

source: bool Cursor.equals(<parameter>Cursor <replaceable>other</replaceable></parameter>);
tr: bool Cursor.equals(<parameter>Cursor <replaceable>diğer</replaceable></parameter>);

source: Returns <literal>true</literal>, if this cursor and the cursor <replaceable>other</replaceable> are equal, otherwise <literal>false</literal>.
tr: Bu imleç ve <replaceable>diğer</replaceable> imleç eşitse <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: Returns the cursor as a string of the form <quote><literal>Cursor(line, column)</literal></quote>.
tr: İmleci, <quote><literal>Cursor(satır, sütun)</literal></quote> biçiminde bir dizi olarak döndürür.

source: The Range Prototype
tr: Erim Prototipi

source: Constructor. Calling <literal>new Range()</literal> returns a Range at (0, 0) - (0, 0).
tr: Yapıcı. <literal>new Range()</literal> çağırmak, (0, 0)–(0, 0) konumunda bir erim döndürür.

source: Range(<parameter>Cursor <replaceable>start</replaceable></parameter>, <parameter>Cursor <replaceable>end</replaceable></parameter>);
tr: Range(<parameter>Cursor <replaceable>başlangıç</replaceable></parameter>, <parameter>Cursor <replaceable>bitiş</replaceable></parameter>);

source: Constructor. Calling <literal>new Range(<replaceable>start</replaceable>, <replaceable>end</replaceable>)</literal> returns the Range (<replaceable>start</replaceable>, <replaceable>end</replaceable>).
tr: Yapıcı. <literal>new Range(<replaceable>başlangıç</replaceable>, <replaceable>bitiş</replaceable>)</literal> çağırmak, (<replaceable>başlangıç</replaceable>, <replaceable>bitiş</replaceable>) erimini döndürür.

source: Range(<parameter>int <replaceable>startLine</replaceable></parameter>, <parameter>int <replaceable>startColumn</replaceable></parameter>, <parameter>int <replaceable>endLine</replaceable></parameter>, <parameter>int <replaceable>endColumn</replaceable></parameter>);
tr: Range(<parameter>int <replaceable>başlangıçSatırı</replaceable></parameter>, <parameter>int <replaceable>başlangıçSütunu</replaceable></parameter>, <parameter>int <replaceable>bitişSatırı</replaceable></parameter>, <parameter>int <replaceable>bitişSütunu</replaceable></parameter>);

source: Constructor. Calling <literal>new Range(<replaceable>startLine</replaceable>, <replaceable>startColumn</replaceable>, <replaceable>endLine</replaceable>, <replaceable>endColumn</replaceable>)</literal> returns the Range from (<replaceable>startLine</replaceable>, <replaceable>startColumn</replaceable>) to (<replaceable>endLine</replaceable>, <replaceable>endColumn</replaceable>).
tr: Yapıcı. <literal>new Range(<replaceable>başlangıçSatırı</replaceable>, <replaceable>başlangıçSütunu</replaceable>, <replaceable>bitişSatırı</replaceable>, <replaceable>bitişSütunu</replaceable>)</literal> çağırmak, (<replaceable>başlangıçSatırı</replaceable>, <replaceable>başlangıçSütunu</replaceable>) değerlerini (<replaceable>bitişSatırı</replaceable>, <replaceable>bitişSütunu</replaceable>) olarak döndürür.

source: Range(<parameter>Range <replaceable>other</replaceable></parameter>);
tr: Range(<parameter>Range <replaceable>diğer</replaceable></parameter>);

source: Copy constructor. Returns a copy of Range <replaceable>other</replaceable>.
tr: Yapıcıyı kopyala. <replaceable>diğer</replaceable> eriminin bir kopyasını döndürür.

source: Returns a clone of the range.
tr: Erimin bir klonunu döndürür.

source: Example: <function>var clone = range.clone();</function>
tr: Örnek: <function>var clone = range.clone();</function>

source: Returns <literal>true</literal>, if the start and end cursors are equal.
tr: Başlangıç ve bitiş imleçleri eşitse <literal>true</literal> döndürür.

source: Example: <function>var empty = range.isEmpty();</function>
tr: Örnek: <function>var empty = range.isEmpty();</function>

source: Returns <literal>true</literal>, if both start and end cursor are valid, otherwise <literal>false</literal>.
tr: Hem başlangıç hem bitiş imleçleri eşitse <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: Example: <function>var valid = range.isValid();</function>
tr: Örnek: <function>var valid = range.isValid();</function>

source: Returns the Range from (-1, -1) to (-1, -1).
tr: (-1, -1) ile (-1, -1) arasındaki erimi döndürür.

source: bool Range.contains(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: bool Range.contains(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Returns <literal>true</literal>, if this range contains the cursor position, otherwise <literal>false</literal>.
tr: Eğer bu erim imleç konumunu içeriyorsa <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: bool Range.contains(<parameter>Range <replaceable>other</replaceable></parameter>);
tr: bool Range.contains(<parameter>Range <replaceable>diğer</replaceable></parameter>);

source: Returns <literal>true</literal>, if this range contains the Range <replaceable>other</replaceable>, otherwise <literal>false</literal>.
tr: Eğer bu erim <replaceable>diğer</replaceable> erimini içeriyorsa <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: bool Range.containsColumn(<parameter>int <replaceable>column</replaceable></parameter>);
tr: bool Range.containsColumn(<parameter>int <replaceable>sütun</replaceable></parameter>);

source: Returns <literal>true</literal>, if <replaceable>column</replaceable> is in the half open interval <literal>[start.column, end.column)</literal>, otherwise <literal>false</literal>.
tr: <replaceable>sütun</replaceable>, yarı açık <literal>[başlangıç.sütun, bitiş.sütun)</literal> aralığındaysa <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: bool Range.containsLine(<parameter>int <replaceable>line</replaceable></parameter>);
tr: bool Range.containsLine(<parameter>int <replaceable>satır</replaceable></parameter>);

source: Returns <literal>true</literal>, if <replaceable>line</replaceable> is in the half open interval <literal>[start.line, end.line)</literal>, otherwise <literal>false</literal>.
tr: <replaceable>satır</replaceable>, yarı açık <literal>[başlangıç.satır, bitiş.satır)</literal> aralığındaysa <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: bool Range.overlaps(<parameter>Range <replaceable>other</replaceable></parameter>);
tr: bool Range.overlaps(<parameter>Range <replaceable>diğer</replaceable></parameter>);

source: Returns <literal>true</literal>, if this range and the range <replaceable>other</replaceable> share a common region, otherwise <literal>false</literal>.
tr: Bu erim ve <replaceable>diğer</replaceable> erimi ortak bir bölge paylaşıyorlarsa <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: bool Range.overlapsLine(<parameter>int <replaceable>line</replaceable></parameter>);
tr: bool Range.overlapsLine(<parameter>int <replaceable>satır</replaceable></parameter>);

source: Returns <literal>true</literal>, if <replaceable>line</replaceable> is in the interval <literal>[start.line, end.line]</literal>, otherwise <literal>false</literal>.
tr: <replaceable>satır</replaceable>, <literal>[başlangıç.satır, bitiş.satır)</literal> aralığındaysa <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: bool Range.overlapsColumn(<parameter>int <replaceable>column</replaceable></parameter>);
tr: bool Range.overlapsColumn(<parameter>int <replaceable>sütun</replaceable></parameter>);

source: Returns <literal>true</literal>, if <replaceable>column</replaceable> is in the interval <literal>[start.column, end.column]</literal>, otherwise <literal>false</literal>.
tr: <replaceable>sütun</replaceable>, <literal>[başlangıç.sütun, bitiş.sütun)</literal> aralığındaysa <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: Returns <literal>true</literal>, if the range starts and ends at the same line, &ie; if <replaceable>Range.start.line == Range.end.line</replaceable>.
tr: Erim aynı satırda başlıyor ve bitiyorsa <literal>true</literal> döndürür; &ie;, <replaceable>Range.start.line == Range.end.line</replaceable> ise.

source: Since: &kde; 4.9
tr: Eklendiği sürüm: &kde; 4.9

source: bool Range.equals(<parameter>Range <replaceable>other</replaceable></parameter>);
tr: bool Range.equals(<parameter>Range <replaceable>diğer</replaceable></parameter>);

source: Returns <literal>true</literal>, if this range and the Range <replaceable>other</replaceable> are equal, otherwise <literal>false</literal>.
tr: Eğer bu erim ve <replaceable>diğer</replaceable> erimi eşitse <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: Returns the range as a string of the form <quote><literal>Range(Cursor(line, column), Cursor(line, column))</literal></quote>.
tr: Erimi, <quote><literal>Cursor(satır, sütun)</literal></quote> biçiminde bir dizi olarak döndürür.

source: Global Functions
tr: Global İşlevler

source: This section lists all global functions.
tr: Bu bölüm, tüm global işlevleri listeler.

source: Reading &amp; Including Files
tr: Dosyaları Okumak ve İçermek

source: String read(<parameter>String <replaceable>file</replaceable></parameter>);
tr: String read(<parameter>String <replaceable>dosya</replaceable></parameter>);

source: Will search the given <replaceable>file</replaceable> relative to the <literal>katepart5/script/files</literal> directory and return its content as a string.
tr: Verilen <replaceable>dosya</replaceable>’yı <literal>katepart5/script/files</literal> dizinine göreceli olarak arar ve içeriğini bir dizi olarak döndürür.

source: void require(<parameter>String <replaceable>file</replaceable></parameter>);
tr: void require(<parameter>String <replaceable>dosya</replaceable></parameter>);

source: Will search the given <replaceable>file</replaceable> relative to the <literal>katepart5/script/libraries</literal> directory and evaluate it. <literal>require</literal> is internally guarded against multiple inclusions of the same <replaceable>file</replaceable>.
tr: Verilen <replaceable>dosya</replaceable>’yı <literal>katepart5/script/libraries</literal> dizinine göreceli olarak arar ve onu değerlendirir. <literal>require</literal>, aynı <replaceable>dosya</replaceable>’nın birden çok içerilmesine karşı korumalıdır.

source: Since: &kde; 4.10
tr: Eklendiği sürüm: &kde; 4.10

source: Debugging
tr: Hata Ayıklama

source: void debug(<parameter>String <replaceable>text</replaceable></parameter>);
tr: void debug(<parameter>String <replaceable>metin</replaceable></parameter>);

source: Prints <replaceable>text</replaceable> to <literal>stdout</literal> in the console launching the application.
tr: <replaceable>metin</replaceable>’i, uygulamayı başlatan konsolda <literal>stdout</literal>’a yazdırır.

source: Translation
tr: Çeviri

source: In order to support full localization, there are several functions to translate strings in scripts, namely <literal>i18n</literal>, <literal>i18nc</literal>, <literal>i18np</literal> and <literal>i18ncp</literal>. These functions behave exactly like <ulink url="https://techbase.kde.org/Development/Tutorials/Localization/i18n"> &kde;'s translation functions</ulink>.
tr: Tam yerelleştirmeyi desteklemek için betiklerdeki dizileri çevirmek üzere birkaç işlev bulunur; bunlar, <literal>i18n</literal>, <literal>i18nc</literal>, <literal>i18np</literal> ve <literal>i18ncp</literal> olarak geçer. Bunlar kesin olarak <ulink url="https://techbase.kde.org/Development/Tutorials/Localization/i18n"> &kde;’nin çeviri işlevleri</ulink> gibi davranırlar.

source: The translation functions translate the wrapped strings through &kde;'s translation system to the language used in the application. Strings in scripts being developed in the official &kappname; sources are automatically extracted and translatable. In other words, as a &kappname; developer you do not have to bother with message extraction and translation. It should be noted though, that the translation only works inside the &kde; infrastructure, &ie;, new strings in 3rd-party scripts developed outside of &kde; are not translated. Therefore, please consider contributing your scripts to &kate; such that proper translation is possible.
tr: Çeviri işlevleri, sarılmış dizileri &kde;’nin çeviri sistemi aracılığıyla uygulamada kullanılan dile çevirir. Resmi &kappname; kaynaklarında geliştirilen komut dosyalarındaki dizeler otomatik olarak çıkarılır ve çevrilebilir. Başka bir deyişle, bir &kappname; geliştiricisi olarak ileti çıkarma ve çeviri ile uğraşmanıza gerek yoktur. Bununla birlikte, çevirinin yalnızca &kde; altyapısı içinde çalıştığını, yani &kde; dışında geliştirilen 3. taraf betiklerdeki yeni dizilerin çevrilmediğini de belirtmek gerekir. Bu nedenle, doğru çevirinin olabilmesi için lütfen betiklerinizle &kate;’e katkıda bulunmayı düşünün.

source: void i18n(<parameter>String <replaceable>text</replaceable></parameter>, <replaceable>arg1</replaceable>, ...);
tr: void i18n(<parameter>String <replaceable>metin</replaceable></parameter>, <replaceable>arg1</replaceable>, …);

source: Translates <replaceable>text</replaceable> into the language used by the application. The arguments <replaceable>arg1</replaceable>, ..., are optional and used to replace the placeholders <literal>%1</literal>, <literal>%2</literal>, &etc;
tr: <replaceable>metin</replaceable>’i, uygulama tarafından kullanılan dile çevirir. <replaceable>arg1</replaceable>, …, argümanları isteğe bağlıdır ve <literal>%1</literal>, <literal>%2</literal>, gibi yer tutucuları değiştirmede kullanılırlar.

source: void i18nc(<parameter>String <replaceable>context</replaceable></parameter>, <parameter>String <replaceable>text</replaceable></parameter>, <replaceable>arg1</replaceable>, ...);
tr: void i18nc(<parameter>String <replaceable>bağlam</replaceable></parameter>, <parameter>String <replaceable>metin</replaceable></parameter>, <replaceable>arg1</replaceable>, …);

source: Translates <replaceable>text</replaceable> into the language used by the application. Additionally, the string <replaceable>context</replaceable> is visible to translators so they can provide a better translation. The arguments <replaceable>arg1</replaceable>, ..., are optional and used to replace the placeholders <literal>%1</literal>, <literal>%2</literal>, &etc;
tr: <replaceable>metin</replaceable>’i, uygulama tarafından kullanılan dile çevirir. Ek olarak, <replaceable>bağlam</replaceable> metni çevirmenlere görünür, böylece daha iyi bir çeviri sağlayabilirler. <replaceable>arg1</replaceable>, …, argümanları isteğe bağlıdır ve <literal>%1</literal>, <literal>%2</literal>, gibi yer tutucuları değiştirmede kullanılırlar.

source: void i18np(<parameter>String <replaceable>singular</replaceable></parameter>, <parameter>String <replaceable>plural</replaceable></parameter>, <parameter>int <replaceable>number</replaceable></parameter>, <replaceable>arg1</replaceable>, ...);
tr: void i18np(<parameter>String <replaceable>tekil</replaceable></parameter>, <parameter>String <replaceable>çoğul</replaceable></parameter>, <parameter>int <replaceable>sayı</replaceable></parameter>, <replaceable>arg1</replaceable>, …);

source: Translates either <replaceable>singular</replaceable> or <replaceable>plural</replaceable> into the language used by the application, depending on the given <replaceable>number</replaceable>. The arguments <replaceable>arg1</replaceable>, ..., are optional and used to replace the placeholders <literal>%1</literal>, <literal>%2</literal>, &etc;
tr: <replaceable>tekil</replaceable> veya <replaceable>çoğul</replaceable> varyantları, verilen <replaceable>sayı</replaceable>’ya bağlı olarak uygulama tarafından kullanılan dile çevirir. <replaceable>arg1</replaceable>, …, argümanları isteğe bağlıdır ve <literal>%1</literal>, <literal>%2</literal>, gibi yer tutucuları değiştirmede kullanılırlar.

source: void i18ncp(<parameter>String <replaceable>context</replaceable></parameter>, <parameter>String <replaceable>singular</replaceable></parameter>, <parameter>String <replaceable>plural</replaceable></parameter>, <parameter>int <replaceable>number</replaceable></parameter>, <replaceable>arg1</replaceable>, ...);
tr: void i18ncp(<parameter>String <replaceable>bağlam</replaceable></parameter>, <parameter>String <replaceable>tekil</replaceable></parameter>, <parameter>String <replaceable>çoğul</replaceable></parameter>, <parameter>int <replaceable>sayı</replaceable></parameter>, <replaceable>arg1</replaceable>, …);

source: Translates either <replaceable>singular</replaceable> or <replaceable>plural</replaceable> into the language used by the application, depending on the given <replaceable>number</replaceable>. Additionally, the string <replaceable>context</replaceable> is visible to translators so they can provide a better translation. The arguments <replaceable>arg1</replaceable>, ..., are optional and used to replace the placeholders <literal>%1</literal>, <literal>%2</literal>, &etc;
tr: <replaceable>tekil</replaceable> veya <replaceable>çoğul</replaceable> varyantları, verilen <replaceable>sayı</replaceable>’ya bağlı olarak uygulama tarafından kullanılan dile çevirir. Ek olarak, <replaceable>bağlam</replaceable> metni çevirmenlere görünür, böylece daha iyi bir çeviri sağlayabilirler. <replaceable>arg1</replaceable>, …, argümanları isteğe bağlıdır ve <literal>%1</literal>, <literal>%2</literal>, gibi yer tutucuları değiştirmede kullanılırlar.

source: The View API
tr: Görünüm API’si

source: Whenever a script is being executed, there is a global variable <quote><literal>view</literal></quote> representing the current active editor view. The following is a list of all available View functions.
tr: Ne zaman bir betik yürütülürse geçerli etkin düzenleyici görünümünü temsil eden bir <quote><literal>view</literal></quote> global değişkeni vardır. Tüm kullanılabilir View işlevleri aşağıda listelenmiştir.

source: Copy the selection if there is one, otherwise the current line if the option <userinput>[ ] Copy/Cut the current line if no selection</userinput> is set.
tr: <userinput>[ ] Metin seçilmeden çağrılırsa geçerli satırı kes/kopyala</userinput> ayarlıysa bir seçim varken seçimi kopyala, aksi takdirde geçerli satırı kopyala.

source: Since: &kde-frameworks; 5.79
tr: Eklendiği sürüm: &kde-frameworks; 5.79

source: Cut the selection if there is one, otherwise the current line if the option <userinput>[ ] Copy/Cut the current line if no selection</userinput> is set.
tr: <userinput>[ ] Metin seçilmeden çağrılırsa geçerli satırı kes/kopyala</userinput> ayarlıysa bir seçim varken seçimi kes, aksi takdirde geçerli satırı kes.

source: Paste the clipboard content.
tr: Pano içeriğini yapıştır.

source: Returns the current cursor position in the view.
tr: Görünümdeki geçerli imleç konumunu döndürür.

source: void view.setCursorPosition(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); void view.setCursorPosition(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: void view.setCursorPosition(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); void view.setCursorPosition(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Set the current cursor position to either (line, column) or to the given cursor.
tr: Geçerli imleç konumunu ya (satır, sütun) ya da verilen imlece ayarla.

source: Returns the virtual cursor position with each tab counting the corresponding amount of spaces depending on the current tab width.
tr: Geçerli sekme genişliğine bağlı olarak her sekmenin karşılık gelen boşluk miktarını saydığı sanal imleç konumunu döndürür.

source: void view.setVirtualCursorPosition(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); void view.setVirtualCursorPosition(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: void view.setVirtualCursorPosition(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); void view.setVirtualCursorPosition(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Set the current virtual cursor position to (line, column) or to the given cursor.
tr: Geçerli sanal imleç konumunu (satır, sütun) veya verilen imleç olarak ayarlayın.
