Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_plugins.po
Languages: tr

source: This button will cause the folder view to <command>cd</command> to the folder of the currently active document if possible. This button is disabled, if the active document is a new, unsaved file, or the folder in which it resides can not be decided.
tr: Bu düğme, klasör görünümünün olanaklıysa o anda etkin olan belgenin klasörüne <command>cd</command> yapmasını sağlar. Etkin belge yeni kaydedilmemiş bir dosyaysa veya içinde bulunduğu klasör belirlenemiyorsa bu düğme devre dışı bırakılır.

source: Options
tr: Seçenekler

source: Short View
tr: Kısa Görünüm

source: Displays only the filenames.
tr: Yalnızca dosya adlarını görüntüler.

source: Detailed View
tr: Ayrıntılı Görünüm

source: Displays <guilabel>Name</guilabel>, <guilabel>Date</guilabel> and <guilabel>Size</guilabel> of the files.
tr: Dosyaların; <guilabel>Ad</guilabel>, <guilabel>Tarih</guilabel> ve <guilabel>Boyutu</guilabel> özelliklerini görüntüler.

source: Tree View
tr: Ağaç Görünümü

source: Like Short View, but folders can be expanded to view their contents.
tr: Kısa Görünüm gibi; ancak klasörler içeriklerini görüntülemek için genişletilebilir.

source: Detailed Tree View
tr: Ayrıntılı Ağaç Görünümü

source: This also allows folders to be expanded, but displays the additional columns available in Detailed View.
tr: Bu aynı zamanda klasörlerin genişletilmesine de olanak tanır; ancak Ayrıntılı Görünüm’de kullanılabilir olan ek sütunları görüntüler.

source: Show Hidden Files
tr: Gizli Dosyaları Göster

source: Displays files normally hidden by your &OS;.
tr: Normalde &OS; tarafından gizlenen belgeleri görüntüler.

source: Automatically synchronize with current document
tr: Geçerli belge ile kendiliğinden eşzamanla

source: When this option is enabled the filesystem browser will automatically <command>cd</command> to the folder of the document currently open in the editing area every time it changes.
tr: Bu seçenek etkinleştirildiğinde, dosya sistemi tarayıcısı her değişiklikte kendiliğinden düzenleme alanında açık olan belgenin klasörüne <command>cd</command> yapar.

source: A Location Entry
tr: Bir Konum Girdisi

source: This displays a breadcrumb navigation to the currently open folder, similarly to &dolphin;. You can click on a any folder to browse to it, or click on one of the arrows to the left of a folder to select any folders beneath it. You may also select from your list of Places by clicking the leftmost icon in the breadcrumb navigation, which displays an icon that represents your current Place.
tr: Bu, &dolphin;’e benzer şekilde, o anda açık olan klasöre yönelik bir ekmek kırıntısı dolaşımı görüntüler. Göz atmak için herhangi bir klasöre veya altındaki herhangi bir klasörü seçmek için klasörün solundaki oklardan birine tıklayabilirsiniz. Şu anki Yerinizi temsil eden bir simgeyi görüntüleyen ekmek kırıntısı dolaşımında en soldaki simgeyi tıklayarak da Yerler listenizden seçim yapabilirsiniz.

source: You can also click to the right of the breadcrumbs to change them to a text box where you can type the path of a folder to browse. The &URL; entry maintains a list of previously typed paths. To choose one, use the arrow button to the right of the entry.
tr: Ayrıca, göz atılacak klasörün yolunu yazabileceğiniz bir metin kutusuna dönüştürmek için ekmek kırıntılarının sağına da tıklayabilirsiniz. &URL; girdisi, önceden yazılan yolların bir listesini tutar. Birini seçmek için girdinin sağındaki ok düğmesini kullanın.

source: The &URL; entry has folder auto-completion. The completion method can be set using the &RMB; menu of the text entry.
tr: &URL; girdisinde klasör kendiliğinden tamamlama özelliği vardır. Tamamlama yöntemi, metin girişinin &RMB; menüsü kullanılarak ayarlanabilir.

source: A Folder View
tr: Bir Klasör Görünümü

source: This is a standard &kde; folder view.
tr: Bu, standart bir &kde; klasör görünümüdür.

source: A Filter Entry
tr: Bir Süzgeç Girdisi

source: The Filter entry allows you to enter a filter for the files displayed in the folder view. The filter uses standard globs; patterns must be separated by white space. Example: <userinput>*.cpp *.h *.moc</userinput>
tr: Süzgeç girdisi, klasör görünümünde görüntülenen dosyalar için bir süzgeç girmenizi sağlar. Süzgeç, standart global ayarları kullanır; dizgiler boşlukla ayrılmalıdır. Örnek: <userinput>*.cpp *.h *.moc</userinput>

source: To display all files, enter a single asterisk <userinput>*</userinput>.
tr: Tüm dosyaları görüntülemek için tek bir <userinput>*</userinput> kullanın.

source: The filter entry saves the last 10 filters entered between sessions. To use one, press the arrow button on the right of the entry and select the desired filter string. You can disable the filter by pressing the <guibutton>Clear text</guibutton> button to the left of the autocompletion arrow button.
tr: Süzgeç girdisi, oturumlar arasında girilen son 10 süzgeci kaydeder. Birini kullanmak için girdinin sağındaki ok düğmesine basın ve istediğiniz süzgeç dizisini seçin. Kendiliğinden tamamlama ok düğmesinin solundaki <guibutton>Metni temizle</guibutton> düğmesine basarak süzgeci devre dışı bırakabilirsiniz.

source: This plugin can be configured on the <guilabel>Filesystem Browser</guilabel> page of <link linkend="configuring-kate-configdialog">&kate;'s configuration</link>.
tr: Bu eklenti, <link linkend="configuring-kate-configdialog">&kate; yapılandırmasının</link> <guilabel>Dosya Sistemi Tarayıcısı</guilabel> sayfasında yapılandırılabilir.

source: Toolbar
tr: Araç Çubuğu

source: Configure the buttons on the Filesystem Browser toolbar by moving the ones you want enabled to the <guilabel>Selected Actions</guilabel> list, and order them using the arrow buttons at the side of the list.
tr: Etkinleştirilmesini istediğiniz düğmeleri <guilabel>Seçili Eylemler</guilabel> listesine taşıyarak Dosya Sistemi Tarayıcısı araç çubuğundaki düğmeleri yapılandırın ve listenin yan tarafındaki ok düğmelerini kullanarak bunları sıralayın.

source: The Documents List
tr: Belgeler Listesi

source: Documents list
tr: Belgeler listesi

source: The documents list displays a list of all documents currently open in &kate;. Modified files will have a small <guiicon>floppy disk</guiicon> icon on their left to indicate that state.
tr: Belgeler listesi, o anda &kate;’de açık olan tüm belgelerin bir listesini görüntüler. Değiştirilen dosyaların sol tarafında bu durumu belirtmek için küçük bir <guiicon>disket</guiicon> simgesi bulunur.

source: On the top the Documents list has a toolbar with the following buttons:
tr: Belgeler listesinin üst kısmında aşağıdaki düğmeleri içeren bir araç çubuğu bulunur:

source: <guiicon><inlinemediaobject><imageobject><imagedata fileref="document-new-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Create new document
tr: <guiicon><inlinemediaobject><imageobject><imagedata fileref="document-new-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Yeni belge oluştur

source: <guiicon><inlinemediaobject><imageobject><imagedata fileref="document-open-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Open an existing document
tr: <guiicon><inlinemediaobject><imageobject><imagedata fileref="document-open-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Var olan bir belgeyi aç

source: <guiicon><inlinemediaobject><imageobject><imagedata fileref="go-up-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Previous Document
tr: <guiicon><inlinemediaobject><imageobject><imagedata fileref="go-up-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Önceki Belge

source: <guiicon><inlinemediaobject><imageobject><imagedata fileref="go-down-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Next Document
tr: <guiicon><inlinemediaobject><imageobject><imagedata fileref="go-down-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Sonraki Belge

source: <guiicon><inlinemediaobject><imageobject><imagedata fileref="document-save-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Save the current document
tr: <guiicon><inlinemediaobject><imageobject><imagedata fileref="document-save-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Geçerli belgeyi kaydet

source: <guiicon><inlinemediaobject><imageobject><imagedata fileref="document-save-as-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Save the current document under a new name
tr: <guiicon><inlinemediaobject><imageobject><imagedata fileref="document-save-as-22.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> Geçerli belgeyi yeni bir adla kaydet

source: By default, the Documents list appears in <guimenuitem>Tree Mode</guimenuitem>, which displays the folder structure surrounding all currently open documents. Also available is <guimenuitem>List Mode</guimenuitem>, which displays a simple list of all open documents. You can switch modes by right-clicking on the list and selecting from the <guisubmenu>View Mode</guisubmenu> menu.
tr: Öntanımlı olarak Belgeler Listesi, o anda açık olan tüm belgeleri çevreleyen klasör yapısını görüntüleyen <guimenuitem>Ağaç Kipi</guimenuitem>’nde görünür. Ayrıca tüm açık belgelerin basit bir listesini görüntüleyen <guimenuitem>Liste Kipi</guimenuitem> de kullanılabilir. Listeye sağ tıklayıp <guisubmenu>Görüntüleme Kipi</guisubmenu> menüsünden seçim yaparak kipleri değiştirebilirsiniz.

source: If two or more files with the same name (located in different folders) are open in <guimenuitem>List Mode</guimenuitem>, the names of the second will be prepended <quote>(2)</quote> and so on. The tool-tip for the file will display its full name including the path, allowing you to choose the desired one.
tr: <guimenuitem>Liste Kipi</guimenuitem>’nde farklı klasörlerde bulunan aynı adlı iki dosya açıksa ikinci dosyanın adının sonuna <quote>(2)</quote> ve artan sayılar iliştirilecektir. Dosyanın araç ipucu, yol da içerilmek üzere tam adını görüntüleyecek ve istediğiniz dosyayı seçmenize olanak tanıyacaktır.

source: To display a document in the currently active frame, click the document name in the list.
tr: Bir belgeyi o anda etkin olan çerçevede görüntülemek için listedeki belge adına tıklayın.

source: The context menu has some common actions from the <guimenu>File</guimenu> menu.
tr: Bağlam menüsünde <guimenu>Dosya</guimenu> menüsündeki bazı ortak işlemler bulunur.

source: Additionally there are filemanager actions to rename or delete the file. With <guimenuitem>Copy Location</guimenuitem> you can copy the full path of the document to the clipboard.
tr: Ayrıca dosyayı yeniden adlandırmak veya silmek için dosya yöneticisi eylemleri vardır. <guimenuitem>Konumu Kopyala</guimenuitem> ile belgenin tam yolunu panoya kopyalayabilirsiniz.

source: You can sort the list in a few different ways by right clicking the list and selecting from the <guisubmenu>Sort By</guisubmenu> menu. The options are:
tr: Listeye sağ tıklayıp <guisubmenu>Şuna Göre Sırala</guisubmenu> menüsünden seçim yaparak listeyi birkaç farklı şekilde sıralayabilirsiniz. Seçenekler şunlardır:

source: Document Name
tr: Belge Adı

source: Lists the documents alphabetically by their name.
tr: Belgeleri adlarına göre abecesel olarak listeler.

source: Document Path
tr: Belge Yolu

source: Lists the documents alphabetically by the path to them.
tr: Belgeleri yollarına göre abecesel olarak listeler.

source: Opening Order
tr: Açma Sırası

source: Lists the documents in the order of opening.
tr: Belgeleri açılış sıralarına göre listeler.

source: The document list will per default visualize your history by shading the entries for the most recent documents with a background color. If the document was edited, an extra color is blended in. The most recent document has the strongest color, so that you can easily find the documents you are working on. This feature can be disabled in the <link linkend="config-dialog-documents">Documents</link> page of the configuration dialog.
tr: Belge listesi öntanımlı olarak, en yeni belgelerin girdilerini bir arka plan rengiyle gölgeleyerek geçmişinizi görselleştirecektir. Belge düzenlenmişse fazladan bir renk eklenir. En yeni belge en güçlü renge sahiptir, böylece üzerinde çalıştığınız belgeleri kolayca bulabilirsiniz. Bu özellik, yapılandırma iletişim kutusunun <link linkend="config-dialog-documents">Belgeler</link> sayfasında devre dışı bırakılabilir.

source: The default location of the document list in the &kate; window is to the left of the editing area.
tr: &kate; penceresindeki belge listesinin öntanımlı konumu düzenleme alanının soludur.

source: <shortcut> <keycombo action="simul">&Alt;&Up;</keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Previous Document</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;&Up;</keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Önceki Belge</guimenuitem>

source: Opens the document displayed above the currently open document in the Documents list.
tr: Belgeler listesinde o anda açık olan belgenin üzerinde görüntülenen belgeyi açar.

source: <shortcut> <keycombo action="simul">&Alt;&Down;</keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Next Document</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;&Down;</keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Sonraki Belge</guimenuitem>

source: Opens the document displayed below the currently open document in the Documents list.
tr: Belgeler listesinde o anda açık olan belgenin altında görüntülenen belgeyi açar.

source: <guimenu>View</guimenu> <guimenuitem>Show Active</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Etkin Belgeyi Göster</guimenuitem>

source: Displays the currently open document in the Documents list.
tr: Şu anda açık olan belgeyi Belgeler listesinde görüntüler.

source: Background Shading
tr: Arka Plan Gölgelendirme

source: This section allows you to enable or disable the background shading visualization of your recent activity, and choose which colors to use if enabled.
tr: Bu bölüm, son etkinliğinizin arka plan gölgelendirme görselleştirmesini etkinleştirmenize veya devre dışı bırakmanıza ve etkinleştirildiğinde hangi renklerin kullanılacağını seçmenize olanak tanır.

source: Sort By
tr: Şuna Göre Sırala

source: Set how you want the document list sorted. This can be set from the &RMB; menu in the document list as well.
tr: Belge listesinin nasıl sıralanmasını istediğinizi ayarlayın. Bu, belge listesindeki &RMB; menüsünden de ayarlanabilir.

source: View Mode
tr: Görüntüleme Kipi

source: This provides two options that effect the display of the Documents tool view. The <guilabel>Tree View</guilabel> option will display the documents in a tree underneath the folders they are in, while the <guilabel>List View</guilabel> option will display a flat list of documents.
tr: Bu, Belgeler aracı görünümünün görüntülenmesini etkileyen iki seçenek sunar. <guilabel>Ağaç Görünümü</guilabel> seçeneği, belgeleri bulundukları klasörlerin altındaki bir ağaçta görüntülerken, <guilabel>Liste Görünümü</guilabel> seçeneği belgelerin düz bir listesini görüntüler.

source: Show Full Path
tr: Tam Yolu Göster

source: When Tree View and this option are enabled, the folder entries displayed in the Documents tool view will display the full filesystem path to the folder in addition to the name of the folder. It has no effect in List View.
tr: Ağaç Görünümü ve bu seçenek etkinleştirildiğinde, Belgeler aracı görünümünde görüntülenen klasör girdileri, klasörün adına ek olarak klasöre giden tam dosya sistemi yolunu da görüntüler. Liste Görünümü’nde hiçbir etkisi yoktur.

source: Show Toolbar
tr: Araç Çubuğunu Göster

source: When Tree View and this option are enabled, a toolbar with actions like <guibutton>Save</guibutton> is displayed above the list of documents. Uncheck this option if the toolbar should be hidden.
tr: Ağaç Görünümü ve bu seçenek etkinleştirildiğinde, belge listesinin üzerinde <guibutton>Kaydet</guibutton> gibi eylemlerin bulunduğu bir araç çubuğu görüntülenir. Araç çubuğunun gizlenmesi gerekiyorsa bu seçeneğin işaretini kaldırın.

source: Show Close Button
tr: Kapat Düğmesini Göster

source: When this option is enabled, &kate; will show a close button for opened documents on hover.
tr: Bu seçenek etkinleştirildiğinde &kate;, fareyle üzerine gelindiğinde açılan belgeler için bir kapatma düğmesi gösterecektir.

source: &gdb; Plugin
tr: &gdb; Eklentisi

source: Previous experience with &gdb; is strongly recommended. For more information on using &gdb;, visit <ulink url="https://www.gnu.org/software/gdb/">the &gdb; website</ulink>.
tr: Öncesinde &gdb; kullanımı hakkında bilgi sahibi olmanız şiddetle önerilir. &gdb; kullanımı üzerine daha fazla bilgi için <ulink url="https://www.gnu.org/software/gdb/">&gdb; web sitesini</ulink> ziyaret edin.

source: You can enable the &gdb; plugin in <link linkend="config-dialog-plugins">the Plugins section of &kate;'s configuration</link>.
tr: &gdb; eklentisini, &kate; yapılandırmasının <link linkend="config-dialog-plugins">Eklentiler</link> bölümünden etkinleştirebilirsiniz.

source: If you compile using &gcc;/<command>g++</command> you might want to use the <command><parameter>-ggdb</parameter></command> command line argument.
tr: &gcc;/<command>g++</command> kullanarak derliyorsanız <command><parameter>-ggdb</parameter></command> komut satırı argümanını kullanmak isteyebilirsiniz.

source: Menu and Toolbar Structure
tr: Menü ve Araç Çubuğu Yapısı

source: All of these options are available in &kate;'s menus, and many are available on the Debug toolbar as well.
tr: Bu seçeneklerin tümüne &kate;’in menülerinden ve çoğuna Hata Ayıklama araç çubuğundan da ulaşılabilir.

source: <guimenu>View</guimenu><guisubmenu>Tool View</guisubmenu><guimenuitem>Show Debug View</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guisubmenu>Araç Görünümleri</guisubmenu><guimenuitem>Hata Ayıklama</guimenuitem>

source: Shows a tool view containing &gdb; output, the &gdb; command line used, and other settings.
tr: &gdb; çıktısını, kullanılan &gdb; komut satırını ve diğer ayarları içeren bir araç görünümü gösterir.

source: <guimenu>View</guimenu><guisubmenu>Tool View</guisubmenu><guimenuitem>Show Locals and Stack</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guisubmenu>Araç Görünümleri</guisubmenu><guimenuitem>Yereller ve Yığın</guimenuitem>

source: Shows a list of all currently loaded variables and their values and a &gdb; backtrace.
tr: Şu anda yüklü tüm değişkenleri, onların değerlerini ve bir &gdb; geri izini gösterir.

source: <guimenu>Debug</guimenu><guisubmenu>Targets</guisubmenu>
tr: <guimenu>Hata Ayıklama</guimenu><guisubmenu>Hedefler</guisubmenu>

source: A submenu containing a list of targets (executables).
tr: Hedeflerin (yürütülebilirlerin) bir listesini içeren bir alt menü.

source: <guimenu>Debug</guimenu><guimenuitem>Start Debugging</guimenuitem>
tr: <guimenu>Hata Ayıklama</guimenu><guimenuitem>Hata Ayıklamayı Başlat</guimenuitem>

source: Starts &gdb; with a target.
tr: &gdb;’yi bir hedef ile başlatır.

source: <guimenu>Debug</guimenu><guimenuitem>Kill / Stop Debugging</guimenuitem>
tr: <guimenu>Hata Ayıklama</guimenu><guimenuitem>Hata Ayıklamayı Öldür/Durdur</guimenuitem>

source: Stops &gdb;.
tr: &gdb;’yi durdurur.

source: <guimenu>Debug</guimenu><guimenuitem>Restart Debugging</guimenuitem>
tr: <guimenu>Hata Ayıklama</guimenu><guimenuitem>Hata Ayıklamayı Yeniden Başlat</guimenuitem>

source: Restarts &gdb;.
tr: &gdb;’yi yeniden başlatır.

source: <guimenu>Debug</guimenu><guimenuitem>Toggle Breakpoint / Break</guimenuitem>
tr: <guimenu>Hata Ayıklama</guimenu><guimenuitem>Kesme Noktası-Kesme Ekle/Kaldır</guimenuitem>

source: Set a breakpoint at the current cursor position.
tr: Geçerli imleç konumuna bir kesme noktası ekleyin/kaldırın.

source: <guimenu>Debug</guimenu><guimenuitem>Step In</guimenuitem>
tr: <guimenu>Hata Ayıklama</guimenu><guimenuitem>İçeri Gir</guimenuitem>

source: Execute the present statement (function call will be debugged).
tr: Geçerli ifadeyi yürütün (işlev çağrısında hata ayıklama gerçekleştirilecek).

source: <guimenu>Debug</guimenu><guimenuitem>Step Over</guimenuitem>
tr: <guimenu>Hata Ayıklama</guimenu><guimenuitem>Üzerinden Geç</guimenuitem>

source: Execute the present statement (function call will not be debugged).
tr: Geçerli ifadeyi yürütün (işlev çağrısında hata ayıklama gerçekleştirilmeyecek).

source: <guimenu>Debug</guimenu><guimenuitem>Step Out</guimenuitem>
tr: <guimenu>Hata Ayıklama</guimenu><guimenuitem>Dışarı Çık</guimenuitem>

source: Resumes execution until the program that is executing terminates.
tr: Yürütme işlemi sonlanana kadar yürütmeyi sürdürür.

source: <guimenu>Debug</guimenu><guimenuitem>Move PC</guimenuitem>
tr: <guimenu>Hata Ayıklama</guimenu><guimenuitem>Program Sayacını Taşı</guimenuitem>

source: Move program counter (next execution).
tr: Program sayacını taşıyın (sonraki yürütme).

source: <guimenu>Debug</guimenu><guimenuitem>Run To Cursor</guimenuitem>
tr: <guimenu>Hata Ayıklama</guimenu><guimenuitem>İmlece Kadar Çalıştır</guimenuitem>

source: Runs the program until it reaches current cursor position.
tr: Programı, geçerli imleç konumuna kadar çalıştırır.

source: <guimenu>Debug</guimenu><guimenuitem>Continue</guimenuitem>
tr: <guimenu>Hata Ayıklama</guimenu><guimenuitem>Sürdür</guimenuitem>

source: Ignores any breakpoints and executes program until it terminates (successfully or not).
tr: Tüm kesme noktalarını yok sayar ve program sonlanana kadar onu yürütür (başarılı veya değil).

source: <guimenu>Debug</guimenu><guimenuitem>Print Value</guimenuitem>
tr: <guimenu>Hata Ayıklama</guimenu><guimenuitem>Değeri Yazdır</guimenuitem>

source: Prints the value of the variable that the cursor is currently pointing to.
tr: İmlecin şu anda işaret ettiği değişkenin değerini yazdırır.

source: <guimenu>Settings</guimenu><guisubmenu>Toolbars Shown</guisubmenu><guimenuitem>&gdb; Plugin</guimenuitem>
tr: <guimenu>Ayarlar</guimenu><guisubmenu>Gösterilen Araç Çubukları</guisubmenu><guimenuitem>Hata Ayıklama Eklentisi</guimenuitem>

source: Display the debugging toolbar.
tr: Hata ayıklama araç çubuğunu görüntüler.

source: Debug View
tr: Hata Ayıklama Görünümü

source: The <guilabel>Debug View</guilabel> tool view consists of several tabs:
tr: <guilabel>Hata Ayıklama Görünümü</guilabel> araç çubuğu, çeşitli sekmelerden oluşur:

source: &gdb; Output
tr: &gdb; Çıktısı

source: Contains output from &gdb; and a &gdb; command line.
tr: &gdb; ve &gdb; komut satırından çıktılar içerir.

source: The Output Tab
tr: Çıktı Sekmesi

source: The Output tab.
tr: Çıktı sekmesi.

source: The <guilabel>Output</guilabel> tab displaying the output from a debugging session.
tr: <guilabel>Çıktı</guilabel> sekmesi, bir hata ayıklama oturumundan gelen çıktıyı görüntüler.

source: Settings
tr: Ayarlar

source: Executable
tr: Yürütülebilir

source: Path to the target (executable) for debugging.
tr: Hata ayıklama için hedef (yürütülebilir) yolu.

source: The current working directory provided to the target.
tr: Hedefe sağlanan geçerli çalışma dizini.

source: Arguments
tr: Argümanlar

source: Arguments passed to the program.
tr: Programa geçirilen argümanlar.

source: Keep focus
tr: Odağı tut

source: Keeps focus on the &gdb; command line.
tr: Odağı &gdb; komut satırında tutun.

source: Redirect IO
tr: Girdi-Çıktı’yı Yeniden Yönlendir

source: Opens a new <guilabel>IO</guilabel> tab in the <guilabel>Debug View</guilabel> where you can view output and provide input to the running program.
tr: <guilabel>Hata Ayıklama Görünümü</guilabel>’nde, çıktıyı görebileceğiniz ve çalışan programa girdi sağlayabileceğiniz yeni bir <guilabel>Girdi-Çıktı</guilabel> sekmesi açar.

source: <screeninfo>The Settings dialog</screeninfo>
tr: <screeninfo>Ayarlar iletişim kutusu</screeninfo>
