Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_development.po
Languages: tr

source: <userinput>hidden</userinput> defines whether the name should appear in &kappname;'s menus.
tr: <userinput>hidden</userinput>, adın &kappname; menülerinde görünüp görünmeyeceğini tanımlar.

source: So the next line may look like this:
tr: Böylece, bir sonraki satır böyle görünebilir:

source: Next comes the <userinput>highlighting</userinput> element, which contains the optional element <userinput>list</userinput> and the required elements <userinput>contexts</userinput> and <userinput>itemDatas</userinput>.
tr: Sonrasında <userinput>highlighting</userinput> ögesi gelir. Bu öge, isteğe bağlı <userinput>list</userinput> ögesini ve zorunlu <userinput>contexts</userinput> ve <userinput>itemDatas</userinput> ögelerini içerir.

source: <userinput>list</userinput> elements contain a list of keywords. In this case the keywords are <emphasis>class</emphasis> and <emphasis>const</emphasis>. You can add as many lists as you need.
tr: <userinput>list</userinput> ögeleri bir anahtar sözcükler listesi içerir. Bu durumda, anahtar sözcükler <emphasis>class</emphasis> ve <emphasis>const</emphasis> olur. İstediğiniz kadar liste ekleyebilirsiniz.

source: Since &kde-frameworks; 5.53, a list can include keywords from another list or language/file, using the <userinput>include</userinput> element. <userinput>##</userinput> is used to separate the list name and the language definition name, in the same way as in the <userinput>IncludeRules</userinput> rule. This is useful to avoid duplicating keyword lists, if you need to include the keywords of another language/file. For example, the <emphasis>othername</emphasis> list contains the <emphasis>str</emphasis> keyword and all the keywords of the <emphasis>types</emphasis> list, which belongs to the <emphasis>ISO C++</emphasis> language.
tr: &kde-frameworks; 5.53 sürümünden bu yana, bir liste, başka bir listeden ve/veya dilden/dosyadan <userinput>include</userinput> ögesini kullanarak anahtar sözcükler içerebilirler. <userinput>IncludeRules</userinput> kuralında olduğu gibi, <userinput>##</userinput>, liste adını ve dil tanımını ayırmak için kullanılır. Bu, başka bir dilin/dosyanın anahtar sözcüklerini içermeniz gerekiyorsa yinelenen anahtar sözcük listelerini önlemek için yararlıdır. Örneğin, <emphasis>othername</emphasis> listesi, <emphasis>ISO C++</emphasis> diline ait olan <emphasis>str</emphasis> anahtar sözcüğünü ve <emphasis>types</emphasis> listesinin tüm anahtar sözcüklerini içerir.

source: The <userinput>contexts</userinput> element contains all contexts. The first context is by default the start of the highlighting. There are two rules in the context <emphasis>Normal Text</emphasis>, which match the list of keywords with the name <emphasis>somename</emphasis> and a rule that detects a quote and switches the context to <emphasis>string</emphasis>. To learn more about rules read the next chapter.
tr: <userinput>contexts</userinput> ögesi tüm bağlamları içerir. İlk bağlam, öntanımlı olarak, vurgulamanın başlangıcıdır. <emphasis>Normal Text</emphasis> adlı bağlamda iki adet kural vardır: <emphasis>somename</emphasis> adındaki bir kuralla eşleşen anahtar sözcükler ve bir tırnağı algılayıp bağlamı <emphasis>string</emphasis> yapan başka bir tanesi. Kurallar hakkında daha fazla bilgi almak için sonraki fasılı okuyun.

source: The third part is the <userinput>itemDatas</userinput> element. It contains all color and font styles needed by the contexts and rules. In this example, the <userinput>itemData</userinput> <emphasis>Normal Text</emphasis>, <emphasis>String</emphasis> and <emphasis>Keyword</emphasis> are used.
tr: Üçüncü kısımsa <userinput>itemDatas</userinput> ögesidir. Bağlamlar ve kurallar tarafından gereksinim duyulan tüm renk ve yazıtipi biçemlerini içerir. Bu örnekte, <userinput>itemData</userinput> <emphasis>Normal Text</emphasis>, <emphasis>String</emphasis> ve <emphasis>Keyword</emphasis> kullanılmıştır.

source: The last part of a highlight definition is the optional <userinput>general</userinput> section. It may contain information about keywords, code folding, comments, indentation, empty lines and spell checking.
tr: Bir vurgu tanımının son kısmı ise isteğe bağlı olan <userinput>general</userinput> bölümüdür. Anahtar sözcükler, kod katlama, yorumlar, girintileme, boş satırlar ve yazım denetim üzerine bilgiler içerir.

source: The <userinput>comment</userinput> section defines with what string a single line comment is introduced. You also can define a multiline comment using <emphasis>multiLine</emphasis> with the additional attribute <emphasis>end</emphasis>. This is used if the user presses the corresponding shortcut for <emphasis>comment/uncomment</emphasis>.
tr: <userinput>comment</userinput> bölümü, tek bir satırlık bir yorumun hangi diziye konulduğunu tanımlar. Ayrıca, ek <emphasis>end</emphasis> özniteliği ile <emphasis>multiLine</emphasis> kullanarak çok satırlı bir yorum da tanımlayabilirsiniz. Bu, kullanıcı <emphasis>comment/uncomment</emphasis> ile ilişkili kısayola bastığı zaman kullanılır.

source: The <userinput>keywords</userinput> section defines whether keyword lists are case sensitive or not. Other attributes will be explained later.
tr: <userinput>keywords</userinput> bölümü, anahtar sözcük listelerinin BÜYÜK/küçük harf duyarlı olup olmadığını tanımlar. Diğer öznitelikler daha sonra açıklanacaktır.

source: The other sections, <userinput>folding</userinput>, <userinput>emptyLines</userinput> and <userinput>spellchecking</userinput>, are usually not necessary and are explained later.
tr: <userinput>folding</userinput>, <userinput>emptyLines</userinput> ve <userinput>spellchecking</userinput> bölümleri genelde gerekli değildir ve daha sonra açıklanacaklardır.

source: The Sections in Detail
tr: Ayrıntılı Olarak Bölümler

source: This part will describe all available attributes for contexts, itemDatas, keywords, comments, code folding and indentation.
tr: Bu kısım; bağlamlar, itemData’lar, anahtar sözcükler, yorumlar, kod katlama ve girintileme ile ilgili tüm öznitelikleri açıklar.

source: The element <userinput>context</userinput> belongs in the group <userinput>contexts</userinput>. A context itself defines context specific rules such as what should happen if the highlight system reaches the end of a line. Available attributes are:
tr: <userinput>context</userinput> ögesi, <userinput>contexts</userinput> grubuna aittir. Bağlamın kendisi, vurgu sistemi bir satırın sonuna ulaştığında ne olması gerektiği gibi bağlama özgü kuralları tanımlar. Kullanılabilir özellikler şunlardır:

source: <userinput>name</userinput> states the context name. Rules will use this name to specify the context to switch to if the rule matches.
tr: <userinput>name</userinput>, bağlam adını belirtir. Kurallar, kuralın eşleşmesi durumunda geçiş yapılacak bağlamı belirtmek için bu adı kullanır.

source: <userinput>attribute</userinput> identifies the style to use for a character when no rule matches or when a rule does not specify attribute. In the latter case, <emphasis>attribute</emphasis> of the context specified in the rule's <emphasis>context</emphasis> will be used.
tr: <userinput>attribute</userinput>, hiçbir kural eşleşmediğinde veya bir kural özniteliği belirtilmediğinde bir karakter için kullanılacak biçemi tanımlar. Sonraki durumda, kuralın <emphasis>context</emphasis>’inde belirtilen <emphasis>attribute</emphasis> kullanılır.

source: <userinput>lineEndContext</userinput> defines the context the highlight system switches to if it reaches the end of a line. This may either be a name of another context, <userinput>#stay</userinput> to not switch the context (&eg;. do nothing) or <userinput>#pop</userinput> which will cause it to leave this context. It is possible to use for example <userinput>#pop#pop#pop</userinput> to pop three times, or even <userinput>#pop#pop!OtherContext</userinput> to pop two times and switch to the context named <userinput>OtherContext</userinput>. It is also possible to switch to a context that belongs to another language definition, in the same way as in the <userinput>IncludeRules</userinput> rules, &eg;, <userinput>SomeContext##JavaScript</userinput>. Context switches are also described in <xref linkend="kate-highlight-rules-detailled"/>. Default: #stay.
tr: <userinput>lineEndContext</userinput>, vurgu sistemi satırın sonuna geldiğinde geçiş yapılacak bağlamı tanımlar. Bu, ya başka bir bağlam adı, bağlamı değiştirmemek (bir şey yapmamak) için <userinput>#stay</userinput> veya bağlamdan çıkış yapmak için <userinput>#pop</userinput> olabilir. Örneğin, üç kez <userinput>#pop#pop#pop</userinput> yapmak veya hatta iki kez <userinput>#pop#pop!OtherContext</userinput> ve <userinput>OtherContext</userinput> adlı başka bağlama geçiş yapmak da olabilir. Ayrıca başka bir dil tanımına ait olan başka bir bağlama geçiş yapmak da olanaklıdır. Bu, <userinput>IncludeRules</userinput> kuralları ile aynı tarzdadır; &eg;, <userinput>SomeContext##JavaScript</userinput>. Bağlam anahtarları ek olarak <xref linkend="kate-highlight-rules-detailled"/> içinde açıklanırlar. Öntanımlı: #stay.

source: <userinput>lineEmptyContext</userinput> defines the context if an empty line is encountered. The nomenclature of context switches is the same as previously described in <emphasis>lineEndContext</emphasis>. Default: #stay.
tr: <userinput>lineEmptyContext</userinput>, boş bir satıra rastlandığındaki bağlamı tanımlar. Bağlam anahtarlarının terminolojisi daha önce <emphasis>lineEndContext</emphasis>’te açıklananla aynıdır. Öntanımlı: #stay.

source: <userinput>fallthroughContext</userinput> specifies the next context to switch to if no rule matches. The nomenclature of context switches is the same as previously described in <emphasis>lineEndContext</emphasis>. Default: #stay.
tr: <userinput>fallthroughContext</userinput>, hiçbir kural eşleşmediğinde geçiş yapılacak sonraki bağlamı belirtir. Bağlam anahtarlarının terminolojisi daha önce <emphasis>lineEndContext</emphasis>’te açıklananla aynıdır. Öntanımlı: #stay.

source: <userinput>fallthrough</userinput> defines if the highlight system switches to the context specified in <userinput>fallthroughContext</userinput> if no rule matches. Note that since &kde; &frameworks; 5.62 this attribute is deprecated in favor of <userinput>fallthroughContext</userinput>, since if the <userinput>fallthroughContext</userinput> attribute is present it is implicitly understood that the value of <userinput>fallthrough</userinput> is <emphasis>true</emphasis>. Default: <emphasis>false</emphasis>.
tr: <userinput>fallthrough</userinput>, hiçbir kural eşleşmediğinde sistemin <userinput>fallthroughContext</userinput> içinde belirtilen geçiş yapacağı bağlamı belirtir. &kde; &frameworks; 5.62 sürümünden bu yana bu özniteliğin <userinput>fallthroughContext</userinput> namına kullanımdan kaldırıldığını aklınızdan çıkarmayın. Özellikle, <userinput>fallthroughContext</userinput> özniteliği varsa örtük olarak <userinput>fallthrough</userinput> değerinin <emphasis>true</emphasis> olacağı anlaşılır. Öntanımlı: <emphasis>false</emphasis>.

source: <userinput>noIndentationBasedFolding</userinput> disables indentation-based folding in the context. If indentation-based folding is not activated, this attribute is useless. This is defined in the element <emphasis>folding</emphasis> of the group <emphasis>general</emphasis>. Default: <emphasis>false</emphasis>.
tr: <userinput>noIndentationBasedFolding</userinput>, bu bağlamdaki girintileme tabanlı katlamayı devre dışı bırakır. Girintileme tabanlı katlama etkinleştirilmemişse bu öznitelik bir işe yaramaz. Bu, <emphasis>general</emphasis> grubunun <emphasis>folding</emphasis> ögesinde tanımlanmıştır. Öntanımlı: <emphasis>false</emphasis>.

source: The element <userinput>itemData</userinput> is in the group <userinput>itemDatas</userinput>. It defines the font style and colors. So it is possible to define your own styles and colors. However, we recommend you stick to the default styles if possible so that the user will always see the same colors used in different languages. Though, sometimes there is no other way and it is necessary to change color and font attributes. The attributes name and defStyleNum are required, the others are optional. Available attributes are:
tr: <userinput>itemData</userinput> ögesi, <userinput>itemDatas</userinput> grubundadır. Yazıtipi biçemini ve renklerini tanımlar. Böylece, kendi biçemlerinizi ve renklerinizi tanımlamanız olanaklıdır. Ancak biz yine de öntanımlı biçemlere sadık kalmanızı öneririz; böyle yaparsanız kullanıcı farklı dillerde de aynı renkleri görür. Bazen başka bir şansınız olmaz ve yazıtipi/renk özniteliklerini değiştirmeniz gerekebilir. name ve defStyleNum öznitelikleri zorunludur, diğerleri isteğe bağlıdır. Kullanılabilir öznitelikler şunlardır:

source: <userinput>name</userinput> sets the name of the itemData. Contexts and rules will use this name in their attribute <emphasis>attribute</emphasis> to reference an itemData.
tr: <userinput>name</userinput>, itemData’nın adını ayarlar. Bağlamlar ve kurallar, <emphasis>attribute</emphasis> özniteliğinde bir itemData’ya başvurmak için bu adı kullanırlar.

source: <userinput>defStyleNum</userinput> defines which default style to use. Available default styles are explained in detail later.
tr: <userinput>defStyleNum</userinput>, hangi öntanımlı biçemin kullanılacağını tanımlar. Kullanılabilir öntanımlı biçemler ilerde daha ayrıntılı açıklanır.

source: <userinput>color</userinput> defines a color. Valid formats are '#rrggbb' or '#rgb'.
tr: <userinput>color</userinput>, bir renk tanımlar. Geçerli biçimler “#rrggbb” veya “#rgb”dir.

source: <userinput>selColor</userinput> defines the selection color.
tr: <userinput>selColor</userinput>, seçim rengini tanımlar.

source: <userinput>italic</userinput> if <emphasis>true</emphasis>, the text will be italic.
tr: <userinput>italic</userinput> <emphasis>true</emphasis> ise metin yatık olur.

source: <userinput>bold</userinput> if <emphasis>true</emphasis>, the text will be bold.
tr: <userinput>bold</userinput> <emphasis>true</emphasis> ise metin kalın olur.

source: <userinput>underline</userinput> if <emphasis>true</emphasis>, the text will be underlined.
tr: <userinput>underline</userinput> <emphasis>true</emphasis> ise metnin altı çizili olur.

source: <userinput>strikeOut</userinput> if <emphasis>true</emphasis>, the text will be struck out.
tr: <userinput>strikeOut</userinput> <emphasis>true</emphasis> ise metnin üzeri çizili olur.

source: <userinput>spellChecking</userinput> if <emphasis>true</emphasis>, the text will be spellchecked.
tr: <userinput>spellChecking</userinput> <emphasis>true</emphasis> ise metnin yazımı denetlenir.

source: The element <userinput>keywords</userinput> in the group <userinput>general</userinput> defines keyword properties. Available attributes are:
tr: <userinput>general</userinput> grubundaki <userinput>keywords</userinput> ögesi, anahtar sözcük özelliklerini tanımlar. Kullanılabilir öznitelikler şunlardır:

source: <userinput>casesensitive</userinput> may be <emphasis>true</emphasis> or <emphasis>false</emphasis>. If <emphasis>true</emphasis>, all keywords are matched case sensitively.
tr: <userinput>casesensitive</userinput>, <emphasis>true</emphasis> veya <emphasis>false</emphasis> olabilir. <emphasis>true</emphasis> ise tüm anahtar sözcükler BÜYÜK/küçük harf duyarlı olarak eşlenirler.

source: <userinput>weakDeliminator</userinput> is a list of characters that do not act as word delimiters. For example, the dot <userinput>'.'</userinput> is a word delimiter. Assume a keyword in a <userinput>list</userinput> contains a dot, it will only match if you specify the dot as a weak delimiter.
tr: <userinput>weakDeliminator</userinput>, sözcük sınırlandırıcısı olarak davranmayan bir karakterler listesidir. Örneğin, <userinput>'.'</userinput> noktası bir sözcük sınırlandırıcısıdır. <userinput>list</userinput> içindeki bir anahtar sözcüğün bir nokta içerdiğini varsayalım; bu, noktayı eğer yalnızca bir zayıf sınırlandırıcı olarak tanımlarsanız eşleştirir.

source: <userinput>additionalDeliminator</userinput> defines additional delimiters.
tr: <userinput>additionalDeliminator</userinput>, ek sınırlandırıcılar tanımlar.

source: <userinput>wordWrapDeliminator</userinput> defines characters after which a line wrap may occur.
tr: <userinput>wordWrapDeliminator</userinput>, ardından bir satır kaydırma oluşabilecek karakterleri tanımlar.

source: Default delimiters and word wrap delimiters are the characters <userinput>.():!+,-&lt;=&gt;%&amp;*/;?[]^{|}~\</userinput>, space (<userinput>' '</userinput>) and tabulator (<userinput>'\t'</userinput>).
tr: Öntanımlı sınırlandırıcılar ve sözcük kaydırma sınırlandırıcıları şunlardır: <userinput>.():!+,-&lt;=&gt;%&amp;*/;?[]^{|}~\</userinput>, boşluk (<userinput>' '</userinput>) ve sekmelendirici (<userinput>'\t'</userinput>).

source: The element <userinput>comment</userinput> in the group <userinput>comments</userinput> defines comment properties which are used for <menuchoice><guimenu>Tools</guimenu><guimenuitem>Comment</guimenuitem></menuchoice>, <menuchoice><guimenu>Tools</guimenu><guimenuitem>Uncomment</guimenuitem></menuchoice> and <menuchoice><guimenu>Tools</guimenu><guimenuitem>Toggle Comment</guimenuitem></menuchoice>. Available attributes are:
tr: <userinput>comments</userinput> grubundaki <userinput>comment</userinput> ögesi; <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Yorum</guimenuitem></menuchoice>, <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Yorumu Kapat</guimenuitem></menuchoice> ve <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Yorumu Aç/Kapat</guimenuitem></menuchoice> seçenekleri için kullanılan yorum özelliklerini tanımlar. Kullanılabilir öznitelikler şunlardır:

source: <userinput>name</userinput> is either <emphasis>singleLine</emphasis> or <emphasis>multiLine</emphasis>. If you choose <emphasis>multiLine</emphasis> the attributes <emphasis>end</emphasis> and <emphasis>region</emphasis> are required. If you choose <emphasis>singleLine</emphasis> you can add the optional attribute <emphasis>position</emphasis>.
tr: <userinput>name</userinput>, ya <emphasis>singleLine</emphasis> ya da <emphasis>multiLine</emphasis> olabilir. <emphasis>multiLine</emphasis> seçerseniz <emphasis>end</emphasis> ve <emphasis>region</emphasis> öznitelikleri zorunludur. <emphasis>singleLine</emphasis> seçerseniz isteğe bağlı olan <emphasis>position</emphasis> özniteliğini ekleyebilirsiniz.

source: <userinput>start</userinput> defines the string used to start a comment. In C++ this would be &quot;/*&quot; in multiline comments. This attribute is required for types <emphasis>multiLine</emphasis> and <emphasis>singleLine</emphasis>.
tr: <userinput>start</userinput>, bir yorum başlatmak için kullanılan diziyi tanımlar. C++ için bu, çoklu satır yorumlarda &quot;/*&quot; olur. Bu öznitelik, <emphasis>multiLine</emphasis> ve <emphasis>singleLine</emphasis> türleri için zorunludur.

source: <userinput>end</userinput> defines the string used to close a comment. In C++ this would be &quot;*/&quot;. This attribute is only available and is required for comments of type <emphasis>multiLine</emphasis>.
tr: <userinput>end</userinput>, bir yorum kapatmak için kullanılan diziyi tanımlar. C++ için bu, çoklu satır yorumlarda &quot;*/&quot; olur. Bu öznitelik, yalnızca <emphasis>multiLine</emphasis> türü yorumlar için kullanılabilir ve onun için zorunludur.

source: <userinput>region</userinput> should be the name of the foldable multiline comment. Assume you have <emphasis>beginRegion="Comment"</emphasis> ... <emphasis>endRegion="Comment"</emphasis> in your rules, you should use <emphasis>region="Comment"</emphasis>. This way uncomment works even if you do not select all the text of the multiline comment. The cursor only must be in the multiline comment. This attribute is only available for type <emphasis>multiLine</emphasis>.
tr: <userinput>region</userinput>, katlanabilir çoklu satır yorumun adı olmalıdır. Kurallarınızda <emphasis>beginRegion="Comment"</emphasis> … <emphasis>endRegion="Comment"</emphasis> olduğunu varsayalım; o zaman <emphasis>region="Comment"</emphasis> kullanmalısınız. Böylece, çoklu satır yorumun tüm metnini seçmeseniz bile yorumu kapatmak çalışır. Yalnızca, imleç çoklu satır yorumun içerisinde olmalıdır. Bu öznitelik, yalnızca <emphasis>multiLine</emphasis> türü için kullanılabilirdir.

source: <userinput>position</userinput> defines where the single line comment is inserted. By default, the single line comment is placed at the beginning of the line at column 0, but if you use <emphasis>position="afterwhitespace"</emphasis> the comment is inserted after leading whitespaces right, before the first non-whitespace character. This is useful for putting comments correctly in languages where indentation is important, such as Python or YAML. This attribute is optional and the only possible value is <emphasis>afterwhitespace</emphasis>. This is only available for type <emphasis>singleLine</emphasis>.
tr: <userinput>position</userinput>, tek satırlık yorumun nereye eklendiğini tanımlar. Öntanımlı olarak, tek satırlık yorum satırın başında 0. sütuna koyulur; ancak <emphasis>position="afterwhitespace"</emphasis> kullanırsanız yorum, ilk boş olmayan karakterden sonra sağa doğru boşluk bırakılarak eklenir. Bu; örneğin, Python veya YAML gibi girintilemenin önemli olduğu diller için kullanışlıdır. Bu öznitelik isteğe bağlıdır ve tek olası değeri <emphasis>afterwhitespace</emphasis>’dir. Bu, yalnızca <emphasis>singleLine</emphasis> türü için kullanılabilirdir.

source: The element <userinput>folding</userinput> in the group <userinput>general</userinput> defines code folding properties. Available attributes are:
tr: <userinput>general</userinput> grubundaki <userinput>folding</userinput> ögesi, kod katlama özelliklerini tanımlar. Kullanılabilir öznitelikler şunlardır:

source: <userinput>indentationsensitive</userinput> if <emphasis>true</emphasis>, the code folding markers will be added indentation based, as in the scripting language Python. Usually you do not need to set it, as it defaults to <emphasis>false</emphasis>.
tr: <userinput>indentationsensitive</userinput> <emphasis>true</emphasis> ise kod katlama imleyicileri girintileme tabanlı olarak eklenir. Örnek olarak yine Python verilebilir. Genelde öntanımlı olarak <emphasis>false</emphasis> olduğundan pek ayarlamanıza gerek olmaz.

source: The element <userinput>emptyLine</userinput> in the group <userinput>emptyLines</userinput> defines which lines should be treated as empty lines. This allows modifying the behavior of the <emphasis>lineEmptyContext</emphasis> attribute in the elements <userinput>context</userinput>. Available attributes are:
tr: <userinput>emptyLines</userinput> grubundaki <userinput>emptyLine</userinput> ögesi, hangi satırlara boş satır gibi davranılması gerektiğini tanımlar. Bu, <userinput>context</userinput> ögelerindeki <emphasis>lineEmptyContext</emphasis> özniteliğinin davranışının değiştirilmesine olanak tanır. Kullanılabilir öznitelikler şunlardır:
