Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_development.po
Languages: tr

source: Having specified the header this section explains how the indentation scripting itself works. The basic skeleton of the body looks like this: <programlisting> // required katepart js libraries, &eg; range.js if you use Range require ("range.js"); triggerCharacters = "{}/:;"; function indent(line, indentWidth, ch) { // called for each newline (ch == '\n') and all characters specified in // the global variable triggerCharacters. When calling <menuchoice><guimenu>Tools</guimenu><guimenuitem>Format Indentation</guimenuitem></menuchoice> // the variable ch is empty, i.e. ch == ''. // // see also: Scripting API return -2; } </programlisting> The function <function>indent()</function> has three parameters: <itemizedlist> <listitem><para><literal>line</literal>: the line that has to be indented</para></listitem> <listitem><para><literal>indentWidth</literal>: the indentation width in number of spaces</para></listitem> <listitem><para><literal>ch</literal>: either a newline character (<literal>ch == '\n'</literal>), the trigger character specified in <literal>triggerCharacters</literal> or empty if the user invoked the action <menuchoice><guimenu>Tools</guimenu><guimenuitem>Format Indentation</guimenuitem></menuchoice>.</para></listitem> </itemizedlist> The return value of the <function>indent()</function> function specifies how the line will be indented. If the return value is a simple integer number, it is interpreted as follows: <itemizedlist> <listitem><para>return value <literal>-2</literal>: do nothing</para></listitem> <listitem><para>return value <literal>-1</literal>: keep indentation (searches for previous non-blank line)</para></listitem> <listitem><para>return value <literal> 0</literal>: numbers &gt;= 0 specify the indentation depth in spaces</para></listitem> </itemizedlist> Alternatively, an array of two elements can be returned: <itemizedlist> <listitem><para><literal>return [ indent, align ];</literal></para></listitem> </itemizedlist> In this case, the first element is the indentation depth as above with the same meaning of the special values. However, the second element is an absolute value representing a column for <quote>alignment</quote>. If this value is higher than the indent value, the difference represents a number of spaces to be added after the indentation of the first parameter. Otherwise, the second number is ignored. Using tabs and spaces for indentation is often referred to as <quote>mixed mode</quote>.
tr: Üstbilgiyi belirledikten sonra bu bölüm girintileme betiği oluşturma işleminin nasıl çalıştığını açıklamaktadır. Gövdenin temel iskeleti şöyle görünür: <programlisting> // zorunlu katepart js kitaplıkları; &eg;, Range require ("range.js"); kullanıyorsanız range.js triggerCharacters = "{}/:;"; function indent(line, indentWidth, ch) { // triggerCharacters global değişkeninde belirtilen her bir yenisatır (ch == ’\n’) ve tüm karakterler için çağrılır. <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Girintilemeyi Biçimlendir</guimenuitem></menuchoice>, ch değişkeni boştur; demeli, ch == ’’. // // Ayrıca bakınız: Betik Yazımı API’si return -2; } </programlisting> <function>indent()</function> işlevinin üç parametresi vardır:<itemizedlist><listitem><para><literal>line</literal>: Girintilenmesi gereken satır</para></listitem><listitem><para><literal>indentWidth</literal>: Boşluk türünden girintileme genişliği</para></listitem><listitem><para><literal>ch</literal>: Ya bir yenisatır karakteri (<literal>ch == ’\n’</literal>) ya <literal>triggerCharacters</literal> içinde belirtilen tetikleyici karakter ya da kullanıcı <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Girintilemeyi Biçimlendir</guimenuitem></menuchoice> eylemini çağırdıysa boş.</para></listitem></itemizedlist><function>indent()</function> işlevinin döndürdüğü değer, satırın nasıl girintileneceğini belirtir. Dönüş değeri basit bir tamsayıysa aşağıdaki gibi değerlendirilir:<itemizedlist><listitem><para>return value <literal>-2</literal>: Bir şey yapma</para></listitem><listitem><para>return value <literal>-1</literal>: Girintilemeyi tut (önceki boş olmayan satırları arar)</para></listitem><listitem><para>return value <literal> 0</literal>: &gt;=0 sayıları, boşluk türünden girintileme derinliğini belirtir</para></listitem></itemizedlist>Alternatif olarak, iki ögeli bir diziliş döndürülebilir:<itemizedlist><listitem><para><literal>return [ indent, align ];</literal></para></listitem></itemizedlist>Bu durumda ilk öge, yukarıdaki gibi özel değerlerle aynı anlama gelen girintileme derinliğidir. Ancak ikinci öge, <quote>hizalama</quote> sütununu temsil eden mutlak bir değerdir. Bu değer girinti değerinden yüksekse, fark, ilk parametrenin girintisinden sonra eklenecek boşluk sayısını temsil eder. Aksi halde ikinci sayı dikkate alınmaz. Girintileme için sekmelerin ve boşlukların kullanılmasına genellikle <quote>karma kip</quote> adı verilir.

source: Consider the following example: Assume using tabs to indent, and tab width is set to 4. Here, &lt;tab&gt; represents a tab and '.' a space: <programlisting> 1: &lt;tab&gt;&lt;tab&gt;foobar("hello", 2: &lt;tab&gt;&lt;tab&gt;......."world"); </programlisting> When indenting line 2, the <function>indent()</function> function returns [8, 15]. As result, two tabs are inserted to indent to column 8, and 7 spaces are added to align the second parameter under the first, so that it stays aligned if the file is viewed with a different tab width.
tr: Aşağıdaki örneğe ele alın: Girintileme için sekmelerin kullanıldığını ve sekme genişliğinin 4 olduğunu varsayalım. Burada, &lt;tab&gt; bir sekmeyi ve '.' bir boşluğu temsil eder: <programlisting> 1: &lt;tab&gt;&lt;tab&gt;foobar("merhaba", 2: &lt;tab&gt;&lt;tab&gt;......."dünya"); </programlisting> 2. satırı girintilerken, <function>indent()</function> işlevi [8, 15] değerini döndürür. Sonuç olarak, 8. sütuna girinti yapmak için iki sekme eklenir ve ikinci parametreyi birincinin altına hizalamak için 7 boşluk eklenir, böylece dosya farklı bir sekme genişliğinde görüntülenirse hizalı kalır.

source: A default &kde; installation ships &kappname; with several indenters. The corresponding &javascript; source code can be found in <filename>$<envar>XDG_DATA_DIRS</envar>/katepart5/script/indentation</filename>.
tr: Öntanımlı bir &kde; kurulumu, &kappname; uygulamasını birkaç girintileyici ile kurar. Karşılık gelen &javascript; kaynak kodu <filename>$<envar>XDG_DATA_DIRS</envar>/katepart5/script/indentation</filename> konumunda bulunabilir.

source: Developing an indenter requires reloading the scripts to see whether the changes behave appropriately. Instead of restarting the application, simply switch to the command line and invoke the command <command>reload-scripts</command>.
tr: Bir girintileyici geliştirmek, değişikliklerin uygun şekilde davranıp davranmadığını görmek için betiklerin yeniden yüklenmesini gerektirir. Uygulamayı yeniden başlatmak yerine komut satırına geçin ve <command>reload-scripts</command> komutunu çağırın.

source: If you develop useful scripts please consider contributing to the &kappname; Project by <ulink url="mailto:kwrite-devel@kde.org">contacting the mailing list</ulink>.
tr: Yararlı betikler geliştiriyorsanız &kappname; uygulamasına katkıda bulunmayı düşünün. Geliştirmelerinizi <ulink url="mailto:kwrite-devel@kde.org">posta listesine gönderin</ulink>.

source: Command Line Scripts
tr: Komut Satırı Betikleri

source: A functionality similar to command line scripts is also provided in the <ulink url="help:/kate/kate-application-plugin-snippets.html">snippets plugin</ulink>. This plugin may provide an easier starting point, especially for small custom scripts.
tr: Komut satırı betiklerine benzer bir işlevsellik ayrıca <ulink url="help:/kate/kate-application-plugin-snippets.html">parçacıklar eklentisinde</ulink> sunulmaktadır. Bu eklenti, özellikle küçük özelleştirilmiş betikler için daha iyi bir başlangıç noktası sağlayabilir.

source: As it is hard to satisfy everyone's needs, &kappname; supports little helper tools for quick text manipulation through the <link linkend="advanced-editing-tools-commandline">built-in command line</link>. For instance, the command <command>sort</command> is implemented as a script. This section explains how to create <filename>*.js</filename> files to extend &kappname; with arbitrary helper scripts.
tr: Herkesin gereksinimlerini karşılamak güç olsa da, &kappname;, <link linkend="advanced-editing-tools-commandline">yerleşik komut satırı</link> ile tez metin manipülasyonunu sağlamak için küçük yardımcı araçlar sağlar. Örneğin, <command>sort</command> komutu bir betik olarak uygulanmıştır. Bu bölüm, &kappname; uygulamasını olabildiğince genişletmek için nasıl <filename>*.js</filename> dosyaları oluşturulacağını açıklar.

source: Command line scripts are located in the same folder as indentation scripts. So as a first step, create a new <filename>*.js</filename> file called <filename>myutils.js</filename> in the local home folder <filename>$<envar>XDG_DATA_HOME</envar>/katepart5/script/commands</filename>. Therein, the environment variable <envar>XDG_DATA_HOME</envar> typically expands to either <filename>~/.local</filename> or <filename>~/.local/share</filename>.
tr: Komut satırı betikleri, girintileme betikleriyle aynı klasörde bulunurlar. İlk adım olarak, yerel ana klasör olan <filename>$<envar>XDG_DATA_HOME</envar>/katepart5/script/commands</filename> klasöründe yeni bir <filename>*.js</filename> dosyası oluşturun; &eg;, <filename>izlencelerim.js</filename>. Burada, <envar>XDG_DATA_HOME</envar> çevre değişkeni genellikle <filename>~/.local</filename> veya <filename>~/.local/share</filename> olarak genişletilir.

source: On &Windows; these files are located in <filename>%USERPROFILE%\AppData\Local\katepart5\script\commands</filename>. <replaceable>%USERPROFILE%</replaceable> usually expands to <filename>C:\\Users\\<replaceable>user</replaceable></filename>.
tr: &Windows;’ta bu dosyalar genelde <filename>C:\\Users\\<replaceable>user</replaceable></filename> olarak genişleyen <filename>%USERPROFILE%\AppData\Local\katepart5\script\commands</filename>. <replaceable>%USERPROFILE%</replaceable> konumundadır.

source: The Command Line Script Header
tr: Komut Satırı Betik Üstbilgisi

source: The header of each command line script is embedded in &JSON; at the beginning of the script as follows: <programlisting> var katescript = { "author": "Example Name &lt;example.name@some.address.org&gt;", "license": "LGPLv2+", "revision": 1, "kate-version": "5.1", "functions": ["sort", "moveLinesDown"], "actions": [ { "function": "sort", "name": "Sort Selected Text", "category": "Editing", "interactive": "false" }, { "function": "moveLinesDown", "name": "Move Lines Down", "category": "Editing", "shortcut": "Ctrl+Shift+Down", "interactive": "false" } ] }; // kate-script-header, must be at the start of the file without comments </programlisting> Each entry is explained in detail now:
tr: <filename>javascript.js</filename> dosyasının üstbilgisi, aşağıdaki gibi belgenin başına &JSON; olarak gömülür: <programlisting> var katescript = { "author": "Örnek Ad &lt;örnek.ad@bir.adres.org&gt;", "license": "LGPLv2+", "revision": 1, "kate-version": "5.1", "functions": ["sort", "moveLinesDown"], "actions": [ { "function": "sort", "name": "Seçili Metni Sırala", "category": "Editing", "interactive": "false" }, { "function": "moveLinesDown", "name": "Satırları Aşağı Taşı", "category": "Editing", "shortcut": "Ctrl+Shift+Down", "interactive": "false" } ] }; // kate-script-header, dosyanın başında yorumsuz olmalıdır </programlisting> Burada her giriş ayrıntılı olarak açıklanır:

source: <literal>license</literal> [optional]: Short form of the license, such as BSD License or LGPLv2.
tr: <literal>license</literal> [isteğe bağlı]: Lisansın kısa adı; örneğin, BSD License veya LGPLv3.

source: <literal>functions</literal> [required]: &JSON; array of commands in the script.
tr: <literal>functions</literal> [zorunlu]: Betikteki komutların &JSON; dizilişi.

source: <literal>actions</literal> [optional]: &JSON; Array of &JSON; objects that defines the actions that appear in the application menu. Detailed information is provided in the section <link linkend="advanced-editing-tools-commandline">Binding Shortcuts</link>.
tr: <literal>actions</literal> [isteğe bağlı]: Uygulama menüsünde görünen eylemleri tanımlayan &JSON; nesnelerinin &JSON; dizilişi. Ayrıntılı bilgi, <link linkend="advanced-editing-tools-commandline">Kısayolları Bağıntılamak</link> bölümünde sağlanmıştır.

source: Since the value of <literal>functions</literal> is a &JSON; array, a single script is able to contain an arbitrary number of command line commands. Each function is available through &kappname;'s <link linkend="advanced-editing-tools-commandline">built-in command line</link>.
tr: <literal>functions</literal> değeri bir &JSON; dizilişi olduğundan, tek bir betik istediğiniz kadar komut satırı komutu içerebilir. Her bir işlev, &kappname; uygulamasının <link linkend="advanced-editing-tools-commandline">yerleşik komut satırından</link> kullanılabilir.

source: The Script Source Code
tr: Betik Kaynak Kodu

source: All functions specified in the header have to be implemented in the script. For instance, the script file from the example above needs to implement the two functions <command>sort</command> and <command>moveLinesDown</command>. All functions have the following syntax:
tr: Üstbilgide belirtilen tüm işlevlerin betikte uygulanması gerekir. Örneğin, yukarıdaki örnekteki komut dosyasının <command>sort</command> ve <command>moveLinesDown</command> işlevlerini uygulaması gerekir. Tüm işlevler aşağıdaki sözdizime sahiptir:

source: // required katepart js libraries, &eg; range.js if you use Range require ("range.js"); function &lt;name&gt;(arg1, arg2, ...) { // ... implementation, see also: Scripting API }
tr: // zorunlu katepart js kitaplıkları; &eg;, Range require ("range.js"); kullanıyorsanız range.js function &lt;name&gt;(arg1, arg2, …) { // … uygulama, ayrıca bakınız: Betik Yazımı API’si }

source: Arguments in the command line are passed to the function as <parameter>arg1</parameter>, <parameter>arg2</parameter>, &etc; In order to provide documentation for each command, simply implement the '<function>help</function>' function as follows: <programlisting> function help(cmd) { if (cmd == "sort") { return i18n("Sort the selected text."); } else if (cmd == "...") { // ... } } </programlisting> Executing <command>help sort</command> in the command line then calls this help function with the argument <parameter>cmd</parameter> set to the given command, &ie; <parameter>cmd == "sort"</parameter>. &kappname; then presents the returned text as documentation to the user. Make sure to <link linkend="dev-scripting-api-i18n">translate the strings</link>.
tr: Komut satırındaki argümanlar işleve <parameter>arg1</parameter>, <parameter>arg2</parameter>, vb. olarak geçirilirler. Her bir komut için belgelendirmek sağlamak istiyorsanız yalnızca '<function>help</function>' işlevini aşağıdaki gibi uygulayın: <programlisting> function help(cmd) { if (cmd == "sort") { return i18n("Seçili metni sıralayın."); } else if (cmd == "…") { // … } } </programlisting> Komut satırında <command>help sort</command> işlevini yürütmek, sonrasında bu yardım işlevini verilen komuta ayarlı <parameter>cmd</parameter> ile çağırır; &ie;, <parameter>cmd == "sort"</parameter>. &kappname; sonrasında döndürülen metni kullanıcıya belgelendirme olarak sunar. <link linkend="dev-scripting-api-i18n">Dizileri başka dillere</link> çevrilebilir yaptığınızdan emin olun.

source: Developing a command line script requires reloading the scripts to see whether the changes behave appropriately. Instead of restarting the application, simply switch to the command line and invoke the command <command>reload-scripts</command>.
tr: Bir komut satırı betiği geliştirmek, değişikliklerin uygun şekilde davranıp davranmadığını görmek için betiklerin yeniden yüklenmesini gerektirir. Uygulamayı yeniden başlatmak yerine komut satırına geçin ve <command>reload-scripts</command> komutunu çağırın.

source: Binding Shortcuts
tr: Kısayolları Bağıntılamak

source: In order to make the scripts accessible in the application menu and assign shortcuts, the script needs to provide an appropriate script header. In the above example, both functions <literal>sort</literal> and <literal>moveLinesDown</literal> appear in the menu due to the following part in the script header: <programlisting> var katescript = { ... "actions": [ { "function": "sort", "name": "Sort Selected Text", "icon": "", "category": "Editing", "interactive": "false" }, { "function": "moveLinesDown", "name": "Move Lines Down", "icon": "", "category": "Editing", "shortcut": "Ctrl+Shift+Down", "interactive": "false" } ] }; </programlisting> The fields for one action are as follows:
tr: Betiklerin uygulama menüsünden erişilebilir olmasını sağlamak ve kısayollar atamak için betiğin uygun bir betik başlığı sağlaması gerekir. Yukarıdaki örnekte, betik üstbilgisindeki aşağıdaki bölüm nedeniyle menüde hem <literal>sort</literal> hem de <literal>moveLinesDown</literal> işlevleri görünüyor: <programlisting> var katescript = { … "actions": [ { "function": "sort", "name": "Seçili Metni Sırala", "icon": "", "category": "Editing", "interactive": "false" }, { "function": "moveLinesDown", "name": "Satırları Aşağı Taşı", "icon": "", "category": "Editing", "shortcut": "Ctrl+Shift+Down", "interactive": "false" } ] }; </programlisting> Tek bir eylem için olan alanlar aşağıdaki gibidir:

source: <literal>function</literal> [required]: The function that should appear in the menu <menuchoice><guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu></menuchoice>.
tr: <literal>function</literal> [zorunlu]: <menuchoice><guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu></menuchoice> menüsünde görünmesi gereken işlev.

source: <literal>name</literal> [required]: The text appears in the script menu.
tr: <literal>name</literal> [zorunlu]: Betikler menüsünde görünen metin.

source: <literal>icon</literal> [optional]: The icon appears next to the text in the menu. All &kde; icon names can be used here.
tr: <literal>icon</literal> [isteğe bağlı]: Menüde metnin yanında görünen simge. Burada tüm &kde; simgeleri adları kullanılabilir.

source: <literal>category</literal> [optional]: If a category is specified, the script appears in a submenu.
tr: <literal>category</literal> [isteğe bağlı]: Bir kategori belirtilirse betik bir alt menüde görünür.

source: <literal>shortcut</literal> [optional]: The shortcut given here is the default shortcut. Example: <literal>Ctrl+Alt+t</literal>. See the <ulink url="https://doc.qt.io/qt-5/qt.html#Key-enum">&Qt; documentation</ulink> for further details.
tr: <literal>shortcut</literal> [isteğe bağlı]: Burada verilen kısayol, öntanımlı kısayoldur. Örnek: <literal>Kontrol+Seçenek+T</literal>. Daha fazla ayrıntı için <ulink url="https://doc.qt.io/qt-5/qt.html#Key-enum">&Qt; belgelendirmesine</ulink> bakın.

source: <literal>interactive</literal> [optional]: If the script needs user input in the command line, set this to <literal>true</literal>.
tr: <literal>interactive</literal> [isteğe bağlı]: Betiğin komut satırında kullanıcı girdisi bekleyip beklemediği. Bunu, <literal>true</literal> olarak ayarlayın.

source: Scripting API
tr: Betik Yazımı API’si

source: The scripting API presented here is available to all scripts, &ie; indentation scripts and command line commands. The <classname>Cursor</classname> and <classname>Range</classname> classes are provided by library files in <filename>$<envar>XDG_DATA_DIRS</envar>/katepart5/libraries</filename>. If you want to use them in your script, which needs to use some of the <classname>Document</classname> or <classname>View</classname> functions, please include the necessary library by using:
tr: Burada sunulan betik yazımı API’si, tüm betikler için kullanılabilirdir; &ie;, girintileme betikleri ve komut satırı betikleri. <classname>Cursor</classname> ve <classname>Range</classname> sınıfları, <filename>$<envar>XDG_DATA_DIRS</envar>/katepart5/libraries</filename> içindeki kitaplık dosyaları tarafından sağlanırlar. <classname>Document</classname> veya <classname>View</classname> işlevlerinden bazılarını kullanması gereken bu API’yi betiğinizde kullanmak istiyorsanız şunu kullanarak gerekli kitaplığı içerin:

source: // required katepart js libraries, &eg; range.js if you use Range require ("range.js");
tr: // zorunlu katepart js kitaplıkları; &eg;, Range require ("range.js"); kullanıyorsanız range.js require ("range.js");

source: To extend the standard scripting API with your own functions and prototypes simply create a new file in &kde;'s local configuration folder <filename>$<envar>XDG_DATA_HOME</envar>/katepart5/libraries</filename> and include it into your script using:
tr: Standart betik yazımı API’sini kendi işlevleriniz ve prototiplerinizle genişletmek istiyorsanız yalnızca &kde;’nin yerel yapılandırma klasörü olan <filename>$<envar>XDG_DATA_HOME</envar>/katepart5/libraries</filename> içinde yeni bir dosya oluşturun ve onu betiğinizde şunu kullanarak içerin:

source: require ("myscriptnamehere.js");
tr: require ("benimbetiğiminadıburaya.js");

source: On &Windows; these files are located in <filename>%USERPROFILE%\AppData\Local\katepart5\libraries</filename>. <replaceable>%USERPROFILE%</replaceable> usually expands to <filename>C:\\Users\\<replaceable>user</replaceable></filename>.
tr: &Windows;’ta bu dosyalar genelde <filename>C:\\Users\\<replaceable>user</replaceable></filename> olarak genişleyen <filename>%USERPROFILE%\AppData\Local\katepart5\libraries</filename>. <replaceable>%USERPROFILE%</replaceable> konumundadır.

source: To extend existing prototypes like <classname>Cursor</classname> or <classname>Range</classname>, the recommended way is to <emphasis>not</emphasis> modify the global <filename>*.js</filename> files. Instead, change the <classname>Cursor</classname> prototype in &javascript; after the <filename>cursor.js</filename> is included into your script via <literal>require</literal>.
tr: <classname>Cursor</classname> veya <classname>Range</classname> gibi var olan prototipleri genişletmek istiyorsanız tavsiye edilen yol global <filename>*.js</filename> dosyalarını değiştirmek <emphasis>değildir</emphasis>. Bunun yerine, &javascript; içindeki <classname>Cursor</classname> prototipini <filename>cursor.js</filename> betiğinizde <literal>require</literal> ile içerildikten sonra değiştirin.

source: Cursors and Ranges
tr: İmleçler ve Erimler

source: As &kappname; is a text editor, all the scripting API is based on cursors and ranges whenever possible. A Cursor is a simple <literal>(line, column)</literal> tuple representing a text position in the document. A Range spans text from a starting cursor position to an ending cursor position. The API is explained in detail in the next sections.
tr: &kappname; bir metin düzenleyici olduğundan, tüm betik oluşturma API’si olabildiğince imleçlere ve erimlere dayanır. İmleç, belgedeki bir metin konumunu temsil eden basit bir <literal>(satır, sütun)</literal> demettir. Erim, metni başlangıç imleç konumundan bitiş imleç konumuna kadar yayar. API sonraki bölümlerde ayrıntılı olarak açıklanmaktadır.

source: The Cursor Prototype
tr: İmleç Prototipi

source: Constructor. Returns a Cursor at position <literal>(0, 0)</literal>.
tr: Yapıcı. <literal>(0, 0)</literal> konumunda bir imleç döndürür.

source: Example: <function>var cursor = new Cursor();</function>
tr: Örnek: <function>var cursor = new Cursor();</function>
