Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_configuring.po
Languages: tr

source: &kappname; syncs the swap files on the disk every 15 seconds, but only if they have changed since the last sync. The user can disable the swap files syncing if he wants, by selecting <guilabel>Disable</guilabel>, but this can lead to more data loss.
tr: &kappname;, diskteki takas dosyalarını her 15 saniyede bir eşzamanlar; ancak yalnızca son eşzamanlamadan bu yana değiştiyse bu işlemi yapar. Kullanıcı isterse <guilabel>Devre dışı</guilabel>’yı seçerek takas dosyalarının eşzamanlamasını devre dışı bırakabilir; ancak bu daha çok veri kaybına neden olur.

source: When the swap file is enabled, it is possible to switch between two modes, namely <guilabel>Enabled, Store in Default Directory</guilabel> and <guilabel>Enabled, Store in Custom Directory</guilabel>.
tr: Takas dosyası etkinleştirildiğinde, <guilabel>Etkin, Öntanımlı Dizinde Depola</guilabel> ve <guilabel>Etkin, Özel Dizinde Depola</guilabel> adındaki iki kip arasından seçim yapılabilir.

source: Store swap files in
tr: Takas dosyalarını şurada depola

source: By default, the swap files are saved in the same folder as the file. When <guilabel>Enabled, Store in Custom Directory</guilabel> is chosen for the swap file mode, swap files are created in the specified folder. This is useful for network file systems to avoid unnecessary network traffic.
tr: Öntanımlı olarak takas dosyaları, dosyayla aynı klasöre kaydedilir. Takas dosyası kipi için <guilabel>Etkin, Özel Dizinde Depola</guilabel> seçildiğinde, takas dosyaları belirtilen klasörde oluşturulur. Bu, gereksiz ağ trafiğini önlemek amacıyla ağ dosya sistemleri için kullanışlıdır.

source: Save swap files every
tr: Takas dosyası kaydetme aralığı

source: &kappname; syncs the swap files on the disk every 15 seconds, but only if they have changed since the last sync. You can change the sync interval as you like.
tr: &kappname;, diskteki takas dosyalarını her 15 saniyede bir eşzamanlar; ancak yalnızca son eşzamanlamadan bu yana değiştiyse bu işlemi yapar. Eşzamanlama aralığını istediğiniz gibi değiştirebilirsiniz.

source: Modes &amp; Filetypes
tr: Kipler ve Dosya Türleri

source: This page allows you to override the default configuration for documents of specified &MIME; types. When the editor loads a document, it will try if it matches the file masks or &MIME; types for one of the defined filetypes, and if so apply the variables defined. If more filetypes match, the one with the highest priority will be used.
tr: Bu sayfa, belirtilen &MIME; türlerindeki belgeler için öntanımlı yapılandırmayı geçersiz kılmanıza olanak tanır. Düzenleyici bir belge yüklediğinde, bunun tanımlanmış dosya türlerinden biri için dosya maskeleri veya &MIME; türleriyle eşleşip eşleşmediğini deneyecek ve eğer öyleyse tanımlanan değişkenleri uygulayacaktır. Daha fazla dosya türü eşleşirse en yüksek önceliğe sahip olan kullanılır.

source: Filetype:
tr: Dosya türü:

source: The filetype with the highest priority is the one displayed in the first drop down box. If more filetypes were found, they are also listed.
tr: En yüksek önceliğe sahip dosya türü, ilk açılan kutuda görüntülenen dosya türüdür. Daha fazla dosya türü bulunursa onlar da listelenir.

source: <guilabel>New</guilabel>
tr: <guilabel>Yeni</guilabel>

source: This is used to create a new filetype. After you click on this button, the fields below get empty and you can fill the properties you want for the new filetype.
tr: Yeni bir dosya türü oluşturmak için kullanılır. Bu düğmeye tıkladıktan sonra aşağıdaki alanlar boşalır ve yeni dosya türü için istediğiniz özellikleri doldurabilirsiniz.

source: Delete
tr: Sil

source: To remove an existing filetype, select it from the drop down box and press the Delete button.
tr: Var olan bir dosya türünü kaldırmak için açılır kutudan onu seçin ve Sil düğmesine basın.

source: Properties of <replaceable>current filetype</replaceable>
tr: <replaceable>Geçerli dosya türü</replaceable> özellikleri

source: Name:
tr: Ad:

source: The name of the filetype will be the text of the corresponding menu item. This name is displayed in the <menuchoice><guimenu>Tools</guimenu><guimenuitem>Filetypes</guimenuitem> </menuchoice> menu.
tr: Dosya türünün adı ilgili menü ögesinin metni olacaktır. Bu ad <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Dosya Türleri</guimenuitem></menuchoice> menüsünde görüntülenir.

source: Section:
tr: Bölüm:

source: The section name is used to organize the file types in menus. This is also used in the <menuchoice><guimenu>Tools</guimenu><guimenuitem>Filetypes</guimenuitem> </menuchoice> menu.
tr: Bölüm adı menülerdeki dosya türlerini düzenlemek için kullanılır. Bu aynı zamanda <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Dosya Türleri</guimenuitem></menuchoice> menüsünde de kullanılır.

source: Variables:
tr: Değişkenler:

source: This string allows you to configure &kappname;'s settings for the files selected by this &MIME; type using &kappname; variables. You can set almost any configuration option, such as highlight, indent-mode, &etc;
tr: Bu dizi, &kappname; değişkenlerini kullanarak bu &MIME; türü tarafından seçili dosyalar için &kappname; ayarlarını yapılandırmanıza olanak tanır. Vurgulama, girinti kipi vb. gibi neredeyse tüm yapılandırma seçeneklerini ayarlayabilirsiniz.

source: Press <guibutton>Edit</guibutton> to see a list of all available variables and their descriptions. Select the checkbox on the left to enable a particular variable and then set the value of the variable on the right. Some variables provide a drop-down box to select possible values from while others require you to enter a valid value manually.
tr: Kullanılabilir tüm değişkenlerin ve bunların açıklamalarının bir listesini görmek için <guibutton>Düzenle</guibutton>’ye basın. Belirli bir değişkeni etkinleştirmek için soldaki onay kutusunu seçin ve ardından sağdaki değişkenin değerini ayarlayın. Bazı değişkenler olası değerleri seçebileceğiniz bir açılır kutu sağlarken, diğerleri ise elle geçerli bir değer girmenizi gerektirir.

source: For complete information on these variables, see <link linkend="config-variables">Configuring with Document Variables</link>.
tr: Bu değişkenler hakkındaki tam bilgi için <link linkend="config-variables">Belge Değişkenleriyle Yapılandırmak</link> bölümüne bakın.

source: Highlighting:
tr: Vurgulama:

source: If you create a new file type, this drop down box allows you to select a filetype for highlighting.
tr: Yeni bir dosya türü oluşturursanız bu açılır kutu, vurgulama için bir dosya türü seçmenize olanak tanır.

source: Indentation Mode:
tr: Girintileme kipi:

source: The drop down box specifies the indentation mode for new documents.
tr: Açılır kutu, yeni belgeler için girintileme kipini belirtir.

source: File extensions:
tr: Dosya uzantıları:

source: The wildcards mask allows you to select files by filename. A typical mask uses an asterisk and the file extension, for example <filename>*.txt; *.text</filename>. The string is a semicolon-separated list of masks.
tr: Joker maskeleri, dosyaları dosya adına göre seçmenize olanak tanır. Tipik bir maske, bir yıldız işareti ve dosya uzantısını kullanır; örneğin, <filename>*.txt; *.text</filename>. Dizi, noktalı virgülle ayrılan bir maske listesidir.

source: MIME types:
tr: MIME türleri:

source: Displays a wizard that helps you easily select &MIME; types.
tr: &MIME; türlerini kolayca seçmenize yardımcı olan bir sihirbaz görüntüler.

source: Priority:
tr: Öncelik:

source: Sets a priority for this file type. If more than one file type selects the same file, the one with the highest priority will be used.
tr: Bu dosya türü için bir öncelik ayarlar. Birden fazla dosya türü aynı dosyayı seçerse en yüksek önceliğe sahip olan kullanılacaktır.

source: Configuring With Document Variables
tr: Belge Değişkenleriyle Yapılandırmak

source: &kappname; variables is &kappname;'s implementation of document variables, similar to &Emacs; and vi modelines. In katepart, the lines have the following format: <userinput>kate: VARIABLENAME VALUE; [ VARIABLENAME VALUE; ... ]</userinput> The lines can of course be in a comment, if the file is in a format with comments. Variable names are single words (no whitespace), and anything up to the next semicolon is the value. The semicolon is required.
tr: &kappname; değişkenleri, &Emacs; ve Vi kip satırlarına benzer biçimde &kappname;’in belge değişkenlerini uygulamasıdır. Katepart’ta satırlar aşağıdaki biçime sahiptir: <userinput>kate: DEĞİŞKEN-ADI DEĞER; [ DEĞİŞKEN-ADI DEĞER; … ]</userinput>. Satırlar dosya yorum içeren bir biçimdeyse elbette yorumda yer almalıdır. Değişken adları tek sözcüklerden oluşur (boşluk yoktur) ve sonraki noktalı virgülden sonraki her şey değerdir. Noktalı virgül gereklidir.

source: Here is an example variable line, forcing indentation settings for a C++, &Java; or &javascript; file:
tr: İşte bir C++, &Java; veya &javascript; dosyası için girintileme ayarlarını zorlayan örnek bir değişken satırı:

source: Only the first and last 10 lines are searched for variable lines.
tr: Değişken satırları için yalnızca ilk ve son on satır aranır.

source: Additionally, document variables can be placed in a file called <filename>.kateconfig</filename> in any directory, and the configured settings will be applied as if the modelines were entered on every file in the directory and its subdirectories. Document variables in <filename>.kateconfig</filename> use the same syntax as in modelines, but with <link linkend="kateconfig-extended-options">extended options</link>.
tr: Ek olarak, belge değişkenleri herhangi bir dizindeki <filename>.kateconfig</filename> adlı bir dosyaya yerleştirilebilir ve yapılandırılan ayarlar, dizindeki ve alt dizinlerindeki her dosyaya kip satırları girilmiş gibi uygulanacaktır. Belge değişkenleri, <filename>.kateconfig</filename> dosyasındaki kip satırları ile aynı sözdizimini kullanır; ancak <link linkend="kateconfig-extended-options">genişletilmiş seçeneklerle</link>.

source: There are variables to support almost all configurations in &kappname;, and additionally plugins can use variables, in which case it should be documented in the plugin's documentation.
tr: &kappname;’de hemen hemen tüm yapılandırmaları destekleyecek değişkenler vardır ve ayrıca eklentiler değişkenleri kullanabilir, bu durumda eklentinin belgelerinde belgelenmesi gerekir.

source: &kappname; has support for reading configurations from <filename>.editorconfig</filename> files, when the <ulink url="https://editorconfig.org/">editorconfig</ulink> library is installed. &kappname; automatically searches for a <filename>.editorconfig</filename> whenever you open a file. It gives priority to <filename>.kateconfig</filename> files, though.
tr: &kappname;’de, <ulink url="https://editorconfig.org/">editorconfig</ulink> kurulu olduğu zaman <filename>.editorconfig</filename> dosyalarından yapılandırmaları okuma desteği vardır. &kappname;, bir dosya açtığınızda kendiliğinden bir <filename>.editorconfig</filename> dosyası arar. Yine de <filename>.kateconfig</filename> dosyalarına öncelik tanır.

source: How &kappname; uses Variables
tr: &kappname; değişkenleri nasıl kullanır

source: When reading configuration, katepart looks in the following places (in that order): <itemizedlist> <listitem><para>The global configuration.</para></listitem> <listitem><para>Optional session data.</para></listitem> <listitem><para>The "Filetype" configuration.</para></listitem> <listitem><para>Document variables in <filename>.kateconfig</filename>.</para></listitem> <listitem><para>Document variables in the document itself.</para></listitem> <listitem><para>Settings made during editing from menu or command line.</para></listitem> </itemizedlist> As you can see, document variables are only overridden by changes made at runtime. Whenever a document is saved, the document variables are reread, and will overwrite changes made using menu items or the command line.
tr: Yapılandırma okurken, katepart aşağıdaki yerlere bakar (sırasıyla): <itemizedlist> <listitem><para>Global yapılandırma.</para></listitem> <listitem><para>İsteğe bağlı oturum verisi.</para></listitem> <listitem><para>"Dosya Türü" yapılandırması.</para></listitem> <listitem><para><filename>.kateconfig</filename> dosyasındaki belge değişkenleri.</para></listitem> <listitem><para>Belgenin içindeki belge değişkenleri.</para></listitem> <listitem><para>Komut satırından veya uygulama menüsünden ayarlanan ayarlar.</para></listitem> </itemizedlist> Gördüğünüz üzere, belge değişkenleri yalnzca çalışma zamanında yapılan değişikliklerle geçersiz kılınabilirler. Bir belge kaydedildiğinde, belge değişkenleri yeniden okunur ve komut satırından veya menü ögelerinden yapılan değişikliklerin üzerine yazılır.

source: Any variable not listed below is stored in the document and can be queried by other objects such as plugins, which can use them for their own purpose. For example, the variable indent mode uses document variables for its configuration.
tr: Aşağıda listelenmeyen herhangi bir değişken belgede depolanır ve bunları kendi amaçları doğrultusunda kullanabilen eklentiler gibi diğer nesneler tarafından sorgulanabilirler. Örneğin, değişken girinti kipi, yapılandırması için belge değişkenlerini kullanır.

source: The variables listed here documents &kappname; version 5.38. More variables may be added in the future. There are 3 possible types of values for variables, with the following valid expressions:
tr: Burada listelenen değişkenler, &kappname; 5.38 sürümünü belgelemektedir. Gelecekte daha fazla değişken eklenebilir. Değişkenler için aşağıdaki geçerli ifadelerle birlikte 3 olası değer türü vardır:

source: INTEGER - any integer number
tr: INTEGER — herhangi bir tamsayı

source: STRING - anything else
tr: STRING — başka herhangi bir şey

source: Available Variables
tr: Kullanılabilir Değişkenler

source: Enable automatic insertion of brackets.
tr: Ayraçların kendiliğinden eklenmesini etkinleştirin.

source: Set the number of autocenter lines.
tr: Kendiliğinden hizalama satırlarının sayısını ayarlayın.

source: Set the document background color. The value must be something that can be evaluated to a valid color, for example <userinput>#ff0000</userinput>.
tr: Belge arka plan rengini ayarlayın. Değer, geçerli bir renge dönüştürülebilir olmalıdır; örneğin, <userinput>#ff0000</userinput>.

source: Enable or disable unindenting when &Backspace; is pressed.
tr: &Backspace; düğmesine basıldığında girintinin geri alınmasını etkinleştirin veya devre dışı bırakın.

source: Turn <link linkend="kate-part-selection-block">block selection</link> on or off.
tr: <link linkend="kate-part-selection-block">Blok seçimini</link> açın veya kapatın.

source: Enable/disable the byte order mark (BOM) when saving files in Unicode format (utf8, utf16, utf32).
tr: Dosyaları Unicode (utf8, utf16, utf32) biçiminde kaydederken, bayt sırası imini etkinleştirin veya devre dışı bırakın.

source: Since: &kate; 3.4 (&kde; 4.4)
tr: &kate; 3.4 (&kde; 4.4) sürümünden beri

source: Set the color for the bracket highlight. The value must be something that can be evaluated to a valid color, for example <userinput>#ff0000</userinput>.
tr: Ayraç vurgusunun rengini ayarlayın. Değer, geçerli bir renk için değerlendirilebilecek bir şey olmalıdır; örneğin; <userinput>#ff0000</userinput>.

source: Set the color for the current line. The value must be something that can be evaluated to a valid color, for example <userinput>#ff0000</userinput>.
tr: Geçerli satırın rengini ayarlayın. Değer, geçerli bir renk için değerlendirilebilecek bir şey olmalıdır; örneğin, <userinput>#ff0000</userinput>.

source: Sets the default dictionary used for spellchecking.
tr: Yazım denetimi için kullanılan öntanımlı sözlüğü ayarlar.

source: Turns <link linkend="kate-part-auto-wrap">dynamic word wrap</link> on or off.
tr: <link linkend="kate-part-auto-wrap">Devingen sözcük kaydırmayı</link> açar veya kapatır.

source: Set the end of line mode. Valid settings are <userinput>unix</userinput>, <userinput>mac</userinput> and <userinput>dos</userinput>.
tr: Satır sonu kipini ayarlayın. Geçerli ayarlar <userinput>unix</userinput>, <userinput>mac</userinput> ve <userinput>dos</userinput> olarak üçe ayrılır.

source: Set the display of <link linkend="advanced-editing-tools-code-folding">folding markers</link> on or off.
tr: <link linkend="advanced-editing-tools-code-folding">Katlama imleyicilerinin</link> görüntülenmesini açar veya kapatır.

source: Enable folding preview in the editor border.
tr: Düzenleyici kenarlığında katlama önizlemesini etkinleştirin.

source: Set the point size of the document font.
tr: Belgenin yazıtipi boyutunu punto türünden ayarlayın.

source: Set the font of the document. The value should be a valid font name, for example <userinput>courier</userinput>.
tr: Belgenin yazıtipini ayarlayın. Değer, geçerli bir yazıtipi adı olmalıdır; örneğin, <userinput>courier</userinput>.

source: Set the syntax highlighting. Valid strings are all the names available in the menus. For instance, for C++ simply write <userinput>C++</userinput>.
tr: Sözdizimi vurgulamasını ayarlayın. Geçerli diziler, menüde kullanılabilir olan tüm adlardır. Örneğin, C++ için yalnızca <userinput>C++</userinput> yazın.

source: Set the icon bar color. The value must be something that can be evaluated to a valid color, for example <userinput>#ff0000</userinput>.
tr: Simge çubuğunun rengini ayarlayın. Değer, geçerli bir renk olmalıdır; örneğin, <userinput>#ff0000</userinput>.

source: Set the display of the icon border on or off.
tr: Simge kenarlığının görüntülenmesini açın veya kapatın.

source: Set the auto-indentation mode. The options <userinput>none</userinput>, <userinput>normal</userinput>, <userinput>cstyle</userinput>, <userinput>haskell</userinput>, <userinput>lilypond</userinput>, <userinput>lisp</userinput>, <userinput>python</userinput>, <userinput>ruby</userinput> and <userinput>xml</userinput> are recognized. See the section <xref linkend="kate-part-autoindent"/> for details.
tr: Kendiliğinden girintileme kipini ayarlayın. Şu seçenekler desteklenir: <userinput>none</userinput>, <userinput>normal</userinput>, <userinput>cstyle</userinput>, <userinput>haskell</userinput>, <userinput>lilypond</userinput>, <userinput>lisp</userinput>, <userinput>python</userinput>, <userinput>ruby</userinput> ve <userinput>xml</userinput>. Ayrıntılar için <xref linkend="kate-part-autoindent"/> bölümüne bakın.

source: Enable/disable adjusting indentation of text pasted from the clipboard.
tr: Panodan yapıştırılan metnin girintileme ayarlamasını etkinleştirin/devre dışı bırakın.

source: Since: &kate; 3.11 (&kde; 4.11)
tr: &kate; 3.11 (&kde; 4.11) sürümünden beri

source: Set the indentation width.
tr: Girintileme genişliğini ayarlayın.

source: Set whether to keep extra spaces when calculating indentation width.
tr: Girintileme genişliği hesaplanırken, fazladan boşlukların tutulup tutulmayacağını ayarlayın.

source: Set the display of line numbers on or off.
tr: Satır numaralarının görüntülenmesini açın veya kapatın.

source: Add an empty line at the end of the file (EOF) when saving the document.
tr: Belgeyi kaydederken, dosyanın sonuna (EOF) boş bir satır ekleyin.

source: Since: &kate; 3.9 (&kde; 4.9)
tr: &kate; 3.9 (&kde; 4.9) sürümünden beri

source: Set overwrite mode on or off.
tr: Üzerine yazma kipini açın veya kapatın.

source: Set <link linkend="kate-part-selection-persistent">persistent selection</link> on or off.
tr: <link linkend="kate-part-selection-persistent">Kalıcı seçimi</link> açın veya kapatın.

source: Set tab to space conversion on save on or off.
tr: Kaydetme sırasında sekmeden boşluğa dönüşümü açın veya kapatın.

source: Set dynamic tab to space conversion on or off.
tr: Devingen sekmeden boşluğa dönüşümü açın veya kapatın.

source: Removes trailing spaces when saving the document. Valid options are:
tr: Belgeyi kaydederken satır sonlarındaki boşlukları kaldırır. Geçerli seçenekler:

source: <userinput>none</userinput>, <userinput>-</userinput> or <userinput>0</userinput>: never remove trailing spaces.
tr: <userinput>none</userinput>, <userinput>-</userinput> veya <userinput>0</userinput>: Asla satır sonu boşluklarını kaldırmayın.

source: <userinput>modified</userinput>, <userinput>mod</userinput>, <userinput>+</userinput> or <userinput>1</userinput>: remove trailing spaces only in modified lines. The modified lines are marked by the line modification system.
tr: <userinput>modified</userinput>, <userinput>mod</userinput>, <userinput>+</userinput> veya <userinput>1</userinput>: Yalnızca değiştirilen satırlardaki sondaki boşlukları kaldırın. Değiştirilen çizgiler, satır değişiklik sistemi tarafından işaretlenir.

source: <userinput>all</userinput>, <userinput>*</userinput> or <userinput>2</userinput>: remove trailing spaces in the entire document.
tr: <userinput>all</userinput>, <userinput>*</userinput> veya <userinput>2</userinput>: Tüm belgedeki satır sonu boşluklarını kaldırın.

source: Show scrollbar minimap.
tr: Sarma çubuğu mini haritasını gösterin.

source: Show scrollbar preview.
tr: Sarma çubuğu önizlemesini gösterin.

source: Set the color scheme. The string must be the name of a color scheme that exists in your configuration to have any effect.
tr: Renk şemasını ayarlayın. Herhangi bir etki yaratabilmesi için dizinin, yapılandırmanızda bulunan renk şemasının adı olması gerekir.

source: Set the selection color. The value must be something that can be evaluated to a valid color, for example <userinput>#ff0000</userinput>.
tr: Seçim rengini ayarlayın. Değer, geçerli bir renkle değerlendirilebilecek bir şey olmalıdır; örneğin, <userinput># ff0000</userinput>.

source: Set the visual tab character on or off.
tr: Görsel sekme karakterini açın veya kapatın.

source: Set <link linkend="pref-edit-cursor-selection">smart home navigation</link> on or off.
tr: <link linkend="pref-edit-cursor-selection">Akıllı ana klasör dolaşımını</link> açın veya kapatın.

source: Set &Tab; key indentation on or off.
tr: &Tab; düğmesi girintilemesini açın veya kapatın.

source: Set the tab character display width.
tr: Sekme karakterinin genişliğini ayarlayın.

source: Set the number of undo steps to remember.
tr: Anımsanacak geri alma eylemi sayısını ayarlayın.

source: Note: Deprecated since &kate; 3 in &kde;4. This variable is ignored. The maximal count of undo steps is unlimited.
tr: Not: &kde;4 üzerindeki &kate; 3 sürümünden beri kullanılmıyor. Bu değer yok sayılır. Geri alma eyleminin en yüksek sayısı sınırsızdır.

source: Set the <link linkend="kate-part-auto-wrap">static word wrap</link> width.
tr: <link linkend="kate-part-auto-wrap">Durağan sözcük kaydırma</link> genişliğini ayarlayın.

source: Set the word wrap marker color. The value must be something that can be evaluated to a valid color, for example <userinput>#ff0000</userinput>.
tr: Sözcük kaydırma imleyicisinin rengini ayarlayın. Değer, geçerli bir renkle değerlendirilebilecek bir şey olmalıdır; örneğin, <userinput>#ff0000</userinput>.

source: Set static word wrapping on or off.
tr: Durağan sözcük kaydırmayı açın veya kapatın.

source: Extended Options in <filename>.kateconfig</filename> files
tr: <filename>.kateconfig</filename> dosyalarındaki genişletilmiş seçenekler

source: &kappname; always search for a <filename>.kateconfig</filename> file for local files (not remote files). In addition, it is possible to set options based on wildcards (file extensions) as follows:
tr: &kappname;, her zaman yerel dosyalar için bir <filename>.kateconfig</filename> dosyası arar (uzak dosyalarda aramaz). Ek olarak, aşağıdaki biçimde özel karakter araması için seçenekler ayarlamak da olanaklıdır (dosya uzantıları):
