Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_fundamentals.po
Languages: tr

source: When starting a new session, the &GUI; configuration of <guilabel>Default Session</guilabel> is loaded. To save window configuration in the default session, you need to enable saving window configuration in the sessions configuration page of the configuration dialog and then load the default session, set up the window as desired and save the session again.
tr: Yeni bir oturum başlatılırken, <guilabel>Öntanımlı Oturum</guilabel>’un &GUI; yapılandırması yüklenir. Pencere yapılandırmasını öntanımlı oturuma kaydetmek için yapılandırma iletişim kutusunun oturum yapılandırma sayfasında pencere yapılandırmasını kaydetmeyi etkinleştirmeniz ve ardından öntanımlı oturumu yüklemeniz, pencereyi istediğiniz gibi ayarlamanız ve oturumu yeniden kaydetmeniz gerekir.

source: When a named session is loaded, &kate; will display the session name at the start of the window title, which then has the form <quote><replaceable>Session Name</replaceable>: <replaceable>Document name or &URL;</replaceable> - &kate;</quote>.
tr: Ad verilmiş bir oturum yüklendiğinde &kate;, oturum adını pencere başlığının başlangıcında görüntüleyecektir. Bu dizi, <quote><replaceable>Oturum adı</replaceable>: <replaceable>Belge adı veya &URL;’si</replaceable> — &kate;</quote> biçimindedir.

source: When opening files on the command line with <option>--start <replaceable>name</replaceable></option> or if a session is selected using the session chooser, the specified session is loaded prior to the files specified on the command line. To open files from the command line in a new, unnamed session, configure &kate; to start a new session as default in the session page of the configuration dialog or use <option>--start</option> with an empty string: <replaceable>''</replaceable>.
tr: Dosyaları komut satırında <option>--start <replaceable>ad</replaceable></option> seçeneği ile açarken veya bir oturum, oturum seçicisinden seçilmişse belirtilen oturum, komut satırında belirtilen dosyaların yüklenmesinden önce yüklenir. Komut satırından dosyaları yeni, adsız bir oturum ile açmak için yapılandırma iletişim kutusunun oturum sayfasında &kate;’i öntanımlı olarak yeni bir oturum başlatması için yapılandırın veya <option>--start</option> seçeneğini boş bir diziyle kullanın: <replaceable>''</replaceable>.

source: Since &kate; 2.5.1 the <acronym>PID</acronym> of the current instance is exported to the environment variable <envar>KATE_PID</envar>. When opening files from the built in terminal Kate will automatically select the current instance if nothing else is indicated on the command line.
tr: &kate; 2.5.1 sürümünden bu yana, geçerli örneğin <acronym>PID</acronym>’si <envar>KATE_PID</envar> çevre değişkenine dışa aktarılır. Yerleşik uçbirimden dosyalar açarken Kate, komut satırında başka bir şey belirtilmemişse kendiliğinden geçerli örneği seçer.

source: <title>Quick Open</title>
tr: <title>Tez Aç</title>

source: To be able to quickly open/switch between files, Kate comes with a built-in quick open dialog. You can open it with <keycombo action="simul">&Ctrl;&Alt;<keycap>O</keycap></keycombo>.
tr: Tez dosyalar açmak/aralarında geçiş yapmak için Kate, yerleşik bir tez aç iletişim kutusuyla gelir. Bunu, <keycombo action="simul">&Ctrl;&Alt;<keycap>O</keycap></keycombo> kısayoluyla açabilirsiniz.

source: Quick open can show all open documents in Kate as well as all files in open projects. To be able to see project files, you need to enable <link linkend="kate-application-plugin-projects">Project Plugin</link>.
tr: Tez Aç, Kate’de açık olan tüm açık belgeleri ve projeleri gösterebilir. Proje dosyalarını görebilmek için <link linkend="kate-application-plugin-projects">Proje Eklentisi</link>’ni etkinleştirmeniz gerekir.

source: Using Quick Open
tr: Tez Aç’ı Kullanmak

source: Using quick open is very simple. Once you open it, just type the name or portions of the name of the file you want to open and quick open will filter the list based on what you typed. Hitting &Enter; opens the selected file, while &Esc; hides the quick open.
tr: Tez Aç’ı kullanmak çok basittir. Açtığınızda, açmak istediğiniz dosyanın adını veya adının bir kısmını yazmanız yeterlidir; Tez Aç, yazdıklarınıza göre listeyi süzer. &Enter; düğmesine basmak seçili dosyayı açar, &Esc; ise Tez Aç’ı gizler.

source: By default, only the file name is matched while filtering. If you want to match path, you need to have a "/" in the typed text. For example: "doc/index" will match all the files that contain "index" inside the folder "doc".
tr: Öntanımlı olarak, süzme sırasında yalnızca dosya adı eşleştirilir. Yolu eşleştirmek isterseniz yazılan metinde bir "/" olmalıdır. Örneğin: "belge/indeks", "belge" klasöründe "indeks" içeren tüm belgelerle eşleşecektir.

source: The documents which are already open are highlighted in bold and are listed at the top when the dialog opens. Also, when quick open shows up the previous open document is already selected so you can just press &Enter; and it will take you to that document.
tr: Halihazırda açık olan belgeler kalın harflerle vurgulanır ve iletişim kutusu açıldığında en üstte listelenir. Ayrıca, Tez Aç görüntülendiğinde önceki açık belge halihazırda seçilidir, böylece yalnızca &Enter; düğmesine basabilirsiniz ve bu sizi o belgeye götürecektir.

source: Configuring Quick Open
tr: Tez Aç Yapılandırması

source: <screeninfo>Quick Open</screeninfo>
tr: <screeninfo>Tez Aç</screeninfo>

source: Quick open provides a couple of config options. To access these options, right-click in the input line edit.
tr: Tez Aç, birkaç yapılandırma seçeneği sağlar. Bu seçeneklere ulaşmak için giriş satırında sağ tıklayın.

source: Currently available options are:
tr: Şu anda kullanılabilir seçenekler şunlardır:

source: <userinput>Current Project</userinput> - Show files from current project only
tr: <userinput>Geçerli Proje</userinput> — Yalnızca geçerli projeden olan dosyaları göster

source: <userinput>All Projects</userinput> - Show files from all open projects
tr: <userinput>Tüm Projeler</userinput> — Tüm projelerden olan dosyaları göster

source: <userinput>Fuzzy Filtering</userinput> - Use fuzzy matching algorithm to filter files
tr: <userinput>Belirsiz Süzme</userinput> — Dosyaları süzmek için belirsiz eşleştirme algoritmasını kullan

source: <userinput>Wildcard Filtering</userinput>- Use wildcard matching to filter files
tr: <userinput>Jokerle Süzme</userinput>- Dosyaları süzmek için joker eşleştirmesi algoritmasını kullan

source: Getting Help
tr: Yardım Almak

source: With &kate;
tr: &kate; ile

source: This manual
tr: Bu kılavuz

source: Offers detailed documentation on all menu commands, configuration options, tools, dialogs, plugins &etc; as well as descriptions of the &kate; window, the editor and various concepts used in the application.
tr: Tüm menü komutları, yapılandırma seçenekleri, araçlar, iletişim kutuları, eklentiler vb. hakkında ayrıntılı belgeler sunar; ayrıca &kate; penceresinin, düzenleyicisinin ve uygulamada kullanılan çeşitli kavramların açıklamalarını verir.

source: Press <keycap>F1</keycap> or use the <menuchoice><guimenu>Help</guimenu> <guimenuitem>&kate; Handbook</guimenuitem></menuchoice> menu topic to view this manual.
tr: Bu kılavuzu görüntülemek için <keycap>F1</keycap> düğmesine basın veya <menuchoice><guimenu>Yardım</guimenu> <guimenuitem>&kate; El Kitabı</guimenuitem></menuchoice> menü başlığını kullanın.

source: What's This Help
tr: Bu Nedir Yardımı

source: What's This help offers immediate help with single elements of graphical windows, such as buttons or other window areas.
tr: Bu Nedir Yardımı, düğmeler veya diğer pencere alanları gibi grafik pencerelerin tekil ögeleriyle ilgili anında yardım sunar.

source: We strive to provide What's This help for any elements for which it makes sense. It is available throughout the configuration dialog, and in many other dialogs as well.
tr: Mantıklı olan tüm ögeler için Bu Nedir yardımını sağlamaya çalışıyoruz. Yapılandırma iletişim kutusunda ve diğer birçok iletişim kutusunda da kullanılabilirdir.

source: To employ What's This help, press <keycombo action="simul">&Shift;<keycap>F1</keycap></keycombo> or use the <menuchoice><guimenu>Help</guimenu><guimenuitem>What's This</guimenuitem></menuchoice> menu item to enable What's This mode. The cursor will turn into an arrow with a question mark, and you can now click any element in the window to read the What's This help for that element, if it is available.
tr: Bu Nedir yardımını açmak için <keycombo action="simul">&Shift;<keycap>F1</keycap></keycombo> düğmelerine basın veya <menuchoice><guimenu>Yardım</guimenu><guimenuitem>Bu Nedir?</guimenuitem></menuchoice> menü ögesini seçin. İmleç, soru işareti ile birlikte bir oka dönüşecektir ve artık herhangi bir ögenin, eğer varsa Bu Nedir yardımı içeriğini okuyabilirsiniz.

source: Help Buttons in Dialogs
tr: İletişim Kutularındaki Yardım Düğmeleri

source: Some dialogs have a <guibutton>Help</guibutton> Button. Pressing it will start the &khelpcenter; and open the relevant documentation.
tr: Bazı iletişim kutularında bir <guibutton>Yardım</guibutton> düğmesi vardır. Ona tıklamak &khelpcenter;’ni başlatır ve ilgili belgelendirmeyi açar.

source: With Your Text Files
tr: Metin Dosyalarınızla

source: &kate; does not (yet!) provide any means for reading document related documentation. Depending on the file you are editing, you may find the <link linkend="kate-application-plugin-konsole">Built in Terminal Emulator</link> helpful for viewing related &UNIX; manual pages or info documentation, or you can use &konqueror;.
tr: &kate;, henüz düzenlediğiniz projelere ilişik belgelendirmeleri (örneğin kod veya API belgelendirmesi) okumak için henüz bir yordam sağlamıyor. Düzenlediğiniz dosyaya bağlı olarak, &UNIX; kılavuz sayfalarını görüntülemek için <link linkend="kate-application-plugin-konsole">Yerleşik Uçbirim Öykünücüsü</link>’nü veya &konqueror;’ı kullanabilirsiniz.

source: Articles on &kate;
tr: &kate; ile İlgili Yazılar

source: &kate;'s homepage provides some <ulink url="https://kate-editor.org/featured-articles"> Articles and Howtos</ulink> with further information beyond the scope of this handbook.
tr: &kate;’in ana sayfası, bu el kitabının kapsamı dışında olan bazı <ulink url="https://kate-editor.org/featured-articles">Yazılar ve Nasıl Yapılırlar</ulink> girdileri sağlar.
