Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_development.po
Languages: tr

source: bool document.isCode(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); bool document.isCode(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: bool document.isCode(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); bool document.isCode(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Returns <literal>true</literal>, if the attribute at the given cursor position is not equal to all of the following styles: <literal>dsComment</literal>, <literal>dsString</literal>, <literal>dsRegionMarker</literal>, <literal>dsChar</literal>, <literal>dsOthers</literal>.
tr: Verilen imleç konumundaki öznitelik aşağıdaki biçemlerin tümüne eşit değilse <literal>true</literal> değerini döndürür: <literal>dsComment</literal>, <literal>dsString</literal>, <literal>dsRegionMarker</literal>, <literal>dsChar</literal>, <literal>dsOthers</literal>.

source: bool document.isComment(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); bool document.isComment(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: bool document.isComment(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); bool document.isComment(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Returns <literal>true</literal>, if the attribute of the character at the cursor position is <literal>dsComment</literal>, otherwise <literal>false</literal>.
tr: İmleç konumundaki karakterin özniteliği <literal>dsComment</literal> ise <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: bool document.isString(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); bool document.isString(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: bool document.isString(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); bool document.isString(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Returns <literal>true</literal>, if the attribute of the character at the cursor position is <literal>dsString</literal>, otherwise <literal>false</literal>.
tr: İmleç konumundaki karakterin özniteliği <literal>dsString</literal> ise <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: bool document.isRegionMarker(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); bool document.isRegionMarker(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: bool document.isRegionMarker(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); bool document.isRegionMarker(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Returns <literal>true</literal>, if the attribute of the character at the cursor position is <literal>dsRegionMarker</literal>, otherwise <literal>false</literal>.
tr: İmleç konumundaki karakterin özniteliği <literal>dsRegionMarker</literal> ise <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: bool document.isChar(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); bool document.isChar(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: bool document.isChar(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); bool document.isChar(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Returns <literal>true</literal>, if the attribute of the character at the cursor position is <literal>dsChar</literal>, otherwise <literal>false</literal>.
tr: İmleç konumundaki karakterin özniteliği <literal>dsChar</literal> ise <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: bool document.isOthers(<parameter>int <replaceable>line</replaceable></parameter>, <parameter>int <replaceable>column</replaceable></parameter>); bool document.isOthers(<parameter>Cursor <replaceable>cursor</replaceable></parameter>);
tr: bool document.isOthers(<parameter>int <replaceable>satır</replaceable></parameter>, <parameter>int <replaceable>sütun</replaceable></parameter>); bool document.isOthers(<parameter>Cursor <replaceable>imleç</replaceable></parameter>);

source: Returns <literal>true</literal>, if the attribute of the character at the cursor position is <literal>dsOthers</literal>, otherwise <literal>false</literal>.
tr: İmleç konumundaki karakterin özniteliği <literal>dsOthers</literal> ise <literal>true</literal>, aksi takdirde <literal>false</literal> döndürür.

source: void document.indent(<parameter>Range <replaceable>range</replaceable></parameter>, <parameter>int <replaceable>change</replaceable></parameter>);
tr: void document.indent(<parameter>Range <replaceable>erim</replaceable></parameter>, <parameter>int <replaceable>değişiklik</replaceable></parameter>);

source: Indents all lines in <replaceable>range</replaceable> by <replaceable>change</replaceable> tabs or <replaceable>change</replaceable> times <literal>tabSize</literal> spaces depending on the users preferences. The <replaceable>change</replaceable> parameter can be negative.
tr: <replaceable>erim</replaceable>’deki tüm satırları <replaceable>değişiklik</replaceable> sekme kadar veya <replaceable>değişiklik</replaceable> kez girintiler. <literal>tabSize</literal> boşlukları kullanıcı tercihlerine bağlıdır. <replaceable>değişiklik</replaceable> parametresi negatif olabilir.

source: The Editor API
tr: Düzenleyici API’si

source: In addition to the document and view API, there is a general editor API that provides functions for general editor scripting functionality.
tr: Belge ve görünüm API’sine ek olarak, genel düzenleyici betiği oluşturma işlevlerine yönelik işlevler sağlayan bir genel düzenleyici API’si vardır.

source: Returns the text that currently is in the global clipboard.
tr: Şu anda global panoda bulunan metni döndürür.

source: The editor holds a clipboard history that contains up to 10 clipboard entries. This function returns all entries that currently are in the clipboard history.
tr: Düzenleyici, en fazla 10 pano girdisini içeren bir pano geçmişini tutar. Bu işlev, şu anda pano geçmişinde bulunan tüm girdileri döndürür.

source: void editor.setClipboardText(<parameter>String <replaceable>text</replaceable></parameter>);
tr: void editor.setClipboardText(<parameter>String <replaceable>metin</replaceable></parameter>);

source: Set the contents of the clipboard to <replaceable>text</replaceable>. The <replaceable>text</replaceable> will be added to the clipboard history.
tr: Panonun içeriğini <replaceable>metin</replaceable> olarak ayarlar. <replaceable>metin</replaceable>, pano geçmişine eklenir.
