Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_regular-expressions.po
Languages: tr

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>İşbaran</firstname><surname>Akçayır</surname><affiliation><address><email>isbaran@gmail.com</email></address></affiliation><contrib>-</contrib></othercredit> <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>-</contrib></othercredit>

source: Regular Expressions
tr: Düzenli İfadeler

source: This Appendix contains a brief but hopefully sufficient and covering introduction to the world of <emphasis>regular expressions</emphasis>. It documents regular expressions in the form available within &kappname;, which is not compatible with the regular expressions of perl, nor with those of for example <command>grep</command>.
tr: Bu Ek, <emphasis>düzenli ifadeler</emphasis> dünyasına kısa; ancak umarım yeterli ve kapsamlı bir giriş içerir. Bu belgede, &kappname; içinde kullanılabilir olan düzenli ifadeler anlatılır. Bu düzenli ifade biçimi, ne perl düzenli ifadeleriyle ne de <command>grep</command> ile kullanılabilir düzenli ifadelerle doğrudan uyumlu değildir.

source: Introduction
tr: Giriş

source: <emphasis>Regular Expressions</emphasis> provides us with a way to describe some possible contents of a text string in a way understood by a small piece of software, so that it can investigate if a text matches, and also in the case of advanced applications with the means of saving pieces or the matching text.
tr: <emphasis>Düzenli İfadeler</emphasis>, bize bir metin dizisinin kimi olası içeriğini küçük bir yazılım parçası tarafından anlaşılacak şekilde tanımlamanın bir yolunu sağlar, böylece bir metnin eşleşip eşleşmediğini görebilir ve bazı gelişmiş durumlarda belirli parçaları veya eşleşen metni kaydedebiliriz.

source: An example: Say you want to search a text for paragraphs that starts with either of the names <quote>Henrik</quote> or <quote>Pernille</quote> followed by some form of the verb <quote>say</quote>.
tr: Örnek: Bir metni, içinde <quote>Henrik</quote> veya <quote>Pernille</quote> adlarından biriyle başlayan ve sonrasında <quote>say</quote> gelen paragraflar için aramak istiyoruz.

source: With a normal search, you would start out searching for the first name, <quote>Henrik</quote> maybe followed by <quote>sa</quote> like this: <userinput>Henrik sa</userinput>, and while looking for matches, you would have to discard those not being the beginning of a paragraph, as well as those in which the word starting with the letters <quote>sa</quote> was not either <quote>says</quote>, <quote>said</quote> or so. And then of course repeat all of that with the next name...
tr: Normal bir aramada, öncelikle adla aramaya başlardık; <quote>Henrik</quote>, belki sonrasında <quote>sa</quote> getirirdik: <userinput>Henrik sa</userinput>; eşleşmeleri ararken paragraf başı olmayan varyantları ve <quote>sa</quote> ile başlayan sözcükleri yok saymamız gerekirdi; örneğin <quote>says</quote>, <quote>said</quote> vb. Sonrasında bunların hepsini diğer adla da yinelememiz gerekecekti…

source: With Regular Expressions, that task could be accomplished with a single search, and with a larger degree of preciseness.
tr: Düzenli İfadeler sayesinde bu görev tek bir aramayla ve daha büyük bir doğrulukla gerçekleştirilebilir.

source: To achieve this, Regular Expressions defines rules for expressing in details a generalization of a string to match. Our example, which we might literally express like this: <quote>A line starting with either <quote>Henrik</quote> or <quote>Pernille</quote> (possibly following up to 4 blanks or tab characters) followed by a whitespace followed by <quote>sa</quote> and then either <quote>ys</quote> or <quote>id</quote></quote> could be expressed with the following regular expression:
tr: Bunu başarmak için Düzenli İfadeler, eşleşecek bir dizinin genelleştirilmesini ayrıntılı olarak ifade etmeye yönelik kuralları tanımlar. Sözcüğü tam anlamıyla şu şekilde ifade edebiliriz: <quote>Ya <quote>Henrik</quote> ya da <quote>Pernille</quote> ile başlayan bir satır (büyük olasılıkla öncesinde bir sekme karakteri veya 4 adet boşluk olabilir), sonrasında bir boşluk ve <quote>sa</quote> ve sonrasında ya <quote>ys</quote> veya <quote>id</quote></quote> şu düzenli ifadeyle gösterilebilirdi:

source: The above example demonstrates all four major concepts of modern Regular Expressions, namely:
tr: Yukarıdaki örnek, çağdaş Düzenli İfadelerin dört ana konseptinin tümünü göstermektedir:

source: <para>Patterns</para>
tr: <para>Dizgiler</para>

source: <para>Assertions</para>
tr: <para>Savlar</para>

source: <para>Quantifiers</para>
tr: <para>Niceleyiciler</para>

source: Back references
tr: Geriye başvurular

source: The caret (<literal>^</literal>) starting the expression is an assertion, being true only if the following matching string is at the start of a line.
tr: İfadeyi başlatan şapka (<literal>^</literal>) bir savdır ve yalnızca aşağıdaki eşleşen dizi bir satırın başındaysa doğrudur.

source: The strings <literal>[ \t]</literal> and <literal>(Henrik|Pernille) sa(ys|id)</literal> are patterns. The first one is a <emphasis>character class</emphasis> that matches either a blank or a (horizontal) tab character; the other pattern contains first a subpattern matching either <literal>Henrik</literal> <emphasis>or</emphasis> <literal>Pernille</literal>, then a piece matching the exact string <literal> sa</literal> and finally a subpattern matching either <literal>ys</literal> <emphasis>or</emphasis> <literal>id</literal>
tr: <literal>[ \t]</literal> ve <literal>(Henrik|Pernille) sa(ys|id)</literal> dizgilerdir. İlki, ya bir boş ya da (yatay) sekme karakteriyle eşleşen bir <emphasis>karakter sınıfıdır</emphasis>; diğer dizgi ise ya <literal>Henrik</literal> <emphasis>ya da</emphasis> <literal>Pernille</literal> ile eşleşen bir alt dizgi ve <literal> sa</literal> dizisiyle tam olarak eşleşen bir parçadır ve son olarak ya <literal>ys</literal> <emphasis>ya da</emphasis> <literal>id</literal> ile eşleşen bir alt dizgidir

source: The string <literal>{0,4}</literal> is a quantifier saying <quote>anywhere from 0 up to 4 of the previous</quote>.
tr: <literal>{0,4}</literal> dizisi, <quote>öncekinin 0’dan 4’e kadar herhangi bir yer</quote> olan bir niceleyicidir.

source: Because regular expression software supporting the concept of <emphasis>back references</emphasis> saves the entire matching part of the string as well as sub-patterns enclosed in parentheses, given some means of access to those references, we could get our hands on either the whole match (when searching a text document in an editor with a regular expression, that is often marked as selected) or either the name found, or the last part of the verb.
tr: <emphasis>Geriye başvurular</emphasis> kavramını destekleyen düzenli ifade yazılımı, dizinin eşleşen kısmının tümünü ve parantez içine alınmış alt dizgileri kaydettiği için bu başvurulara bazı erişim araçları verildiğinde, ya eşleşmenin tümünü (düzenli bir ifadeyle bir düzenleyicide bir metin belgesi aranırken, bu genellikle seçilmiş olarak işaretlenir) ya da bulunan ad ya da yüklemin son kısmını ele alabiliriz.

source: All together, the expression will match where we wanted it to, and only there.
tr: Tümü birlikte, ifade nerede eşleşmesini istiyorsak yalnızca orada eşleşir.

source: The following sections will describe in details how to construct and use patterns, character classes, assertions, quantifiers and back references, and the final section will give a few useful examples.
tr: Aşağıdaki bölümlerde dizgilerin, karakter sınıflarının, savların, niceleyicilerin ve geriye başvuruların nasıl oluşturulacağı ve kullanılacağı ayrıntılı olarak açıklanacak ve son bölümde birkaç yararlı örnek verilecektir.

source: <title>Patterns</title>
tr: <title>Dizgiler</title>

source: Patterns consists of literal strings and character classes. Patterns may contain sub-patterns, which are patterns enclosed in parentheses.
tr: Dizgiler, değişmez dizilerden ve karakter sınıflarından oluşur. Dizgiler, parantez içine alınmış dizgiler olan alt dizgiler içerebilir.

source: Escaping characters
tr: Karakterleri kaçırmak

source: In patterns as well as in character classes, some characters have a special meaning. To literally match any of those characters, they must be marked or <emphasis>escaped</emphasis> to let the regular expression software know that it should interpret such characters in their literal meaning.
tr: Dizgilerde olduğu gibi karakter sınıflarında da bazı karakterlerin özel bir anlamı vardır. Bu karakterlerden herhangi birini tam anlamıyla eşleştirmek için düzenli ifade yazılımının bu tür karakterleri gerçek anlamlarında yorumlaması gerektiğini bilmesini sağlamak amacıyla bunların imlenmesi veya <emphasis>kaçırılması</emphasis> gerekir.

source: This is done by prepending the character with a backslash (<literal>\</literal>).
tr: Bu, karakterin başına ters eğik çizgi (<literal>\</literal>) getirilerek yapılır.

source: The regular expression software will silently ignore escaping a character that does not have any special meaning in the context, so escaping for example a <quote>j</quote> (<userinput>\j</userinput>) is safe. If you are in doubt whether a character could have a special meaning, you can therefore escape it safely.
tr: Düzenli ifade yazılımı, bağlamda herhangi bir özel anlamı olmayan bir karakterden kaçmayı sessizce yok sayar; bu nedenle, örneğin bir <quote>j</quote> (<userinput>\j</userinput>) karakterinden kaçmak güvenlidir. Bir karakterin özel bir anlamı olup olmadığından kuşkunuz varsa onu güvenle kaçırabilirsiniz.

source: Escaping of course includes the backslash character itself, to literally match a such, you would write <userinput>\\</userinput>.
tr: Kaçış, elbette ters eğik çizgi karakterinin kendisini de içerir, böyle bir dizinin tam anlamıyla eşleşmesi için <userinput>\\</userinput> yazarsınız.

source: Character Classes and abbreviations
tr: Karakter sınıfları ve kısaltmalar

source: A <emphasis>character class</emphasis> is an expression that matches one of a defined set of characters. In Regular Expressions, character classes are defined by putting the legal characters for the class in square brackets, <literal>[]</literal>, or by using one of the abbreviated classes described below.
tr: Bir <emphasis>karakter sınıfı</emphasis>, tanımlanmış bir karakter kümesinden biriyle eşleşen bir ifadedir. Düzenli ifadelerde karakter sınıfları, sınıfın yasal karakterlerini <literal>[]</literal> köşeli parantez içine alarak veya aşağıda açıklanan kısaltılmış sınıflardan birini kullanarak tanımlanır.

source: Simple character classes just contains one or more literal characters, for example <userinput>[abc]</userinput> (matching either of the letters <quote>a</quote>, <quote>b</quote> or <quote>c</quote>) or <userinput>[0123456789]</userinput> (matching any digit).
tr: Basit karakter sınıfları yalnızca bir veya daha çok düz karakter içerir; örneğin, <userinput>[abc]</userinput> (<quote>a</quote>, <quote>b</quote> veya <quote>c</quote> harflerinden biriyle eşleşir) veya <userinput>[0123456789]</userinput> (herhangi bir rakamla eşleşir).

source: Because letters and digits have a logical order, you can abbreviate those by specifying ranges of them: <userinput>[a-c]</userinput> is equal to <userinput>[abc]</userinput> and <userinput>[0-9]</userinput> is equal to <userinput>[0123456789]</userinput>. Combining these constructs, for example <userinput>[a-fynot1-38]</userinput> is completely legal (the last one would match, of course, either of <quote>a</quote>,<quote>b</quote>,<quote>c</quote>,<quote>d</quote>, <quote>e</quote>,<quote>f</quote>,<quote>y</quote>,<quote>n</quote>,<quote>o</quote>,<quote>t</quote>, <quote>1</quote>,<quote>2</quote>,<quote>3</quote> or <quote>8</quote>).
tr: Harfler ve rakamlar mantıksal bir sıraya sahip olduğundan, erimlerini belirterek bunları kısaltabilirsiniz: <userinput>[a-c]</userinput>, <userinput>[abc]</userinput>’ye ve <userinput>[0-9]</userinput> ise <userinput>[0123456789]</userinput>’a eşittir. Bu yapıları birleştirerek; örneğin <userinput>[a-fynot1-38]</userinput> gibi tümüyle geçerli bir yapı oluşturabilirsiniz (sonuncusu, elbette <quote>a</quote>,<quote>b</quote>,<quote>c</quote>,<quote>d</quote>, <quote>e</quote>,<quote>f</quote>,<quote>y</quote>,<quote>n</quote>,<quote>o</quote>,<quote>t</quote>, <quote>1</quote>,<quote>2</quote>,<quote>3</quote> veya <quote>8</quote> ögelerinden biriyle eşleşecektir).

source: As capital letters are different characters from their non-capital equivalents, to create a caseless character class matching <quote>a</quote> or <quote>b</quote>, in any case, you need to write it <userinput>[aAbB]</userinput>.
tr: BÜYÜK harfler, BÜYÜK harf olmayan karşılıklarından farklı karakterler olduğundan, <quote>a</quote> veya <quote>b</quote> ile eşleşen ve BÜYÜK/küçük harf duyarsız bir karakter sınıfı oluşturmak için her durumda, onu <userinput>[aAbB]</userinput> olarak yazmanız gerekir.

source: It is of course possible to create a <quote>negative</quote> class matching as <quote>anything but</quote> To do so put a caret (<literal>^</literal>) at the beginning of the class:
tr: Elbette <quote>herhangi bir şeyin dışındaki her şeyle</quote> eşleşen bir <quote>negatif</quote> sınıf oluşturmak olanaklıdır. Bunu yapmak için sınıfın başına bir şapka (<literal>^</literal>) koyun:

source: <userinput>[^abc]</userinput> will match any character <emphasis>but</emphasis> <quote>a</quote>, <quote>b</quote> or <quote>c</quote>.
tr: <userinput>[^abc]</userinput>, <quote>a</quote>, <quote>b</quote> veya <quote>c</quote> <emphasis>dışındaki</emphasis> herhangi bir karakterler eşleşir.

source: In addition to literal characters, some abbreviations are defined, making life still a bit easier:
tr: Gerçek karakterlerin yanı sıra bazı kısaltmalar da tanımlanmış olup bu da işimizi biraz daha kolaylaştırmaktadır:

source: This matches the &ASCII; bell character (BEL, 0x07).
tr: Bu, &ASCII; zil karakteriyle (BEL, 0x07) eşleşir.

source: This matches the &ASCII; form feed character (FF, 0x0C).
tr: Bu, &ASCII; form besleme karakteriyle (FF, 0x0C) eşleşir.

source: This matches the &ASCII; line feed character (LF, 0x0A, Unix newline).
tr: Bu, &ASCII; satır besleme karakteriyle (LF, 0x0A, Unix yenisatır) eşleşir.

source: This matches the &ASCII; carriage return character (CR, 0x0D).
tr: Bu, &ASCII; satır başı karakteriyle (CR, 0x0D) eşleşir.

source: This matches the &ASCII; horizontal tab character (HT, 0x09).
tr: Bu, &ASCII; yatay sekme karakteriyle (HT, 0x09) eşleşir.

source: This matches the &ASCII; vertical tab character (VT, 0x0B).
tr: Bu, &ASCII; dikey sekme karakteriyle (VT, 0x0B) eşleşir.

source: This matches the Unicode character corresponding to the hexadecimal number hhhh (between 0x0000 and 0xFFFF). \0ooo (&ie;, \zero ooo) matches the &ASCII;/Latin-1 character corresponding to the octal number ooo (between 0 and 0377).
tr: Bu, onaltılık hhhh Unicode karakteriyle eşleşir (0x0000 ve 0xFFFF arasında). \0ooo (&ie;, \zero ooo), ooo sekizlik &ASCII;/Latin-1 karakteriyle eşleşir (0 ve 0377).

source: <userinput>.</userinput> (dot)
tr: <userinput>.</userinput> (nokta)

source: This matches any character (including newline).
tr: Bu, herhangi bir karakterle eşleşir (yenisatır içerilir).

source: This matches a digit. Equal to <literal>[0-9]</literal>
tr: Bu, bir rakamla eşleşir. <literal>[0-9]</literal> ile aynıdır

source: This matches a non-digit. Equal to <literal>[^0-9]</literal> or <literal>[^\d]</literal>
tr: Bu, rakam olmayan bir şeyle eşleşir. <literal>[^0-9]</literal> veya <literal>[^\d]</literal> ile aynıdır

source: This matches a whitespace character. Practically equal to <literal>[ \t\n\r]</literal>
tr: Bu, boşluk karakteriyle eşleşir. <literal>[ \t\n\r]</literal> ile aynı şeydir

source: This matches a non-whitespace. Practically equal to <literal>[^ \t\r\n]</literal>, and equal to <literal>[^\s]</literal>
tr: Bu, boşluk olmayan bir karakterle eşleşir. <literal>[^ \t\r\n]</literal> ve <literal>[^\s]</literal> ile aynıdır

source: Matches any <quote>word character</quote> - in this case any letter, digit or underscore. Equal to <literal>[a-zA-Z0-9_]</literal>
tr: Herhangi bir <quote>sözcük karakteriyle</quote> eşleşir; bu durumda bu bir harf, rakam veya alt çizgi olabilir. <literal>[a-zA-Z0-9_]</literal> ile aynıdır

source: Matches any non-word character - anything but letters, numbers or underscore. Equal to <literal>[^a-zA-Z0-9_]</literal> or <literal>[^\w]</literal>
tr: Bu, sözcük karakteri olmayan herhangi bir karakterler eşleşir; bu durumda bu harfler, sayılar ve alt çizgi dışındaki her şey olabilir. <literal>[^a-zA-Z0-9_]</literal> veya <literal>[^\w]</literal> ile aynıdır

source: The <emphasis>POSIX notation of classes</emphasis>, <userinput>[:&lt;class name&gt;:]</userinput> are also supported. For example, <userinput>[:digit:]</userinput> is equivalent to <userinput>\d</userinput>, and <userinput>[:space:]</userinput> to <userinput>\s</userinput>. See the full list of POSIX character classes <ulink url="https://www.regular-expressions.info/posixbrackets.html">here</ulink>.
tr: <emphasis>Sınıfların POSIX biçimine simgelemi</emphasis>, <userinput>[:&lt;class name&gt;:]</userinput> de ayrıca desteklenir. Örneğin, <userinput>[:digit:]</userinput>, <userinput>\d</userinput>’e ve <userinput>[:space:]</userinput> de <userinput>\s</userinput>’e eşittir. POSIX karakter sınıflarının tam listesine <ulink url="https://www.regular-expressions.info/posixbrackets.html">buradan</ulink> bakabilirsiniz.

source: The abbreviated classes can be put inside a custom class, for example to match a word character, a blank or a dot, you could write <userinput>[\w \.]</userinput>
tr: Kısaltılmış sınıflar özel bir sınıfın içine yerleştirilebilir; örneğin bir sözcük karakteriyle, bir boşlukla veya bir noktayla eşleştirmek için <userinput>[\w \.]</userinput> yazabilirsiniz

source: Characters with special meanings inside character classes
tr: Karakter sınıflarındaki özel anlamlara sahip karakterler

source: The following characters has a special meaning inside the <quote>[]</quote> character class construct, and must be escaped to be literally included in a class:
tr: Aşağıdaki karakterlerin <quote>[]</quote> karakter sınıfı yapısında özel bir anlamı vardır ve bir sınıfa sözcüğün tam anlamıyla içerilebilmesi için kaçış karakterlerinin kullanılması gerekir:

source: Ends the character class. Must be escaped unless it is the very first character in the class (may follow an unescaped caret).
tr: Karakter sınıfını sonlandırır. Sınıftaki ilk karakter olmadığı sürece kaçırılmalıdır (kaçırılmamış bir şapka işaretinden sonra gelebilir).

source: <userinput>^</userinput> (caret)
tr: <userinput>^</userinput> (şapka)

source: Denotes a negative class, if it is the first character. Must be escaped to match literally if it is the first character in the class.
tr: İlk karakter ise negatif sınıfı belirtir. Sınıfın ilk karakteri ise sözcüğün tam anlamıyla eşleşecek biçimde kaçırılmalıdır.

source: <userinput>-</userinput> (dash)
tr: <userinput>-</userinput> (tire)

source: Denotes a logical range. Must always be escaped within a character class.
tr: Mantıksal bir erimi belirtir. Bir karakter sınıfı içinde her zaman kaçırılmalıdır.

source: <userinput>\</userinput> (backslash)
tr: <userinput>\</userinput> (ters eğik çizgi)

source: The escape character. Must always be escaped.
tr: Kaçış karakteri. Her zaman kaçırılmalıdır.

source: Alternatives: matching <quote>one of</quote>
tr: Alternatifler: Bunlardan <quote>biriyle</quote> eşleştirmek

source: If you want to match one of a set of alternative patterns, you can separate those with <literal>|</literal> (vertical bar character).
tr: Bir dizi alternatif dizgiden birini eşleştirmek istiyorsanız bunları <literal>|</literal> (dikey çubuk karakteri) ile ayırabilirsiniz.

source: For example to find either <quote>John</quote> or <quote>Harry</quote> you would use an expression <userinput>John|Harry</userinput>.
tr: Örneğin <quote>John</quote> veya <quote>Harry</quote> bulmak istediğinizde <userinput>John|Harry</userinput> düzenli ifadesini kullanırsınız.

source: Sub Patterns
tr: Alt Dizgiler

source: <emphasis>Sub patterns</emphasis> are patterns enclosed in parentheses, and they have several uses in the world of regular expressions.
tr: <emphasis>Alt dizgiler</emphasis>, parantez içine alınmış dizgilerdir ve düzenli ifadeler dünyasında çeşitli kullanımları vardır.

source: Specifying alternatives
tr: Alternatifleri belirtmek

source: You may use a sub pattern to group a set of alternatives within a larger pattern. The alternatives are separated by the character <quote>|</quote> (vertical bar).
tr: Bir dizi alternatifi daha büyük bir dizgi içinde gruplandırmak için bir alt dizgi kullanabilirsiniz. Alternatifler <quote>|</quote> (dikey çubuk) karakteriyle ayrılır.

source: For example to match either of the words <quote>int</quote>, <quote>float</quote> or <quote>double</quote>, you could use the pattern <userinput>int|float|double</userinput>. If you only want to find one if it is followed by some whitespace and then some letters, put the alternatives inside a subpattern: <userinput>(int|float|double)\s+\w+</userinput>.
tr: Örneğin, <quote>int</quote>, <quote>float</quote> veya <quote>double</quote> sözcüklerinden biriyle eşleşmek için <userinput>int|float|double</userinput> dizgisini kullanabilirsiniz. Yalnızca bir boşluk ve ardından birkaç harf gelen bir tanesini bulmak istiyorsanız alternatifleri bir alt dizginin içine yerleştirin: <userinput>(int|float|double)\s+\w+</userinput>.

source: Capturing matching text (back references)
tr: Eşleşen metni yakalamak (geriye başvurular)

source: If you want to use a back reference, use a sub pattern <userinput>(PATTERN)</userinput> to have the desired part of the pattern remembered. To prevent the sub pattern from being remembered, use a non-capturing group <userinput>(?:PATTERN)</userinput>.
tr: Geriye başvuru kullanmak istiyorsanız dizginin istenilen kısmının anımsanması için <userinput>(DİZGİ)</userinput> alt dizgisini kullanın. Alt dizginin anımsanmasını önlemek için yakalamayan bir <userinput>(?:DİZGİ)</userinput> grubu kullanın.

source: For example, if you want to find two occurrences of the same word separated by a comma and possibly some whitespace, you could write <userinput>(\w+),\s*\1</userinput>. The sub pattern <literal>\w+</literal> would find a chunk of word characters, and the entire expression would match if those were followed by a comma, 0 or more whitespace and then an equal chunk of word characters. (The string <literal>\1</literal> references <emphasis>the first sub pattern enclosed in parentheses</emphasis>.)
tr: Örneğin, aynı sözcüğün virgülle ve büyük olasılıkla bir miktar boşlukla ayrılmış iki örneğini bulmak istiyorsanız <userinput>(\w+),\s*\1</userinput> yazabilirsiniz. <literal>\w+</literal> alt dizgisi bir sözcük karakterleri parçası bulur ve ifadenin tümü onlardan sonra bir virgül, 0 veya birden çok boşluk ve aynı miktarda sözcük karakteri geliyorsa eşleşir. (<literal>\1</literal> dizisi, <emphasis>paranteze alınmış ilk alt dizgiye</emphasis> başvurur.)
