Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_menus.po
Languages: tr

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;&Shift;<keycap>F</keycap> </keycombo></shortcut><guimenu>View</guimenu><guisubmenu>Tool Views</guisubmenu> <guimenuitem>Show Sidebars</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Alt;&Shift;<keycap>F</keycap> </keycombo></shortcut><guimenu>Görünüm</guimenu><guisubmenu>Araç Görünümleri</guisubmenu> <guimenuitem>Kenar Çubuklarını Göster</guimenuitem>

source: Toggles the display of the sidebar button rows. This command does not affect the display of the sidebar content widgets, any sidebar that is visible will stay visible, and if you assigned shortcuts to the commands below those will of course continue to work.
tr: Kenar çubuğu düğmesi satırlarının görünümünü değiştirir. Bu komut, kenar çubuğu içerik araç takımlarının görüntülenmesini etkilemez; görünür olan herhangi bir kenar çubuğu görünür durumda kalacaktır ve aşağıdaki komutlara kısayollar atadıysanız elbette bunlar çalışmayı sürdürecektir.

source: <guimenu>View</guimenu> <guisubmenu>Tool Views</guisubmenu> <guimenuitem>Show <replaceable>Plugin</replaceable></guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Araç Görünümleri</guisubmenu> <guimenuitem><replaceable>Eklenti Adı</replaceable> Ögesini Göster</guimenuitem>

source: A list of all enabled plugins. Use the checkbox in front of each item to toggle the display of the tool view.
tr: Etkinleştirilen tüm eklentilerin listesi. Araç görünümünün görünümünü değiştirmek için her ögenin önündeki onay kutusunu kullanın.

source: <shortcut> <keycap>F7</keycap> </shortcut> <guimenu>View</guimenu> <guimenuitem>Switch to Command Line</guimenuitem>
tr: <shortcut> <keycap>F7</keycap> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Komut Satırına Geç</guimenuitem>

source: This command will toggle the display of the <ulink url="help:/katepart/advanced-editing-tools-commandline.html">built-in command line</ulink>.
tr: Bu komut, <ulink url="help:/katepart/advanced-editing-tools-commandline.html">yerleşik komut satırının</ulink> görüntülenmesini açacaktır/kapatacaktır.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Enlarge Font</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Yazıtipini Büyüt</guimenuitem>

source: This increases the display font size.
tr: Bu, görüntü yazıtipi puntosunu artırır.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Shrink Font</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Yazıtipini Küçült</guimenuitem>

source: This decreases the display font size.
tr: Bu, görüntü yazıtipi puntosunu azaltır.

source: <guimenu>View</guimenu> <guisubmenu>Schema</guisubmenu>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Şema</guisubmenu>

source: This menu lists the available color schemes. You can change the schema for the current view here, to change the default schema you need to use the <ulink url="help:/katepart/config-dialog-editor.html#prefcolors">Fonts &amp; Colors</ulink> page of the config dialog.
tr: Bu menü, kullanılabilir renk şemalarını listeler. Geçerli görünümün şemasını buradan değiştirebilirsiniz; öntanımlı şemayı değiştirmek için yapılandırma iletişim kutusunun <ulink url="help:/katepart/config-dialog-editor.html#prefcolors">Yazıtipleri ve Renkler</ulink> sayfasını kullanmanız gerekir.

source: <shortcut> <keycombo action="simul"><keycap>F10</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guisubmenu>Word Wrap</guisubmenu> <guimenuitem>Dynamic Word Wrap</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>F10</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guisubmenu>Sözcük Kaydırma</guisubmenu> <guimenuitem>Devingen Sözcük Kaydırma</guimenuitem>

source: Toggles dynamic word wrap in the current view. Dynamic word wrap makes all the text in a view visible without the need for horizontal scrolling by rendering one actual line on more visual lines as needed.
tr: Geçerli görünümde devingen sözcük kaydırmayı açar/kapatır. Devingen sözcük kaydırma, gerektiğinde daha fazla görsel satırda tek bir gerçek satırı oluşturarak, yatay kaydırmaya gerek kalmadan görünümdeki tüm metni görünür hale getirir.

source: <guimenu>View</guimenu> <guisubmenu>Word Wrap</guisubmenu> <guisubmenu>Dynamic Word Wrap Indicators</guisubmenu>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Sözcük Kaydırma</guisubmenu> <guisubmenu>Devingen Sözcük Kaydırma Belirteçleri</guisubmenu>

source: Choose when and how the dynamic word wrap indicators should be displayed. This is only available if the <guilabel>Dynamic Word Wrap</guilabel> option is checked.
tr: Devingen sözcük kaydırma belirteçlerinin ne zaman ve nasıl görüntüleneceğini seçin. Bu yalnızca <guilabel>Devingen Sözcük Kaydırma</guilabel> seçeneği işaretliyse kullanılabilir.

source: <guimenu>View</guimenu> <guisubmenu>Word Wrap</guisubmenu> <guimenuitem>Show Static Word Wrap Marker</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Sözcük Kaydırma</guisubmenu> <guimenuitem>Durağan Sözcük Kaydırma İşaretçisini Göster</guimenuitem>

source: Toggles the display of a vertical line indicating the position of the wrap width as configured in the <ulink url="help:/katepart/config-dialog-editor.html#pref-wrap-words-at">config dialog</ulink>. This feature requires that you use a true fixed-width font.
tr: <ulink url="help:/katepart/config-dialog-editor.html#pref-wrap-words-at">Yapılandırma iletişim kutusunda</ulink> yapılandırıldığı şekliyle sarma genişliğinin konumunu gösteren dikey bir çizginin görünümünü değiştirir. Bu özellik, gerçek eş aralıklı bir yazıtipi kullanmanızı gerektirir.

source: <shortcut> <keycombo action="simul"><keycap>F6</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guisubmenu>Borders</guisubmenu> <guimenuitem>Show Icon Border</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>F6</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guisubmenu>Kenarlıklar</guisubmenu> <guimenuitem>Simge Kenarlığını Göster</guimenuitem>

source: This is a toggle item. Setting it on checked will make the Icon Border visible in the left side of the active editor, and vice versa. The Icon Border indicates the positions of the marked lines in the editor.
tr: Bu bir geçiş ögesidir. İşaretli olarak ayarlamak, simge kenarlığının etkin düzenleyicinin sol tarafında görünmesini sağlar (veya bunun tersi de geçerlidir). Simge kenarlığı, işaretli satırların düzenleyicideki konumlarını gösterir.

source: <shortcut> <keycombo action="simul"><keycap>F11</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guisubmenu>Borders</guisubmenu> <guimenuitem>Show Line Numbers</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>F11</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guisubmenu>Kenarlıklar</guisubmenu> <guimenuitem>Satır Numaralarını Göster</guimenuitem>

source: This is a toggle Item. Setting it on checked will make a pane displaying the line numbers of the document visible in the left border of the active editor, and vice versa.
tr: Bu bir geçiş ögesidir. İşaretli olarak ayarlamak, belgenin satır numaralarını gösteren bir bölmenin etkin düzenleyicinin sol kenarında görünmesini sağlar (veya bunun tersi de geçerlidir).

source: <guimenu>View</guimenu> <guisubmenu>Borders</guisubmenu> <guimenuitem>Show Scrollbar Marks</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Kenarlıklar</guisubmenu> <guimenuitem>Sarma Çubuğu İmlerini Göster</guimenuitem>

source: Toggles the visualization of bookmarks (and other marks) on the vertical scrollbar. When enabled, a mark is represented by a thin line in the mark color at the scrollbar, clicking the &MMB; on the line will scroll the view to a position near the mark.
tr: Dikey sarma çubuğundaki yer imlerinin (ve diğer işaretlerin) görselleştirilmesini açar/kapatır. Etkinleştirildiğinde, bir im, sarma çubuğundaki im renginde ince bir çizgiyle temsil edilir; çizgideki &MMB; düğmesine tıklamak, görünümü imin yakınındaki bir konuma saracaktır.

source: <guimenu>View</guimenu> <guisubmenu>Borders</guisubmenu> <guimenuitem>Show Scrollbar Mini-Map</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Kenarlıklar</guisubmenu> <guimenuitem>Sarma Çubuğu Küçük Haritasını Göster</guimenuitem>

source: This will replace the scrollbar with a visualization of the current document. For more information on the scrollbar minimap, see the <ulink url="help:/katepart/kate-part-scrollbar-minimap.html">Scrollbar Minimap section of the &katepart; Handbook</ulink>.
tr: Bu, sarma çubuğunu geçerli belgenin görselleştirmesiyle değiştirecektir. Sarma çubuğu mini haritası hakkında daha fazla bilgi için <ulink url="help:/katepart/kate-part-scrollbar-minimap.html">&katepart; El Kitabı’nın Sarma Çubuğu Mini Haritası</ulink> bölümüne bakın.

source: <guimenu>View</guimenu> <guimenuitem>Code Folding</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Kod Katlama</guimenuitem>

source: These options pertain to <ulink url="help:/katepart/advanced-editing-tools-code-folding.html">code folding</ulink>:
tr: Bu seçenekler, <ulink url="help:/katepart/advanced-editing-tools-code-folding.html">kod katlama</ulink> ile ilgilidir:

source: <shortcut> <keycombo action="simul"><keycap>F9</keycap></keycombo> </shortcut> <guimenuitem>Show Folding Markers</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>F9</keycap></keycombo> </shortcut> <guimenuitem>Katlama İmleyicilerini Göster</guimenuitem>

source: Toggles the display of the folding marker pane in the left side of the view.
tr: Görünümün sol tarafındaki katlama imleyicisi bölmesinin görüntülenmesini açar/kapatır.

source: Fold Current Node
tr: Geçerli Düğümü Katla

source: Collapse the region that contains the cursor.
tr: İmlecin bulunduğu bölgeyi daraltın.

source: Unfold Current Node
tr: Geçerli Düğümün Katını Aç

source: Expand the region that contains the cursor.
tr: İmlecin bulunduğu bölgeyi genişletin.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>-</keycap></keycombo> </shortcut> <guimenuitem>Fold Toplevel Nodes</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>-</keycap></keycombo> </shortcut> <guimenuitem>Üst Düzey Düğümleri Katla</guimenuitem>

source: Collapse all toplevel regions in the document. Click on the right pointing triangle to expand all toplevel regions.
tr: Belgedeki tüm üst düzey bölgeleri daraltın. Tüm üst düzey bölgeleri genişletmek için sağdaki işaret üçgenine tıklayın.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>+</keycap></keycombo> </shortcut> <guimenuitem>Unfold Toplevel Nodes</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>+</keycap></keycombo> </shortcut> <guimenuitem>Üst Düzey Düğümlerin Katını Aç</guimenuitem>

source: Expand all toplevel regions in the document.
tr: Belgedeki tüm üst düzey bölgeleri genişletin.

source: Show Non-Printable Spaces
tr: Yazdırılamaz Boşlukları Göster

source: Show/hide bounding box around non-printable spaces.
tr: Yazdırılamaz alanların çevresindeki sınırlayıcı kutuyu gösterin/gizleyin.

source: The Bookmarks Menu
tr: Yer İmleri Menüsü

source: Below the entries described here, one entry for each bookmark in the active document will be available. The text will be the first few words of the marked line. Choose an item to move the cursor to the start of that line. The editor will scroll as necessary to make that line visible.
tr: Burada açıklanan girdilerin altında, etkin belgedeki her yer imi için bir giriş kullanılabilir olacaktır. Metin, imli satırın ilk birkaç sözcüğü olur. İmleci o satırın başına taşımak için bir öge seçin. Düzenleyici, bu satırı görünür kılmak için gerektiği kadar sarar.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Bookmarks</guimenu> <guimenuitem>Set Bookmark</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Yer İmleri</guimenu> <guimenuitem>Yer İmi Ayarla</guimenuitem>

source: Sets or removes a bookmark in the current line of the active document. (If it's there, it is removed, otherwise one is set.)
tr: Etkin belgenin geçerli satırına bir yer imi koyar veya kaldırır (Eğer oradaysa kaldırılır, aksi takdirde bir tane koyulur.)

source: <guimenu>Bookmarks</guimenu> <guimenuitem>Clear All Bookmarks</guimenuitem>
tr: <guimenu>Yer İmleri</guimenu> <guimenuitem>Tüm Yer İmlerini Temizle</guimenuitem>

source: This command will remove all the markers from the document as well as the list of markers which is appended at the bottom of this menu item.
tr: Bu komut, belgedeki tüm imleyicilerin yanı sıra bu menü ögesinin altına eklenen imleyiciler listesini de kaldıracaktır.

source: <shortcut> <keycombo action="simul">&Alt;&PgUp;</keycombo> </shortcut> <guimenu>Bookmarks</guimenu> <guimenuitem>Previous</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;&PgUp;</keycombo> </shortcut> <guimenu>Yer İmleri</guimenu> <guimenuitem>Önceki</guimenuitem>

source: This will move the cursor to beginning of the first above line with a bookmark. The menuitem text will include the line number and the first piece of text on the line. This item is only available when there is a bookmark in a line above the cursor.
tr: Bu, imleci yukarıdaki yer iminin bulunduğu ilk satırın başına taşır. Menü ögesi metni, satır numarasını ve satırdaki ilk metin parçasını içerecektir. Bu öge yalnızca imlecin üzerindeki satırda bir yer imi bulunduğunda kullanılabilir.

source: <shortcut> <keycombo action="simul">&Alt;&PgDn;</keycombo> </shortcut> <guimenu>Bookmarks</guimenu> <guimenuitem>Next</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;&PgDn;</keycombo> </shortcut> <guimenu>Yer İmleri</guimenu> <guimenuitem>Sonraki</guimenuitem>

source: This will move the cursor to beginning of the next line with a bookmark. The menuitem text will include the line number and the first piece of text on the line. This item is only available when there is a bookmark in a line below the cursor.
tr: Bu, imleci yukarıdaki yer iminin bulunduğu sonraki satırın başına taşır. Menü ögesi metni, satır numarasını ve satırdaki ilk metin parçasını içerecektir. Bu öge yalnızca imlecin üzerindeki satırda bir yer imi bulunduğunda kullanılabilir.

source: The Sessions Menu
tr: Oturumlar Menüsü

source: This menu contains entries for using and managing &kate; sessions. For more information, read <link linkend="fundamentals-using-sessions">Using Sessions</link>.
tr: Bu menü, &kate; oturumlarını kullanmak ve yönetmek için girdiler içerir. Daha fazla bilgi için <link linkend="fundamentals-using-sessions">Oturumları Kullanmak</link> bölümünü okuyun.

source: <guimenu>Sessions</guimenu> <guimenuitem>New</guimenuitem>
tr: <guimenu>Oturumlar</guimenu> <guimenuitem>Yeni</guimenuitem>

source: Creates a new empty session. All currently open files will be closed.
tr: Yeni bir boş oturum oluşturur. Şu anda açık olan tüm dosyalar kapatılır.

source: <guimenu>Sessions</guimenu> <guimenuitem>Open Session...</guimenuitem>
tr: <guimenu>Oturumlar</guimenu> <guimenuitem>Oturum Aç…</guimenuitem>

source: Open an existing session. The Session Chooser dialog is displayed to let you choose one.
tr: Var olan bir oturumu açın. Birini seçmenize izin vermek için Oturum Seçicisi iletişim kutusu görüntülenir.

source: <guimenu>Sessions</guimenu> <guisubmenu>Quick Open Session</guisubmenu>
tr: <guimenu>Oturumlar</guimenu> <guisubmenu>Tez Oturum Aç</guisubmenu>

source: This submenu lets you open an existing session.
tr: Bu alt menü, var olan bir oturumu açmanıza olanak tanır.

source: <guimenu>Sessions</guimenu> <guimenuitem>Save Session</guimenuitem>
tr: <guimenu>Oturumlar</guimenu> <guimenuitem>Oturumu Kaydet</guimenuitem>

source: Save the current session. If the session is anonymous, you will be prompted for a session name.
tr: Geçerli oturumu kaydedin. Oturum anonimse sizden bir oturum adı istenecektir.

source: <guimenu>Sessions</guimenu> <guimenuitem>Save Session As...</guimenuitem>
tr: <guimenu>Oturumlar</guimenu> <guimenuitem>Oturumu Farklı Kaydet…</guimenuitem>

source: Save the current session under a new name. You are prompted for a name to use.
tr: Geçerli oturumu yeni bir adla kaydedin. Kullanılacak bir ad istenir.

source: <guimenu>Sessions</guimenu> <guimenuitem>Manage Sessions...</guimenuitem>
tr: <guimenu>Oturumlar</guimenu> <guimenuitem>Oturumları Yönet…</guimenuitem>

source: Displays the Session Manager dialog which allows you to rename and delete sessions.
tr: Oturumları yeniden adlandırmanıza ve silmenize olanak tanıyan Oturum Yöneticisi iletişim kutusunu görüntüler.

source: The Tools Menu
tr: Araçlar Menüsü

source: <guimenu>Tools</guimenu> <guimenuitem>Read Only Mode</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Saltokunur Kip</guimenuitem>

source: Set the current document to Read Only mode. This prevents any text addition and any changes in the document formatting.
tr: Geçerli belgeyi saltokunur kipe ayarlayın. Bu, herhangi bir metin eklenmesini ve belge biçimindeki herhangi bir değişikliği önler.

source: <guimenu>Tools</guimenu> <guisubmenu>Mode</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Kip</guisubmenu>

source: Choose the filetype scheme you prefer for the active document. This overwrites the global <ulink url="help:/katepart/pref-open-save-modes-filetypes.html">filetype</ulink> mode set in <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure &kate;...</guimenuitem></menuchoice> in the Filetypes tab for your current document only.
tr: Etkin belge için tercih ettiğiniz <ulink url="help:/katepart/pref-open-save-modes-filetypes.html">dosya türü</ulink> şemasını seçin. Bu, yalnızca geçerli belgeniz için Dosya Türleri sekmesinde <menuchoice><guimenu>Ayarlar</guimenu> <guimenuitem>&kate; Uygulamasını Yapılandır…</guimenuitem></menuchoice> bölümünde ayarlanan global dosya türü kipinin üzerine yazar.

source: <guimenu>Tools</guimenu> <guisubmenu>Highlighting</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Vurgulama</guisubmenu>

source: Choose the Highlighting scheme you prefer for the active document. This overwrites the global highlighting mode set in <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Configure Editor...</guimenuitem> </menuchoice> for your current document only.
tr: Etkin belge için tercih ettiğiniz vurgulama şemasını seçin. Bu, yalnızca geçerli belgeniz için <menuchoice> <guimenu>Ayarlar</guimenu><guimenuitem>Düzenleyiciyi Yapılandır…</guimenuitem> </menuchoice> bölümünde ayarlanan global vurgulama kipinin üzerine yazar.

source: <guimenu>Tools</guimenu> <guisubmenu>Indentation</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Girintileme</guisubmenu>

source: Choose the <ulink url="help:/katepart/kate-part-autoindent.html">style of indentation</ulink> you want for your active document. This overwrites the global indentation mode set in <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Configure Editor...</guimenuitem> </menuchoice> for your current document only.
tr: Etkin belgeniz için istediğiniz <ulink url="help:/katepart/kate-part-autoindent.html">girintileme biçemini</ulink> seçin. Bu, yalnızca geçerli belgeniz için <menuchoice> <guimenu>Ayarlar</guimenu><guimenuitem>Düzenleyiciyi Yapılandır…</guimenuitem> </menuchoice> bölümünde ayarlanan global girintileme kipinin üzerine yazar.

source: <guimenu>Tools</guimenu> <guisubmenu>Encoding</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Kodlama</guisubmenu>

source: You can overwrite the default encoding set in <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Configure Editor...</guimenuitem> </menuchoice> in the <guilabel>Open/Save</guilabel> page to set a different encoding for your current document. The encoding you set here will be only valid for your current document.
tr: Etkin belgeniz için istediğiniz kodlamayı seçin. Bu, yalnızca geçerli belgeniz için <menuchoice> <guimenu>Ayarlar</guimenu><guimenuitem>Düzenleyiciyi Yapılandır…</guimenuitem> </menuchoice> bölümünde ayarlanan global kodlamanın üzerine yazar. Burada ayarladığınız kodlama, yalnızca şu anki belgeniz için geçerli olacaktır.

source: <guimenu>Tools</guimenu> <guisubmenu>End of Line</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Satır Sonu</guisubmenu>

source: Choose your preferred end of line mode for your active document. This overwrites the global end of line mode set in <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Configure Editor...</guimenuitem> </menuchoice> for your current document only.
tr: Etkin belgeniz için tercih ettiğiniz satır sonu kipini seçin. Bu, yalnızca geçerli belgeniz için <menuchoice> <guimenu>Ayarlar</guimenu><guimenuitem>Düzenleyiciyi Yapılandır…</guimenuitem> </menuchoice> bölümünde ayarlanan global satır sonu kipinin üzerine yazar.

source: <guimenu>Tools</guimenu> <guisubmenu>Add Byte Mark Order (BOM)</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Bayt Sıralama İmi (BOM) Ekle</guisubmenu>

source: Checking this action you can explicitly add a byte order mark for unicode encoded documents. The byte order mark (BOM) is a Unicode character used to signal the endianness (byte order) of a text file or stream, for more information see <ulink url="https://en.wikipedia.org/wiki/Byte_order_mark">Byte Order Mark</ulink>.
tr: Bu eylemi işaretleyerek Unicode kodlu belgeler için açıkça bir bayt sırası imi ekleyebilirsiniz. Bayt Sırası İmi (BOM), bir metin dosyasının veya akışın son haneliliğini (bayt sırasını) belirtmek için kullanılan bir Unicode karakterdir; daha fazla bilgi için <ulink url="https://en.wikipedia.org/wiki/Byte_order_mark">Bayt Sırası İmi</ulink> sayfasına bakın.

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu>

source: This submenu contains a list of all scripted actions. The list can easily be modified by <ulink url="help:/katepart/dev-scripting.html#dev-scripting-command-line">writing your own scripts</ulink>. This way, &kate; can be extended with user-defined tools.
tr: Bu alt menü, betiklerle yazılan tüm eylemlerin bir listesini içerir. Liste, kendi <ulink url="help:/katepart/dev-scripting.html#dev-scripting-command-line">betiklerinizi</ulink> yazarak kolayca değiştirilebilir. Böylece &kate;, kullanıcı tanımlı araçlarla genişletilebilir.

source: There is a complete list of scripts in the &katepart; documentation.
tr: &katepart; belgelendirmesinde betiklerin tam bir listesi bulunur.

source: <shortcut> <keycombo action="simul">&Ctrl;&Space;</keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Invoke Code Completion</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Space;</keycombo> </shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Kod Tamamlamayı Başlat</guimenuitem>

source: Manually invoke command completion, usually by using a shortcut bound to this action.
tr: Genellikle bu eyleme bağlı bir kısayol kullanarak komut tamamlamayı elle çağırın.

source: <guimenu>Tools</guimenu> <guimenuitem>Word Completion</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Sözcük Tamamlama</guimenuitem>
