Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_plugins.po
Languages: tr

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Alper</firstname><surname>Tekinalp</surname><affiliation><address><email>alper.tekinalp@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit><othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Working with Plugins
tr: Eklentilerle Çalışmak

source: You can enable the individual plugins in the <link linkend="configuring-kate-configdialog">configuration dialog</link>, which also provides access to additional configuration options for plugins that require it.
tr: Eklentileri teker teker <link linkend="configuring-kate-configdialog">yapılandırma iletişim kutusundan</link> etkinleştirebilirsiniz; burası ayrı zamanda ilgili eklenti yapılandırma seçeneklerine de erişim sağlar.

source: &kate; Application Plugins
tr: &kate; Uygulama Eklentileri

source: &kate; plugins are additional functions for the &kate; editor. They can add extra menus and shortcuts, and extend &kate;'s features. You can install as many or as few as you like, from within &kate;. Open &kate;'s configuration dialog with <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kate;...</guimenuitem></menuchoice> Select <menuchoice><guimenu>Application</guimenu><guimenuitem>Plugins</guimenuitem></menuchoice> to choose the wanted plugins.
tr: &kate; eklentileri, &kate; düzenleyicisine ek işlevsel sağlar. Ek menüler ve kısayollar ekleyebilirler ve &kate;’in özelliklerini genişletebilirler. &kate; içinden istediğiniz kadar kurabilirsiniz. &kate;’in yapılandırma iletişim kutusunu <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>&kate; Uygulamasını Yapılandır…</guimenuitem></menuchoice> yolunu izleyerek açın. İstediğiniz eklentileri seçmek için <menuchoice><guimenu>Uygulama</guimenu><guimenuitem>Eklentiler</guimenuitem></menuchoice> ögesini kullanın.

source: The available application plugins are:
tr: Kullanılabilir eklentiler:

source: <link linkend="kate-application-plugin-external-tools">External Tools</link> - Run external tools and applications
tr: <link linkend="kate-application-plugin-external-tools">Dış Araçlar</link> — Dış araçlar ve uygulamalar çalıştırın

source: <link linkend="kate-application-plugin-backtracebrowser">Backtrace Browser</link> - C/C++ Backtrace navigation tool view
tr: <link linkend="kate-application-plugin-backtracebrowser">Geri İz Tarayıcısı</link> — C/C++ Geri İzleri dolaşım araç görünümü

source: <link linkend="kate-application-plugin-build">Build Plugin</link> - Compile or Make and parse error messages
tr: <link linkend="kate-application-plugin-build">Yapı Eklentisi</link> — Derle/Yap ve hata iletilerini ayrıştırın

source: <link linkend="kate-application-plugin-closeexceptlike">Close Except/Like</link> - Close group of documents based on a common path or file extension
tr: <link linkend="kate-application-plugin-closeexceptlike">Dışındakini/Benzerini Kapat</link> — Ortak bir yol veya dosya uzantısı temelli bir belge grubunu kapatın

source: <link linkend="kate-application-plugin-colorpicker">Color Picker</link> - Show preview for known color names
tr: <link linkend="kate-application-plugin-colorpicker">Renk Seçicisi</link> — Bilinen renkler için önizlemeyi göster

source: <link linkend="kate-application-plugin-colored-brackets">Colored Brackets</link> - Colored brackets for readability
tr: <link linkend="kate-application-plugin-colored-brackets">Renklendirilmiş Ayraçlar</link> — Okunabilirlik için renklendirilmiş ayraçlar

source: <link linkend="kate-application-plugin-ctags">CTags</link> - Look up definitions/declarations with CTags
tr: <link linkend="kate-application-plugin-ctags">CTags</link> — Tanımları/Beyanları CTags ile arayın

source: <link linkend="kate-application-plugin-preview">Document preview</link> - Preview the document in the target format.
tr: <link linkend="kate-application-plugin-preview">Belge Önizlemesi</link> — Belgeyi hedef biçimde önizleyin

source: <link linkend="kate-application-plugin-documentswitcher">Document switcher</link> - Quick document switching with <keycombo action="simul">&Alt;&Tab;</keycombo> behavior
tr: <link linkend="kate-application-plugin-documentswitcher">Belge Değiştiricisi</link> — <keycombo action="simul">&Alt;&Tab;</keycombo> kombinasyonuyla tez belge değiştirmesi

source: <link linkend="kate-application-plugin-fsbrowser">File System Browser</link> - File system browser tool view
tr: <link linkend="kate-application-plugin-fsbrowser">Dosya Sistemi Tarayıcısı</link> — Dosya sistemi tarayıcısı araç görünümü

source: <link linkend="kate-application-plugin-documents">Document Tree View</link> - Displays the open files in a file tree
tr: <link linkend="kate-application-plugin-documents">Belge Ağacı Görünümü</link> — Açık belgeleri bir dosya ağacında görüntüler

source: <link linkend="kate-application-plugin-gdb">&gdb;</link> - Provides a simple &gdb; frontend
tr: <link linkend="kate-application-plugin-gdb">&gdb;</link> — Bir temel &gdb; ön ucu sağlar

source: <link linkend="kate-application-plugin-projects">Project Plugin</link> - Integration with &git; and other source control systems
tr: <link linkend="kate-application-plugin-projects">Proje Eklentisi</link> — &git; ve diğer kaynak denetim sistemleriyle tümleştirme

source: Replicode - Constructivist AI language and runtime
tr: Replicode — Yapılandırmacı yapay zeka dili ve çalışma zamanı

source: <link linkend="kate-application-plugin-lspclient">LSP Client</link> - LSP client providing code navigation and code completion for many languages
tr: <link linkend="kate-application-plugin-lspclient">LSP İstemcisi</link> — Birçok dil için kod dolaşımı ve tamamlaması sağlayan LSP istemcisi

source: <link linkend="kate-application-plugin-searchinfiles">Search &amp; Replace</link> - Search and replace in documents, folders, or projects
tr: <link linkend="kate-application-plugin-searchinfiles">Ara ve Değiştir</link> — Belgelerde, klasörlerde ve projelerde arayın ve değiştirin

source: <link linkend="kate-application-plugin-snippets">Scripts &amp; Snippets tool view</link> - Create or download code snippets and editor scripts
tr: <link linkend="kate-application-plugin-snippets">Betikler ve Parçacıklar araç görünümü</link> — Kod parçacıkları ve düzenleyici betikleri oluşturun veya indirin

source: <link linkend="kate-application-plugin-keyboardmacros">Keyboard Macros</link> - Record and play keyboard macros (i.e., keyboard action sequences)
tr: <link linkend="kate-application-plugin-keyboardmacros">Klavye Makroları</link> — Klavye makroları kaydedin ve oynatın (örn., klavye eylem sıralamaları)

source: <link linkend="kate-application-plugin-sql">SQL Plugin</link> - Execute query on SQL databases
tr: <link linkend="kate-application-plugin-sql">SQL Eklentisi</link> — SQL veritabanlarında sorgular yürütün

source: <link linkend="kate-application-plugin-symbolviewer">Symbol Viewer</link> - Extract and show reference symbols from source
tr: <link linkend="kate-application-plugin-symbolviewer">Sembol Görüntüleyicisi</link> — Kaynaktan başvuru sembollerini çıkarın ve gösterin

source: <link linkend="kate-application-plugin-konsole">Terminal tool view</link> - Have a terminal at the ready, using &kde;'s &konsole; widget
tr: <link linkend="kate-application-plugin-konsole">Uçbirim Araç Görünümü</link> — &kde;’nin &konsole; araç takımını kullanarak elinizin altında bir uçbirim bulundurun

source: <link linkend="kate-application-plugin-textfilter">Text Filter</link> - Process text using terminal commands
tr: <link linkend="kate-application-plugin-textfilter">Metin Süzgeci</link> — Uçbirim komutları kullanarak metin işleyin

source: <link linkend="kate-application-plugin-xmltools">&XML; Completion</link> - Lists &XML; elements, attributes, attribute values and entities allowed by DTD
tr: <link linkend="kate-application-plugin-xmltools">&XML; Tamamlama</link> — DTD tarafından izin verilen &XML; ögelerini, özniteliklerini, öznitelik değerlerini ve varlıklarını listeler

source: <link linkend="kate-application-plugin-xmlcheck">&XML; Validation</link>- Validates &XML; files using xmllint
tr: <link linkend="kate-application-plugin-xmlcheck">&XML; Doğrulama</link> — &XML; dosyalarını xmllint kullanarak doğrular

source: <link linkend="kate-application-plugin-compilerexplorer">Compiler Explorer</link>- Interface to compiler explorer tool
tr: <link linkend="kate-application-plugin-compilerexplorer">Derleyici Gezgini</link> — Derleyici Gezgini aracı için arayüz

source: <link linkend="kate-application-plugin-formatting">Formatting</link>- Code formatting plugin
tr: <link linkend="kate-application-plugin-formatting">Biçimlendirme</link> — Kod biçimlendirme eklentisi

source: External Tools
tr: Dış Araçlar

source: The <guilabel>External Tools</guilabel> plugin allows to invoke external applications with data related to the current document, for example its URL, directory, text or selection. Once enabled, a config page appears as depicted below that allows to change or remove existing tools. Similarly, new tools can be added to your liking. The tools will then appear in the <guisubmenu>External Tools</guisubmenu> submenu of the <guimenu>Tools</guimenu> menu of the application.
tr: <guilabel>Dış Araçlar</guilabel> eklentisi, geçerli belgeyle ilgili verilerle (örneğin URL’si, dizini, metni veya seçimi) dış uygulamaları çağırmaya olanak tanır. Etkinleştirildiğinde, aşağıda gösterildiği gibi var olan araçların değiştirilmesine veya kaldırılmasına olanak tanıyan bir yapılandırma sayfası görünür. Benzer şekilde beğeninize göre yeni araçlar da eklenebilir. Araçlar daha sonra uygulamanın <guimenu>Araçlar</guimenu> menüsünün <guisubmenu>Dış Araçlar</guisubmenu> alt menüsünde görünecektir.

source: The config page allows to add new external tools by clicking on the <guilabel>Add</guilabel> button. In this case, a popup menu appears where one can either add a new external tool, add an existing tool from a predefined list, or add a new category to organize the external tools into categories. Similarly, the existing tools can be modified either by double-click or by invoking <guilabel>Edit...</guilabel>, and <guilabel>Remove</guilabel> removes the selected tools.
tr: Yapılandırma sayfası, <guilabel>Ekle</guilabel> düğmesine tıklayarak yeni dış araçlar eklemenize olanak tanır. Bu durumda, yeni bir dış aracın, önceden tanımlı bir listeden var olan bir aracın veya dış araçları kategorize etmek için yeni bir kategorinin ekleneceği bir açılır menü görünür. Benzer olarak, var olan araçlar çift tıklatılarak veya <guilabel>Düzenle…</guilabel> çağrılarak değiştirilebilir ve <guilabel>Kaldır</guilabel> düğmesi ise seçilen araçları kaldırır.

source: Configuring External Tools
tr: Dış Araçları Yapılandırmak

source: Editing a tool opens a config dialog that allows fine-grained configuration of the tool:
tr: Bir aracı düzenlemek, aracın ayrıntılı şekilde yapılandırılmasına olanak tanıyan bir yapılandırma iletişim kutusunu açar:

source: As can be seen, many details can be defined, namely:
tr: Görüldüğü üzere birçok ayrıntı tanımlanabilir:

source: <userinput>Name</userinput>, the name of the tool, which will later appear in the menu.
tr: <userinput>Ad</userinput>, daha sonra menüde görünecek olan aracın adı.

source: <userinput>Icon</userinput>, optional icon that is visible in the menu.
tr: <userinput>Simge</userinput>, menüde görünen isteğe bağlı simge.

source: <userinput>Executable</userinput>, executable including either a full path, or your executable must be in the <envar>PATH</envar> environment variable.
tr: <userinput>Yürütülebilir</userinput>, tam yol içeren yürütülebilir dosya veya sizin yürütülebilir dosyanız <envar>PATH</envar> çevre değişkeninde olmalıdır.

source: <userinput>Arguments</userinput>, optional arguments that are passed to the executable.
tr: <userinput>Argümanlar</userinput>, yürütülebilir dosyaya iletilen isteğe bağlı argümanlar.

source: <userinput>Input</userinput>, optional input that is passed to the process via stdin.
tr: <userinput>Girdi</userinput>, stdin aracılığıyla işleme aktarılan isteğe bağlı girdi.

source: <userinput>Working directory</userinput>, the working directory the tool will be started in. If empty, the working directory is set to the current document’s path.
tr: <userinput>Çalışma dizini</userinput>, aracın başlatılacağı çalışma dizini. Boşsa, çalışma dizini geçerli belgenin yoluna ayarlanır.

source: <userinput>Mime types</userinput>, if set, the tool is active only if the current document’s mime type matches.
tr: <userinput>MIME türleri</userinput>, ayarlandıysa araç yalnızca geçerli belgenin mime türü eşleştiğinde etkin olur.

source: <userinput>Save</userinput>, when invoked, saves none, the current document, or all documents.
tr: <userinput>Kaydet</userinput>, çağrıldığında hiçbirini, geçerli belgeyi veya tüm belgeleri kaydeder.

source: <userinput>Trigger</userinput>, a trigger to execute this tool. A trigger will only affect the currently active document and will only execute if the mimetype of current active document matches the mimetype of the external tool.
tr: <userinput>Tetikleyici</userinput>, bu aracı çalıştırmak için bir tetikleyici. Bir tetikleyici, yalnızca geçerli etkin belgeyi etkiler ve yalnızca geçerli etkin belgenin MIME türü, harici aracın MIME türüyle eşleştiğinde yürütülür.

source: Following triggers are available:
tr: Aşağıdaki tetikleyiciler kullanılabilir:

source: <userinput>None</userinput>, this is the default, it means the tool has no trigger.
tr: <userinput>Yok</userinput>, bu öntanımlıdır, aracın tetikleyisinin olmadığı anlamına gelir.

source: <userinput>Before Save</userinput>, this trigger will execute right before saving the document.
tr: <userinput>Kaydetme Öncesi</userinput>, bu tetikleyici, belge kaydedilmeden hemen önce yürütülür.

source: <userinput>After Save</userinput>, this trigger will execute the tool after the document was saved.
tr: <userinput>Kaydetme Sonrası</userinput>, bu tetikleyici, belge kaydedildikten hemen sonra yürütülür.

source: <userinput>Reload current document after execution</userinput>, useful when the current file is modified on disk.
tr: <userinput>Yürütme sonrası geçerli belgeyi yeniden yükle</userinput>, geçerli dosya diskte değiştirildiğinde yararlıdır.

source: <userinput>Output</userinput>, the output defines the target of stdout. It is either set to <userinput>Ignored</userinput>, <userinput>Insert at Cursor Position</userinput>, <userinput>Replace Selected Text</userinput>, <userinput>Replace Current Document</userinput>, <userinput>Append to Current Document</userinput>, <userinput>Insert in New Document</userinput>, <userinput>Copy to Clipboard</userinput>, or <userinput>Display in Pane</userinput>.
tr: <userinput>Çıktı</userinput>, çıktı, stdout’un hedefini tanımlar. Geçerli seçenekler: <userinput>Yok Say</userinput>, <userinput>İmleç Konumunda Ekle</userinput>, <userinput>Seçili Metni Değiştir</userinput>, <userinput>Geçerli Belgeyi Değiştir</userinput>, <userinput>Geçerli Belgeye İliştir</userinput>, <userinput>Yeni Belgede Ekle</userinput>, <userinput>Panoya Kopyala</userinput>, <userinput>Panelde Görüntüle</userinput>.

source: <userinput>Editor command</userinput>, optional command that can be used to invoke the external tool via the built-in <ulink url="help:/katepart/advanced.html#advanced-editing-tools-commandline">command line</ulink>.
tr: <userinput>Düzenleyici komutu</userinput>, yerleşik <ulink url="help:/katepart/advanced.html#advanced-editing-tools-commandline">komut satırı ile </ulink> dış aracı çağırmak için kullanılabilecek isteğe bağlı komut.

source: The button <guilabel>Defaults</guilabel> is visible only for tools that are shipped with Kate. When clicked, all tool’s settings reverted to default (aka factory) values.
tr: <guilabel>Öntanımlılar</guilabel> düğmesi yalnızca Kate ile birlikte gönderilen araçlar için görünür. Tıklandığında, aracın tüm ayarları öntanımlı (diğer bir deyişle fabrika) değerlerine döndürülür.

source: Variable Expansion
tr: Değişken Genişleme

source: Some editing fields such as the <guilabel>Executable</guilabel>, the <guilabel>Arguments</guilabel>, the <guilabel>Input</guilabel> and the <guilabel>Working Directory</guilabel> support variables that are expanded on tool invocation. This is indicated by the icon <guilabel>{}</guilabel> that appears once one of these text input fields has focus (see red circle):
tr: <guilabel>Yürütülebilir</guilabel>, <guilabel>Argümanlar</guilabel>, <guilabel>Girdi</guilabel> ve <guilabel>Çalışma Dizini</guilabel> gibi kimi düzenleme alanları, araç çağrıldığında genişletilen değişkenleri desteklerler. Bu, bu metin giriş alanlarından biri odağı aldığında görünen <guilabel>{}</guilabel> simgesiyle gösterilir:

source: Hovering over one of these text input fields also shows a tooltip with the current expanded text. Further, clicking on the <guilabel>{}</guilabel> action will open a dialog that lists all available variables:
tr: Bu metin giriş alanlarından birinin üzerine gelindiğinde geçerli genişletilmiş metni içeren bir araç ipucu da gösterilir. Ayrıca, <guilabel>{}</guilabel> eylemine tıklamak, kullanılabilir tüm değişkenleri listeleyen bir iletişim kutusu açacaktır:

source: This feature provides a lot of flexibility when defining an external tool since all variables of the form <userinput>%{...}</userinput> are expanded when the tool gets invoked. There are two kind of variables supported: <itemizedlist> <listitem><para><userinput>%{variable-name}</userinput></para></listitem> <listitem><para><userinput>%{variable-name:&lt;value&gt;}</userinput></para></listitem> </itemizedlist> The first form <userinput>%{variable-name}</userinput> simply replaces the variable with its contents. For instance, the variable <userinput>%{Document:FileName}</userinput> is replaced by the current document’s filename without its path. The second form <userinput>%{variable-name:&lt;value&gt;}</userinput> gets the <userinput>&lt;value&gt;</userinput> as contents. For example, this can be used to expand an environment variable with <userinput>%{ENV:HOME}</userinput>, or one can obtain the current date in the preferred format like <userinput>%{Date:yyyy-MM-dd}</userinput>.
tr: Bu özellik, bir dış araç tanımlarken pek çok esneklik sağlar; çünkü <userinput>%{…}</userinput> biçimindeki tüm değişkenler, araç çağrıldığında genişletilirler. İki tür desteklenen değişken vardır: <itemizedlist> <listitem><para><userinput>%{variable-name}</userinput></para></listitem> <listitem><para><userinput>%{variable-name:&lt;value&gt;}</userinput></para></listitem> </itemizedlist> İlk <userinput>%{variable-name}</userinput> biçimi, değişkeni içeriğiyle değiştirir. Örneğin, <userinput>%{Document:FileName}</userinput> değişkeni geçerli belgenin yol içermeyen dosya adıyla değiştirilir. İkinci <userinput>%{variable-name:&lt;value&gt;}</userinput> biçimi, içeriği olarak <userinput>&lt;value&gt;</userinput> alır. Örneğin, bu, <userinput>%{ENV:HOME}</userinput> ile bir çevre değişkenini genişletmek veya geçerli tarihi yeğlenen <userinput>%{Date:yyyy-MM-dd}</userinput> biçiminde almak için kullanılabilir.

source: Supported variables include:
tr: Desteklenen değişkenler şunlardır:

source: <userinput>Document:FileBaseName</userinput>: File base name without path and suffix of the current document.
tr: <userinput>Document:FileBaseName</userinput>: Geçerli belgenin yolu ve son eki olmadan dosya tabanı adı.

source: <userinput>Document:FileExtension</userinput>: File extension of the current document.
tr: <userinput>Document:FileExtension</userinput>: Geçerli belgenin dosya uzantısı.

source: <userinput>Document:FileName</userinput>: File name without path of the current document.
tr: <userinput>Document:FileName</userinput>: Geçerli belgenin yol olmadan dosya adı.

source: <userinput>Document:FilePath</userinput>: Full path of the current document including the file name
tr: <userinput>Document:FilePath</userinput>: Geçerli belgenin dosya adı da içerilmek üzere tam yolu.

source: <userinput>Document:Text</userinput>: Contents of the current document.
tr: <userinput>Document:Text</userinput>: Geçerli belgenin içeriği.

source: <userinput>Document:Path</userinput>: Full path of the current document excluding the file name.
tr: <userinput>Document:Path</userinput>: Geçerli belgenin dosya adı dışında tam yolu.

source: <userinput>Document:NativeFilePath</userinput>: Full document path including file name, with native path separator (backslash on Windows).
tr: <userinput>Document:NativeFilePath</userinput>: Yerel yol ayırıcıyla birlikte (Windows’ta ters eğik çizgi) dosya adı da içerilen tam belge yolu.

source: <userinput>Document:NativePath</userinput>: Full document path excluding file name, with native path separator (backslash on Windows).
tr: <userinput>Document:NativePath</userinput>: Yerel yol ayırıcıyla birlikte (Windows’ta ters eğik çizgi) dosya adı dışında tam belge yolu.

source: <userinput>Document:Cursor:Line</userinput>: Line number of the text cursor position in current document (starts with 0).
tr: <userinput>Document:Cursor:Line</userinput>: Geçerli belgedeki metin imleci konumunun satır numarası (0 ile başlar).

source: <userinput>Document:Cursor:Column</userinput>: Column number of the text cursor position in current document (starts with 0).
tr: <userinput>Document:Cursor:Column</userinput>: Geçerli belgedeki metin imleci konumunun sütun numarası (0 ile başlar).

source: <userinput>Document:Cursor:XPos</userinput>: X component in global screen coordinates of the cursor position.
tr: <userinput>Document:Cursor:XPos</userinput>: İmleç konumunun genel ekran koordinatlarındaki X bileşeni.

source: <userinput>Document:Cursor:YPos</userinput>: Y component in global screen coordinates of the cursor position.
tr: <userinput>Document:Cursor:YPos</userinput>: İmleç konumunun genel ekran koordinatlarındaki Y bileşeni.

source: <userinput>Document:Selection:Text</userinput>: Text selection of the current document.
tr: <userinput>Document:Selection:Text</userinput>: Geçerli belgenin metin seçimi.

source: <userinput>Document:Selection:StartLine</userinput>: Start line of selected text of the current document.
tr: <userinput>Document:Selection:StartLine</userinput>: Geçerli belgenin seçili metninin başlangıç satırı.

source: <userinput>Document:Selection:StartColumn</userinput>: Start column of selected text of the current document.
tr: <userinput>Document:Selection:StartColumn</userinput>: Geçerli belgenin seçili metninin başlangıç sütunu.

source: <userinput>Document:Selection:EndLine</userinput>: End line of selected text of the current document.
tr: <userinput>Document:Selection:EndLine</userinput>: Geçerli belgenin seçili metninin bitiş satırı.

source: <userinput>Document:Selection:EndColumn</userinput>: End column of selected text of the current document.
tr: <userinput>Document:Selection:EndColumn</userinput>: Geçerli belgenin seçili metninin bitiş sütunu.

source: <userinput>Document:RowCount</userinput>: Number of rows of the current document.
tr: <userinput>Document:RowCount</userinput>: Geçerli belgenin satır sayısı.

source: <userinput>Document:Variable:&lt;variable&gt;</userinput>: Expand arbitrary <ulink url="help:/katepart/config-variables.html">document variables</ulink>.
tr: <userinput>Document:Variable:&lt;variable&gt;</userinput>: Rastgele <ulink url="help:/katepart/config-variables.html">belge değişkenlerini</ulink> genişletin.

source: <userinput>Date:Locale</userinput>: The current date in current locale format.
tr: <userinput>Date:Locale</userinput>: Geçerli yerel ayar biçimindeki geçerli tarih.
