Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_menus.po
Languages: tr

source: You can modify the search and replace behavior by selecting different options at the bottom of the bar. Selecting <inlinemediaobject><imageobject><imagedata fileref="format-text-superscript-22.png" format="PNG"/></imageobject></inlinemediaobject> will limit finds to entries that match the case (upper or lower) of each of the characters in the search pattern. <inlinemediaobject><imageobject><imagedata fileref="edit-select-all-22.png" format="PNG"/></imageobject></inlinemediaobject> will search and replace within the current selection only. The <guilabel>Find All</guilabel> button highlights all matches in the document and shows the number of found matches in a small popup.
tr: Çubuğun altındaki bölümden değişik seçenekler seçerek ara ve değiştir davranışını değiştirebilirsiniz. <inlinemediaobject><imageobject><imagedata fileref="format-text-superscript-22.png" format="PNG"/></imageobject></inlinemediaobject> seçmek, aramayı BÜYÜK/küçük harf eşleşen girdilere sınırlar. <inlinemediaobject><imageobject><imagedata fileref="edit-select-all-22.png" format="PNG"/></imageobject></inlinemediaobject>, yalnızca geçerli seçimde ara ve değiştir yapar. <guilabel>Tümünü Bul</guilabel> düğmesi, belgedeki tüm eşleşmeleri vurgular ve küçük bir açılır pencerede bulunan eşleşme sayısını görüntüler.

source: Click on the <inlinemediaobject><imageobject><imagedata fileref="configure-shortcuts-22.png" format="PNG"/></imageobject></inlinemediaobject> button at the right side of the power search and replace bar to switch to the incremental search bar.
tr: Artımlı arama çubuğuna geçmek için gelişmiş arama çubuğunun sağ tarafındaki <inlinemediaobject><imageobject><imagedata fileref="configure-shortcuts-22.png" format="PNG"/></imageobject></inlinemediaobject> düğmesine tıklayın.

source: The Selection Menu
tr: Seçim Menüsü

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Selection</guimenu> <guimenuitem>Select All</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Seçim</guimenu> <guimenuitem>Tümünü Seç</guimenuitem>

source: This will select the entire document. This could be very useful for copying the entire file to another application.
tr: Bu, belgenin tamamını seçer. Bu, dosyanın tümünü başka bir uygulamaya kopyalamak için çok yararlı olabilir.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Selection</guimenu> <guimenuitem>Deselect</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Seçim</guimenu> <guimenuitem>Seçimi Kaldır</guimenuitem>

source: Deselects the selected text in the editor if any.
tr: Varsa düzenleyicide seçili metnin seçimini kaldırır.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Selection</guimenu> <guimenuitem>Block Selection Mode</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Seçim</guimenu> <guimenuitem>Blok Seçim Kipi</guimenuitem>

source: Toggles Selection Mode. When the Selection Mode is <guilabel>BLOCK</guilabel>, the status bar contains the string <guilabel>[BLOCK]</guilabel> and you can make vertical selections, &eg; select column 5 to 10 in lines 9 to 15.
tr: Seçim kipine geçer. Seçim kipi, <guilabel>BLOK</guilabel> olduğunda, durum çubuğu <guilabel>[BLOK]</guilabel> dizisini gösterir ve dikey seçimler yapabilirsiniz; örneğin, 9’dan 15’e kadar olan satırlarda 5’ten 10’a kadar olan sütunları seçebilirsiniz.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo> </shortcut> <guimenu>Selection</guimenu> <guimenuitem>Comment</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo> </shortcut> <guimenu>Seçim</guimenu> <guimenuitem>Yorum</guimenuitem>

source: This adds one space to the beginning of the line where the text cursor is located or to the beginning of any selected lines.
tr: Bu imlecin konumlandığı satırın veya seçili satırların bir satır üstüne bir boşluk ekler.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>D</keycap></keycombo> </shortcut> <guimenu>Selection</guimenu> <guimenuitem>Uncomment</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>D</keycap></keycombo> </shortcut> <guimenu>Seçim</guimenu> <guimenuitem>Yorumları Kaldır</guimenuitem>

source: This removes one space (if any exist) from the beginning of the line where the text cursor is located or from the beginning of any selected lines.
tr: Bu, metin imlecinin bulunduğu satırın başlangıcından veya seçilen herhangi bir satırın başlangıcından (varsa) bir boşluk kaldırır.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>J</keycap></keycombo> </shortcut> <guimenu>Selection</guimenu> <guimenuitem>Join Lines</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>J</keycap></keycombo> </shortcut> <guimenu>Seçim</guimenu> <guimenuitem>Satırları Birbirine Kat</guimenuitem>

source: Joins the selected lines, or the current line and the line below with one white space character as a separator. Leading/trailing white space on joined lines is removed in the affected ends.
tr: Seçili satırları veya geçerli satırı ve altındaki satırı ayırıcı olarak bir boşluk karakteriyle birleştirir. Etkilenen uçlarda birleştirilmiş satırların başındaki/sondaki boşluklar kaldırılır.

source: <shortcut> <keycombo action="simul">&Ctrl;&Alt;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Selection</guimenu> <guimenuitem>Capitalization</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Alt;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Seçim</guimenu> <guimenuitem>Büyük Harfe Çevir</guimenuitem>

source: Capitalize the selected text or the current word.
tr: Seçili metni veya geçerli sözcüğü BÜYÜK harfle yazın.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Selection</guimenu> <guimenuitem>Uppercase</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Seçim</guimenu> <guimenuitem>Büyük Harf</guimenuitem>

source: Put the selected text or the letter after the cursor in uppercase.
tr: Seçili metni veya imleçten sonraki harfi BÜYÜK harf yapın.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Selection</guimenu> <guimenuitem>Lowercase</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Seçim</guimenu> <guimenuitem>Küçük Harf</guimenuitem>

source: Put the selected text or the letter after the cursor in lowercase.
tr: Seçili metni veya imleçten sonraki harfi küçük harf yapın.

source: <guimenu>Selection</guimenu> <guimenuitem>Clean Indentation</guimenuitem>
tr: <guimenu>Seçim</guimenu> <guimenuitem>Girintilemeyi Temizle</guimenuitem>

source: This cleans the indentation for the current selection or for the line the cursor is currently in. Cleaning the indentation ensures that all your selected text follows the indentation mode you choose.
tr: Bu, geçerli seçime veya imlecin geçerli olarak bulunduğu satıra ilişkin girintilemeyi temizler. Girintilemeyi temizlemek, seçili metninizin tamamının seçtiğiniz girintileme kipinin izlemesini sağlar.

source: <guimenu>Selection</guimenu> <guimenuitem>Format Indent</guimenuitem>
tr: <guimenu>Seçim</guimenu> <guimenuitem>Girintilemeyi Biçimlendir</guimenuitem>

source: Causes a realign of the current line or selected lines using the indentation mode and indentation settings in the document.
tr: Belgedeki girintileme kipini ve girintileme ayarlarını kullanarak geçerli satırın veya seçili satırların yeniden hizalanmasını sağlar.

source: <guimenu>Selection</guimenu> <guimenuitem>Align On...</guimenuitem>
tr: <guimenu>Seçim</guimenu> <guimenuitem>Şuna Göre Hizala…</guimenuitem>

source: This command aligns lines in the selected block or whole document on the column given by a regular expression that you will be prompted for.
tr: Bu komut, seçili bloktaki veya belgenin tamamındaki satırları, size sorulacak düzenli bir ifadeyle verilen sütunda hizalar.

source: If you give an empty pattern it will align on the first non-blank character by default.
tr: Boş bir dizgi verirseniz öntanımlı olarak ilk boş olmayan karaktere hizalanır.

source: If the pattern has a capture it will indent on the captured match.
tr: Dizginin bir yakalaması varsa yakalanan eşleşmeye girintili olacaktır.

source: Examples:
tr: Örnekler:

source: With '<userinput>-</userinput>' it will insert spaces before the first '-' of each lines to align them all on the same column.
tr: “<userinput>-</userinput>”, tümünü aynı sütuna hizalamak için her satırdaki ilk “-” öncesi boşluklar ekleyecektir.

source: With '<userinput>alignon :\\s+(.)</userinput>' it will insert spaces before the first non-blank character that occurs after a colon to align them all on the same column.
tr: “<userinput>alignon:\\s+(.)</userinput>”, tümünü aynı sütuna hizalamak için bir iki nokta öncesi oluşan ilk boş olmayan karakter öncesi boşluklar ekleyecektir.

source: <guimenu>Selection</guimenu> <guimenuitem>Apply Word Wrap</guimenuitem>
tr: <guimenu>Seçim</guimenu> <guimenuitem>Sözcük Kaydırmayı Uygula</guimenuitem>

source: Apply static word wrapping on all the document. That means that a new line of text will automatically start when the current line exceeds the length specified by the <guilabel>Wrap words at</guilabel> option in the Editing tab in <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Configure Editor...</guimenuitem></menuchoice> menu.
tr: Tüm belgeye durağan sözcük kaydırma uygulayın. Bu, geçerli satır <menuchoice> <guimenu>Ayarlar</guimenu><guimenuitem>Düzenleyiciyi Yapılandır…</guimenuitem></menuchoice> iletişim kutusunun Düzenleme sekmesindeki <guilabel>Sözcükleri şurada kaydır</guilabel> seçeneğiyle belirtilen uzunluğu aştığında kendiliğinden yeni bir metin satırının başlayacağı anlamına gelir.

source: <shortcut> <keycombo action="simul">&Ctrl;&Alt;&Up;</keycombo> </shortcut> <guimenu>Selection</guimenu> <guimenuitem>Add Caret above Cursor</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Alt;&Up;</keycombo> </shortcut> <guimenu>Seçim</guimenu> <guimenuitem>İmlecin Üstüne Ek İmleç Ekle</guimenuitem>

source: Adds another caret above the current cursor. The caret is placed in the line directly above and in the same column as the current cursor.
tr: Geçerli metin imlecinin üstüne başka bir imleç ekler. İmleç, geçerli imlecin hemen üstündeki satıra ve aynı sütuna yerleştirilir.

source: <shortcut> <keycombo action="simul">&Ctrl;&Alt;&Down;</keycombo> </shortcut> <guimenu>Selection</guimenu> <guimenuitem>Add Caret below Cursor</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Alt;&Down;</keycombo> </shortcut> <guimenu>Seçim</guimenu> <guimenuitem>İmlecin Altına Ek İmleç Ekle</guimenuitem>

source: Adds another caret below the current cursor. The caret is placed in the line directly above and in the same column as the current cursor.
tr: Geçerli metin imlecinin altına başka bir imleç ekler. İmleç, geçerli imlecin hemen altındaki satıra ve aynı sütuna yerleştirilir.

source: <shortcut> <keycombo action="simul">&Alt;&Shift;<keycap>I</keycap></keycombo> </shortcut> <guimenu>Selection</guimenu> <guimenuitem>Add Cursors to Line Ends</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;&Shift;<keycap>I</keycap></keycombo> </shortcut> <guimenu>Seçim</guimenu> <guimenuitem>Satır Sonlarına İmleçler Ekle</guimenuitem>

source: Adds a cursor to every currently selected line.
tr: Seçili olan her satıra bir imleç ekler.

source: <shortcut> <keycombo action="simul">&Alt;<keycap>J</keycap></keycombo> </shortcut> <guimenu>Selection</guimenu> <guimenuitem>Find and Select Next Occurrence</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;<keycap>J</keycap></keycombo> </shortcut> <guimenu>Seçim</guimenu> <guimenuitem>Sonraki Oluşu Bul ve Seç</guimenuitem>

source: Finds the next occurrence of the word currently under the cursor, selects it and adds a cursor.
tr: İmlecin altında bulunan sözcüğün bir sonraki oluşunu bulur, onu seçer ve bir imleç ekler.

source: <shortcut> <keycombo action="simul">&Ctrl;&Alt;&Shift;<keycap>J</keycap></keycombo> </shortcut> <guimenu>Selection</guimenu> <guimenuitem>Find and Select All Occurrences</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Alt;&Shift;<keycap>J</keycap></keycombo> </shortcut> <guimenu>Seçim</guimenu> <guimenuitem>Tüm Oluşları Bul ve Seç</guimenuitem>

source: Finds all occurrences of the word currently under the cursor, selects them and adds a cursor for each of them.
tr: İmlecin altında bulunan sözcüğün tüm oluşlarını bulur, onları seçer ve her biri için bir imleç ekler.

source: The View Menu
tr: Görünüm Menüsü

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Enlarge Font</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Yazıtipini Büyüt</guimenuitem>

source: This increases the display font size.
tr: Bu, görüntü yazıtipi puntosunu artırır.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Shrink Font</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Yazıtipini Küçült</guimenuitem>

source: This decreases the display font size.
tr: Bu, görüntü yazıtipi puntosunu azaltır.

source: <shortcut> <keycombo action="simul"><keycap>F10</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guisubmenu>Word Wrap</guisubmenu> <guimenuitem>Dynamic Word Wrap</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>F10</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guisubmenu>Sözcük Kaydırma</guisubmenu> <guimenuitem>Devingen Sözcük Kaydırma</guimenuitem>

source: Toggles dynamic word wrap in the current view. Dynamic word wrap makes all the text in a view visible without the need for horizontal scrolling by rendering one actual line on more visual lines as needed.
tr: Geçerli görünümde devingen sözcük kaydırmayı açar/kapatır. Devingen sözcük kaydırma, gerektiğinde daha fazla görsel satırda tek bir gerçek satırı oluşturarak, yatay kaydırmaya gerek kalmadan görünümdeki tüm metni görünür hale getirir.

source: <guimenu>View</guimenu> <guisubmenu>Word Wrap</guisubmenu> <guisubmenu>Dynamic Word Wrap Indicators</guisubmenu>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Sözcük Kaydırma</guisubmenu> <guisubmenu>Devingen Sözcük Kaydırma Göstergeleri</guisubmenu>

source: Choose when and how the dynamic word wrap indicators should be displayed. This is only available if the <guilabel>Dynamic Word Wrap</guilabel> option is checked.
tr: Devingen sözcük kaydırma göstergelerinin ne zaman ve nasıl görüntüleneceğini seçin. Bu yalnızca <guilabel>Devingen Sözcük Kaydırma</guilabel> seçeneği işaretliyse kullanılabilir.

source: <guimenu>View</guimenu> <guisubmenu>Word Wrap</guisubmenu> <guimenuitem>Show Static Word Wrap Marker</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Sözcük Kaydırma</guisubmenu> <guimenuitem>Durağan Sözcük Kaydırma İmleyicisini Göster</guimenuitem>

source: If this option is checked, a vertical line will be drawn at the word wrap column as defined in the <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure Editor...</guimenuitem></menuchoice> in the Editing tab. Please note that the word wrap marker is only drawn if you use a fixed pitch font.
tr: Bu seçenek işaretlenirse <menuchoice> <guimenu>Ayarlar</guimenu> <guimenuitem>Düzenleyiciyi Yapılandır…</guimenuitem></menuchoice> iletişim kutusunun Düzenleme sekmesinde tanımlandığı üzere sözcük kaydırma sütununda dikey bir çizgi çizer. Lütfen sözcük kaydırma imleyicisinin yalnızca eş aralıklı bir yazıtipi kullanıyorsanız çizileceğini unutmayın.

source: <shortcut> <keycombo action="simul"><keycap>F6</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guisubmenu>Borders</guisubmenu> <guimenuitem>Show Icon Border</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>F6</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guisubmenu>Kenarlıklar</guisubmenu> <guimenuitem>Simge Kenarlığını Göster</guimenuitem>

source: This is a toggle item. Setting it on checked will make the Icon Border visible in the left side of the active editor, and vice versa. The Icon Border indicates the positions of the marked lines in the editor.
tr: Bu bir aç/kapat anahtarıdır. İşaretli olarak ayarlamak, simge kenarlığının etkin düzenleyicinin sol tarafında görünmesini sağlar (veya bunun tersi de geçerlidir). Simge kenarlığı, işaretli satırların düzenleyicideki konumlarını gösterir.

source: <shortcut> <keycombo action="simul"><keycap>F11</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guisubmenu>Borders</guisubmenu> <guimenuitem>Show Line Numbers</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>F11</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guisubmenu>Kenarlıklar</guisubmenu> <guimenuitem>Satır Numaralarını Göster</guimenuitem>

source: This is a toggle Item. Setting it on checked will make a pane displaying the line numbers of the document visible in the left border of the active editor, and vice versa.
tr: Bu bir aç/kapat anahtarıdır. İşaretli olarak ayarlamak, belgenin satır numaralarını gösteren bir bölmenin etkin düzenleyicinin sol kenarında görünmesini sağlar (veya bunun tersi de geçerlidir).

source: <guimenu>View</guimenu> <guisubmenu>Borders</guisubmenu> <guimenuitem>Show Scrollbar Marks</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Kenarlıklar</guisubmenu> <guimenuitem>Sarma Çubuğu İmlerini Göster</guimenuitem>

source: If this option is checked, the view will show marks on the vertical scrollbar. The marks are equivalent to the marks on the <link linkend="view-show-icon-border">Icon Border</link>.
tr: Bu seçenek işaretlenirse görünüm dikey sarma çubuğunda imler gösterilir. İmler, <link linkend="view-show-icon-border">Simge Kenarlığı</link> üzerindeki imlerle eşdeğerdir.

source: <guimenu>View</guimenu> <guisubmenu>Borders</guisubmenu> <guimenuitem>Show Scrollbar Mini-Map</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Kenarlıklar</guisubmenu> <guimenuitem>Sarma Çubuğu Mini Haritasını Göster</guimenuitem>

source: This will replace the scrollbar with a visualization of the current document. For more information on the scrollbar minimap, see <xref linkend="kate-part-scrollbar-minimap"/>.
tr: Bu, sarma çubuğunu geçerli belgenin görselleştirmesiyle değiştirecektir. Sarma çubuğu mini haritası hakkında daha fazla bilgi için <xref linkend="kate-part-scrollbar-minimap"/> bölümüne bakın.

source: <guimenu>View</guimenu> <guimenuitem>Code Folding</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Kod Katlama</guimenuitem>

source: These options pertain to <ulink url="help:/katepart/advanced-editing-tools-code-folding.html">code folding</ulink>:
tr: Bu seçenekler, <ulink url="help:/katepart/advanced-editing-tools-code-folding.html">kod katlamayla</ulink> ilgilidir:

source: <guimenu>View</guimenu> <guisubmenu>Borders</guisubmenu> <guisubmenu>Code Folding</guisubmenu> <guimenuitem>Show Folding Markers</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Kenarlıklar</guisubmenu> <guisubmenu>Kod Katlama</guisubmenu> <guimenuitem>Katlama İmlerini Göster</guimenuitem>

source: Toggles the display of the folding marker pane in the left side of the view.
tr: Görünümün sol tarafındaki katlama imleyicileri bölmesinin görüntülenmesini açar/kapatır.

source: <guimenu>View</guimenu> <guisubmenu>Code Folding</guisubmenu> <guimenuitem>Fold Current Node</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Kod Katlama</guisubmenu> <guimenuitem>Geçerli Düğümü Katla</guimenuitem>

source: Collapse the region that contains the cursor.
tr: İmleci içeren bölgeyi daraltın.

source: <guimenu>View</guimenu> <guisubmenu>Code Folding</guisubmenu> <guimenuitem>Unfold Current Node</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Kod Katlama</guisubmenu> <guimenuitem>Geçerli Düğümü Aç</guimenuitem>

source: Expand the region that contains the cursor.
tr: İmleci içeren bölgeyi genişletin.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>-</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guisubmenu>Code Folding</guisubmenu> <guimenuitem>Fold Toplevel Nodes</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>-</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guisubmenu>Kod Katlama</guisubmenu> <guimenuitem>En Üst Düzey Düğümleri Katla</guimenuitem>

source: Collapse all toplevel regions in the document. Click on the right pointing triangle to expand all toplevel regions.
tr: Belgedeki tüm üst düzey bölgeleri daraltın. Tüm üst düzey bölgeleri genişletmek için sağdaki işaret üçgenine tıklayın.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>+</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guisubmenu>Code Folding</guisubmenu> <guimenuitem>Unfold Toplevel Nodes</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>+</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guisubmenu>Kod Katlama</guisubmenu> <guimenuitem>En Üst Düzey Düğümleri Aç</guimenuitem>

source: Expand all toplevel regions in the document.
tr: Belgedeki tüm üst düzey bölgeleri genişletin.

source: Show Non-Printable Spaces
tr: Yazdırılmayacak Boşlukları Göster

source: Show/hide bounding box around non-printable spaces.
tr: Yazdırılamayacak alanların çevresindeki sınırlayıcı kutuyu gösterin/gizleyin.

source: The Go Menu
tr: Git Menüsü

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Go to Line...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo> </shortcut> <guimenu>Git</guimenu> <guimenuitem>Satıra Git…</guimenuitem>

source: This opens the goto line bar at the bottom of the window which is used to have the cursor jump to a particular line (specified by number) in the document. The line number may be entered directly into the text box or graphically by clicking on the up or down arrow spin controls at the side of the text box. The little up arrow will increase the line number and the down arrow decrease it. Close the bar with a click on the button with an icon on the left side of the bar.
tr: Bu, imlecin belgedeki belirli bir satıra (numarayla belirtilen) atlaması için kullanılan, pencerenin alt kısmındaki satıra git çubuğunu açar. Satır numarası doğrudan metin kutusuna girilebilir veya metin kutusunun yan tarafındaki yukarı veya aşağı ok döndürme denetim tıklanarak grafiksel olarak değiştirilebilir. Küçük yukarı ok satır numarasını artıracak, aşağı ok ise azaltacaktır. Çubuğun sol tarafında simge bulunan düğmeye tıklayarak çubuğu kapatın.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Go to Previous Editing Line</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> </shortcut> <guimenu>Git</guimenu> <guimenuitem>Önceki Düzenleme Konumuna Git</guimenuitem>
