Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_configuring.po
Languages: tr

source: Configure &kappname;
tr: &kappname; Yapılandırması

source: Selecting <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure <replaceable>Application</replaceable>...</guimenuitem></menuchoice> from the menu brings up the <guilabel>Configure</guilabel> dialog box. This dialog can be used to alter a number of different settings. The settings available for change vary according to which category the user chooses from a vertical list on the left side of the dialog. By means of three buttons along the bottom of the box the user can control the process.
tr: Menüden <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem><replaceable>Uygulama</replaceable> Uygulamasını Yapılandır…</guimenuitem></menuchoice> seçildiğinde <guilabel>Yapılandır</guilabel> iletişim kutusu açılır. Bu iletişim kutusu bir dizi farklı ayarı değiştirmek için kullanılabilir. Değiştirilebilecek ayarlar, kullanıcının iletişim kutusunun sol tarafındaki dikey listeden hangi kategoriyi seçtiğine göre değişir. Kullanıcı, kutunun alt kısmındaki üç düğme aracılığıyla işlemi denetleyebilir.

source: You may invoke the <guilabel>Help</guilabel> system, accept the current settings and close the dialog by means of the <guibutton>OK</guibutton> button, or <guibutton>Cancel</guibutton> the process. The categories <guilabel>Appearance</guilabel>, <guilabel>Fonts &amp; Colors</guilabel>, <guilabel>Editing</guilabel>, <guilabel>Open/Save</guilabel> and <guilabel>Extensions</guilabel> are detailed below.
tr: <guilabel>Yardım</guilabel> sistemini çağırabilir, <guibutton>Tamam</guibutton> düğmesine basarak geçerli ayarları kabul edip iletişim kutusunu kapatabilir veya işlemi <guibutton>İptal</guibutton> edebilirsiniz. <guilabel>Görünüş</guilabel>, <guilabel>Yazıtipleri ve Renkler</guilabel>, <guilabel>Düzenleme</guilabel>, <guilabel>Aç/Kaydet</guilabel> ve <guilabel>Uzantılar</guilabel> kategorileri aşağıda açıklanmıştır.

source: The Editor Component Configuration
tr: Düzenleyici Bileşeni Yapılandırması

source: This group contains all pages related to the editor component of &kappname;. Most of the settings here are defaults, they can be overridden by <link linkend="pref-open-save-modes-filetypes">defining a filetype</link>, by <link linkend="config-variables">Document Variables</link> or by changing them per document during an editing session.
tr: Bu grup, &kappname; uygulamasının düzenleyici bileşeni ile ilgili tüm sayfaları içerir. Buradaki ayarların çoğu öntanımlılardır; bunlar, <link linkend="pref-open-save-modes-filetypes">bir dosya türü tanımlayarak</link>, <link linkend="config-variables">Belge Değişkenleri</link> ile veya düzenleme sırasında belgeye özel olarak geçersiz kılınabilirler.

source: Appearance
tr: Görünüş

source: <title>General</title>
tr: <title>Genel</title>

source: Editor font
tr: Düzenleyici yazıtipi

source: Here you can choose the font of the editor text. You can choose from any font available on your system, and set a default size. A sample text is displayed at the bottom of the dialog, so you can see the effect of your choices.
tr: Burada düzenleyici metninin yazıtipini seçebilirsiniz. Sisteminizde bulunan herhangi bir yazıtipi arasından seçim yapabilir ve öntanımlı bir boyut belirleyebilirsiniz. İletişim kutusunun altında örnek bir metin görüntülenir, böylece seçimlerinizin etkisini görebilirsiniz.

source: For more information about selecting a font, see the <ulink url="help:/fundamentals/fonts.html"><emphasis>Choosing Fonts</emphasis> section of the <emphasis>&kde; Fundamentals</emphasis> documentation</ulink>.
tr: Yazıtipi seçimi üzerine daha fazla bilgi almak için <emphasis>&kde; Temelleri</emphasis> belgelendirmesinin <ulink url="help:/fundamentals/fonts.html"><emphasis>Yazıtipleri Seçmek</emphasis></ulink> bölümüne bakın.

source: Show whitespace indicators
tr: Boşluk göstergelerini göster

source: Never
tr: Asla

source: The editor will never display dots to indicate the presence of whitespace.
tr: Düzenleyici hiçbir zaman boşluk varlığını belirtmek için noktaları görüntülemez.

source: At the end of a line
tr: Bir satırın sonunda

source: The editor will display dots to indicate the presence of extra whitespace at the end of lines.
tr: Düzenleyici, satır sonlarında fazladan boşluk bulunduğunu belirtmek için noktalar görüntüleyecektir.

source: Always
tr: Her zaman

source: The editor will always display dots to indicate the presence of whitespace.
tr: Düzenleyici, boşlukların varlığını belirtmek için her zaman noktalar görüntüleyecektir.

source: Whitespace indicator size
tr: Boşluk göstergesi boyutu

source: Use the slider to change the size of the visible indicator marker.
tr: Görünür gösterge işaretçisinin boyutunu değiştirmek için sürgüyü kullanın.

source: Show tab indicators
tr: Sekme göstergelerini göster

source: When checked the editor will display a &raquo; symbol to indicate the presence of a tab in the text.
tr: Düzenleyici işaretlendiğinde, metinde bir sekmenin varlığını belirtmek için bir &raquo; sembolü görüntüleyecektir.

source: Bracket matching
tr: Ayraç eşleştirme

source: Highlight range between selected brackets
tr: Seçili ayraçlar arasındaki erimi vurgula

source: If this is enabled, the range between the selected matching brackets will be highlighted.
tr: Bu etkinleştirilirse seçilen eşleşen ayraçlar arasındaki erim vurgulanacaktır.

source: Show preview of matching open bracket
tr: Eşleşen açık ayraç önizlemesini göster

source: When enabled, the editor will show a tooltip of the matching open bracket.
tr: Etkinleştirildiğinde, düzenleyici eşleşen açık ayracın ipucunu gösterecektir.

source: Flash matching bracket when cursor moves to other bracket in pair
tr: İmleç çift halinde başka bir ayraca hareket ettiğinde eşleşen ayraç yanıp söner

source: If enabled, moving on the brackets (<keycap>{</keycap>, <keycap>[</keycap>, <keycap>]</keycap>, <keycap>}</keycap>,<keycap>(</keycap> or <keycap>)</keycap>) will quickly flash the matching bracket.
tr: Etkinleştirilmişse ayraçlara gitmek (<keycap>{</keycap>, <keycap>[</keycap>, <keycap>]</keycap>, <keycap>}</keycap>,<keycap>(</keycap> veya <keycap>)</keycap>), eşleşen ayracı tez yanıp söndürür.

source: Show indentation lines
tr: Girintileme satırlarını göster

source: If this is checked, the editor will display vertical lines to help identifying indent lines.
tr: Bu işaretlenirse düzenleyici, girintili çizgileri tanımlamaya yardımcı olmak için dikey çizgiler görüntüleyecektir.

source: Counts
tr: Sayımlar

source: Show word count
tr: Sözcük sayısını göster

source: Displays the number of words and characters in the document and in the current selection in the status bar. This option is also available in the status bar context menu.
tr: Belgedeki ve durum çubuğundaki geçerli seçimdeki sözcük ve karakter sayısını görüntüler. Bu seçenek aynı zamanda durum çubuğu bağlam menüsünde de kullanılabilir.

source: Show line count
tr: Satır sayısını göster

source: Displays the number of total lines in the document in the status bar. This option is also available in the status bar context menu.
tr: Durum çubuğunda belgedeki toplam satır sayısını görüntüler. Bu seçenek aynı zamanda durum çubuğu bağlam menüsünde de kullanılabilir.

source: Fold first line
tr: İlk satırı katla

source: If enabled, the first line is folded, if possible. This is useful, if the file starts with a comment, such as a copyright
tr: Etkinleştirilirse ve olanaklıysa ilk satır katlanır. Dosya telif hakkı gibi bir yorumla başlıyorsa bu kullanışlıdır.

source: Dynamic Word Wrap
tr: Devingen sözcük kaydırma

source: If this option is checked, the text lines will be wrapped at the view border on the screen.
tr: Bu seçenek işaretlenirse metin satırları ekrandaki görünüm sınırında sarılır.

source: Wrap dynamically at static word wrap marker
tr: Durağan sözcük kaydırma imleyicisinde devingen olarak kaydır

source: When checked, editor wraps lines dynamically at the <link linkend="pref-word-wrap">static word wrap position</link>.
tr: İşaretlendiğinde, düzenleyici satırları <link linkend="pref-word-wrap">durağan sözcük kaydırma konumunda</link> devingen olarak kaydırır.

source: Disregard word boundaries for dynamic wrapping
tr: Devingen kaydırma için sözcük sınırlarını dikkate alma

source: When checked, the editor does not take into account word boundaries when wrapping text lines.
tr: İşaretlendiğinde düzenleyici, metin satırlarını kaydırırken sözcük sınırlarını dikkate almaz.

source: Dynamic word wrap indicators
tr: Devingen sözcük kaydırma göstergeleri

source: Choose when the Dynamic word wrap indicators should be displayed, either <guilabel>Off</guilabel>, <guilabel>Follow Line Numbers</guilabel> or <guilabel>Always on</guilabel>.
tr: Devingen sözcük kaydırma göstergelerinin ne zaman görüntüleneceğini seçin; <guilabel>Kapalı</guilabel>, <guilabel>Satır numaralarını izle</guilabel> veya <guilabel>Her zaman açık</guilabel>.

source: Indent wrapped lines
tr: Kaydırılan satırları girintile

source: Additionally, this allows you to set a maximum width of the screen, as a percentage, after which dynamically wrapped lines will no longer be vertically aligned. For example, at 50%, lines whose indentation levels are deeper than 50% of the width of the screen will not have vertical alignment applied to subsequent wrapped lines.
tr: Ek olarak bu, ekranın en büyük genişliğini yüzde olarak ayarlamanıza olanak tanır; bundan sonra devingen olarak kaydırılan satırlar artık dikey olarak hizalanmayacaktır. Örneğin, %​50’de, girinti düzeyleri ekran genişliğinin %​50’sinden daha derin olan satırlara sonraki sarılmış çizgilere dikey hizalama uygulanmayacaktır.

source: Line Height Multiplier
tr: Satır yüksekliği çarpanı

source: This value will be multiplied by the font's default line height. A value of 1.0 means that the default height will be used.
tr: Bu değer, yazıtipinin öntanımlı satır yüksekliğiyle çarpılacaktır. 1,0 değeri, öntanımlı yüksekliğin kullanılacağı anlamına gelir.

source: Borders
tr: Kenarlıklar

source: Code block folding
tr: Kod bloku katlama

source: Show arrows to collapse code blocks
tr: Kod bloklarını daraltmak için okları göster

source: If this option is checked, the current view will display marks for code folding, if code folding is available.
tr: Bu seçenek işaretlenirse kod katlamanın kullanılabilir olması durumunda geçerli görünüm, kod katlama imlerini görüntüleyecektir.

source: Show preview of folded blocks on hover
tr: Üzerine gelindiğinde katlanmış kodun önizlemesini göster

source: If checked, hovering over a folded region shows a preview of the folded text in a popup.
tr: İşaretlenirse katlanmış bir bölgenin üzerine gelindiğinde, katlanmış metnin bir önizlemesi açılır pencerede gösterilir.

source: Folding arrows visibility
tr: Katlama okları görünürlüğü

source: Switch the folding arrows between <guimenuitem>Show on Hover</guimenuitem> and <guimenuitem>Show Always</guimenuitem>.
tr: Katlama oklarının görünümünü <guimenuitem>Üzerine gelindiğinde göster</guimenuitem> ve <guimenuitem>Her zaman göster</guimenuitem> arasında değiştirin.

source: Left side
tr: Sol taraf

source: Show marks
tr: İmleri göster

source: If this is checked, you will see an icon border on the left hand side. The icon border shows bookmark signs for instance.
tr: Bu işaretlenirse sol tarafta bir simge kenarlığı göreceksiniz. Simge kenarlığı; örneğin, yer imi işaretlerini gösterir.

source: Show line numbers
tr: Satır numaralarını göster

source: If this is checked, you will see line numbers on the left hand side.
tr: Bu işaretlenirse sol tarafta satır numaralarını göreceksiniz.

source: Highlight changed and unsaved lines
tr: Değiştirilen ve kaydedilmeyen satırları vurgula

source: If this is checked, line modification markers will be visible. For more information, see <xref linkend="kate-part-line-modification"/>.
tr: Bu işaretlenirse satır değişikliği işaretleri görünür olacaktır. Daha fazla bilgi için <xref linkend="kate-part-line-modification"/> bölümüne bakın.

source: Scrollbars
tr: Sarma çubukları

source: If this option is checked the current view will show marks on the vertical scrollbar. These marks will for instance show bookmarks.
tr: Bu seçenek işaretlenirse her yeni görünümde dikey sarma çubuğu üzerinde işaretler gösterilir. Örneğin, bu imler yer imlerini gösterir.

source: Show preview when hovering over scrollbar
tr: Sarma çubuğu üzerine gelindiğinde önizleme göster

source: If this option is checked, and you hover the scrollbar with the mouse cursor a small text preview with several lines of the current document around the cursor position will be displayed. This allows you to quickly switch to another part of the document.
tr: Bu seçenek işaretlenirse ve sarma çubuğu üzerinde fare imleciyle gezinirseniz imleç konumu çevresinde geçerli belgenin birkaç satırının yer aldığı küçük bir metin önizlemesi görüntülenecektir. Bu, belgenin başka bir bölümüne tez geçiş yapmanızı sağlar.

source: Minimap
tr: Mini harita

source: Show minimap
tr: Mini haritayı göster

source: If this option is checked, every new view will show a minimap of the document on the vertical scrollbar.
tr: Bu seçenek işaretlenirse her yeni görünüm dikey sarma çubuğunda belgenin bir mini haritasını gösterecektir.

source: For more information on the scrollbar minimap, see <xref linkend="kate-part-scrollbar-minimap"/>.
tr: Sarma çubuğu mini haritası üzerine daha fazla bilgi için <xref linkend="kate-part-scrollbar-minimap"/> bölümüne bakın.

source: Minimap Width
tr: Küçük harita genişliği

source: Adjusts the width of the scrollbar mini-map, defined in pixels.
tr: Sarma çubuğu mini haritasının piksel türünden tanımlanan genişliğini ayarlar.

source: Scrollbars visibility
tr: Sarma çubukları görünürlüğü

source: Switch the scrollbar on, off or show the scrollbar only when needed. Click with the &LMB; on the blue rectangle to display the line number range of the document displayed on the screen. Keep the &LMB; pressed outside the blue rectangle to automatically scroll through the document.
tr: Sarma çubuğunu yalnızca gerektiğinde açın, kapatın veya gösterin. Ekranda görüntülenen belgenin satır numarası aralığını görüntülemek için mavi dikdörtgenin üzerinde &LMB; ile tıklayın. Belgede kendiliğinden kaydırma yapmak için &LMB;’ni mavi dikdörtgenin dışında basılı tutun.

source: Sort bookmarks menu
tr: Yer imleri menüsünü sırala

source: By date created
tr: Oluşturulma tarihine göre

source: Each new bookmark will be added to the bottom, independently from where it is placed in the document.
tr: Her yeni yer imi, belgede yerleştirildiği yerden bağımsız olarak alt tarafa eklenecektir.

source: By line number
tr: Satır numarasına göre

source: The bookmarks will be ordered by the line numbers they are placed at.
tr: Yer imleri, yerleştirildikleri satır numaralarına göre sıralanacaktır.

source: Color Themes
tr: Renk Temaları

source: This section of the dialog lets you configure all colors in any color theme you have, and create new themes, delete existing ones or just <guilabel>Follow System Color Scheme</guilabel>. Each scheme has settings for colors and normal and highlighted text styles.
tr: İletişim kutusunun bu bölümü, sahip olduğunuz herhangi bir renk temasındaki tüm renkleri yapılandırmanıza ve yeni temalar oluşturmanıza, var olan temaları silmenize veya yalnızca <guilabel>Sistem renk şemasını izle</guilabel>’menize olanak tanır. Her şemada renkler ve normal ve vurgulanan metin biçemleri için ayarlar bulunur.

source: &kappname; will preselect the currently active theme for you, if you want to work on a different theme start by selecting that from the <guilabel>Select theme</guilabel> combobox. With the <guibutton>Copy</guibutton> and <guibutton>Delete</guibutton> buttons you can create a new theme (copying an existing one) or delete existing ones.
tr: &kappname; sizin için o anda etkin olan temayı önceden seçecektir, eğer farklı bir tema üzerinde çalışmak istiyorsanız <guilabel>Tema seç</guilabel> çoklu kutusundan bunu seçerek başlayın. <guibutton>Kopyala</guibutton> ve <guibutton>Sil</guibutton> düğmeleriyle yeni bir tema oluşturabilir (var olan temayı kopyalayarak) veya önceden olan temaları silebilirsiniz.

source: This is described in detail in <xref linkend="color-themes-gui"/>.
tr: Bu, <xref linkend="color-themes-gui"/> bölümünde ayrıntılı açıklanmıştır.

source: Editing
tr: Düzenleme

source: Word wrap
tr: Sözcük kaydırma

source: Word wrap is a feature that causes the editor to automatically start a new line of text and move (wrap) the cursor to the beginning of that new line. &kappname; will automatically start a new line of text when the current line reaches the length specified by the <link linkend="pref-wrap-words-at">Wrap words at:</link> option.
tr: Sözcük kaydırma, düzenleyicinin kendiliğinden yeni bir metin satırı başlatmasına ve imleci bu yeni satırın başına taşımasını (kaydırmasını) sağlayan bir özelliktir. &kappname;, geçerli satır <link linkend="pref-wrap-words-at">Sözcükleri şurada kaydır:</link> seçeneğiyle belirtilen uzunluğa ulaştığında kendiliğinden yeni bir metin satırı başlatacaktır.

source: Wrap words at a fixed column
tr: Sözcükleri belirli bir sütunda kaydır

source: Turns static word wrap on or off.
tr: Durağan sözcük kaydırmayı açar veya kapatır.

source: Draw vertical line at the word wrap column
tr: Sözcük kaydırma sütununda dikey çizgi çiz

source: If this option is checked, a vertical line will be drawn at the word wrap column as defined in the <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure Editor...</guimenuitem></menuchoice> in the Editing tab. Please note that the word wrap marker is only drawn if you use a fixed pitch font.
tr: Bu seçenek işaretlenirse <menuchoice> <guimenu>Ayarlar</guimenu> <guimenuitem>Düzenleyiciyi Yapılandır…</guimenuitem></menuchoice> menüsündeki Düzenleme sekmesinde tanımlandığı üzere sözcük kaydırma sütununda dikey bir çizgi çizilecektir. Lütfen sözcük kaydırma işaretçisinin yalnızca eş aralıklı bir yazıtipi kullanıyorsanız çizileceğini unutmayın.

source: Wrap words at:
tr: Sözcükleri şurada kaydır:

source: If the <link linkend="pref-word-wrap">Wrap words at a fixed column</link> option is selected this entry determines the length (in characters) at which the editor will automatically start a new line.
tr: <link linkend="pref-word-wrap">Sözcükleri belirli bir sütunda kaydır</link> seçeneği seçilirse bu girdi, düzenleyicinin hangi satır uzunluğunda (karakter türünden) kendiliğinden yeni bir satır başlatacağını belirler.

source: Default input mode
tr: Öntanımlı giriş kipi

source: The selected input mode will be enabled when opening a new view. You can still toggle the vi input mode on/off for a particular view in the <guimenu>Edit</guimenu> menu.
tr: Yeni bir görünüm açıldığında seçili olan giriş kipi etkinleştirilecektir. <guimenu>Düzen</guimenu> menüsünde belirli bir görünüm için Vi giriş kipini açıp kapatabilirsiniz.

source: Brackets
tr: Ayraçlar

source: If the <guilabel>Automatically close brackets when opening bracket is typed</guilabel> option is selected when the user types a left bracket (<keycap>[</keycap>, <keycap>(</keycap>, or <keycap>{</keycap>) &kappname; automatically enters the right bracket (<keycap>}</keycap>, <keycap>)</keycap>, or <keycap>]</keycap>) to the right of the cursor.
tr: <guilabel>Açılış ayracı girildiğinde kendiliğinden ayracı kapat</guilabel> seçeneği seçilirse kullanıcı bir sol ayraç girdiğinde (<keycap>[</keycap>, <keycap>(</keycap> veya <keycap>{</keycap>), &kappname; kendiliğinden sağ ayracı (<keycap>}</keycap>, <keycap>)</keycap> veya <keycap>]</keycap>) imlecin sağ tarafına girer.

source: Enclosing characters
tr: Kapsanan karakterler

source: It is possible to select the enclosing characters using the corresponding drop-down list.
tr: İlgili açılır listeyi kullanarak kapsanan karakterleri seçmek olanaklıdır.

source: When text is selected, typing one of these characters wraps the selected text.
tr: Metin seçildiğinde bu karakterlerden birinin girilmesi seçili metni kaydırır.

source: Copy and paste
tr: Kopyala ve yapıştır

source: Move selected text when dragged
tr: Seçili metni sürüklerken taşı

source: This option enables drag-and-drop of the selected text inside the editor window.
tr: Bu seçenek, seçili metnin düzenleyici penceresinin içine sürükleyip bırakılmasını sağlar.

source: Copy/cut the current line if invoked without any text selected
tr: Herhangi bir metin seçilmeden çağrılırsa geçerli satırı kopyala/kes

source: If this option is enabled and the text selection is empty, copy and cut action are performed for the line of text at the actual cursor position.
tr: Bu seçenek etkinleştirilirse ve metin seçimi boşsa, gerçek imleç konumundaki metin satırı için kopyalama ve kesme işlemi gerçekleştirilir.

source: Don't move the text cursor when pasting by mouse
tr: Fareyle yapıştırırken metin imlecini hareket ettirme

source: If this option is enabled and you paste some text in the editor window with the &MMB; clicking, &kappname; will not move the text cursor into the clicked position.
tr: Bu seçenek etkinleştirilirse ve &MMB; ile düzenleyici penceresine bir metin yapıştırırsanız &kappname; metin imlecini tıklanan konuma taşımayacaktır.

source: Text Navigation
tr: Metinde Dolaşma

source: Text Cursor Movement
tr: Metin İmleci Hareketi

source: Smart home and smart end
tr: Akıllı başlangıç ve akıllı son

source: When selected, pressing the home key will cause the cursor to skip white space and go to the start of a line's text.
tr: Seçildiğinde Baş düğmesine basmak, imlecin boşlukları atlamasına ve satır metninin başına gitmesini sağlar.

source: PageUp/PageDown moves cursor
tr: Sayfa Yukarı/Sayfa Aşağı imleci hareket ettirir

source: This option changes the behavior of the cursor when the user presses the &PgUp; or &PgDn; key. If unselected the text cursor will maintain its relative position within the visible text in &kappname; as new text becomes visible as a result of the operation. So if the cursor is in the middle of the visible text when the operation occurs it will remain there (except when one reaches the beginning or end.) With this option selected, the first key press will cause the cursor to move to either the top or bottom of the visible text as a new page of text is displayed.
tr: Bu seçenek, kullanıcı &PgUp; veya &PgDn; düğmesine bastığında imlecin davranışını değiştirir. Seçili değilse işlem sonucunda yeni metin görünür hale geldikçe metin imleci &kappname;’deki görünür metin içindeki göreceli konumunu koruyacaktır. Dolayısıyla, işlem gerçekleştiğinde imleç görünür metnin ortasındaysa orada kalacaktır (başlangıç veya sona ulaşma durumu hariç). Bu seçenek seçiliyken ilk düğme basımı, imlecin yeni bir metin sayfası görüntülendikçe ya yukarı ya da aşağı gitmesine neden olur.

source: Enable camel case cursor movement
tr: Deve biçimi imleç hareketini etkinleştir

source: This option changes the behavior of the cursor when the user presses the <keycombo>&Ctrl;<keycap>Left arrow</keycap></keycombo> or <keycombo>&Ctrl;<keycap>Right arrow</keycap></keycombo> shortcut. If unselected the text cursor jumps over the full words. With this option selected, the cursor jumps break at camel case humps.
tr: Bu seçenek, kullanıcı <keycombo>&Ctrl;<keycap>Sol Ok</keycap></keycombo> veya <keycombo>&Ctrl;<keycap>Sağ Ok</keycap></keycombo> kısayollarını kullandığında görülen davranışı değiştirir. Seçili değilse metin imleci tam sözcüklerin üzerinden atlar. Bu seçenek seçildiğinde, imleç deve hörgücü tümseklerinde kesintiye uğrayarak atlar.

source: Autocenter cursor:
tr: İmleci kendiliğinden ortala:

source: Sets the number of lines to maintain visible above and below the cursor when possible.
tr: Olasıyken imlecin üstünde ve altında görünür kalacak satır sayısını ayarlar.
