Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_configuring.po
Languages: tr

source: Text Selection Mode
tr: Metin seçim kipi

source: Selections will be overwritten by typed text and will be lost on cursor movement.
tr: Girilen metin seçimlerin üzerine yazılır ve imleç hareket ettirildiğinde kaybolur.

source: Persistent
tr: Kalıcı

source: Selections will stay even after cursor movement and typing.
tr: Seçimler, imleç hareket ettirildikten ve metin girildikten sonra bile kalacaktır.

source: Allow scrolling past the end of the document
tr: Belgenin sonunu aşan sarmaya izin ver

source: This option lets you scroll past the end of the document. This can be used to vertically centre the bottom of the document, or put it on top of the current view.
tr: Bu seçenek belgenin sonunu geçmenizi sağlar. Bu, belgenin altını dikey olarak ortalamak veya geçerli görünümün üstüne yerleştirmek için kullanılabilir.

source: Backspace key removes character’s base with its diacritics
tr: Geri Sil düğmesi, karakterin tabanını aksan işaretleriyle birlikte kaldırır

source: When selected, composed characters are removed with their diacritics instead of only removing the base character. This is useful for Indic locales.
tr: Seçildiğinde, oluşturulan karakterler yalnızca temel karakteri kaldırmak yerine aksanlarıyla birlikte kaldırılır. Bu Hint yerel dilleri için kullanışlıdır.

source: Multicursor modifier
tr: Çoklu imleç niteleyicisi

source: This option lets you set the modifier that will be used to create multiple cursors with &LMB; click. You need to press the modifiers and click &LMB; to create a cursor at the desired location. See <link linkend="kate-part-create-multiple-cursors">Creating multiple cursors</link> to discover other ways to create multiple cursors.
tr: Bu seçenek, &LMB; ile birden çok imleç oluşturmak için kullanılacak niteleyiciyi ayarlamanıza olanak tanır. İstediğiniz konumda bir imleç oluşturmak için niteleyicilere basmanız ve &LMB; ile tıklamanız gerekir. Birden çok imleç oluşturmanın diğer yollarını keşfetmek için <link linkend="kate-part-create-multiple-cursors">Birden çok imleç oluşturma</link> konusuna bakın.

source: Indentation
tr: Girintileme

source: Default indentation mode:
tr: Öntanımlı girintileme kipi:

source: Select the automatic indentation mode you want to use as default. It is strongly recommended to use <userinput>None</userinput> or <userinput>Normal</userinput> here, and use filetype configurations to set other indentation modes for text formats like C/C++ code or &XML;.
tr: Öntanımlı olarak kullanmak istediğiniz girintileme kipini seçin. Burada, <userinput>Yok</userinput> veya <userinput>Normal</userinput> kullanmanız ve C/C++ veya &XML; gibi diğer girintileme kipleri için dosya türü yapılandırmalarını kullanmanız şiddetle önerilir.

source: Indent using
tr: Şunu kullanarak girintile

source: Tabulators
tr: Sekmeler

source: When this is enabled the editor will insert tabulator characters when you press the &Tab; key or use <link linkend="kate-part-autoindent">automatic indentation</link>.
tr: Bu etkinleştirildiğinde, &Tab; düğmesine basıldığında veya <link linkend="kate-part-autoindent">kendiliğinden girintileme</link> kullanıldığında, düzenleyici sekme karakterleri ekler.

source: Spaces
tr: Boşluklar

source: When this is enabled the editor will insert a calculated number of spaces according to the position in the text and the <option>tab-width</option> setting when you press the &Tab; key or use <link linkend="kate-part-autoindent">automatic indentation</link>.
tr: Bu etkinleştirildiğinde düzenleyici; metindeki konuma ve <option>tab-width</option> ayarına göre, &Tab; ddüğmesine basıldığında veya <link linkend="kate-part-autoindent">kendiliğinden girintileme</link> kullanıldığında, hesaplanan sayıda boşluk ekler.

source: Tabulators and Spaces
tr: Sekmeler ve Boşluklar

source: When this is enabled, the editor will insert spaces as describe above when indenting or pressing &Tab; at the beginning of a line, but insert tabulators when the &Tab; key is pressed in the middle or end of a line.
tr: Bu etkinleştirildiğinde düzenleyici, bir satırın başında girinti yaparken veya &Tab;’ye basarken yukarıda açıklandığı gibi boşluklar ekleyecektir; ancak bir satırın ortasında veya sonunda &Tab; düğmesine basıldığında sekmeler ekler.

source: Tab width:
tr: Sekme genişliği:

source: This configures the number of spaces that are displayed in place of a tabulator character.
tr: Bu, sekme karakteri yerine görüntülenen boşluk sayısını yapılandırır.

source: Indentation width:
tr: Girintileme genişliği:

source: The indentation width is the number of spaces which is used to indent a line. If configured to indent using tabulators, a tabulator character is inserted if the indentation is divisible by the tab width.
tr: Girintileme genişliği, bir satırı girintilemek için kullanılan boşlukların sayısıdır. Sekmeler kullanılarak girintili olacak şekilde yapılandırılmışsa ve girintileme sekme genişliğine bölünebiliyorsa bir sekme karakteri eklenir.

source: Indentation Properties
tr: Girintileme Özellikleri

source: Keep extra spaces
tr: Ek boşlukları tut

source: If this option is disabled, changing the indentation level aligns a line to a multiple of the width specified in <guilabel>Indentation width</guilabel>.
tr: Bu seçenek devre dışı bırakılırsa girintileme düzeyini değiştirmek, bir satırı <guilabel>Girintileme genişliği</guilabel> alanında belirtilen genişliğin katlarına hizalar.

source: Adjust indentation of text pasted from the clipboard
tr: Panodan yapıştırılan kodun girintilemesini ayarla

source: If this option is selected, text pasted from the clipboard is indented. Triggering the <guimenuitem>Undo</guimenuitem> action removes the indentation.
tr: Bu seçenek seçilirse panodan yapıştırılan metin girintilenir. <guimenuitem>Geri Al</guimenuitem> eyleminin tetiklenmesi girintilemeyi kaldırır.

source: Indentation Actions
tr: Girintileme Eylemleri

source: Backspace key in leading blank space unindents
tr: Baştaki boşlukta Geri tuşu kullanımı, girintiyi azaltır

source: If this option is selected, the &Backspace; key decreases the indentation level if the cursor is located in the leading blank space of a line.
tr: Bu seçenek seçilirse &Backspace; düğmesi, imleç bir satırın başındaki boşluğa konumlandırılmışsa girintilemeyi azaltır.

source: Tab key action (if no selection exists)
tr: Sekme düğmesi eylemi (seçim yoksa)

source: If you want &Tab; to align the current line in the current code block like in &Emacs;, make &Tab; a shortcut to the action <guimenuitem>Format Indentation</guimenuitem>.
tr: &Tab; düğmesinin geçerli kod blokundaki geçerli satırı &Emacs;’te olduğu gibi hizalamasını istiyorsanız &Tab;’yi <guimenuitem>Girintilemeyi Biçimlendir</guimenuitem> eyleminin kısayolu yapın.

source: Always advance to the next tab position
tr: Her zaman sonraki sekme konumuna git

source: If this option is selected, the &Tab; key always inserts white space so that the next tab position is reached. If the option <guilabel>Insert spaces instead of tabulators</guilabel> on the <guilabel>General</guilabel> tab in the <guilabel>Editing</guilabel> page is enabled, spaces are inserted; otherwise, a single tabulator is inserted.
tr: Bu seçenek seçilirse &Tab; düğmesi, sonraki sekme konumuna ulaşana dek her zaman boşluk ekler. <guilabel>Düzenleme</guilabel> bölümündeki <guilabel>Genel</guilabel> sekmesinde, <guilabel>Sekmeler yerine boşluklar ekle</guilabel> seçeneği etkinleştirilmişse boşluk karakterleri, aksi takdirde bir adet sekme eklenir.

source: Always increase indentation level
tr: Girintileme düzeyini her zaman artır

source: If this option is selected, the &Tab; key always indents the current line by the number of character positions specified in <guilabel>Indentation width</guilabel>.
tr: Bu seçenek seçilirse &Tab; düğmesi, her zaman geçerli satırı <guilabel>Girintileme genişliği</guilabel> alanında belirtilen karakter konumu sayısına göre girintiler.

source: Increase indentation level if in leading blank space
tr: Baştaki boşluktaysa girintileme düzeyini artır

source: If this option is selected, the &Tab; key either indents the current line or advances to the next tab position. If the insertion point is at or before the first non-space character in the line, or if there is a selection, the current line is indented by the number of character positions specified in <guilabel>Indentation width</guilabel>. If the insertion point is located after the first non-space character in the line and there is no selection, white space is inserted so that the next tab position is reached: if the option <guilabel>Insert spaces instead of tabulators</guilabel> on the <guilabel>General</guilabel> tab in the <guilabel>Editing</guilabel> page is enabled, spaces are inserted; otherwise, a single tabulator is inserted.
tr: Bu seçenek seçilirse &Tab; düğmesi geçerli satırı girintiler veya sonraki sekme konumuna ilerletir. Ekleme noktası satırdaki ilk boşluk olmayan karakterde veya öncesindeyse veya bir seçim varsa geçerli satır, <guilabel>Girintileme genişliği</guilabel> alanında belirtilen karakter konumu sayısına göre girintilenir. Ekleme noktası, satırdaki ilk boşluk olmayan karakterden sonra yer alıyorsa ve seçim yoksa bir sonraki sekme konumuna ulaşılması için boşluk karakterleri eklenir: <guilabel>Düzenleme</guilabel> bölümündeki <guilabel>Genel</guilabel> sekmesinde, <guilabel>Sekmeler yerine boşluklar ekle</guilabel> seçeneği etkinleştirilmişse boşluk karakterleri, aksi takdirde bir adet sekme eklenir.

source: Auto Completion
tr: Kendiliğinden Tamamlama

source: <guilabel>General</guilabel>
tr: <guilabel>Genel</guilabel>

source: Enable auto completion
tr: Kendiliğinden tamamlamayı etkinleştir

source: If enabled, a word completion box automatically pops up during typing showing a list of text entries to complete the current text under the cursor.
tr: Etkinleştirilirse yazma sırasında imlecin altındaki geçerli metni tamamlamak için metin girişlerinin listesini gösteren bir sözcük tamamlama kutusu kendiliğinden açılır.

source: Auto select first completion entry
tr: İlk tamamlama girdisini kendiliğinden seç

source: If enabled, the first auto completion item is always preselected so you can insert it with &Enter;. If you do not want such behavior, &eg; if you want pressing &Enter; to only insert a newline, then disable this item.
tr: Etkinleştirilirse ilk kendiliğinden tamamlama ögesi her zaman önceden seçilir, böylece onu &Enter; ile ekleyebilirsiniz. Bu tür bir davranış istemiyorsanız örneğin &Enter; düğmesine basarak yalnızca yeni bir satır eklemek istiyorsanız bu ögeyi devre dışı bırakın.

source: Minimal word length to complete
tr: Tamamlanacak en kısa sözcük uzunluğu

source: While typing text, the word completion searches for words in the document starting with the already typed text. This option configures the minimal amount of characters that are needed to make the word completion active and pop up a completion box.
tr: Metin yazarken sözcük tamamlama, önceden yazılmış olan metinden başlayarak belgedeki sözcükleri arar. Bu seçenek, sözcük tamamlamayı etkin hale getirmek ve bir tamamlama kutusu açmak için gereken en az karakter sayısını yapılandırır.

source: Remove tail on complete
tr: Tamamlandığında son boşlukları kaldır

source: Remove the tail of a previous word when the completion item is chosen from a list.
tr: Bir listeden tamamlama ögesi seçildiğinde önceki sözcüğün sonunu kaldır

source: Keyword completion
tr: Anahtar Sözcük Tamamlama

source: If enabled, the built-in autocompletion uses the keywords defined by the syntax highlighting.
tr: Etkinleştirilirse yerleşik kendiliğinden tamamlama, sözdizim vurgulamasıyla tanımlanan anahtar sözcükleri kullanır.

source: Spellcheck
tr: Yazım Denetimi

source: These configuration options are described in the documentation for the &systemsettings; module <ulink url="help:/kcontrol/spellchecking">Spell Checker</ulink>.
tr: Bu yapılandırma seçenekleri, <ulink url="help:/kcontrol/spellchecking">Yazım Denetleyicisi</ulink> &systemsettings; modülünde açıklanmıştır.

source: Vi Input Mode
tr: Vi Giriş Kipi

source: Let Vi commands override Kate shortcuts
tr: Vi komutlarının Kate kısayollarını geçersiz kılmasına izin ver

source: When selected, Vi commands will override &kappname;'s built-in commands. For example: <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> will redo, and override the standard action (showing the search and replace dialog).
tr: Seçildiklerinde Vi komutları, &kappname; yerleşik komutlarını geçersiz kılar. Örneğin: <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> kısayolu Yinele eylemini gerçekleştirir ve standart eylemi (Bul ve Değiştir penceresini gösterme) geçersiz kılar.

source: Display relative line numbers
tr: Göreceli satı numaralarını göster

source: if this is enabled, the current line always refers to line 0. Lines above and below increase the line number relatively.
tr: Bu etkinleştirilirse geçerli satır her zaman 0. satıra başvurur. Yukarıdaki ve altındaki satırlar, satır numarasını göreceli olarak artırır.

source: Key Mapping
tr: Düğme Eşlemleme

source: Key mapping is used to change the meaning of typed keys. This allows you to move commands to other keys or make special keypresses for doing a series of commands.
tr: Düğme eşlemleme, girilen düğmelerin anlamını değiştirmek için kullanılır. Bu, komutları diğer düğmelere taşımanıza veya bir dizi komutu gerçekleştirmek için özel düğmelere basmanıza olanak tanır.

source: Example:
tr: Örnek:

source: This will prepend <userinput>I--</userinput> to a line when pressing <keycap>F2</keycap>.
tr: Bu, <keycap>F2</keycap> düğmesine basıldığında bir satırın başına <userinput>I--</userinput> ekleyecektir.

source: Open/Save
tr: Aç/Kaydet

source: File Format
tr: Dosya Biçimi

source: Encoding
tr: Kodlama

source: This defines the standard encoding to use to open/save files, if not changed in the open/save dialog or by using a command line option.
tr: Bu, aç/kaydet iletişim kutusunda veya bir komut satırı seçeneği kullanılarak değiştirilmediği takdirde, dosyaları açmak/kaydetmek için kullanılacak standart kodlamayı tanımlar.

source: Encoding Detection
tr: Kodlama algılaması

source: Select an item from the drop down box, either to disable autodetection or use <guilabel>Universal</guilabel> to enable autodetection for all encodings. But as this may probably only detect utf-8/utf-16, selecting a region will use custom heuristics for better results. If neither the encoding chosen as standard above, nor the encoding specified in the open/save dialog, nor the encoding specified on command line match the content of the file, this detection will be run.
tr: Kendiliğinden algılamayı devre dışı bırakmak için açılır kutudan bir öge seçin veya tüm kodlamalar için kendiliğinden algılamayı etkinleştirmek üzere <guilabel>Evrensel</guilabel>’i kullanın. Ancak bu büyük olasılıkla yalnızca UTF-8/UTF-16’yı algılayabileceğinden, bir bölge seçmek daha iyi sonuçlar için özel buluşsal yöntemi kullanın. Yukarıda standart olarak seçili kodlama, aç/kaydet iletişim kutusunda belirtilen kodlama veya komut satırında belirtilen kodlama dosyanın içeriğiyle eşleşmiyorsa bu algılama çalıştırılacaktır.

source: Fallback Encoding
tr: Yedek Kodlama

source: This defines the fallback encoding to try for opening files if neither the encoding chosen as standard above, nor the encoding specified in the open/ save dialog, nor the encoding specified on command line match the content of the file. Before this is used, an attempt will be made to determine the encoding to use by looking for a byte order mark at start of file: if one is found, the right unicode encoding will be chosen; otherwise encoding detection will run, if both fail fallback encoding will be tried.
tr: Bu, yukarıda standart olarak seçilen kodlamanın, aç/kaydet iletişim kutusunda belirtilen kodlamanın veya komut satırında belirtilen kodlamanın dosyanın içeriğiyle eşleşmemesi durumunda, dosyaları açarken denenecek yedek kodlamayı tanımlar. Bu kullanılmadan önce, dosyanın başlangıcında bir bayt sırası işareti aranarak kullanılacak kodlamanın belirlenmesi için bir girişimde bulunulacaktır: eğer bir tane bulunursa doğru Unicode kodlama seçilecektir; aksi takdirde, her iki başarısız geri dönüş kodlaması da denenecekse kodlama algılaması çalıştırılacaktır.

source: End of line
tr: Satır sonu

source: Choose your preferred end of line mode for your active document. You have the choice between &UNIX;, DOS/&Windows; or Macintosh.
tr: Etkin belgeniz için tercih ettiğiniz satır sonu kipini seçin. &UNIX;, DOS/&Windows; veya Macintosh arasından bir seçim yapabilirsiniz.

source: Automatic end of line detection
tr: Kendiliğinden satır sonu algılaması

source: Check this if you want the editor to autodetect the end of line type. The first found end of line type will be used for the whole file.
tr: Düzenleyicinin satır türünü kendiliğinden algılamasını istiyorsanız bunu işaretleyin. İlk bulunan satır sonu türü, tüm dosya için kullanılacaktır.

source: Enable byte order mark (BOM)
tr: Bayt sırası imini (BOM) etkinleştir

source: The byte order mark is a special sequence at the beginning of unicode encoded documents. It helps editors to open text documents with the correct unicode encoding. For more information see <ulink url="https://en.wikipedia.org/wiki/Byte_order_mark">Byte Order Mark</ulink>.
tr: Bayt sırası imi, Unicode ile kodlanmış belgelerin başında özel bir dizidir. Düzenleyicilerin metin belgelerini doğru Unicode kodlamayla açmalarına yardımcı olur. Bayt sırası imi, görüntülenen belgede görünür değildir. Daha fazla bilgi için <ulink url="https://en.wikipedia.org/wiki/Byte_order_mark">Bayt Sırası İmi</ulink> adresine bakın.

source: Line Length Limit
tr: Satır uzunluğu sınırı

source: Unfortunately, due to deficiencies in &Qt;, &kappname; experiences poor performance when working with extremely long lines. For that reason, &kappname; will automatically wrap lines when they are longer than the number of characters specified here. To disable this, set this to <userinput>0</userinput>.
tr: Ne yazık ki &Qt;’deki eksiklikler nedeniyle &kappname; çok uzun satırlarla çalışırken düşük başarım sergiler. Bu nedenle &kappname;, burada belirtilen karakter sayısından daha uzun olan satırları kendiliğinden kaydırır. Bunu devre dışı bırakmak için bunu <userinput>0</userinput> olarak ayarlayın.

source: Automatic Cleanups on Save
tr: Kaydederken Kendiliğinden Temizle

source: Remove trailing spaces
tr: Satır sonu boşluklarını kaldır

source: The editor will automatically eliminate extra spaces at the ends of lines of text while saving the file. You can select <guilabel>Never</guilabel> to disable this functionality, <guilabel>On Modified Lines</guilabel> to do so only on lines that you have modified since you last saved the document, or <guilabel>In Entire Document</guilabel> to remove them unconditionally from the entire document.
tr: Düzenleyici, dosyayı kaydederken metin satırlarının sonundaki fazladan boşlukları kendiliğinden kaldıracaktır. Bu işlevi devre dışı bırakmak için <guilabel>Hiçbir zaman</guilabel>, bunu yalnızca belgeyi son kaydettiğinizden bu yana değiştirdiğiniz satırlarda yapmak için <guilabel>Değiştirilen satırlarda</guilabel> veya belgenin tümünden koşulsuz olarak kaldırmak için <guilabel>Tüm belgede</guilabel> seçeneğini kullanın.

source: Append newline at end of file on save
tr: Kaydederken dosyanın sonuna yenisatır iliştir

source: The editor will automatically append a newline to the end of the file if one is not already present upon saving the file.
tr: Dosyayı kaydettikten sonra eğer yoksa düzenleyici, dosyanın sonuna kendiliğinden yeni bir satır ekleyecektir.

source: Enable Auto Save (local files only)
tr: Kendiliğinden Kaydetmeyi Etkinleştir (Yalnızca yerel dosyalar)

source: Check this if you want the editor to autosave documents while you are working on them.
tr: Siz üzerinde çalışırken düzenleyicinin belgeleri kendiliğinden kaydetmesini istiyorsanız bunu işaretleyin.

source: Auto save document when focus leaves the editor
tr: Etkin belge odağı kaybederken onu kendiliğinden kaydet

source: The editor will automatically save documents when you switch to something outside the editor, &eg;, the terminal panel in &kate;.
tr: Düzenleyicinin dışında bir şeye, örneğin &kate;’deki uçbirim paneline geçtiğinizde, düzenleyici belgeleri kendiliğinden kaydeder.

source: Auto save interval
tr: Kendiliğinden kaydetme aralığı

source: You can determine the autosave interval in seconds here. If the interval is 0, the document will not be autosaved after intervals.
tr: Kendiliğinden kaydetme aralığını buradan saniye türünde belirleyebilirsiniz. Aralık 0 olursa belge aralıklardan sonra kendiliğinden kaydedilmez.

source: Advanced
tr: Gelişmiş

source: Write a backup file on save for
tr: Kaydetmek için bir yedek dosyası yaz

source: Backing up on save will cause &kappname; to copy the disk file (the previously saved version of the file) to &lt;prefix&gt;&lt;filename&gt;&lt;suffix&gt; before saving the new changes. A backup file can help you recover work if something goes wrong while saving or if you later want to recover the previous version of the file. The suffix defaults to <emphasis role="bold">~</emphasis> and prefix is empty by default.
tr: Kaydı yedeklemek, &kappname; uygulamasının diskteki dosyayı (dosyanın önceden kaydedilen sürümünü) yeni değişiklikleri kaydetmeden önce &lt;önek&gt;&lt;dosya-adı&gt;&lt;sonek&gt; olarak kaydetmesini sağlar. Yedekleme dosyası, kaydederken bir şeyler ters giderse veya daha sonra dosyanın önceki sürümünü kurtarmak isterseniz çalışmanızı kurtarmanıza yardımcı olabilir. Sonek öntanımlı olarak <emphasis role="bold">~</emphasis> yapılır ve önek öntanımlı olarak boştur.

source: Local files
tr: Yerel dosyalar

source: Check this if you want backups of local files when saving.
tr: Kaydederken, yerel dosyaların yedeğinin alınmasını istiyorsanız bunu işaretleyin.

source: Remote files
tr: Uzak dosyalar

source: Check this if you want backups of remote files when saving.
tr: Kaydederken, uzak dosyaların yedeğinin alınmasını istiyorsanız bunu işaretleyin.

source: Prefix for backup files
tr: Yedek dosyaları için önek

source: Enter the prefix to prepend to the backup file names.
tr: Yedek dosyası adlarına iliştirilecek öneki girin.

source: Suffix for backup files
tr: Yedek dosyaları için sonek

source: Enter the suffix to add to the backup file names.
tr: Yedek dosyası adlarına iliştirilecek soneki girin.

source: Swap file mode
tr: Takas dosyası kipi

source: &kappname; is able to recover (most) unsaved work in the case of a crash or power failure. A swap file (.&lt;filename&gt;.kate-swp) is created when a document is edited. If the user doesn’t save the changes and &kappname; crashes, the swap file remains on the disk. When opening a file, &kappname; checks if there is a swap file for the document and if it is, it asks the user whether he wants to recover the lost data or not. The user has the possibility to view the differences between the original file and the recovered one, too. The swap file is deleted after every save and on normal exit.
tr: &kappname;, bir kilitlenme veya elektrik kesintisi durumunda (çoğu) kaydedilmemiş çalışmayı kurtarabilir. Bir belge düzenlendiğinde bir takas dosyası (.&lt;dosyaadı&gt;.kate-swp) oluşturulur. &kappname; çöker ve kullanıcı değişikliklerini kaydetmemişse takas dosyası diskte kalır. &kappname;, bir dosyayı açarken belge için bir takas dosyası olup olmadığını denetler ve varsa kullanıcıya kaybolan verileri kurtarmak isteyip istemediğini sorar. Kullanıcı, özgün dosya ile kurtarılan dosya arasındaki farkları da görüntüleme olanağına sahiptir. Takas dosyası, her kaydetme sonrasında ve normal çıkışta silinir.
