Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_plugins.po
Languages: tr

source: To configure formatting for a project, first create a <filename>.kateproject</filename> file and then add a <code>"formatting"</code> object to it. In the <code>"formatting"</code> object you can specify your settings as shown in the previous example. Example:
tr: Bir proje için yapılandırmayı biçimlendirmek üzere ilk bir <filename>.kateproject</filename> dosyası oluşturun ve ona bir <code>"formatting"</code> nesnesi ekleyin. <code>"formatting"</code> nesnesinde ayarlarınızı, bir önceki örnekte görüldüğü üzere yapabilirsiniz. Örneğin:

source: You need to enable the <link linkend="kate-application-plugin-projects">Project plugin</link> for this to work
tr: Bunun çalışması için <link linkend="kate-application-plugin-projects">Proje Eklentisi</link>’ni etkinleştirmeniz gerekir.

source: { "name": "My Cool Project", "files": [ { "git": 1 } ], "formatting": { "formatterForJson": "clang-format", "autopep8": { "formatOnSave": false } } }
tr: { "name": "Süper Projem", "files": [ { "git": 1 } ], "formatting": { "formatterForJson": "clang-format", "autopep8": { "formatOnSave": false } } }

source: Temporarily disable format on save
tr: Kaydederken biçimlendirmeyi geçici olarak devre dışı bırak

source: While working you will often need to disable the formatting for a short while due to any reason. You can do this from the menubar, <menuchoice><guimenu>Tools</guimenu> <guimenuitem>Format on Save</guimenuitem></menuchoice>. You can also trigger this action from the <guilabel>Command bar</guilabel>.
tr: Çalışırken herhangi bir nedenden dolayı biçimlendirmeyi kısa bir süre için devre dışı bırakmak isteyebilirsiniz. Bunu, <menuchoice><guimenu>Araçlar</guimenu> menüsündeki <guimenuitem>Kaydederken Biçimlendir</guimenuitem></menuchoice> seçeneğiyle yapabilirsiniz. Bu eylem, <guilabel>Komut Çubuğu</guilabel> ile de tetiklenebilir.
