Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_development.po
Languages: tr

source: <userinput>selected-text-color</userinput>: The text color when it is selected is generally the same value as <quote>text-color</quote>. When the text is selected, the background is defined by the value of <link linkend="variable-pref-colors-selected-text">TextSelection</link> in the <link linkend="color-themes-editor-colors">Editor Colors</link>, so you must ensure that the text has good contrast and is readable with this background. The value is a <emphasis>string</emphasis> with a hexadecimal color code. This key/value is required.
tr: <userinput>selected-text-color</userinput>: Seçili olan metin renginin değeri genelde <quote>text-color</quote> ile aynıdır. Metin seçiliyken, arka plan, <link linkend="color-themes-editor-colors">Düzenleyici Renkleri</link>’nin <link linkend="variable-pref-colors-selected-text">TextSelection</link> değeriyle belirlenir, bundan dolayı, metnin iyi bir karşıtlığa sahip olduğundan ve bu arka planla okunabilir olduğundan emin olun. Değer, onaltılık renk koduna sahip bir <emphasis>dizidir</emphasis> ve zorunludur.

source: <userinput>bold</userinput>: It is a <emphasis>boolean</emphasis> that determines if the text is in bold. This key is optional, the default value is <userinput>false</userinput>.
tr: <userinput>bold</userinput>: Metnin kalın olup olmadığını belirten bir <emphasis>Boole</emphasis> değeridir. Bu anahtar isteğe bağlıdır, öntanımlı değer <userinput>false</userinput>’tur.

source: <userinput>italic</userinput>: It is a <emphasis>boolean</emphasis> that determines if the text is curved. This key is optional, the default value is <userinput>false</userinput>.
tr: <userinput>italic</userinput>: Metnin yatık olup olmadığını belirten bir <emphasis>Boole</emphasis> değeridir. Bu anahtar isteğe bağlıdır, öntanımlı değer <userinput>false</userinput>’tur.

source: <userinput>underline</userinput>: It is a <emphasis>boolean</emphasis> that determines if the text is underlined. This key is optional, the default value is <userinput>false</userinput>.
tr: <userinput>underline</userinput>: Metnin altı çizili olup olmadığını belirten bir <emphasis>Boole</emphasis> değeridir. Bu anahtar isteğe bağlıdır, öntanımlı değer <userinput>false</userinput>’tur.

source: <userinput>strike-through</userinput>: It is a <emphasis>boolean</emphasis> that determines if the text is strike through. This key is optional, the default value is <userinput>false</userinput>.
tr: <userinput>strike-through</userinput>: Metnin üzeri çizili olup olmadığını belirten bir <emphasis>Boole</emphasis> değeridir. Bu anahtar isteğe bağlıdır, öntanımlı değer <userinput>false</userinput>’tur.

source: <userinput>background-color</userinput>: Determines the background of the text, used for example in alerts in comments. The value is a <emphasis>string</emphasis> with a hexadecimal color code. This key is optional, by default there is no background.
tr: <userinput>background-color</userinput>: Metnin arka planının belirler; örneğin, yorumlardaki uyarılar için kullanılır. Değer, onaltılık renk koduna sahip bir <emphasis>dizidir</emphasis>. Bu anahtar isteğe bağlıdır ve öntanımlı olarak bir arka plan yoktur.

source: <userinput>selected-background-color</userinput>: Determines the background of the text when it is selected. The value is a <emphasis>string</emphasis> with a hexadecimal color code. This key is optional, by default there is no background.
tr: <userinput>selected-background-color</userinput>: Metnin seçiliyken arka planının belirler. Değer, onaltılık renk koduna sahip bir <emphasis>dizidir</emphasis>. Bu anahtar isteğe bağlıdır ve öntanımlı olarak bir arka plan yoktur.

source: In <link linkend="color-themes-gui">the &GUI; to manage color themes of KTextEditor</link>, these attributes can be modified in the <userinput><guilabel>Default Text Styles</guilabel></userinput> tab. The name in the list of styles is using the style configured for the item, providing you with an immediate preview when configuring a style. Each style lets you select common attributes as well as foreground and background colors. To unset a background color, right-click to use the context menu.
tr: <link linkend="color-themes-gui">KTextEditor renk temalarını yönetmek için kullanılan arayüzde</link>, bu öznitelikler <userinput><guilabel>Öntanımlı Metin Biçemleri</guilabel></userinput> sekmesinde değiştirilebilir. Biçem listesindeki ad, öge için yapılandırılan biçemi kullanır ve bir biçemi yapılandırırken size anında bir önizleme sağlar. Her biçem, ortak özelliklerin yanı sıra ön plan ve arka plan renklerini de seçmenize olanak tanır. Bir arka plan rengini kaldırmak için bağlam menüsünü kullanmak üzere sağ tıklayın.

source: The available text style keys are the following; the keys used in the <link linkend="color-themes-json">&JSON; file</link> are listed in <emphasis>bold</emphasis>, the names used in the <link linkend="color-themes-gui">&GUI;</link> are shown in parentheses if they are different.
tr: Kullanılabilir metin biçemi anahtarları aşağıda listelenmiştir; <link linkend="color-themes-json">&JSON; dosyasında</link> kullanılan anahtarlar <emphasis>kalın</emphasis> ile, <link linkend="color-themes-gui">grafik arayüzde</link> kullanılan adlar ise farklılarsa parantez içinde gösterilirler.

source: Normal Text &amp; Source Code
tr: Normal Metin ve Kaynak Kodu

source: <userinput>Normal</userinput>: Default text style for normal text and source code without special highlighting.
tr: <userinput>Normal</userinput>: Özel vurgulama olmadan normal metin ve kaynak kodu için öntanımlı metin biçemi.

source: <userinput>Keyword</userinput>: Text style for built-in language keywords.
tr: <userinput>Keyword</userinput>: Yerleşik dil anahtar sözcükleri için metin biçemi.

source: <userinput>Function</userinput>: Text style for function definitions and function calls.
tr: <userinput>Function</userinput>: İşlev tanımları ve çağrıları için metin biçemi.

source: <userinput>Variable</userinput>: Text style for variables, if applicable. For instance, variables in PHP/Perl typically start with a <userinput>$</userinput>, so all identifiers following the pattern <userinput>$foo</userinput> are highlighted as variable.
tr: <userinput>Variable</userinput>: Kullanılabiliyorsa değişkenler için metin biçemi. Örneğin, PHP/Perl değişkenleri genellikle bir <userinput>$</userinput> ile başlar, bundan dolayı <userinput>$foo</userinput> dizgisine uyan tüm tanımlayıcılar değişken olarak vurgulanırlar.

source: <userinput>ControlFlow</userinput> (<guilabel>Control Flow</guilabel>): Text style for control flow keywords, such as <emphasis>if</emphasis>, <emphasis>then</emphasis>, <emphasis>else</emphasis>, <emphasis>return</emphasis>, <emphasis>switch</emphasis>, <emphasis>break</emphasis>, <emphasis>yield</emphasis>, <emphasis>continue</emphasis>, etc.
tr: <userinput>ControlFlow</userinput> (<guilabel>Denetim Akışı</guilabel>): <emphasis>if</emphasis>, <emphasis>then</emphasis>, <emphasis>else</emphasis>, <emphasis>return</emphasis>, <emphasis>switch</emphasis>, <emphasis>break</emphasis>, <emphasis>yield</emphasis>, <emphasis>continue</emphasis>, vb. gibi denetim akışı anahtar sözcükleri için metin biçemi.

source: <userinput>Operator</userinput>: Text style for operators, such as <userinput>+</userinput>, <userinput>-</userinput>, <userinput>*</userinput>, <userinput>/</userinput>, <userinput>%</userinput>, etc.
tr: <userinput>Operator</userinput>: <userinput>+</userinput>, <userinput>-</userinput>, <userinput>*</userinput>, <userinput>/</userinput>, <userinput>%</userinput>, vb. gibi işleçler için metin biçemi.

source: <userinput>BuiltIn</userinput> (<guilabel>Built-in</guilabel>): Text style for built-in language classes, functions and objects.
tr: <userinput>BuiltIn</userinput> (<guilabel>Yerleşik</guilabel>): Yerleşik dil sınıfları, işlevleri ve nesneleri için metin biçemi.

source: <userinput>Extension</userinput>: Text style for well-known extensions, such as &Qt; classes, functions/macros in C++ and Python or boost.
tr: <userinput>Extension</userinput>: İyi bilinen uzantılar; örneğin, &Qt; sınıfları, C++ işlevleri/makroları vb. için metin biçemi.

source: <userinput>Preprocessor</userinput>: Text style for preprocessor statements or macro definitions.
tr: <userinput>Preprocessor</userinput>: Önişlemci ifadeleri veya makro tanımları için metin biçemi.

source: <userinput>Attribute</userinput>: Text style for annotations or attributes of functions or objects, e.g. <userinput>@override</userinput> in Java, or <userinput>__declspec(...)</userinput> and <userinput>__attribute__((...))</userinput> in C++.
tr: <userinput>Attribute</userinput>: Bilgi notları veya işlevlerin veya nesnelerin öznitelikleri için metin biçemi; örneğin, Java’daki <userinput>@override</userinput> veya C++’daki <userinput>__declspec(…)</userinput> ve <userinput>__attribute__((…))</userinput>.

source: Numbers, Types &amp; Constants
tr: Sayılar, Türler ve Sabitler

source: <userinput>DataType</userinput> (<guilabel>Data Type</guilabel>): Text style for built-in data types such as <emphasis>int</emphasis>, <emphasis>char</emphasis>, <emphasis>float</emphasis>, <emphasis>void</emphasis>, <emphasis>u64</emphasis>, etc.
tr: <userinput>DataType</userinput> (<guilabel>Veri Türü</guilabel>): <emphasis>int</emphasis>, <emphasis>char</emphasis>, <emphasis>float</emphasis>, <emphasis>void</emphasis>, <emphasis>u64</emphasis>, vb. gibi yerleşik veri türleri için metin biçemi.

source: <userinput>DecVal</userinput> (<guilabel>Decimal/Value</guilabel>): Text style for decimal values.
tr: <userinput>DecVal</userinput> (<guilabel>Ondalık/Değer</guilabel>): Ondalık değerler için metin biçemi.

source: <userinput>BaseN</userinput> (<guilabel>Base-N Integer</guilabel>): Text style for numbers with base other than 10.
tr: <userinput>BaseN</userinput> (<guilabel>N Tabanlı Tamsayı</guilabel>): 10’dan başka bir tabanlı sayılar için metin biçemi.

source: <userinput>Float</userinput> (<guilabel>Floating Point</guilabel>): Text style for floating point numbers.
tr: <userinput>Float</userinput> (<guilabel>Kayan Noktalı</guilabel>): Kayan noktalı sayılar için metin biçemi.

source: <userinput>Constant</userinput>: Text style for language constants and user defined constants, e.g. <emphasis>True</emphasis>, <emphasis>False</emphasis>, <emphasis>None</emphasis> in Python or <emphasis>nullptr</emphasis> in C/C++; or math constants like <emphasis>PI</emphasis>.
tr: <userinput>Constant</userinput>: Dil sabitleri ve kullanıcı tanımlı sabitler için metin biçemi; örneğin, Python’daki <emphasis>True</emphasis>, <emphasis>False</emphasis>, <emphasis>None</emphasis> veya C/C++’daki <emphasis>nullptr</emphasis> veya <emphasis>PI</emphasis> gibi matematik sabitleri.

source: Strings &amp; Characters
tr: Diziler ve Karakterler

source: <userinput>Char</userinput> (<guilabel>Character</guilabel>): Text style for single characters such as <userinput>'x'</userinput>.
tr: <userinput>Char</userinput> (<guilabel>Karakter</guilabel>): <userinput>'x'</userinput> gibi tekli karakterler için metin biçemi.

source: <userinput>SpecialChar</userinput> (<guilabel>Special Character</guilabel>): Text style for escaped characters in strings, e.g. <quote><userinput>hello\n</userinput></quote>, and other characters with special meaning in strings, such as substitutions or regex operators.
tr: <userinput>SpecialChar</userinput> (<guilabel>Özel Karakter</guilabel>): Dizilerde kaçırılan karakterler; örneğin, <quote><userinput>esenlikler\n</userinput></quote> ve değiştirmeler veya düzenli ifade işleçleri gibi özel anlamlı diğer karakterler için metin biçemi.

source: <userinput>String</userinput>: Text style for strings like <quote><userinput>hello world</userinput></quote>.
tr: <userinput>String</userinput>: <quote><userinput>merhaba dünya</userinput></quote> gibi diziler için metin biçemi.

source: <userinput>VerbatimString</userinput> (<guilabel>Verbatim String</guilabel>): Text style for verbatim or raw strings like <userinput>'raw \backlash'</userinput> in Perl, CoffeeScript, and shells, as well as <userinput>r'\raw'</userinput> in Python, or such as HERE docs.
tr: <userinput>VerbatimString</userinput> (<guilabel>Gerçek Dizi</guilabel>): Gerçek veya ham diziler için metin biçemi; örneğin, Perl, CoffeeScript belgelerindeki gibi <userinput>'ham \ters eğik çizgi'</userinput> veya Python veya HERE belgelerindeki <userinput>r'\ham'</userinput> gibi diziler.

source: <userinput>SpecialString</userinput> (<guilabel>Special String</guilabel>): Text style for special strings, such as regular expressions in ECMAScript, the &latex; math mode, SQL, etc.
tr: <userinput>SpecialString</userinput> (<guilabel>Özel Dizi</guilabel>): Özel diziler için metin biçemi; örneğin, ECMAScript düzenli ifadeleri, &latex; matematik kipi, SQL, vb.

source: <userinput>Import</userinput> (<guilabel>Imports, Modules, Includes</guilabel>): Text style for includes, imports, modules or &latex; packages.
tr: <userinput>Import</userinput> (<guilabel>Import’lar, Modüller, Include’lar</guilabel>): Include’lar, import’lar, modüller veya &latex; paketleri için metin biçemi.

source: Comments &amp; Documentation
tr: Yorumlar ve Belgelendirme

source: <userinput>Comment</userinput>: Text style for normal comments.
tr: <userinput>Comment</userinput>: Normal yorumlar için metin biçemi.

source: <userinput>Documentation</userinput>: Text style for comments that reflect API documentation, such as <userinput>/** doxygen comments */</userinput> or <userinput>"""docstrings"""</userinput>.
tr: <userinput>Documentation</userinput>: API belgelendirmesini yansıtan yorumlar için metin biçemi; örneğin, <userinput>/** doxygen yorumları */</userinput> veya <userinput>"""docstrings"""</userinput>.

source: <userinput>Annotation</userinput>: Text style for annotations in comments or documentation commands, such as <userinput>@param</userinput> in Doxygen or JavaDoc.
tr: <userinput>Annotation</userinput>: Yorumlardaki bilgi notları veya belgelendirme komutları için metin biçemi; örneğin, Doxygen veya JavaDoc için <userinput>@param</userinput>.

source: <userinput>CommentVar</userinput> (<guilabel>Comment Variable</guilabel>): Text style that refers to variables names used in above commands in a comment, such as <userinput>foobar</userinput> in <quote><userinput>@param foobar</userinput></quote>, in Doxygen or JavaDoc.
tr: <userinput>CommentVar</userinput> (<guilabel>Yorum Değişkeni</guilabel>): Yukarıdaki komutlarda bir yorumda kullanılan değişken adlarına başvuran metin biçemi; örneğin, Doxygen veya JavaDoc’ta <quote><userinput>@param foobar</userinput></quote> içindeki <userinput>foobar</userinput> gibi.

source: <userinput>RegionMarker</userinput> (<guilabel>Region Marker</guilabel>): Text style for region markers, typically defined by <userinput>//BEGIN</userinput> and <userinput>//END</userinput> in comments.
tr: <userinput>RegionMarker</userinput> (<guilabel>Bölge İmleyicisi</guilabel>): Genellikle yorumlarda <userinput>//BEGIN</userinput> ve <userinput>//END</userinput> ile tanımlanan bölge imleyicilerine yönelik metin biçemi.

source: <userinput>Information</userinput>: Text style for information, notes and tips, such as the keyword <userinput>@note</userinput> in Doxygen.
tr: <userinput>Information</userinput>: Bilgi, notlar ve ipuçları için metin biçemi; örneğin, Doxygen <userinput>@note</userinput> anahtar sözcüğü gibi.

source: <userinput>Warning</userinput>: Text style for warnings, such as the keyword <userinput>@warning</userinput> in Doxygen.
tr: <userinput>Warning</userinput>: Uyarılar için metin biçemi; örneğin, Doxygen’deki <userinput>@warning</userinput> anahtar sözcüğü gibi.

source: <userinput>Alert</userinput>: Text style for special words in comments, such as <userinput>TODO</userinput>, <userinput>FIXME</userinput>, <userinput>XXXX</userinput> and <userinput>WARNING</userinput>.
tr: <userinput>Alert</userinput>: Yorumlardaki özel sözcükler için metin biçemi; örneğin, <userinput>TODO</userinput>, <userinput>FIXME</userinput>, <userinput>XXXX</userinput> ve <userinput>WARNING</userinput>.

source: Miscellaneous
tr: Çeşitli

source: <userinput>Error</userinput>: Text style indicating error highlighting and wrong syntax.
tr: <userinput>Error</userinput>: Hata vurgulaması ve yanlış sözdizimi belirten metin biçemi.

source: <userinput>Others</userinput>: Text style for attributes that do not match any of the other default styles.
tr: <userinput>Others</userinput>: Diğer öntanımlı biçemlerden hiçbiriyle eşleşmeyen öznitelikler için metin biçemi.

source: Custom Highlighting Text Styles
tr: Özel Vurgulama Metin Biçemleri

source: Here you can establish text styles for a specific syntax highlighting definition, overriding the <userinput>default text style</userinput> described in <link linkend="color-themes-text-styles">the previous section</link>.
tr: Burada, <link linkend="color-themes-text-styles">önceki bölümde</link> açıklanan <userinput>öntanımlı metin biçemini</userinput> geçersiz kılarak, belirli bir sözdizim vurgulama tanımı için metin biçemleri oluşturabilirsiniz.

source: In the <link linkend="color-themes-json">&JSON; theme file</link>, this corresponds to the <userinput>custom-styles</userinput> key, whose value is an <emphasis>object</emphasis> where each subschema key corresponds to the <userinput>name of a syntax highlighting definition</userinput>. Its value is an <emphasis>object</emphasis> where each key refers to the <userinput>style attributes name</userinput> defined in <link linkend="kate-highlight-sections">the <userinput>itemData</userinput> elements</link> of the syntax highlighting &XML; file, and the respective value is a sub-object with the keys <emphasis>text-color</emphasis>, <emphasis>selected-text-color</emphasis>, <emphasis>bold</emphasis>, <emphasis>italic</emphasis>, <emphasis>underline</emphasis>, <emphasis>strike-through</emphasis>, <emphasis>background-color</emphasis> and <emphasis>selected-background-color</emphasis>, defined in <link linkend="color-themes-text-styles">the previous section</link>. Each of these values are optional, since if they are not present, the style set in <userinput>text-styles</userinput> is considered.
tr: <link linkend="color-themes-json">&JSON; tema dosyasında</link> bu, değeri her alt şema anahtarının <userinput>bir sözdizimi vurgulama tanımının adına</userinput> karşılık geldiği bir <emphasis>nesne</emphasis> olan <userinput>custom-styles</userinput> anahtarına karşılık gelir. Onun değeri, her bir anahtarın sözdizim tanımlama &XML; dosyasının <link linkend="kate-highlight-sections"><userinput>itemData</userinput> ögesinde</link> tanımlı <userinput>biçem öznitelikleri adına</userinput> başvuran bir <emphasis>nesnedir</emphasis>. İlgili değer, <emphasis>text-color</emphasis>, <emphasis>selected-text-color</emphasis>, <emphasis>bold</emphasis>, <emphasis>italic</emphasis>, <emphasis>underline</emphasis>, <emphasis>strike-through</emphasis>, <emphasis>background-color</emphasis> ve <emphasis>selected-background-color</emphasis> anahtarlarıyla bir alt nesnedir. Bu alt nesne, <link linkend="color-themes-text-styles">bir önceki bölümde</link> tanımlanmıştır. Bu değerlerin her biri isteğe bağlıdır; eğer yoklarsa <userinput>text-styles</userinput> içinde tanımlı biçem kümesi değerlendirilir.

source: For example, in this piece of code, the <quote>ISO C++</quote> syntax highlighting definition has a special text style for the <quote>Type Modifiers</quote> and <quote>Standard Classes</quote> attributes. In the corresponding &XML; file <quote>isocpp.xml</quote>, the defined attribute <quote>Standard Classes</quote> uses the default style <userinput>BuiltIn</userinput> (or dsBuiltIn). In this attribute, only the value of <userinput>text-color</userinput> is overwritten by the new color <quote>#6431b3</quote>.
tr: Örneğin bu kod parçasında, <quote>ISO C++</quote> sözdizim vurgulama tanımında <quote>Type Modifiers</quote> ve <quote>Standard Classes</quote> öznitelikleri için özel bir metin biçemi vardır. Karşılık gelen <quote>isocpp.xml</quote> &XML; dosyasında tanımlı <quote>Standard Classes</quote> özniteliği <userinput>BuiltIn</userinput> (veya dsBuiltIn) öntanımlı biçemini kullanır. Bu öznitelikte, yalnızca <userinput>text-color</userinput> değerinin yeni <quote>#6431b3</quote> değeriyle üzerine yazılır.

source: You should consider that these text styles are associated with the attribute names defined in the syntax highlighting &XML; files. If an XML file is updated and some attributes are renamed or removed, the custom style defined in the theme will no longer apply.
tr: Bu metin biçemlerinin, &XML; dosyalarını vurgulayan sözdizimde tanımlanan öznitelik adlarıyla ilişkili olduğunu dikkate almalısınız. Bir XML dosyası güncellenirse ve bazı nitelikler yeniden adlandırılırsa veya kaldırılırsa temada tanımlanan özel biçem artık geçerli olmayacaktır.

source: Syntax highlighting definitions often include other definitions. For example, the <quote>QML</quote> highlighter includes the <quote>JavaScript</quote> highlighter, since they share functionality in highlighting.
tr: Sözdizim vurgulama tanımları genellikle başka tanımları da içerir. Örneğin, <quote>QML</quote> vurgulayıcısı, <quote>JavaScript</quote> vurgulayıcısını da içerir; çünkü bunlar, vurgulamadaki işlevleri paylaşırlar.

source: In <link linkend="color-themes-gui">the &GUI; to manage themes of KTextEditor</link>, these attributes can be modified in the <userinput><guilabel>Highlighting Text Styles</guilabel></userinput> tab. By default, the editor preselects the highlighting of the current document. You will notice that many highlights contain other highlights represented by groups in the style list. For example most highlights import the <quote>Alert</quote> highlight, and many source code formats import the <quote>Doxygen</quote> highlight.
tr: <link linkend="color-themes-gui">KTextEditor tema yönetim arayüzünde</link>, bu öznitelikler <userinput><guilabel>Vurgulama Metin Biçemleri</guilabel></userinput> sekmesinde yapılandırılabilir. Öntanımlı olarak düzenleyici, geçerli belgenin vurgulamasını önceden seçer. Pek çok vurgunun, biçem listesindeki gruplar tarafından temsil edilen diğer vurguları içerdiğini fark edeceksiniz. Örneğin, öne çıkanların çoğu <quote>Alert</quote> vurgusunu içe aktarır ve birçok kaynak kodu biçimi de <quote>Doxygen</quote> vurgusunu içe aktarır.

source: The Color Themes &GUI;
tr: Renk Temaları Grafik Arayüzü

source: The simplest way to create and edit color themes is through the &GUI; within the <link linkend="config-dialog"><quote>Configure</quote> dialog</link> provided by <ulink url="https://api.kde.org/frameworks/ktexteditor/html/">KTextEditor</ulink>. To access it, select <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure <replaceable>Application</replaceable>...</guimenuitem></menuchoice> from the menubar in your text editor. This brings up the <guilabel>Configure</guilabel> dialog box, there select <guilabel>Color Themes</guilabel> in the side panel.
tr: Renk temaları oluşturmanın ve düzenlemenin en basit yolu, <ulink url="https://api.kde.org/frameworks/ktexteditor/html/">KTextEditor</ulink> tarafından sağlanan <link linkend="config-dialog"><quote>Yapılandırma</quote> iletişim kutusunu</link> kullanmaktır. Ona erişmek için düzenleyicinizdeki menü çubuğundan <menuchoice><guimenu>Ayarlar</guimenu> <guimenuitem><replaceable>Uygulama</replaceable> Uygulamasını Yapılandır…</guimenuitem></menuchoice> yolunu izleyin. Bu, <guilabel>Yapılandır</guilabel> iletişim kutusunu getirir; burada kenar çubuğundaki <guilabel>Renk Temaları</guilabel> girdisini seçin.

source: <phrase>&kate;'s settings dialog box with the color theme management.</phrase>
tr: <phrase>&kate;’in renk teması yönetimini gösteren ayarlar iletişim kutusu.</phrase>
