Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_development.po
Languages: tr

source: The text style, used for syntax highlighting through the <emphasis>default styles attributes</emphasis>. For example, the text color and the selected text color.
tr: <emphasis>Öntanımlı biçemler öznitelikleri</emphasis> ile sözdizim vurgulamada kullanılan metin biçemi. Örneğin, metin rengi ve seçili metin rengi.

source: The background of the text editing area, including the text selection and the current line.
tr: Metin düzenleme alanının arka planı; metin seçimi ve geçerli satır içerilmek üzere.

source: The icon border of the text area: their background, the separator line, the line numbers, the line word wrap markers, the modified line marks and the code folding.
tr: Metin alanının simge kenarlıkları: Arka planları, ayırıcı çizgisi, satır numaraları, satır sözcük kaydırma imleyicileri, değiştirilen satır imleri ve kod katlama.

source: Text decorators such as the search markers, the indentation and tab/space line marks, the bracket matching and the spell checking.
tr: Arama imleyicileri, girintileme ve sekme/boşluk çizgisi imleri, ayraç eşleştirme ve yazım denetimi gibi metin dekorasyonları.

source: Bookmarks and snippets.
tr: Yer imleri ve parçacıklar.

source: To avoid confusion, the following is out of scope:
tr: Kafa karışıklığını önlemek adına, aşağıdakiler kapsam dışında bırakılmıştır:

source: The font type and the font size.
tr: Yazıtipi türü ve yazıtipi puntosu.

source: The colors of the text editing application, such as the scroll bar map, the menus, the tab bar, the window color, etc. In &kde; applications, like &kate; or &kdevelop;, these colors are defined by the <userinput>&kde; &plasma; global color scheme</userinput>, which are set in the <ulink url="help:/kcontrol/colors/"><quote>Colors</quote> module in &systemsettings;</ulink> or from the application itself in the menu <menuchoice><guimenu>Settings</guimenu><guisubmenu>Color Scheme</guisubmenu></menuchoice>.
tr: Metin düzenleme uygulamasının renkleri; örneğin, sarma çubuğu haritası, menüler, sekme çubuğu, pencere rengi vb. &kate; veya &kdevelop; gibi &kde; uygulamalarında, bu renkler <userinput>&kde; &plasma; global renk şemalarında</userinput> tanımlıdır. Bu alana, &systemsettings; içindeki <ulink url="help:/kcontrol/colors/"><quote>Renkler</quote> modülünde</ulink> veya uygulamanın kendisinde <menuchoice><guimenu>Ayarlar</guimenu><guisubmenu>Renk Şeması</guisubmenu></menuchoice> ögesinden ulaşılabilir.

source: <phrase><quote>Breeze Light</quote> and <quote>Breeze Dark</quote> color themes with the <quote>C++</quote> syntax highlighting.</phrase>
tr: <phrase><quote>C++</quote> sözdizim vurgulamasında <quote>Esinti Açık</quote> ve <quote>Esinti Koyu</quote> renk temaları.</phrase>

source: <para><quote>Breeze Light</quote> and <quote>Breeze Dark</quote> color themes with the <quote>C++</quote> syntax highlighting.</para>
tr: <para><quote>C++</quote> sözdizim vurgulamasında <quote>Esinti Açık</quote> ve <quote>Esinti Koyu</quote> renk temaları.</para>

source: The KSyntaxHighlighting Color Themes
tr: KSyntaxHighlighting Renk Temaları

source: The <ulink url="https://api.kde.org/frameworks/syntax-highlighting/html/">KSyntaxHighlighting</ulink> framework, which is the <link linkend="highlight">syntax highlighting</link> engine, is the library that <userinput>provides and manages the color themes</userinput>. This is part of &kde; &frameworks; and is used in &kde; text editors such as <ulink url="https://apps.kde.org/en/kate">&kate;</ulink>, <ulink url="https://apps.kde.org/en/kwrite">&kwrite;</ulink>, <ulink url="https://apps.kde.org/en/kile">&kile;</ulink> and <ulink url="https://apps.kde.org/en/kdevelop">&kdevelop;</ulink>. This dependency looks like the following:
tr: <ulink url="https://api.kde.org/frameworks/syntax-highlighting/html/">KSyntaxHighlighting</ulink> <link linkend="highlight">sözdizim vurgulaması</link> işletkesi, <userinput>renk temalarını sağlayan ve yöneten</userinput> çatıdır. Bu, &kde; &frameworks;’ün bir parçasıdır ve <ulink url="https://apps.kde.org/en/kate">&kate;</ulink>, <ulink url="https://apps.kde.org/en/kwrite">&kwrite;</ulink>, <ulink url="https://apps.kde.org/en/kile">&kile;</ulink> ve <ulink url="https://apps.kde.org/en/kdevelop">&kdevelop;</ulink> gibi &kde; metin düzenleyicilerinde kullanılır. Bağımlılıkları aşağıdaki gibidir:

source: Dependence of &kde; &frameworks; 5 libraries on text editors.
tr: Metin düzenleyicilerinde &kde; &frameworks; 5 kitaplıkları.

source: Dependence of &kde; &frameworks; libraries on text editors.
tr: Metin düzenleyicilerinde &kde; &frameworks; 5 kitaplıkları.

source: KSyntaxHighlighting includes a variety of built-in themes which are displayed on the <ulink url="https://kate-editor.org/themes/"><quote>Color Themes</quote> page of the Kate editor website</ulink>.
tr: KSyntaxHighlighting içinde, <ulink url="https://kate-editor.org/themes/">Kate düzenleyicisinin web sayfasının <quote>Renk Temaları</quote></ulink> bölümünde görüntülenen çeşitli yerleşik temalar vardır.

source: The <ulink url="https://api.kde.org/frameworks/ktexteditor/html/">KTextEditor</ulink> framework, which is the text editing engine, provides a user interface for creating and editing color themes, including a tool for importing and exporting themes. This is the simplest way to create and edit them, you can access it from the <link linkend="config-dialog"><quote>Configure</quote> dialog</link> of the text editor. More details in <xref linkend="color-themes-gui"/>.
tr: <ulink url="https://api.kde.org/frameworks/ktexteditor/html/">KTextEditor</ulink> metin düzenleme işletkesi çatısı, renk temaları oluşturmak ve düzenlemek için içe/dışa aktarma araçları da içerilmek üzere bir kullanıcı arayüzü sağlar. Bu, renk temaları oluşturmanın ve düzenlemenin en basit yoludur; buna metin düzenleyicisinin <link linkend="config-dialog"><quote>Yapılandırma</quote> iletişim kutusundan</link> erişebilirsiniz. Daha fazla ayrıntı için <xref linkend="color-themes-gui"/> bölümüne bakın.

source: <phrase>The &GUI; to manage color themes in &kate;'s settings.</phrase>
tr: <phrase>&kate; ayarlarında renk temalarını yönetmek için kullanılan arayüz.</phrase>

source: <para>The &GUI; to manage color themes in &kate;'s settings.</para>
tr: <para>&kate; ayarlarında renk temalarını yönetmek için kullanılan arayüz.</para>

source: It is important to mention that, in the &kde; text editors like &kate; or &kdevelop;, the KSyntaxHighlighting color themes are used <ulink url="https://kate-editor.org/post/2020/2020-09-13-kate-color-themes-5.75/">since &kde; &frameworks; 5.75</ulink>, released on October 10, 2020. Previously, &kate;'s color schemes (KConfig based schema config) were used and are now deprecated. However, it is possible to convert the old &kate; schemes to the KSyntaxHighlighting color themes. The <ulink url="https://invent.kde.org/frameworks/syntax-highlighting">KSyntaxHighlighting repository</ulink> includes the <userinput>utils/kateschema_to_theme_converter.py</userinput> script and the <userinput>utils/schema-converter/</userinput> utility for that purpose.
tr: &kate; veya &kdevelop; gibi &kde; metin düzenleyicilerinde kullanılan KSyntaxHighlighting renk temaları, 10 Ekim 2020 tarihinde yayımlanan <ulink url="https://kate-editor.org/post/2020/2020-09-13-kate-color-themes-5.75/">&kde; &frameworks; 5.75</ulink> sürümüyle kullanılmaya başlanmıştır. Öncesinde, &kate;’in kendi renk şemaları (KConfig tabanlı şema yapılandırması) kullanılıyordu; artık bunlar kullanılmıyor. Yine de, eski &kate; şemalarını KSyntaxHighlighting renk şemalarına dönüştürmek olanaklıdır. <ulink url="https://invent.kde.org/frameworks/syntax-highlighting">KSyntaxHighlighting deposunda</ulink>, bu iş için kullanılan <userinput>utils/kateschema_to_theme_converter.py</userinput> betiği ve <userinput>utils/schema-converter/</userinput> izlencesi bulunur.

source: The Color Themes &JSON; Format
tr: Renk Temaları &JSON; Biçimi

source: Color themes are stored in &JSON; format files, with the <userinput>.theme</userinput> extension.
tr: Renk temaları, &JSON; biçimli dosyalarda <userinput>.theme</userinput> uzantısıyla depolanır.

source: In the <ulink url="https://invent.kde.org/frameworks/syntax-highlighting"> KSyntaxHighlighting source code</ulink>, the &JSON; files of built-in themes are located in the <userinput>data/themes/</userinput> directory. Note that in text editors, the built-in themes are compiled into the KSyntaxHighlighting library, therefore, the way to access them is through the source code or by <link linkend="color-themes-gui-import-export">exporting them from the &GUI; to manage themes of KTextEditor</link>.
tr: <ulink url="https://invent.kde.org/frameworks/syntax-highlighting"> KSyntaxHighlighting kaynak kodunda</ulink>, yerleşik temaların &JSON; dosyaları <userinput>data/themes/</userinput> dizininde bulunur. Metin düzenleyicilerinde yerleşik temaların KSyntaxHighlighting kitaplığıyla derlendiğine dikkat edin; dolayısıyla, onlara erişmek ya kaynak kodundan ya da <link linkend="color-themes-gui-import-export">KTextEditor temalarını yönetmek üzere grafik arayüzden dışa aktarılarak</link> olanaklıdır.

source: It is also possible to easily add additional or custom themes, which are loaded from the file system. User-customized theme files are located in the <filename class="directory">org.kde.syntax-highlighting/themes/</filename> directory in your user folder, which you can find with the command <userinput><command>qtpaths</command><option> --paths GenericDataLocation</option></userinput> and are commonly <filename class="directory"><envar>$HOME</envar>/.local/share/</filename> and <filename class="directory">/usr/share/</filename>.
tr: Dosya sisteminden, ek veya özel temaları kolaylıkla eklemek olanaklıdır. Kullanıcılar tarafından özelleştirilen tema dosyaları, kullanıcı klasörünüzdeki <filename class="directory">org.kde.syntax-highlighting/themes/</filename> dizininde bulunur; bu dizini <userinput><command>qtpaths</command><option> --paths GenericDataLocation</option></userinput> komutuyla bulabilirsiniz ve genellikle <filename class="directory"><envar>$HOME</envar>/.local/share/</filename> ve <filename class="directory">/usr/share/</filename> dizinleridir.

source: In Flatpak and Snap packages, the above directory will not work as the data location is different for each application. In a Flatpak application, the location of custom theme files is usually <filename class="directory"><envar>$HOME</envar>/.var/app/<replaceable>flatpak-package-name</replaceable>/data/org.kde.syntax-highlighting/themes/</filename> and in a Snap application that location is <filename class="directory"><envar>$HOME</envar>/snap/<replaceable>snap-package-name</replaceable>/current/.local/share/org.kde.syntax-highlighting/themes/</filename>.
tr: Flatpak ve Snap paketlerinde, yukarıdaki dizin işe yaramaz; çünkü her uygulamanın veri konumu farklıdır. Bir Flatpak uygulamasında, özel dosyaların konumu genellikle <filename class="directory"><envar>$HOME</envar>/.var/app/<replaceable>flatpak-paketi-adı</replaceable>/data/org.kde.syntax-highlighting/themes/</filename> ve bir Snap uygulamasında ise <filename class="directory"><envar>$HOME</envar>/snap/<replaceable>snap-paketi-adı</replaceable>/current/.local/share/org.kde.syntax-highlighting/themes/</filename> olarak kullanılır.

source: On &Windows; these files are located <filename>%USERPROFILE%&#92;AppData&#92;Local&#92;org.kde.syntax-highlighting&#92;themes</filename>. <replaceable>%USERPROFILE%</replaceable> usually expands to <filename>C:&#92;Users&#92;<replaceable>user-name</replaceable></filename>.
tr: &Windows;’ta bu dosyalar genelde <filename>C:&#92;Users&#92;<replaceable>user-name</replaceable></filename> <filename>%USERPROFILE%&#92;AppData&#92;Local&#92;org.kde.syntax-highlighting&#92;themes</filename> olarak genişleyen <replaceable>%USERPROFILE%</replaceable> konumundadır.

source: In summary, for most configurations the custom themes directory is as follows:
tr: Özet olarak, çoğu yapılandırmada özel tema dizinleri aşağıdaki gibidir:

source: <envar>$HOME</envar>/.var/app/<replaceable>flatpak-package-name</replaceable>/data/org.kde.syntax-highlighting/themes/
tr: <envar>$HOME</envar>/.var/app/<replaceable>flatpak-paketi-adı</replaceable>/data/org.kde.syntax-highlighting/themes/

source: <envar>$HOME</envar>/snap/<replaceable>snap-package-name</replaceable>/current/.local/share/org.kde.syntax-highlighting/themes/
tr: <envar>$HOME</envar>/snap/<replaceable>snap-paketi-adı</replaceable>/current/.local/share/org.kde.syntax-highlighting/themes/

source: If multiple theme files exist with the same name, the file with the highest <userinput>revision</userinput> will be loaded.
tr: Aynı adlı birden çok tema dosyası varsa en yüksek <userinput>revision</userinput>’a (revizyona) sahip dosya yüklenir.

source: The &JSON; Structure
tr: &JSON; Yapısı

source: The structure of a &JSON; file is explained on <ulink url="https://www.json.org">their website</ulink>. Basically, a &JSON; format file consists of:
tr: Bir &JSON; dosyasının yapısı <ulink url="https://www.json.org">web sitelerinde</ulink> açıklanmıştır. Temel olarak, bir &JSON; biçimi şunlardan oluşur:

source: Collections of key/value pairs, separated by commas and grouped in <userinput>{ }</userinput> which we will call <quote>objects</quote>.
tr: Adına <quote>nesneler</quote> dediğimiz ve <userinput>{ }</userinput> ile gruplanan anahtar/değer çiftleri koleksiyonları.

source: Ordered lists of values, separated by commas and grouped in <userinput>[ ]</userinput> which we will call <quote>array</quote>.
tr: Adına <quote>diziliş</quote> dediğimiz ve <userinput>[ ]</userinput> ile gruplanan sıralı değerler listeleri.

source: The nomenclature <quote>key</quote>, <quote>value</quote>, <quote>object</quote> and <quote>array</quote> will be used in this article. If this is your first time working with &JSON; files, understanding them is as simple as looking at the examples below.
tr: Bu yazıda, <quote>anahtar</quote>, <quote>değer</quote>, <quote>nesne</quote> ve <quote>diziliş</quote> ögeleri kullanılacaktır. &JSON; dosyalarıyla ilk tanışmanız ise onları anlamanın en kolay yolu aşağıdaki örneklere bakmaktır.

source: Main Sections of the &JSON; Color Theme Files
tr: &JSON; Renk Teması Dosyalarının Ana Bölümleri

source: The root object of the color theme &JSON; file contains the following schema keys:
tr: &JSON; renk teması dosyalarının kök nesnesi aşağıdaki şema anahtarlarını içerir:

source: <userinput>metadata</userinput>: It is mandatory. The value is an object with the theme's metadata, such as name, revision and license.
tr: <userinput>metadata</userinput>: Zorunlu. Değer, temanın üst verisi olan bir nesnedir; örneğin, adı, revizyonu ve lisansı.

source: This is detailed in <xref linkend="color-themes-json-metadata"/>.
tr: Ayrıntılı bilgi için <xref linkend="color-themes-json-metadata"/> bölümüne bakın.

source: <userinput>editor-colors</userinput>: It is mandatory. The value is an object with the colors of the text editing area, such as the background, the icon border and the text decoration.
tr: <userinput>editor-colors</userinput>: Zorunlu. It is mandatory. Değer; arka plan, simge kenarlığı ve metin dekorasyonu gibi metin düzenleme alanının renklerine sahip bir nesnedir.

source: This is detailed in <xref linkend="color-themes-editor-colors"/>.
tr: Ayrıntılı bilgi için <xref linkend="color-themes-editor-colors"/> bölümüne bakın.

source: <userinput>text-styles</userinput>: It is mandatory. The value is an object with the <emphasis>default text style</emphasis> attributes of the syntax highlighting. Each attribute defines its <emphasis>text color</emphasis>, its <emphasis>selected text color</emphasis>, or whether it <emphasis>bold</emphasis> or <emphasis>italic</emphasis>, for example. The text styles can be referenced from <link linkend="kate-highlight-default-styles">the attributes of the syntax definition &XML; files</link>.
tr: <userinput>text-styles</userinput>: Zorunlu. Değer, sözdizim vurgulamanın <emphasis>öntanımlı metin biçemi</emphasis> öznitelikleriyle bir nesnedir. Her bir öznitelik; örneğin, kendi <emphasis>metin rengini</emphasis>, <emphasis>seçili metin rengini</emphasis> veya onun <emphasis>kalın</emphasis> veya <emphasis>yatık</emphasis> olup olmadığını tanımlar. Metin biçemlerine <link linkend="kate-highlight-default-styles">&XML; sözdizim vurgulama dosyalarından</link> başvurulabilir.

source: This is detailed in <xref linkend="color-themes-text-styles"/>.
tr: Ayrıntılı bilgi için <xref linkend="color-themes-text-styles"/> bölümüne bakın.

source: <userinput>custom-styles</userinput>: It is optional. Defines text styles for the attributes of specific syntax highlighting definitions. For example, in a highlighting definition such as <userinput>Python</userinput> or <userinput>Markdown</userinput> you can specify a different text style that overrides the default defined in <userinput>text-styles</userinput>.
tr: <userinput>custom-styles</userinput>: İsteğe bağlı. Belirli sözdizim vurgulama tanımlarının öznitelekleri için metin biçemlerini tanımları. Örneğin, <userinput>Python</userinput> veya <userinput>Markdown</userinput> vurgulama tanımlarında, <userinput>text-styles</userinput> içinde tanımlı metin biçemini geçersiz kılacak bir metin biçemi tanımlayabilirsiniz.

source: This is detailed in <xref linkend="color-themes-custom-styles"/>.
tr: Ayrıntılı bilgi için <xref linkend="color-themes-custom-styles"/> bölümüne bakın.

source: The &JSON; language does not support comments. However, you can use the optional key <userinput>_comments</userinput> in the root object to write comments, for example, if you are adapting an existing theme you can put the URL of the original repository. The most practical way is to use an array of strings.
tr: &JSON; dili yorumları desteklemez. Ancak, yorumlar yazmak için kök nesnede isteğe bağlı <userinput>_comments</userinput> anahtarını kullanabilirsiniz. Bu örneğin, önceden var olan bir temayı uyarlıyorsanız özgün deponun URL’sini buraya koyabilirsiniz. En pratik yolu, diziler içeren dizilişler kullanmaktır.

source: Below is an example file for the <quote>Breeze Light</quote> theme. You can notice that, to avoid the example being too large, the <userinput>editor-colors</userinput> and <userinput>text-styles</userinput> objects do not contain all the required keys. You can see the full archive of <ulink url="https://invent.kde.org/frameworks/syntax-highlighting/-/blob/master/data/themes/breeze-light.theme"> the <quote>Breeze Light</quote> theme in the KSyntaxHighlighting repository</ulink>.
tr: Aşağıda <quote>Esinti Açık</quote> teması için bir örnek dosyayı görebilirsiniz. Örneğin pek büyük olmasını engellemek için <userinput>editor-colors</userinput> ve <userinput>text-styles</userinput> nesnelerinin tüm gerekli anahtarları içermediğine dikkat edin. <ulink url="https://invent.kde.org/frameworks/syntax-highlighting/-/blob/master/data/themes/breeze-light.theme"><quote>Esinti Açık</quote> temasının tam arşivini KSyntaxHighlighting deposunda</ulink> bulabilirsiniz.

source: { "_comments": [ "This is a comment.", "If this theme is an adaptation of another, put the link to the original repository." ], "metadata": { "name" : "Breeze Light", "revision" : 5, "copyright": [ "SPDX-FileCopyrightText: 2016 Volker Krause &lt;vkrause@kde.org&gt;", "SPDX-FileCopyrightText: 2016 Dominik Haumann &lt;dhaumann@kde.org&gt;" ], "license": "SPDX-License-Identifier: MIT" }, "editor-colors": { "BackgroundColor" : "#ffffff", "CodeFolding" : "#94caef", "BracketMatching" : "#ffff00", "CurrentLine" : "#f8f7f6", "IconBorder" : "#f0f0f0", "IndentationLine" : "#d2d2d2", "LineNumbers" : "#a0a0a0", "CurrentLineNumber" : "#1e1e1e", <replaceable>The other editor color keys...</replaceable> }, "text-styles": { "Normal" : { "text-color" : "#1f1c1b", "selected-text-color" : "#ffffff", "bold" : false, "italic" : false, "underline" : false, "strike-through" : false }, "Keyword" : { "text-color" : "#1f1c1b", "selected-text-color" : "#ffffff", "bold" : true }, "Function" : { "text-color" : "#644a9b", "selected-text-color" : "#452886" }, "Variable" : { "text-color" : "#0057ae", "selected-text-color" : "#00316e" }, <replaceable>The other text style keys...</replaceable> }, "custom-styles": { "ISO C++": { "Data Type": { "bold": true, "selected-text-color": "#009183", "text-color": "#00b5cf" }, "Keyword": { "text-color": "#6431b3" } }, "YAML": { "Attribute": { "selected-text-color": "#00b5cf", "text-color": "#00b5cf" } } } }
tr: { "_comments": [ "Bu bir yorumdur.", "Bu tema bir başkasından uyarlanmışsa özgün deponun bağlantısını buraya koyun." ], "metadata": { "name" : "Esinti Açık", "revision" : 5, "copyright": [ "SPDX-FileCopyrightText: 2016 Volker Krause &lt;vkrause@kde.org&gt;", "SPDX-FileCopyrightText: 2016 Dominik Haumann &lt;dhaumann@kde.org&gt;" ], "license": "SPDX-License-Identifier: MIT" }, "editor-colors": { "BackgroundColor" : "#ffffff", "CodeFolding" : "#94caef", "BracketMatching" : "#ffff00", "CurrentLine" : "#f8f7f6", "IconBorder" : "#f0f0f0", "IndentationLine" : "#d2d2d2", "LineNumbers" : "#a0a0a0", "CurrentLineNumber" : "#1e1e1e", <replaceable>Diğer düzenleyici renk anahtarları…</replaceable> }, "text-styles": { "Normal" : { "text-color" : "#1f1c1b", "selected-text-color" : "#ffffff", "bold" : false, "italic" : false, "underline" : false, "strike-through" : false }, "Keyword" : { "text-color" : "#1f1c1b", "selected-text-color" : "#ffffff", "bold" : true }, "Function" : { "text-color" : "#644a9b", "selected-text-color" : "#452886" }, "Variable" : { "text-color" : "#0057ae", "selected-text-color" : "#00316e" }, <replaceable>Diğer metin biçemi anahtarları…</replaceable> }, "custom-styles": { "ISO C++": { "Data Type": { "bold": true, "selected-text-color": "#009183", "text-color": "#00b5cf" }, "Keyword": { "text-color": "#6431b3" } }, "YAML": { "Attribute": { "selected-text-color": "#00b5cf", "text-color": "#00b5cf" } } } }

source: Metadata
tr: Üst Veri

source: The &JSON; object of the <userinput>metadata</userinput> key contains relevant information on the theme. This object has the following keys:
tr: <userinput>metadata</userinput> anahtarının &JSON; nesnesi, tema üzerine aşağıdaki ilgili bilgiyi içerir. Bu nesnedeki anahtarlar aşağıdaki gibidir:

source: <userinput>name</userinput>: It is a <emphasis>string</emphasis> sets the name of the language. It appears in the menus and dialogs afterwards. It is mandatory.
tr: <userinput>name</userinput>: Dilin adını ayarlayan bir <emphasis>dizidir</emphasis>. Daha sonra menülerde ve iletişim kutularında görünür. Bu, zorunludur.

source: <userinput>revision</userinput>: It is an <emphasis>integer</emphasis> number that specifies the current revision of the theme file. Whenever you update a color theme file, make sure to increase this number. It is mandatory.
tr: <userinput>revizyon</userinput>: Tema dosyasının geçerli revizyonunu belirten bir <emphasis>tamsayı</emphasis>’dır. Bir renk teması dosyasını güncellediğinizde bu sayıyı artırdığınızdan emin olun. Bu zorunludur.

source: <userinput>license</userinput>: It is a <emphasis>string</emphasis> that defines the license of the theme, using the identifier <userinput>SPDX-License-Identifier</userinput> from the standard <ulink url="https://spdx.dev/">SPDX license communication format</ulink>. It is optional.
tr: <userinput>license</userinput>: Temanın lisansını, standart <ulink url="https://spdx.dev/">SPDX lisans iletişim biçiminden alınan</ulink> <userinput>SPDX-License-Identifier</userinput> tanımlayıcısını kullanarak belirten bir <emphasis>dizidir</emphasis>. İsteğe bağlıdır.
