Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_development.po
Languages: tr

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Extending &kate;
tr: &kate;’i Genişletmek

source: Introduction
tr: Giriş

source: Like any advanced text editor, &kate; offers a variety of ways to extend its functionality. You can <link linkend="dev-scripting">write simple scripts to add functionality with &javascript;</link> or add even more functionality to the editor itself with <link linkend="dev-app">&kate; Application Plugins written in C++</link>. Finally, once you have extended &kate;, you are welcome to <ulink url="https://kate-editor.org/join-us/">join us</ulink> and share your enhancements with the world!
tr: Gelişmiş herhangi bir metin düzenleyicisi gibi, &kate; de, işlevselliğini genişletmenin çeşitli yollarını sunar. <link linkend="dev-scripting">&javascript; ile basit betikler yazabilir</link> veya <link linkend="dev-app">C++ ile yazılmış &kate; Uygulama Eklentileri</link> ile çok daha fazla özellik ekleyebilirsiniz. Son olarak, &kate;’i genişlettikten sonra, <ulink url="https://kate-editor.org/join-us/">bize katılın</ulink> ve iyileştirmelerinizi dünyayla paylaşın!

source: Working with Syntax Highlighting
tr: Sözdizim Vurgulamalarıyla Çalışmak

source: For information about adding or modifying syntax highlighting definitions, see the <ulink url="help:/katepart/highlight.html">Working with Syntax Highlighting section of the Development chapter of the &katepart; Handbook</ulink>.
tr: Sözdizim vurgulamaları tanımlamarını eklemek veya düzenlemek hakkında bilgi için <ulink url="help:/katepart/highlight.html">&katepart; El Kitabı’nın Geliştirme bölümünün Sözdizim Vurgulamalarıyla Çalışmak bölümüne</ulink> bakın.

source: Scripting with &javascript;
tr: &javascript; ile Betik Yazımı

source: For information about scripting with &javascript;, see the <ulink url="help:/katepart/dev-scripting.html">Scripting with &javascript; section of the Development chapter of the &katepart; Handbook</ulink>.
tr: &javascript; ile betik yazımı hakkında bilgi için <ulink url="help:/katepart/highlight.html">&katepart; El Kitabı</ulink>’nın &javascript; ile betik yazımı bölümüne bakın.

source: &kate; (C++) Application Plugins
tr: &kate; (C++) Uygulama Eklentileri

source: <link linkend="kate-application-plugins">&kate; Application Plugins</link> extend the functionality of the &kate; editor itself in any way you can imagine, using the same programming language &kate; is written in, C++.
tr: <link linkend="kate-application-plugins">&kate; Uygulama Eklentileri</link>, düşleyebileceğiniz herhangi bir biçimde &kate; düzenleyicisinin işlevselliğini genişletir, &kate;’in yazıldığı programlama dili olan C++ programlama dilini kullanarak yazılmıştır.

source: To get started, see the <ulink url="https://kate-editor.org/2004/01/06/writing-a-kate-plugin/">Writing a &kate; Plugin tutorial on the &kate; website</ulink>.
tr: Başlamak için &kate; web sitesindeki <ulink url="https://kate-editor.org/2004/01/06/writing-a-kate-plugin/">&kate; Eklentileri Öğreticisi</ulink>’ne bakın.
