Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_development.po
Languages: tr

source: The <userinput>char</userinput> attribute defines the character to match.
tr: <userinput>char</userinput> özniteliği, eşleştirilecek karakteri tanımlar.

source: Detect two specific characters in a defined order.
tr: Tanımlı bir sırada iki belirli karakteri algılar.

source: &lt;Detect2Chars char=&quot;(character)&quot; char1=&quot;(character)&quot; (common attributes) /&gt;
tr: &lt;2KarakterAlgıla char=&quot;(karakter)&quot; char1=&quot;(karakter)&quot; (ortak öznitelikler) /&gt;

source: The <userinput>char</userinput> attribute defines the first character to match, <userinput>char1</userinput> the second.
tr: <userinput>char</userinput> özniteliği, eşleştirilecek ilk karakteri, <userinput>char1</userinput> ise ikincisini tanımlar.

source: This rule is present for historical reasons and for readability it's preferable to use <userinput>StringDetect</userinput>.
tr: Bu kural tarihsel nedenlerden dolayı buradadır; okunabilirlik açısından <userinput>StringDetect</userinput> kullanılması tercih nedenidir.

source: Detect one character of a set of specified characters.
tr: Belirli bir karakter kümesinden tek bir karakteri algılar.

source: &lt;AnyChar String=&quot;(string)&quot; (common attributes) /&gt;
tr: &lt;AnyChar String=&quot;(dizi)&quot; (ortak öznitelikler) /&gt;

source: The <userinput>String</userinput> attribute defines the set of characters.
tr: <userinput>String</userinput> özniteliği, karakterlerin kümesini tanımlar.

source: Detect an exact string.
tr: Kesin bir diziyi algılar.

source: &lt;StringDetect String=&quot;(string)&quot; [insensitive=&quot;true|false&quot;] (common attributes) (dynamic) /&gt;
tr: &lt;StringDetect String=&quot;(dizi)&quot; [insensitive=&quot;true|false&quot;] (ortak öznitelikler) (devingen) /&gt;

source: The <userinput>String</userinput> attribute defines the string to match. The <userinput>insensitive</userinput> attribute defaults to <emphasis>false</emphasis> and is passed to the string comparison function. If the value is <emphasis>true</emphasis> insensitive comparing is used.
tr: <userinput>String</userinput> özniteliği, eşleştirilecek diziyi tanımlar. <userinput>insensitive</userinput> özniteliği öntanımlı olarak <emphasis>false</emphasis>’tur ve dizi karşılaştırma işlevine geçirilir. Değer <emphasis>true</emphasis> ise duyarsız karşılaştırma kullanılır.

source: Detect an exact string but additionally require word boundaries such as a dot <userinput>'.'</userinput> or a whitespace on the beginning and the end of the word. Think of <userinput>\b&lt;string&gt;\b</userinput> in terms of a regular expression, but it is faster than the rule <userinput>RegExpr</userinput>.
tr: Tam bir diziyi algılar; ancak sözcük başlangıcında ve sonunda <userinput>'.'</userinput> veya boşluk gibi sözcük sınırlarına gereksinim duyar. Bir düzenli ifade kapsamında <userinput>\b&lt;string&gt;\b</userinput> gibi düşünün; ancak <userinput>RegExpr</userinput> kuralından daha hızlıdır.

source: &lt;WordDetect String=&quot;(string)&quot; [insensitive=&quot;true|false&quot;] (common attributes) (local deliminators) /&gt;
tr: &lt;SözcükAlgıla String=&quot;(dizi)&quot; [insensitive=&quot;true|false&quot;] (ortak öznitelikler) (yerel sınırlandırıcılar) /&gt;

source: Since: &kate; 3.5 (&kde; 4.5)
tr: &kate; 3.5 (&kde; 4.5) sürümünden bu yana

source: Matches against a regular expression.
tr: Bir düzenli ifade ile eşleşir.

source: &lt;RegExpr String=&quot;(string)&quot; [insensitive=&quot;true|false&quot;] [minimal=&quot;true|false&quot;] (common attributes) (dynamic) /&gt;
tr: &lt;RegExpr String=&quot;(dizi)&quot; [insensitive=&quot;true|false&quot;] [minimal=&quot;true|false&quot;] (ortak öznitelikler) (devingen) /&gt;

source: The <userinput>String</userinput> attribute defines the regular expression.
tr: <userinput>String</userinput> özniteliği, düzenli ifadeyi tanımlar.

source: <userinput>insensitive</userinput> defaults to <emphasis>false</emphasis> and is passed to the regular expression engine.
tr: <userinput>insensitive</userinput> öntanımlı olarak <emphasis>false</emphasis>’tur ve düzenli ifade işletkesine geçirilir.

source: <userinput>minimal</userinput> defaults to <emphasis>false</emphasis> and is passed to the regular expression engine.
tr: <userinput>minimal</userinput> öntanımlı olarak <emphasis>false</emphasis>’tur ve düzenli ifade işletkesine geçirilir.

source: Because the rules are always matched against the beginning of the current string, a regular expression starting with a caret (<literal>^</literal>) indicates that the rule should only be matched against the start of a line.
tr: Kurallar her zaman geçerli dizinin başlangıcına göre eşleştirildiğinden, şapka (<literal>^</literal>) ile başlayan düzenli ifade, kuralın yalnızca satırın başlangıcına göre eşleştirilmesi gerektiğini belirtir.

source: See <link linkend="regular-expressions">Regular Expressions</link> for more information on those.
tr: Bunlar hakkında daha fazla bilgi için <link linkend="regular-expressions">Düzenli İfadeler</link> bağlantısına bakın.

source: Detect a keyword from a specified list.
tr: Belirli bir listeden bir anahtar sözcüğü algılar.

source: &lt;keyword String=&quot;(list name)&quot; (common attributes) (local deliminators) /&gt;
tr: &lt;anahtar sözcük String=&quot;(liste ado)&quot; (ortak öznitelikler) (yerel sınırlandırıcılar) /&gt;

source: The <userinput>String</userinput> attribute identifies the keyword list by name. A list with that name must exist.
tr: <userinput>String</userinput> özniteliği, adıyla anahtar sözcük listesini tanımlar. Bu ada sahip bir liste var olmalıdır.

source: The highlighting system processes keyword rules in a very optimized way. This makes it an absolute necessity that any keywords to be matched need to be surrounded by defined delimiters, either implied (the default delimiters), or explicitly specified within the <emphasis>additionalDeliminator</emphasis> property of the <emphasis>keywords</emphasis> tag.
tr: Vurgulama sistemi, anahtar sözcük kurallarını oldukça eniyilenmiş bir biçimde işler. Bu, eşleştirilecek tüm anahtar sözcüklerin, örtük biçimde (öntanımlı sınırlandırıcılar) veya <emphasis>keywords</emphasis> etiketinin <emphasis>additionalDeliminator</emphasis> özelliğiyle açıkça belirtilmiş bir biçimde tanımlı sınırlandırıcılarla eşleştirilmiş olmasını bir gereklilik kılar.

source: If a keyword to be matched shall contain a delimiter character, this respective character must be added to the <emphasis>weakDeliminator</emphasis> property of the <emphasis>keywords</emphasis> tag. This character will then loose its delimiter property in all <emphasis>keyword</emphasis> rules. It is also possible to use the <emphasis>weakDeliminator</emphasis> attribute of <emphasis>keyword</emphasis> so that this modification only applies to this rule.
tr: Eşleştirilecek bir anahtar sözcükte sınırlandırıcı bir karakter varsa bu ilgili karakter <emphasis>keywords</emphasis> etiketinin <emphasis>weakDeliminator</emphasis> özelliğine eklenmelidir. Sonrasında bu karakter tüm <emphasis>keyword</emphasis> kurallarında sınırlandırıcı kimliğini kaybeder. Aynı zamanda, <emphasis>keyword</emphasis>’ün <emphasis>weakDeliminator</emphasis> özniteliği de kullanılabilir; böylece bu değişiklik yalnızca bu kural için geçerli olur.

source: Detect an integer number (as the regular expression: <userinput>\b[0-9]+</userinput>).
tr: Bir tamsayıyı algılar (şu düzenli ifade gibi: <userinput>\b[0-9]+</userinput>).

source: &lt;Int (common attributes) (local deliminators) /&gt;
tr: &lt;Int (ortak öznitelikler) (yerel sınırlandırıcılar) /&gt;

source: This rule has no specific attributes.
tr: Bu kuralın belirli bir özniteliği yoktur.

source: Detect a floating point number (as the regular expression: <userinput>(\b[0-9]+\.[0-9]*|\.[0-9]+)([eE][-+]?[0-9]+)?</userinput>).
tr: Bir kayan noktalı sayıyı algılar (şu düzenli ifade gibi: <userinput>(\b[0-9]+\.[0-9]*|\.[0-9]+)([eE][-+]?[0-9]+)?</userinput>).

source: &lt;Float (common attributes) (local deliminators) /&gt;
tr: &lt;Float (ortak öznitelikler) (yerel sınırlandırıcılar) /&gt;

source: Detect an octal point number representation (as the regular expression: <userinput>\b0[0-7]+</userinput>).
tr: Bir sekizlik noktalı sayı temsilini algılar (şu düzenli ifade gibi: <userinput>\b0[0-7]+</userinput>).

source: &lt;HlCOct (common attributes) (local deliminators) /&gt;
tr: &lt;HlCOct (ortak öznitelikler) (yerel sınırlandırıcılar) /&gt;

source: Detect a hexadecimal number representation (as a regular expression: <userinput>\b0[xX][0-9a-fA-F]+</userinput>).
tr: Bir onaltılık sayı temsilini algılar (şu düzenli ifade gibi: <userinput>\b0[xX][0-9a-fA-F]+</userinput>).

source: &lt;HlCHex (common attributes) (local deliminators) /&gt;
tr: &lt;HlCHex (ortak öznitelikler) (yerel sınırlandırıcılar) /&gt;

source: Detect an escaped character.
tr: Kaçırılan bir karakteri algılar.

source: &lt;HlCStringChar (common attributes) /&gt;
tr: &lt;HlCStringChar (ortak öznitelikler) /&gt;

source: It matches literal representations of characters commonly used in program code, for example <userinput>\n</userinput> (newline) or <userinput>\t</userinput> (TAB).
tr: Program kodunda sıkça kullanılan karakterlerin gerçek temsilleriyle eşleşir; örneğin, <userinput>\n</userinput> (yenisatır) veya <userinput>\t</userinput> (SEKME).

source: The following characters will match if they follow a backslash (<literal>\</literal>): <userinput>abefnrtv&quot;'?\</userinput>. Additionally, escaped hexadecimal numbers such as for example <userinput>\xff</userinput> and escaped octal numbers, for example <userinput>\033</userinput> will match.
tr: Eğer bir ters eğik çizgi (<literal>\</literal>) sonrasında geliyorlarsa aşağıdaki karakterler eşleşir: <userinput>abefnrtv&quot;'?\</userinput>. Ek olarak, kaçırılan onaltılık (örneğin, <userinput>\xff</userinput>) ve sekizlik (örneğin, <userinput>\033</userinput>) karakterler de eşleşir.

source: Detect an C character.
tr: Bir C karakterini algılar.

source: &lt;HlCChar (common attributes) /&gt;
tr: &lt;HlCChar (ortak öznitelikler) /&gt;

source: It matches C characters enclosed in a tick (Example: <userinput>'c'</userinput>). The ticks may be a simple character or an escaped character. See HlCStringChar for matched escaped character sequences.
tr: Bir kesme işareti çifti içine alınmış C karakterleriyle eşleşir (Örnek: <userinput>'c'</userinput>). Kesme işaretleri normal bir karakter veya kaçırılmış bir karakter olabilir. Eşleştirilen kaçırılmış karakter dizileri hakkında daha fazla bilgi için HlCStringChar bölümüne bakın.

source: Detect a string with defined start and end characters.
tr: Tanımlı bir başlangıç ve bitiş karakterleri olan bir diziyi algılar.

source: &lt;RangeDetect char=&quot;(character)&quot; char1=&quot;(character)&quot; (common attributes) /&gt;
tr: &lt;RangeDetect char=&quot;(karakter)&quot; char1=&quot;(karakter)&quot; (ortak öznitelikler) /&gt;

source: <userinput>char</userinput> defines the character starting the range, <userinput>char1</userinput> the character ending the range.
tr: <userinput>char</userinput>, erimi başlatan karakteri, <userinput>char1</userinput> ise bitiren karakteri tanımlar.

source: Useful to detect for example small quoted strings and the like, but note that since the highlighting engine works on one line at a time, this will not find strings spanning over a line break.
tr: Örneğin küçük alıntılanmış dizileri ve benzerlerini algılamak için kullanışlıdır; ancak vurgulama işletkesi her kerede bir satır üzerinde çalıştığından, bunun bir satır sonu boyunca uzanan dizileri bulmayacağını unutmayın.

source: Matches a specified char at the end of a line.
tr: Satırın sonundaki belirli bir karakterle eşleşir.

source: &lt;LineContinue (common attributes) [char="\"] /&gt;
tr: &lt;LineContinue (ortak öznitelik) [char="\"] /&gt;

source: <userinput>char</userinput> optional character to match, default is backslash (<userinput>'\'</userinput>). New since &kde; 4.13.
tr: <userinput>char</userinput> isteğe bağlı eşleştirilecek karakterdir, öntanımlısı ise ters eğik çizgidir (<userinput>'\'</userinput>). &kde; 4.13 sürümünden bu yana eklidir.

source: This rule is useful for switching context at end of line. This is needed for example in C/C++ to continue macros or strings.
tr: Bu kural, satırın sonunda bağlamı değiştirmek için kullanışlıdır. Bu, örneğin C/C++’da makroları veya dizileri sürdürmek için gereklidir.

source: Include rules from another context or language/file.
tr: Başka bir bağlamdan, dilden veya dosyadan kuralları içerir.

source: The <userinput>context</userinput> attribute defines which context to include.
tr: <userinput>context</userinput> özniteliği, hangi bağlamın içerileceğini tanımlar.

source: If it is a simple string it includes all defined rules into the current context, example:
tr: Basit bir diziyse tanımlı tüm kuralları geçerli bağlama içerir; örneğin:

source: If the string contains a <userinput>##</userinput> the highlight system will look for a context from another language definition with the given name, for example <programlisting>&lt;IncludeRules context=&quot;String##C++&quot; /&gt;</programlisting> would include the context <emphasis>String</emphasis> from the <emphasis>C++</emphasis> highlighting definition.
tr: Dizi bir <userinput>##</userinput> içeriyorsa vurgu sistemi, verilen adda başka bir dilden bir bağlam arar; örneğin, <programlisting>&lt;IncludeRules context=&quot;String##C++&quot; /&gt;</programlisting>, <emphasis>C++</emphasis> vurgulama tanımından <emphasis>String</emphasis> bağlamını içerir.

source: If <userinput>includeAttrib</userinput> attribute is <emphasis>true</emphasis>, change the destination attribute to the one of the source. This is required to make, for example, commenting work, if text matched by the included context is a different highlight from the host context.
tr: <userinput>includeAttrib</userinput> özniteliği <emphasis>true</emphasis> ise hedef özniteliği kaynağın olanına değiştirin. Bu; örneğin dahil edilen bağlamla eşleşen metnin ana bilgisayar bağlamından farklı bir vurgu olması durumunda yorum yapma işleminin gerçekleştirilmesi için gereklidir.

source: Detect whitespaces.
tr: Boşlukları algılar.

source: &lt;DetectSpaces (common attributes) /&gt;
tr: &lt;DetectSpaces (ortak öznitelikler) /&gt;

source: Use this rule if you know that there can be several whitespaces ahead, for example in the beginning of indented lines. This rule will skip all whitespace at once, instead of testing multiple rules and skipping one at a time due to no match.
tr: İleride birkaç boşluk olabileceğini biliyorsanız; örneğin, girintili çizgilerin başında bu kuralı kullanın. Bu kural, birden fazla kuralı sınamak ve eşleşme olmaması nedeniyle birer birer atlamak yerine, tüm boşlukları tek kerede atlayacaktır.

source: Detect identifier strings (as the regular expression: <userinput>[a-zA-Z_][a-zA-Z0-9_]*</userinput>).
tr: Tanımlayıcı dizilerini algılar (şu düzenli ifade gibi: <userinput>[a-zA-Z_][a-zA-Z0-9_]*</userinput>).

source: &lt;DetectIdentifier (common attributes) /&gt;
tr: &lt;DetectIdentifier (ortak öznitelikler) /&gt;

source: Use this rule to skip a string of word characters at once, rather than testing with multiple rules and skipping one at a time due to no match.
tr: Birden çok kuralla sınamak ve eşleşme olmaması nedeniyle birer birer atlamak yerine, bir dizi sözcük karakterini aynı anda atlamak için bu kuralı kullanın.

source: Tips &amp; Tricks
tr: İpuçları ve Kolaylıklar

source: Once you have understood how the context switching works it will be easy to write highlight definitions. Though you should carefully check what rule you choose in what situation. Regular expressions are very mighty, but they are slow compared to the other rules. So you may consider the following tips.
tr: Bağlam değiştirmenin nasıl çalıştığını anladıktan sonra vurgu tanımlarını yazmak kolay olacaktır. Hangi durumda hangi kuralı seçtiğinizi dikkatlice denetlemelisiniz. Düzenli ifadeler çok güçlüdür; ancak diğer kurallara göre yavaştırlar. Bu nedenle aşağıdaki ipuçlarını dikkate alabilirsiniz.

source: Regular expressions are easy to use but often there is another much faster way to achieve the same result. Consider you only want to match the character <userinput>'#'</userinput> if it is the first character in the line. A regular expression based solution would look like this: <programlisting>&lt;RegExpr attribute=&quot;Macro&quot; context=&quot;macro&quot; String=&quot;^\s*#&quot; /&gt;</programlisting> You can achieve the same much faster in using: <programlisting>&lt;DetectChar attribute=&quot;Macro&quot; context=&quot;macro&quot; char=&quot;#&quot; firstNonSpace=&quot;true&quot; /&gt;</programlisting> If you want to match the regular expression <userinput>'^#'</userinput> you can still use <userinput>DetectChar</userinput> with the attribute <userinput>column=&quot;0&quot;</userinput>. The attribute <userinput>column</userinput> counts characters, so a tabulator is only one character.
tr: Düzenli ifadelerin kullanımı kolaydır ancak çoğu zaman aynı sonucu elde etmenin çok daha hızlı başka bir yolu vardır. Satırdaki ilk karakter ise <userinput>'#'</userinput> karakterini eşleştirmek istediğinizi varsayalım. Düzenli ifade tabanlı bir çözüm şöyle görünecektir: <programlisting>&lt;RegExpr attribute=&quot;Macro&quot; context=&quot;macro&quot; String=&quot;^\s*#&quot; /&gt;</programlisting> Aynısını çok daha hızlıca şunu kullanarak elde edebilirsiniz: <programlisting>&lt;DetectChar attribute=&quot;Macro&quot; context=&quot;macro&quot; char=&quot;#&quot; firstNonSpace=&quot;true&quot; /&gt;</programlisting>. <userinput>'^#'</userinput> düzenli ifadesini eşleştirmek istiyorsanız hâlâ <userinput>column=&quot;0&quot;</userinput> özniteliğiyle <userinput>DetectChar</userinput> kullanabilirsiniz. <userinput>column</userinput> özniteliği karakterleri sayar, bu nedenle, sekme karakteri yalnızca bir karakter olarak geçer.

source: In <userinput>RegExpr</userinput> rules, use the attribute <userinput>column="0"</userinput> if the pattern <userinput>^PATTERN</userinput> will be used to match text at the beginning of a line. This improves performance, as it will avoid looking for matches in the rest of the columns.
tr: <userinput>RegExpr</userinput> kurallarında, <userinput>^PATTERN</userinput> dizgisi satırın başındaki metni eşleştirmek için kullanılacaksa <userinput>column="0"</userinput> özniteliğini kullanın. Geri kalan sütunlarda arama yapmayacağından bu, başarımı önemli ölçüde iyileştirir.

source: In regular expressions, use non-capturing groups <userinput>(?:PATTERN)</userinput> instead of capturing groups <userinput>(PATTERN)</userinput>, if the captures will not be used in the same regular expression or in dynamic rules. This avoids storing captures unnecessarily.
tr: Düzenli ifadelerde, yakalamalar aynı düzenli ifadeler içinde veya devingen kurallarda kullanılmayacaklarsa <userinput>(PATTERN)</userinput> yakalayan grupları yerine yakalamayan <userinput>(?:PATTERN)</userinput> gruplarını kullanın. Bu, gereksiz yere yakalamaları depolamayı önler.

source: You can switch contexts without processing characters. Assume that you want to switch context when you meet the string <userinput>*/</userinput>, but need to process that string in the next context. The below rule will match, and the <userinput>lookAhead</userinput> attribute will cause the highlighter to keep the matched string for the next context.
tr: Karakterleri işlemeden bağlamlar arasında geçiş yapabilirsiniz. <userinput>*/</userinput> dizisiyle karşılaştığınızda bağlamı değiştirmek istediğinizi; ancak bu diziyi bir sonraki bağlamda işlemeniz gerektiğini varsayalım. Aşağıdaki kural eşleşecektir ve <userinput>lookAhead</userinput> özelliği, vurgulayıcının eşleşen diziyi bir sonraki bağlam için tutmasını sağlar.

source: Use <userinput>DetectSpaces</userinput> if you know that many whitespaces occur.
tr: Çok sayıda boşluk oluşacağını biliyorsanız <userinput>DetectSpaces</userinput> kullanın.

source: Use <userinput>DetectIdentifier</userinput> instead of the regular expression <userinput>'[a-zA-Z_]\w*'</userinput>.
tr: <userinput>'[a-zA-Z_]\w*'</userinput> düzenli ifadesi yerine <userinput>DetectIdentifier</userinput> kullanın.

source: Use default styles whenever you can. This way the user will find a familiar environment.
tr: Olabildiğince öntanımlı biçemleri kullanın. Böylece, kullanıcı tanıdık bir ortam bulacaktır.

source: Look into other &XML; files to see how other people implement tricky rules.
tr: Başkalarının karmaşık kuralları nasıl uyguladıklarını görmek için diğer &XML; dosyalarına bakın.

source: You can validate every &XML; file by using the command <command>validatehl.sh mySyntax.xml</command>. The file <filename>validatehl.sh</filename> uses <filename>language.xsd</filename> which are both available in <ulink url="https://commits.kde.org/syntax-highlighting?path=data/schema">Syntax Highlighting repository</ulink>.
tr: <command>validatehl.sh mySyntax.xml</command> komutunu kullanarak tüm &XML; dosyalarını doğrulayabilirsiniz. <filename>validatehl.sh</filename> dosyası, her ikisi de <ulink url="https://commits.kde.org/syntax-highlighting?path=data/schema">Sözdizim Vurgulaması</ulink> deposunda bulunabilen <filename>language.xsd</filename> dosyalarını kullanır.

source: If you repeat complex regular expression very often you can use <emphasis>ENTITIES</emphasis>. Example:
tr: Karmaşık düzenli ifadeleri pek sık yineliyorsanız <emphasis>ENTITIES</emphasis> kullanabilirsiniz. Örnek:

source: Now you can use <emphasis>&amp;myref;</emphasis> instead of the regular expression.
tr: Şimdi, düzenli ifade yerine <emphasis>&amp;myref;</emphasis> kullanabilirsiniz.

source: On Kate Editor, you can reload syntaxes using the built-in command line (<userinput>F7</userinput> shortcut by default) and the <command>reload-highlighting</command> command.
tr: Kate’de, yerleşik komut satırını (öntanımlı kısayolu <userinput>F7</userinput>) ve <command>reload-highlighting</command> komutunu kullanarak sözdizimleri yenileyebilirsiniz.

source: You can use the command-line utility named <userinput>ksyntaxhighlighter6</userinput> (<userinput>kate-syntax-highlighter</userinput> on older versions) to test a syntax and display the style and regions associated with each part of a text.
tr: Bir sözdizimi sınamak ve biçemi ve metnin her bir kısmıyla ilgili bölgeleri görüntülemek için <userinput>ksyntaxhighlighter6</userinput> (eski sürümlerde <userinput>kate-syntax-highlighter</userinput>) adlı komut satırı izlencesini kullanabilirsiniz.

source: <phrase>Result of <command>ksyntaxhighlighter6 --output-format=ansi --syntax-trace=format test.cpp</command>.</phrase>
tr: <phrase><command>ksyntaxhighlighter6 --output-format=ansi --syntax-trace=format test.cpp</command> sonucu.</phrase>

source: <para>Result of <command>ksyntaxhighlighter6 --output-format=ansi --syntax-trace=format test.cpp</command>.</para>
tr: <para><command>ksyntaxhighlighter6 --output-format=ansi --syntax-trace=format test.cpp</command> sonucu.</para>

source: Use <command>ksyntaxhighlighter6 -h</command> for more options.
tr: Daha çok seçenek için <command>ksyntaxhighlighter6 -h</command> kullanın.

source: Working with Color Themes
tr: Renk Temalarıyla Çalışmak

source: Color themes define the colors of the <link linkend="kate-part">text editing area</link> and the <link linkend="highlight">syntax highlighting</link>. A color theme encompasses the following:
tr: Renk temaları, <link linkend="kate-part">metin düzenleme alanının</link> ve <link linkend="highlight">sözdizim vurgulamanın</link> renklerini tanımlar. Bir renk teması, aşağıdakileri içerir:
