Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_development.po
Languages: tr

source: <userinput>regexpr</userinput> defines a regular expression that will be treated as an empty line. By default, empty lines do not contain any characters, therefore, this adds additional empty lines, for example, if you want lines with spaces to also be considered empty lines. However, in most syntax definitions you do not need to set this attribute.
tr: <userinput>regexpr</userinput>, boş bir satır olarak davranılacak bir düzenli ifade tanımlar. Öntanımlı olarak, boş satırlar hiçbir karakter içermezler, dolayısıyla, bu ek boş satırlar ekler; örneğin, boşluklar içeren satırların da boş satırlar olarak kabul edilmesini istiyorsanız yararlıdır. Çoğu sözdizim tanımında bu özniteliği ayarlamanız gerekmez.

source: The element <userinput>encoding</userinput> in the group <userinput>spellchecking</userinput> defines a character encoding for spell checking. Available attributes:
tr: <userinput>spellchecking</userinput> grubundaki <userinput>encoding</userinput> ögesi, yazım denetimi için bir karakter kodlaması tanımlar. Kullanılabilir öznitelikler şunlardır:

source: <userinput>char</userinput> is a encoded character.
tr: <userinput>char</userinput>, bir kodlanmış karakterdir.

source: <userinput>string</userinput> is a sequence of characters that will be encoded as the character <emphasis>char</emphasis> in the spell checking. For example, in the language LaTeX, the string <userinput>\&quot;{A}</userinput> represents the character <userinput>&#196;</userinput>.
tr: <userinput>string</userinput>, yazım denetimindeki <emphasis>char</emphasis> karakteri olarak kodlanacak karakterler dizisidir. Örneğin, LaTeX için <userinput>\&quot;{A}</userinput> dizisi <userinput>&#196;</userinput> karakterini temsil eder.

source: Available Default Styles
tr: Kullanılabilir Öntanımlı Biçemler

source: Default Styles were <link linkend="kate-highlight-system-default-styles">already explained</link>, as a short summary: Default styles are predefined font and color styles.
tr: Öntanımlı Biçemler daha önce <link linkend="kate-highlight-system-default-styles">halihazırda kısa bir özet olarak</link> açıklammıştı: Öntanımlı biçemler, önceden tanımlanan yazıtipi ve renk biçemleridir.

source: General default styles:
tr: Genel öntanımlı biçemler:

source: <userinput>dsNormal</userinput>, when no special highlighting is required.
tr: Özel bir vurgulama gerekmediğinde <userinput>dsNormal</userinput>.

source: <userinput>dsKeyword</userinput>, built-in language keywords.
tr: <userinput>dsKeyword</userinput>, yerleşik dil anahtar sözcükleri.

source: <userinput>dsFunction</userinput>, function calls and definitions.
tr: <userinput>dsFunction</userinput>, işlev çağrıları ve tanımları.

source: <userinput>dsVariable</userinput>, if applicable: variable names (&eg; $someVar in PHP/Perl).
tr: <userinput>dsVariable</userinput>, kullanılabiliyorsa değişken adları (&eg;., PHP/Perl için $someVar).

source: <userinput>dsControlFlow</userinput>, control flow keywords like if, else, switch, break, return, yield, ...
tr: <userinput>dsControlFlow</userinput>; if, else, switch, break, return, yield, vb. denetim akışı anahtar sözcükleri.

source: <userinput>dsOperator</userinput>, operators like + - * / :: &lt; &gt;
tr: <userinput>dsOperator</userinput>, + - * / :: &lt; &gt; gibi işleçler.

source: <userinput>dsBuiltIn</userinput>, built-in functions, classes, and objects.
tr: <userinput>dsBuiltIn</userinput>, yerleşik işlevler, sınıflar ve nesneler.

source: <userinput>dsExtension</userinput>, common extensions, such as &Qt; classes and functions/macros in C++ and Python.
tr: <userinput>dsExtension</userinput>, ortak uzantılar; örneğin, C++ ve Python içindeki &Qt; sınıfları ve işlevler/makrolar.

source: <userinput>dsPreprocessor</userinput>, preprocessor statements or macro definitions.
tr: <userinput>dsPreprocessor</userinput>, önişlemci ifadeleri veya makro tanımları.

source: <userinput>dsAttribute</userinput>, annotations such as @override and __declspec(...).
tr: <userinput>dsAttribute</userinput>, @override ve __declspec(…) gibi açıklamalar.

source: String-related default styles:
tr: Dizi ile ilgili öntanımlı biçemler:

source: <userinput>dsChar</userinput>, single characters, such as 'x'.
tr: <userinput>dsChar</userinput>, “x” gibi tekli karakterler.

source: <userinput>dsSpecialChar</userinput>, chars with special meaning in strings such as escapes, substitutions, or regex operators.
tr: <userinput>dsSpecialChar</userinput>, kaçışlar, yer değiştirmeler, veya düzenli ifade işleçleri gibi özel anlama sahip diziler.

source: <userinput>dsString</userinput>, strings like "hello world".
tr: <userinput>dsString</userinput>, "merhaba dünya" gibi diziler.

source: <userinput>dsVerbatimString</userinput>, verbatim or raw strings like 'raw \backlash' in Perl, CoffeeScript, and shells, as well as r'\raw' in Python.
tr: <userinput>dsVerbatimString</userinput>, Perl, CoffeeScript ve kabuklardaki ’raw \backlash’ ve Python’daki r’\raw’ gibi gerçek veya ham diziler.

source: <userinput>dsSpecialString</userinput>, SQL, regexes, HERE docs, &latex; math mode, ...
tr: <userinput>dsSpecialString</userinput>, SQL, regex’ler, HERE belgeleri, &latex; matematik kipi, …

source: <userinput>dsImport</userinput>, import, include, require of modules.
tr: <userinput>dsImport</userinput>; modüllerin import, include, require ifadeleri.

source: Number-related default styles:
tr: Sayı ile ilgili öntanımlı biçemler:

source: <userinput>dsDataType</userinput>, built-in data types like int, void, u64.
tr: <userinput>dsDataType</userinput>; int, void, u64 gibi yerleşik veri türleri.

source: <userinput>dsDecVal</userinput>, decimal values.
tr: <userinput>dsDecVal</userinput>, ondalık değerler.

source: <userinput>dsBaseN</userinput>, values with a base other than 10.
tr: <userinput>dsBaseN</userinput>, 10 dışında tabana sahip değerler.

source: <userinput>dsFloat</userinput>, floating point values.
tr: <userinput>dsFloat</userinput>, kayan noktalı değerler.

source: <userinput>dsConstant</userinput>, built-in and user defined constants like PI.
tr: <userinput>dsConstant</userinput>, Pİ gibi yerleşik ve kullanıcı tanımlı sabitler.

source: Comment and documentation-related default styles:
tr: Yorum ve belgelendirmeyle ilgili öntanımlı biçemler:

source: <userinput>dsComment</userinput>, comments.
tr: <userinput>dsComment</userinput>, yorumlar.

source: <userinput>dsDocumentation</userinput>, /** Documentation comments */ or """docstrings""".
tr: <userinput>dsDocumentation</userinput>, /** Belgelendirme yorumları */ veya """docstrings""".

source: <userinput>dsAnnotation</userinput>, documentation commands like @param, @brief.
tr: <userinput>dsAnnotation</userinput>, @param, @brief gibi belgelendirme komutları.

source: <userinput>dsCommentVar</userinput>, the variable names used in above commands, like "foobar" in @param foobar.
tr: <userinput>dsCommentVar</userinput>, yukarıdaki komutlarda kullanılan değişken adları; @param foobar’daki "foobar" gibi.

source: <userinput>dsRegionMarker</userinput>, region markers like //BEGIN, //END in comments.
tr: <userinput>dsRegionMarker</userinput>; yorumlardaki //BEGIN, //END gibi bölge imleyicileri.

source: Other default styles:
tr: Diğer öntanımlı biçemler:

source: <userinput>dsInformation</userinput>, notes and tips like @note in doxygen.
tr: <userinput>dsInformation</userinput>, doxygen içindeki @note gibi notlar ve ipuçları.

source: <userinput>dsWarning</userinput>, warnings like @warning in doxygen.
tr: <userinput>dsWarning</userinput>, doxygen’deki @warning gibi uyarılar.

source: <userinput>dsAlert</userinput>, special words like TODO, FIXME, XXXX.
tr: <userinput>dsAlert</userinput>; TODO, FIXME, XXXX gibi özel sözcükler.

source: <userinput>dsError</userinput>, error highlighting and wrong syntax.
tr: <userinput>dsError</userinput>, hata vurgulaması ve yanlış sözdizim.

source: <userinput>dsOthers</userinput>, when nothing else fits.
tr: <userinput>dsOthers</userinput>, başka hiçbir şey uymadığında kullanılır.

source: Highlight Detection Rules
tr: Vurgu Algılama Kuralları

source: This section describes the syntax detection rules.
tr: Bu bölüm, sözdizim algılama kurallarını tanımlar.

source: Each rule can match zero or more characters at the beginning of the string they are tested against. If the rule matches, the matching characters are assigned the style or <emphasis>attribute</emphasis> defined by the rule, and a rule may ask that the current context is switched.
tr: Her kural, sınandıkları dizinin başlangıcındaki sıfır veya daha fazla karakterle eşleşebilir. Kural eşleşirse eşleşen karakterlere kural tarafından tanımlanan biçem veya <emphasis>öznitelik</emphasis> atanır ve bir kural, geçerli bağlamın değiştirilmesini isteyebilir.

source: A rule looks like this:
tr: Kural şuna benzer:

source: &lt;RuleName attribute=&quot;(identifier)&quot; context=&quot;(identifier)&quot; [rule specific attributes] /&gt;
tr: &lt;KuralAdı attribute=&quot;(tanımlayıcı)&quot; context=&quot;(tanımlayıcı)&quot; [kurala özel öznitelikler] /&gt;

source: The <emphasis>attribute</emphasis> identifies the style to use for matched characters by name, and the <emphasis>context</emphasis> identifies the context to use from here.
tr: <emphasis>attribute</emphasis>, eşleşen karakterlerle kullanılacak biçemi ada göre tanımlar ve <emphasis>context</emphasis> ise buradan sonra kullanılacak bağlamı tanımlar.

source: The <emphasis>context</emphasis> can be identified by:
tr: <emphasis>context</emphasis>, şöyle tanımlanabilir:

source: An <emphasis>identifier</emphasis>, which is the name of the other context.
tr: <emphasis>identifier</emphasis>, bu diğer bağlamın adıdır.

source: An <emphasis>order</emphasis> telling the engine to stay in the current context (<userinput>#stay</userinput>), or to pop back to a previous context used in the string (<userinput>#pop</userinput>). An empty or absent context is equivalent to <userinput>#stay</userinput>.
tr: Bir <emphasis>order</emphasis>, işletkeye geçerli bağlamda kalmasını (<userinput>#stay</userinput>) veya dizide kullanılan bir önceki bağlama geri gitmesini (<userinput>#pop</userinput>) söyler. Boş veya var olmayan bir bağlam <userinput>#stay</userinput> ile eşdeğerdir.

source: To go back more steps, the #pop keyword can be repeated: <userinput>#pop#pop#pop</userinput>
tr: Daha çok adım geri gitmek için #pop anahtar sözcüğü yinelenebilir: <userinput>#pop#pop#pop</userinput>

source: An <emphasis>order</emphasis> followed by an exclamation mark (<emphasis>!</emphasis>) and an <emphasis>identifier</emphasis>, which will make the engine first follow the order and then switch to the other context, &eg; <userinput>#pop#pop!OtherContext</userinput>.
tr: Bir ünlem işareti (<emphasis>!</emphasis>) ve <emphasis>tanımlayıcı</emphasis> tarafından izlenen bir <emphasis>sıra</emphasis>, işletkenin ilk sırayı izlemesini ve başka bir bağlama geçmesini söyler; örneğin, <userinput>#pop#pop!OtherContext</userinput>.

source: An <emphasis>identifier</emphasis>, which is a context name, followed by two hashes (<userinput>##</userinput>) and another <emphasis>identifier</emphasis>, which is the name of a language definition. This naming is similar to that used in <userinput>IncludeRules</userinput> rules and allows you to switch to a context belonging to another syntax highlighting definition, e.g. <userinput>SomeContext##JavaScript</userinput>.
tr: Bir bağlam adı olan, iki adet kare tarafından izlenen (<userinput>##</userinput>) ve sonrasında başka bir <emphasis>tanımlayıcı</emphasis> olan bir <emphasis>tanımlayıcı</emphasis>, bir dil tanımının adıdır. Bu adlandırma, <userinput>IncludeRules</userinput> kurallarında kullanılana benzerdir ve başka bir sözdizim vurgulama tanımında kullanılan bağlama geçiş yapmanıza olanak tanır; örneğin, <userinput>SomeContext##JavaScript</userinput>.

source: Rule specific attributes varies and are described in the following sections.
tr: Kurala özgü öznitelikler farklılık gösterir ve aşağıdaki bölümlerde açıklanmaktadır.

source: Common attributes
tr: Ortak öznitelikler

source: All rules have the following attributes in common and are available whenever <userinput>(common attributes)</userinput> appears. All attributes are optional.
tr: Tüm kurallar aşağıdaki ortak özelliklere sahiptir ve <userinput>(ortak özellikler)</userinput> göründüğünde kullanılabilir. Tüm özellikler isteğe bağlıdır.

source: <emphasis>attribute</emphasis>: An attribute maps to a defined <emphasis>itemData</emphasis>. Default: <emphasis>attribute</emphasis> from the context specified in <emphasis>context</emphasis> attribute.
tr: <emphasis>attribute</emphasis>: Bir tanımlı ile <emphasis>itemData</emphasis> eşlemlenen öznitelik. Öntanımlı: <emphasis>context</emphasis> özniteliğinde tanımlanan <emphasis>attribute</emphasis>.

source: <emphasis>context</emphasis>: Specify the context to which the highlighting system switches if the rule matches. Default: #stay.
tr: <emphasis>context</emphasis>: Kural eşleşirse vurgulama sisteminin geçiş yapacağı bağlamı belirtir. Öntanımlı: #stay.

source: <emphasis>beginRegion</emphasis>: Start a code folding block. Default: unset.
tr: <emphasis>beginRegion</emphasis>: Bir kod katlama bloku başlatın. Öntanımlı: Ayarsız.

source: <emphasis>endRegion</emphasis>: Close a code folding block. Default: unset.
tr: <emphasis>endRegion</emphasis>: Bir kod katlama blokunu kapatın. Öntanımlı: Ayarsız.

source: <emphasis>lookAhead</emphasis>: If <emphasis>true</emphasis>, the highlighting system will not process the matches length. Default: <emphasis>false</emphasis>.
tr: <emphasis>lookAhead</emphasis>: <emphasis>true</emphasis> ise vurgulama sistemi eşleşmelerin uzunluğunu dikkate almaz.Öntanımlı: <emphasis>false</emphasis>.

source: <emphasis>firstNonSpace</emphasis>: Match only, if the string is the first non-whitespace in the line. Default: <emphasis>false</emphasis>.
tr: <emphasis>firstNonSpace</emphasis>: Dizi, satırdaki ilk boşluk olmayan karakterse eşleşir. Öntanımlı: <emphasis>false</emphasis>.

source: <emphasis>column</emphasis>: Match only, if the column matches. Default: unset.
tr: <emphasis>column</emphasis>: Yalnızca sütun eşleşirse eşleşir. Öntanımlı: Ayarsız.

source: Dynamic rules
tr: Devingen kurallar

source: Some rules allow the optional attribute <userinput>dynamic</userinput> of type boolean that defaults to <emphasis>false</emphasis>. If dynamic is <emphasis>true</emphasis>, a rule can use placeholders representing the text matched by a <emphasis>regular expression</emphasis> rule that switched to the current context in its <userinput>string</userinput> or <userinput>char</userinput> attributes. In a <userinput>string</userinput>, the placeholder <replaceable>%N</replaceable> (where N is a number) will be replaced with the corresponding capture <replaceable>N</replaceable> from the calling regular expression, starting from 1. In a <userinput>char</userinput> the placeholder must be a number <replaceable>N</replaceable> and it will be replaced with the first character of the corresponding capture <replaceable>N</replaceable> from the calling regular expression. Whenever a rule allows this attribute it will contain a <emphasis>(dynamic)</emphasis>.
tr: Bazı kurallar, öntanımlı olarak <emphasis>false</emphasis> olan isteğe bağlı Boole türündeki <userinput>dynamic</userinput> özniteliğine izin verirler. Dynamic <emphasis>true</emphasis> ise bir kural bir <emphasis>regular expression</emphasis> ile eşleşen metni temsil eden yer tutucular kullanabilir. Bunlar kendi <userinput>string</userinput> veya <userinput>char</userinput> özniteliklerinde geçerli bağlama geçiş yaparlar. Bir <userinput>string</userinput>’de, <replaceable>%N</replaceable> yer tutucusu (N bir sayıdır), çağırdığı düzenli ifadede ilişkili olduğu <replaceable>N</replaceable> ile değiştirilir. Bir <userinput>char</userinput>’da, yer tutucu bir <replaceable>N</replaceable> sayısı olmalıdır ve çağıran düzenli ifadedeki ilişkili olduğu <replaceable>N</replaceable> ile değiştirilir. Bir kural bu özniteliğe izin veriyorsa bir <emphasis>(dynamic)</emphasis> içerir.

source: <emphasis>dynamic</emphasis>: may be <emphasis>(true|false)</emphasis>.
tr: <emphasis>dynamic</emphasis>: <emphasis>(true|false)</emphasis> olabilir.

source: How does it work:
tr: Nasıl çalışır:

source: In the <link linkend="regular-expressions">regular expressions</link> of the <userinput>RegExpr</userinput> rules, all text within simple curved brackets <userinput>(PATTERN)</userinput> is captured and remembered. These captures can be used in the context to which it is switched, in the rules with the attribute <userinput>dynamic</userinput> <emphasis>true</emphasis>, by <replaceable>%N</replaceable> (in <emphasis>String</emphasis>) or <replaceable>N</replaceable> (in <emphasis>char</emphasis>).
tr: <userinput>RegExpr</userinput> kuallarının <link linkend="regular-expressions">düzenli ifadelerinde</link>, basit süslü ayraçlar arasındaki tüm metin <userinput>(PATTERN)</userinput> yakalanır ve anımsanır. Bu yakalamalar, geçiş yapıldıkları bağlama göre kullanılabilirler. Bu, <userinput>dynamic</userinput> özniteliği <emphasis>true</emphasis> iken ve <replaceable>%N</replaceable> (<emphasis>String</emphasis> içinde) veya <replaceable>N</replaceable> (<emphasis>char</emphasis> içinde) iken geçerlidir.

source: It is important to mention that a text captured in a <userinput>RegExpr</userinput> rule is only stored for the switched context, specified in its <userinput>context</userinput> attribute.
tr: Bir <userinput>RegExpr</userinput> kuralında yakalanan metnin, <userinput>context</userinput> özniteliğinde belirtildiği üzere, yalnızca geçiş yapıldığı bağlam için depolandığını belirtmek önemlidir.

source: If the captures will not be used, both by dynamic rules and in the same regular expression, <userinput>non-capturing groups</userinput> should be used: <userinput>(?:PATTERN)</userinput>
tr: Yakalamalar, hem devingen kurallar hem de düzenli ifadeler tarafından kullanılmayacaksa <userinput>yakalamayan gruplar</userinput> kullanılmalıdır: <userinput>(?:PATTERN)</userinput>

source: The <emphasis>lookahead</emphasis> or <emphasis>lookbehind</emphasis> groups such as <userinput>(?=PATTERN)</userinput>, <userinput>(?!PATTERN)</userinput> or <userinput>(?&lt;=PATTERN)</userinput> are not captured. See <link linkend="regular-expressions">Regular Expressions</link> for more information.
tr: <userinput>(?=PATTERN)</userinput>, <userinput>(?!PATTERN)</userinput> or <userinput>(?&lt;=PATTERN)</userinput> gibi <emphasis>lookahead</emphasis> veya <emphasis>lookbehind</emphasis> grupları yakalanmazlar. Daha fazla bilgi için <link linkend="regular-expressions">Düzenli İfadeler</link> bölümüne bakın.

source: The capture groups can be used within the same regular expression, using <replaceable>\N</replaceable> instead of <replaceable>%N</replaceable> respectively. For more information, see <link linkend="regex-capturing">Capturing matching text (back references)</link> in <link linkend="regular-expressions">Regular Expressions</link>.
tr: Yakalama grupları, <replaceable>%N</replaceable> yerine <replaceable>\N</replaceable> kullanılarak aynı düzenli ifadede kullanılabilirler. Daha fazla bilgi için <link linkend="regular-expressions">Düzenli İfadeler</link> içindeki <link linkend="regex-capturing">Eşleşen metni yakalamak (geriye başvurular)</link> bölümüne bakın.

source: Example 1:
tr: Örnek 1:

source: In this simple example, the text matched by the regular expression <userinput>=*</userinput> is captured and inserted into <replaceable>%1</replaceable> in the dynamic rule. This allows the comment to end with the same amount of <userinput>=</userinput> as at the beginning. This matches text like: <userinput>[[ comment ]]</userinput>, <userinput>[=[ comment ]=]</userinput> or <userinput>[=====[ comment ]=====]</userinput>.
tr: Bu basit örnekte, <userinput>=*</userinput> düzenli ifadesi ile eşleşen metin yakalanır ve devingen kuralda <replaceable>%1</replaceable> yerine yerleştirilir. Bu, yorumun başlangıçta aynı sayıda <userinput>=</userinput> ile bitmesine olanak tanır. Şu tür metinlerle eşleştirilir: <userinput>[[ comment ]]</userinput>, <userinput>[=[ comment ]=]</userinput>veya <userinput>[=====[ comment ]=====]</userinput>.

source: In addition, the captures are available only in the switched context <emphasis>Multi-line Comment</emphasis>.
tr: Ek olarak, yakalamalar yalnızca geçilen <emphasis>Multi-line Comment</emphasis> bağlamında kullanılabilirdir.

source: Example 2:
tr: Örnek 2:

source: In the dynamic rule, <replaceable>%1</replaceable> corresponds to the capture that matches <userinput>#+</userinput>, and <replaceable>%2</replaceable> to <userinput>&amp;quot;+</userinput>. This matches text as: <userinput>#label""""inside the context""""#</userinput>.
tr: Devingen kuralda; <replaceable>%1</replaceable>, <userinput>#+</userinput> ve <replaceable>%2</replaceable>, <userinput>&amp;quot;+</userinput> ile eşleşen yakalamalara karşılık gelir. Bu, şu tür metinlerle eşleşir: <userinput>#etiket""""bağlamın içi""""#</userinput>.

source: These captures will not be available in other contexts, such as <emphasis>OtherContext</emphasis>, <emphasis>FindEscapes</emphasis> or <emphasis>SomeContext</emphasis>.
tr: Bu yakalamalar; <emphasis>OtherContext</emphasis>, <emphasis>FindEscapes</emphasis> veya <emphasis>SomeContext</emphasis> gibi başka bağlamlarda kullanılabilir olmayacaktır.

source: Example 3:
tr: Örnek 3:

source: This matches text like: <userinput>Class::function&lt;T&gt;( ... )</userinput>.
tr: Bu, şunun gibi metinlerle eşleşir: <userinput>Class::function&lt;T&gt;(…)</userinput>.

source: Local deliminators
tr: Yerel sınırlandırıcılar

source: Some rules allow the optional attributes <userinput>weakDeliminator</userinput> and <userinput>additionalDeliminator</userinput> which are combined with attributes of the same name of <userinput>keywords</userinput> tag. For example, when <userinput>'%'</userinput> is a weak delimiter of <userinput>keywords</userinput>, it can become a word delimiter only for a rule by putting it in its <userinput>additionalDeliminator</userinput> attribute. Whenever a rule allows these attributes it will contain a <emphasis>(local deliminators)</emphasis>.
tr: Bazı kurallar, aynı adlı <userinput>keywords</userinput> etiketinin öznitelikleriyle birleştirilen <userinput>weakDeliminator</userinput> ve <userinput>additionalDeliminator</userinput> gibi isteğe bağlı özniteliklere izin verirler. Örneğin, <userinput>'%'</userinput>, <userinput>keywords</userinput>’ün zayıf bir sınırlandırıcısıysa yalnızca onun <userinput>additionalDeliminator</userinput> özniteliğine konularak bir sözcük sınırlandırıcısı olabilir. Ne zaman bir kural bu özniteliklere izin veriyorsa o bir <emphasis>(local deliminators)</emphasis> (yerel sınırlandırıcılar) içerir.

source: <emphasis>weakDeliminator</emphasis>: list of characters that do not act as word delimiters.
tr: <emphasis>weakDeliminator</emphasis>: Sözcük sınırlandırıcısı olarak davranmayan karakterlerin listesi.

source: <emphasis>additionalDeliminator</emphasis>: defines additional delimiters.
tr: <emphasis>additionalDeliminator</emphasis>: Ek sınırlandırıcılar tanımlar.

source: The Rules in Detail
tr: Ayrıntılı Olarak Kurallar

source: Detect a single specific character. Commonly used for example to find the ends of quoted strings.
tr: Tek bir belirli karakteri algılar. Genellikle kapatma tırnaklarını bulmak için kullanılır.

source: &lt;DetectChar char=&quot;(character)&quot; (common attributes) (dynamic) /&gt;
tr: &lt;DetectChar char=&quot;(karakter)&quot; (ortak öznitelikler) (devingen) /&gt;
