Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_menus.po
Languages: tr

source: <guimenuitem>Reuse Word Below</guimenuitem> (<keycombo action="simul">&Ctrl; <keycap>9</keycap></keycombo>) and <guimenuitem>Reuse Word Above</guimenuitem> (<keycombo action="simul">&Ctrl; <keycap>8</keycap></keycombo>) complete the currently typed text by searching for similar words backward or forward from the current cursor position. <guimenuitem>Shell Completion</guimenuitem> pops up a completion box with matching entries.
tr: <guimenuitem>Aşağıdaki Sözcüğü Yeniden Kullan</guimenuitem> (<keycombo action="simul">&Ctrl; <keycap>9</keycap></keycombo>) ve <guimenuitem>Yukarıdaki Sözcüğü Yeniden Kullan</guimenuitem> (<keycombo action="simul">&Ctrl; <keycap>8</keycap></keycombo>), şu anda yazılan sözcüğü, imleç konumundan öne veya arkaya benzer sözcükleri arayarak tamamlar. <guimenuitem>Kabuk Tamamlama</guimenuitem>, eşleşen girdilerle birlikte bir tamamlama kutusu açar.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guisubmenu>Spelling</guisubmenu> <guimenuitem>Automatic Spell Checking</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Araçlar</guimenu> <guisubmenu>Yazım Denetimi</guisubmenu> <guimenuitem>Kendiliğinden Yazım Denetimi</guimenuitem>

source: When <guimenuitem>Automatic Spell Checking</guimenuitem> is enabled, wrongly spelled text is underlined in the document on-the-fly.
tr: <guimenuitem>Kendiliğinden Yazım Denetimi</guimenuitem> etkinleştirildiğinde, yanlış yazılan sözcüklerin altı o anda çizilir.

source: <guimenu>Tools</guimenu> <guisubmenu>Spelling</guisubmenu> <guimenuitem>Spelling...</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Yazım Denetimi</guisubmenu> <guimenuitem>Yazım Denetimi…</guimenuitem>

source: This initiates the spellchecking program - a program designed to help the user catch and correct any spelling errors.
tr: Bu, kullanıcının yazım hatalarını yakalayıp düzeltmesine yardımcı olmak için tasarlanmış bir program olan yazım denetimi programını başlatır.

source: For more information on how to use the &kde; spellchecking program, see the <ulink url="help:/fundamentals/spellcheck.html"><emphasis>Check Spelling</emphasis> section of the <emphasis>&kde; Fundamentals</emphasis> documentation</ulink>.
tr: &kde; yazım denetimi programını kullanmak üzerine daha fazla bilgi için <ulink url="help:/fundamentals/spellcheck.html"><emphasis>&kde; Temelleri</emphasis> belgelendirmesinin <emphasis>Yazım Denetimi</emphasis> bölümüne bakın</ulink>.

source: <guimenu>Tools</guimenu> <guisubmenu>Spelling</guisubmenu> <guimenuitem>Spelling (from cursor)...</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Yazım Denetimi</guisubmenu> <guimenuitem>Yazım Denetimi (İmleçten İtibaren)…</guimenuitem>

source: This initiates the spellchecking program but it starts where your cursor is instead of at the beginning of the document.
tr: Bu, yazım denetimi programını başlatır; ancak belgenin başlangıcı yerine imlecinizin bulunduğu yerden başlar.

source: <guimenu>Tools</guimenu> <guisubmenu>Spelling</guisubmenu> <guimenuitem>Spellcheck Selection...</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Yazım Denetimi</guisubmenu> <guimenuitem>Seçimin Yazımını Denetle…</guimenuitem>

source: Spellchecks the current selection.
tr: Geçerli seçimin yazımını denetler.

source: <guimenu>Tools</guimenu> <guisubmenu>Spelling</guisubmenu> <guimenuitem>Change Dictionary</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Yazım Denetimi</guisubmenu> <guimenuitem>Sözlüğü Değiştir</guimenuitem>

source: Displays a drop down box with all available dictionaries for spellchecking at the bottom of the editor window. This allows easy switching of the spellcheck dictionary &eg; for automatic spellcheck of text in different languages.
tr: Düzenleyici penceresinin alt kısmında yazım denetimi için kullanılabilir tüm sözlükleri içeren bir açılır kutu görüntüler. Bu, farklı dillerdeki metinlerin kendiliğinden yazımının denetlenmesi için yazım denetimi sözlüğünün kolayca değiştirilmesine olanak tanır.

source: The Settings and Help Menu
tr: Ayarlar ve Yardım Menüsü

source: &kate; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/menus.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/menus.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals with these additional entries:
tr: &kate;, genel &kde; <guimenu>Ayarlar</guimenu> ve <guimenu>Yardım</guimenu> menüsü ögelerine sahiptir; daha fazla bilgi için &kde; Temelleri’nin aşağıdaki ek girdilerle birlikte <ulink url="help:/fundamentals/menus.html#menus-settings">Ayarlar Menüsü</ulink> ve <ulink url="help:/fundamentals/menus.html#menus-help">Yardım Menüsü</ulink> bölümlerini okuyun.

source: <guimenu>Settings</guimenu> <guimenuitem>Color Theme</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Renk Teması</guimenuitem>

source: Use a different color scheme from the system’s global color schemes described in the &systemsettings; module <ulink url="help:/kcontrol/colors/index.html">Colors</ulink>.
tr: <ulink url="help:/kcontrol/colors/index.html">Renkler</ulink> &systemsettings; modülünde açıklanan sistem global renk şemasından farklı bir renk şeması kullanın.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Tabs</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Sekmeleri Göster</guimenuitem>

source: Tabs are moveable using the &LMB; and have actions in the context menu to close documents, copy the path to the clipboard or open the folder of the document in the filemanager. Using the <inlinemediaobject><imageobject><imagedata fileref="quickopen-22.png" format="PNG"/></imageobject></inlinemediaobject> <link linkend="view-quick-open"><guibutton>Quick Open</guibutton> </link> button makes switching between documents easy. Click the <inlinemediaobject><imageobject><imagedata fileref="view-split-left-right-22.png" format="PNG"/></imageobject></inlinemediaobject> button with the &LMB; to open a menu with actions from the <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu> menu.
tr: Sekmeler, &LMB; kullanılarak taşınabilir ve belgeleri kapatmak, yolu panoya kopyalamak ve dosyanın klasörünü dosya yöneticisinde açmak gibi ek bağlam menüsü ögelerine sahiptir. <inlinemediaobject><imageobject><imagedata fileref="quickopen-22.png" format="PNG"/></imageobject></inlinemediaobject> <link linkend="view-quick-open"><guibutton>Tez Aç</guibutton> </link> düğmesini kullanmak, belgeler arasında geçiş yapmayı pek kolay kılar. <guimenu>Görünüm</guimenu><guisubmenu>Bölünmüş Görünüm</guisubmenu> menüsündeki eylemlerle bir menü açmak için <inlinemediaobject><imageobject><imagedata fileref="view-split-left-right-22.png" format="PNG"/></imageobject></inlinemediaobject> düğmesine &LMB; ile tıklayın.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Path in Titlebar</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Yolu Başlık Çubuğunda Göster</guimenuitem>

source: If enabled the full path of the active document is displayed, otherwise only the filename. This is useful if you edit several files with the same filename to distinguish them.
tr: Etkinleştirilirse etkin belgenin tam yolu görüntülenir, aksi takdirde yalnızca dosya adı görüntülenir. Bu, aynı dosya adına sahip birden fazla dosyayı düzenlerseniz bunları ayırt etmek için kullanışlıdır.
