Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_advanced.po
Languages: tr

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>İşbaran</firstname><surname>Akçayır</surname><affiliation><address><email>isbaran@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit> <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Advanced Editing Tools
tr: Gelişmiş Düzenleme Araçları

source: Comment/Uncomment
tr: Yorum/Yorumları Kaldır

source: The <guimenuitem>Comment</guimenuitem> and <guimenuitem>Uncomment</guimenuitem> commands, available from the <guimenu>Tools</guimenu> menu allow you to add or remove comment markers to the selection, or the current line if no text is selected, if comments are supported by the format of the text you are editing.
tr: <guimenu>Araçlar</guimenu> menüsünde bulunan <guimenuitem>Yorum</guimenuitem> ve <guimenuitem>Yorumları Kaldır</guimenuitem> komutları, düzenlediğiniz metnin biçimi izin veriyorsa seçime veya seçili metin yoksa geçerli satıra yorum imleyicileri eklemenize veya kaldırmanıza olanak tanır.

source: The rules for how commenting is done are defined in the syntax definitions, so if syntax highlighting is not used, commenting/uncommenting is not possible.
tr: Yorumlamanın nasıl yapıldığına ilişkin kurallar sözdizim tanımlarında tanımlanmıştır, dolayısıyla sözdizim vurgulama kullanılmazsa yorum yapma/yorumları kaldırma olanaklı değildir.

source: Some formats define single line comment markers, some multiline markers and some both. If multiline markers are not available, commenting out a selection that does not fully include its last line is not possible.
tr: Bazı biçimler tek satırlı yorum imleyicilerini, bazıları çok satırlıları ve bazıları da her ikisini birden tanımlar. Çok satırlı imleyiciler kullanılamıyorsa son satırını tam olarak içermeyen bir seçimin yorumlanması olanaklı değildir.

source: If a single line marker is available, commenting single lines is preferred where applicable, as this helps to avoid problems with nested comments.
tr: Tek satır imleyicisi kullanılabiliyorsa iç içe geçmiş yorumlarla ilgili sorunların önlenmesine yardımcı olduğundan, uygun olduğu yerde tek satırlara yorum yapılması tercih edilir.

source: When removing comment markers, no uncommented text should be selected. When removing multiline comment markers from a selection, any whitespace outside the comment markers is ignored.
tr: Yorum imleyicilerini kaldırırken yorumsuz metin seçilmemelidir. Bir seçimden çok satırlı yorum imleyicilerini kaldırırken, yorum işaretçilerinin dışındaki tüm boşluklar dikkate alınmaz.

source: <primary>comment</primary>
tr: <primary>yoruma</primary>

source: To place comment markers, use the <menuchoice><guimenu>Tools</guimenu><guimenuitem>Comment</guimenuitem></menuchoice> menu item or the related keyboard shortcut sequence, the default is <keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo>.
tr: Yorum imleyicileri yerleştirmek için <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Yorum</guimenuitem></menuchoice> menü ögesini veya ilgili klavye kısayolu dizisini kullanın; öntanımlı kısayol: <keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo>.

source: <primary>uncomment</primary>
tr: <primary>yorumları kaldır</primary>

source: To remove comment markers, use the <menuchoice><guimenu>Tools</guimenu><guimenuitem>Uncomment</guimenuitem></menuchoice> menu item or the related keyboard shortcut, the default is <keycombo action="simul">&Ctrl;&Shift;<keycap>D</keycap></keycombo>.
tr: Yorum imleyicilerini kaldırmak için <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Yorumları Kaldır</guimenuitem></menuchoice> menü ögesini veya ilgili klavye kısayolu dizisini kullanın; öntanımlı kısayol: <keycombo action="simul">&Ctrl;&Shift;<keycap>D</keycap></keycombo>.

source: The Editor Component Command Line
tr: Düzenleyici Bileşeni Komut Satırı

source: &kappname;'s editor component has an internal command line, allowing you to perform various actions from a minimal &GUI;. The command line is a text entry at the bottom of the editor area; to show it select <menuchoice><guimenu>View</guimenu><guimenuitem>Switch to Command Line</guimenuitem></menuchoice> or use the shortcut (default is <keycombo action="simul"><keycap>F7</keycap></keycombo>). The editor provides a set of commands as documented below, and additional commands can be provided by plugins.
tr: &kappname; uygulamasını düzenleyici bileşeninde içsel bir komut satırı vardır; bu bileşen, minimal bir grafik arayüzden çeşitli eylemleri gerçekleştirmenize olanak tanır. Komut satırı, düzenleyici alanının alt kısmında bulunan bir metin girişi alanıdır; onu göstermek için <menuchoice><guimenu>Görünüm</guimenu><guimenuitem>Komut Satırına Geç</guimenuitem></menuchoice> ögesini veya klavye kısayolunu (öntanımlı kısayol: <keycombo action="simul"><keycap>F7</keycap></keycombo>) kullanın. Düzenleyici, aşağıda belgelendiği gibi bir dizi komut sağlar ve eklentiler tarafından ek komutlar verilebilir.

source: To execute a command, type the command then press the return key. The command line will indicate whether it succeeded and possibly display a message. If you entered the command line by pressing <keycap>F7</keycap> it will automatically hide after a few seconds. To clear the message and enter a new command, press <keycap>F7</keycap> again.
tr: Bir komutu yürütmek için komutu yazın ve ardından Dönüş düğmesine basın. Komut satırı başarılı olup olmadığını gösterecek ve büyük olasılıkla bir ileti görüntüleyecektir. Komut satırına <keycap>F7</keycap> düğmesine basarak girdiyseniz birkaç saniye sonra kendiliğinden gizlenir. İletiyi temizlemek ve yeni bir komut girmek için yeniden <keycap>F7</keycap> düğmesine basın.

source: The command line has a built-in help system; issue the command <command>help</command> to get started. To see a list of all available commands issue <command>help list</command>; to view help for a specific command, do <command>help <replaceable>command</replaceable></command>.
tr: Komut satırında yerleşik bir yardım sistemi bulunur; Başlamak için <command>help</command> komutunu verin. Kullanılabilir tüm komutların bir listesini görmek için <command>help list</command> komutunu verin; Belirli bir komutun yardımını görüntülemek için <command>help <replaceable>komut</replaceable></command> girişini yapın.

source: The command line has a built in history, so you can reuse commands already typed. To navigate the history, use the &Up; and &Down; keys. When showing historical commands, the argument part of the command will be selected, allowing you to easily overwrite the arguments.
tr: Komut satırının yerleşik bir geçmişi vardır, böylece önceden yazdığınız komutları yeniden kullanabilirsiniz. Geçmişe gitmek için &Up; ve &Down; düğmelerini kullanın. Geçmiş komutları gösterirken, komutun argüman kısmı seçilerek argümanların üzerine kolayca yazmanıza olanak sağlanır.

source: Standard Command Line Commands
tr: Standart Komut Satırı Komutları

source: Argument types
tr: Argüman türleri

source: BOOLEAN
tr: BOOLE

source: This is used with commands that turns things on or off. Legal values are <userinput>on</userinput>, <userinput>off</userinput>, <userinput>true</userinput>, <userinput>false</userinput>, <userinput>1</userinput> or <userinput>0</userinput>.
tr: Bir şeyleri açıp kapatan komutlarla kullanılır. Kullanılabilir değerler şunlardır: <userinput>on</userinput>, <userinput>off</userinput>, <userinput>true</userinput>, <userinput>false</userinput>, <userinput>1</userinput> or <userinput>0</userinput>.

source: INTEGER
tr: TAMSAYI

source: An integer number.
tr: Bir tamsayı.

source: STRING
tr: DİZİ

source: A string, surrounded by single quotes (') or double quotes (") when it contains spaces.
tr: Boşluk içerdiğinde tek tırnak (') veya çift tırnak (") ile çevrelenen bir dizi.

source: Commands for Configuring the Editor
tr: Düzenleyiciyi Yapılandırmak için Komutlar

source: These commands are provided by the editor component, and allow you to configure the active document and view only. This is handy if you want to use a setting different from the default settings, for example for indentation.
tr: Bu komutlar düzenleyici bileşeni tarafından sağlanır ve etkin belgeyi ve yalnızca görüntülemeyi yapılandırmanıza olanak tanır. Girinti gibi öntanımlı ayarlardan farklı bir ayar kullanmak istiyorsanız bu kullanışlıdır.

source: <command>set-tab-width</command><arg choice="req">INTEGER width</arg>
tr: <command>set-tab-width</command><arg choice="req">TAMSAYI genişlik</arg>

source: Sets the tab width to the number <userinput>width</userinput>.
tr: Sekme <userinput>genişliğini</userinput> ayarlar.

source: <command>set-indent-width</command><arg choice="req">INTEGER width</arg>
tr: <command>set-indent-width</command><arg choice="req">TAMSAYI genişlik</arg>

source: Sets the indentation width to the number <userinput>width</userinput>. Used only if you are indenting with spaces.
tr: Girintileme <userinput>genişliğini</userinput> ayarlar. Yalnızca boşluklarla girintileme yapıyorsanız kullanılır.

source: <command>set-word-wrap-column</command><arg choice="req">INTEGER width</arg>
tr: <command>set-word-wrap-column</command><arg choice="req">TAMSAYI genişlik</arg>

source: Sets the line width for hard wrapping to <userinput>width</userinput>. This is used if you are having your text wrapped automatically.
tr: Sert kaydırma için satır <userinput>genişliğini</userinput> ayarlar. Bu, metninizde kendiliğinden kaydırma kullanıyorsanız kullanılır.

source: <command>set-icon-border</command><arg choice="req">BOOLEAN enable</arg>
tr: <command>set-icon-border</command><arg choice="req">BOOLE etkinleştir</arg>

source: Sets the visibility of the icon border.
tr: Simge kenarlığının görünürlüğünü ayarlar.

source: <command>set-folding-markers</command><arg choice="req">BOOLEAN enable</arg>
tr: <command>set-folding-markers</command><arg choice="req">BOOLE etkinleştir</arg>

source: Sets the visibility of the folding markers pane.
tr: Katlama imleyicileri yüzeyinin görünürlüğünü ayarlar.

source: <command>set-line-numbers</command><arg choice="req">BOOLEAN enable</arg>
tr: <command>set-line-numbers</command><arg choice="req">BOOLE etkinleştir</arg>

source: Sets the visibility of the line numbers pane.
tr: Satır numaraları yüzeyinin görünürlüğünü ayarlar.

source: <command>set-replace-tabs</command><arg choice="req">BOOLEAN enable</arg>
tr: <command>set-replace-tabs</command><arg choice="req">BOOLE etkinleştir</arg>

source: If enabled, tabs are replaced with spaces as you type.
tr: Etkinleştirilirse sekmeler siz yazdıkça boşluklarla değiştirilir.

source: <command>set-remove-trailing-space</command><arg choice="req">BOOLEAN enable</arg>
tr: <command>set-remove-trailing-space</command><arg choice="req">BOOLE etkinleştir</arg>

source: If enabled, trailing whitespace is removed whenever the cursor leaves a line.
tr: Etkinleştirilirse sondaki boşluklar imleç satırı terk ettiğinde kaldırılır.

source: <command>set-show-tabs</command><arg choice="req">BOOLEAN enable</arg>
tr: <command>set-show-tabs</command><arg choice="req">BOOLE etkinleştir</arg>

source: If enabled, TAB characters and trailing whitespace will be visualized by a small dot.
tr: Etkinleştirilirse SEKME karakterleri ve sondaki boşluklar küçük bir noktayla görselleştirilir.

source: <command>set-show-indent</command><arg choice="req">BOOLEAN enable</arg>
tr: <command>set-show-indent</command><arg choice="req">BOOLE etkinleştir</arg>

source: If enabled, indentation will be visualized by a vertical dotted line.
tr: Etkinleştirilirse girintileme dikey noktalı bir satırla görselleştirilir.

source: <command>set-indent-spaces</command><arg choice="req">BOOLEAN enable</arg>
tr: <command>set-indent-spaces</command><arg choice="req">BOOLE etkinleştir</arg>

source: If enabled, the editor will indent with <option>indent-width</option> spaces for each indentation level, rather than with one TAB character.
tr: Etkinleştirilirse düzenleyici her bir girintileme düzeyi için SEKME karakteri yerine <option>indent-width</option> kadar boşlukla girintileme yapar.

source: <command>set-mixed-indent</command><arg choice="req">BOOLEAN enable</arg>
tr: <command>set-mixed-indent</command><arg choice="req">BOOLE etkinleştir</arg>

source: If enabled, &kappname; will use a mix of TAB and spaces for indentation. Each indentation level will be <option>indent-width</option> wide, and more indentation levels will be optimized to use as many TAB characters as possible.
tr: Etkinleştirilirse &kappname;, girintileme için SEKME ve boşlukların bir karışımını kullanır. Her girinti düzeyi <option>indent-width</option> genişliğinde olacak ve daha fazla girinti düzeyi olabildiğince çok sayıda SEKME karakteri kullanacak şekilde eniyilenecektir.

source: When executed, this command will additionally set space indentation enabled, and if the indent width is unspecified it will be set to half of the <option>tab-width</option> for the document at the time of execution.
tr: Yürütüldüğünde, bu komut ek olarak boşluk girintisini etkinleştirir ve girinti genişliği belirtilmemişse yürütme sırasında belgenin <option>tab-width</option> değerinin yarısına ayarlanır.

source: <command>set-word-wrap</command><arg choice="req">BOOLEAN enable</arg>
tr: <command>set-word-wrap</command><arg choice="req">BOOLE etkinleştir</arg>

source: Enables dynamic word wrap according to <userinput>enable</userinput>.
tr: <userinput>enable</userinput> değerine göre devingen sözcük kaydırmayı etkinleştirir.

source: <command>set-replace-tabs-save</command><arg choice="req">BOOLEAN enable </arg>
tr: <command>set-replace-tabs-save</command><arg choice="req">BOOLE etkinleştir</arg>

source: When enabled, tabs will be replaced with whitespace whenever the document is saved.
tr: Etkinleştirildiğinde, belge kaydedildiğinde sekmelerin yerini boşluklar alacaktır.

source: <command>set-remove-trailing-space-save</command><arg choice="req">BOOLEAN enable</arg>
tr: <command>set-replace-tabs-save</command><arg choice="req">BOOLE etkinleştir</arg>

source: When enabled, trailing space will be removed from each line whenever the document is saved.
tr: Etkinleştirildiğinde, belge kaydedildiğinde her satırın sondaki boşluk kaldırılacaktır.

source: <command>set-indent-mode</command><arg choice="req">STRING name</arg>
tr: <command>set-indent-mode</command><arg choice="req">DİZİ ad</arg>

source: Sets the autoindentation mode to <userinput>name</userinput>. If <userinput>name</userinput> is not known, the mode is set to 'none'. Valid modes are 'none', 'normal', 'cstyle', 'haskell', 'lilypond', 'lisp', 'python', 'ruby' and 'xml'.
tr: Kendiliğinden girintileme kipini <userinput>ad</userinput> olarak ayarlar. <userinput>ad</userinput> bilinmiyorsa kip “none” olarak ayarlanır. Geçerli kipler: “none”, “normal”, “cstyle”, “haskell”, “lilypond”, “lisp”, “python”, “ruby” ve “xml”.

source: <command>set-auto-ident</command><arg choice="req">BOOLEAN script</arg>
tr: <command>set-auto-ident</command><arg choice="req">BOOLE betik</arg>

source: Enable or disable autoindentation.
tr: Kendiliğinden girintilemeyi etkinleştirin veya devre dışı bırakın.

source: <command>set-highlight</command><arg choice="req">STRING highlight</arg>
tr: <command>set-highlight</command><arg choice="req">DİZİ vurgu</arg>

source: Sets the syntax highlighting system for the document. The argument must be a valid highlight name, as seen in the <menuchoice><guimenu>Tools</guimenu><guisubmenu>Highlighting</guisubmenu></menuchoice> menu. This command provides an autocompletion list for its argument.
tr: Belgenin sözdizim vurgulama sistemini ayarlar. Argüman, <menuchoice><guimenu>Araçlar</guimenu><guisubmenu>Vurgulama</guisubmenu></menuchoice> menüsünde görüldüğü gibi geçerli bir vurgu adı olmalıdır. Bu komut, argümanı için bir kendiliğinden tamamlama listesi sağlar.

source: Reload all <link linkend="dev-scripting">&javascript; scripts</link> used by &kate;, including indenters and command line scripts.
tr: Girintileyiciler ve komut satırı betikleri de içerilmek üzere, &kate;’in kullandığı tüm <link linkend="dev-scripting">&javascript; betiklerini</link> yeniden yükleyin.

source: <command>set-mode</command><arg choice="req">STRING mode</arg>
tr: <command>set-mode</command><arg choice="req">DİZİ kip</arg>

source: Choose the filetype scheme for the current document.
tr: Geçerli belge için dosya türü şemasını seçin.

source: <command>nn[oremap]</command><arg choice="req">STRING original</arg> <arg choice="req">STRING mapped</arg>
tr: <command>nn[oremap]</command><arg choice="req">DİZGİ özgün</arg> <arg choice="req">DİZİ eşlemlenen</arg>

source: Map the key sequence <userinput>original</userinput> to <userinput>mapped</userinput>.
tr: <userinput>Özgün</userinput> düğme sıralamasını <userinput>eşlemlenen</userinput> sıralamasına eşlemler.

source: Commands for editing
tr: Düzenleme için komutlar

source: These commands modify the current document.
tr: Bu komutlar, geçerli belgeyi değiştirir.

source: Indents the selected lines or the current line.
tr: Seçili satırları veya geçerli satırı girintiler.

source: Unindents the selected lines or current line.
tr: Seçili satırların veya geçerli satırın girintisini kaldırır.

source: Cleans up the indentation of the selected lines or current line according to the indentation settings in the document.
tr: Seçili satırların veya geçerli satırın girintisini belgedeki girintileme ayarlarına göre temizler.

source: Inserts comment markers to make the selection or selected lines or current line a comment according to the text format as defined by the syntax highlight definition for the document.
tr: Seçimi veya seçili satırları veya geçerli satırı, belgenin sözdizim vurgulama tanımıyla tanımlandığı şekilde metin biçimine göre bir yorum haline getirmek için yorum imleyicileri ekler.

source: Removes comment markers from the selection or selected lines or current line according to the text format as defined by the syntax highlight definition for the document.
tr: Belgenin sözdizim vurgulama tanımıyla tanımlanan metin biçimine göre seçimden veya seçili satırlardan veya geçerli satırdan yorum imleyicilerini kaldırır.

source: Deletes the current line.
tr: Geçerli satırı siler.

source: <command>replace</command><arg choice="req"> STRING pattern</arg> <arg choice="req">STRING replacement</arg>
tr: <command>replace</command><arg choice="req"> DİZİ dizgi</arg> <arg choice="req">DİZİ değişim</arg>

source: Replaces text matching <userinput>pattern</userinput> with <userinput>replacement</userinput>. If you want to include whitespace in the <userinput>pattern</userinput>, you must quote both the <userinput>pattern</userinput> and <userinput>replacement</userinput> with single or double quotes. If the arguments are unquoted, the first word is used as <userinput>pattern</userinput> and the rest for <userinput>replacement</userinput>. If <userinput>replacement</userinput> is empty, each occurrence of <userinput>pattern</userinput> is removed.
tr: <userinput>dizgi</userinput> ile eşleşen metni <userinput>değişim</userinput> ile değiştirir. <userinput>dizgi</userinput>’de boşlukları içermek isterseniz hem <userinput>dizgi</userinput> hem <userinput>değişim</userinput> değişkenlerini tek veya çift tırnak içine almalısınız. Argümanlar tırnak içinde değilse ilk sözcük <userinput>dizgi</userinput> ve geri kalanı <userinput>değişim</userinput> olarak kullanılır. Eğer <userinput>değişim</userinput> boşsa her bir <userinput>dizgi</userinput> oluşu kaldırılır.

source: You can set flags to configure the search by adding a colon, followed by one or more letters each representing a configuration, giving the form <userinput>replace:options pattern replacement</userinput>. Available options are:
tr: Aramayı yapılandırmak için iki nokta üst üste ve ardından her biri bir yapılandırmayı temsil eden bir veya daha fazla harf ekleyerek <userinput>replace:seçenekler dizgi değişim</userinput> formunu vererek bayrakları ayarlayabilirsiniz. Kullanılabilir seçenekler şunlardır:

source: Search backwards.
tr: Geriye doğru arayın.

source: Search from cursor position.
tr: İmleç konumundan itibaren arayın.

source: Search in the selection only.
tr: Yalnızca seçimde arayın.

source: Do regular expression search. If set, you may use <userinput>\N</userinput> where N is a number to represent captures in the replacement string.
tr: Düzenli ifade araması yapın. Ayarlıysa N değiştirme dizisindeki yakalamaları temsil etmek üzere bir numara olması için <userinput>\N</userinput> kullanabilirsiniz.

source: Do case sensitive search.
tr: BÜYÜK/küçük harf duyarlı arama yapın.

source: Prompt for permission to replace the next occurrence.
tr: Sonraki oluşu değiştirmek için izin isteyin.

source: Match whole words only.
tr: Yalnızca tam sözcüklerle eşleştirin.

source: <command>date</command><arg choice="req">STRING format</arg>
tr: <command>date</command><arg choice="req">DİZİ biçim</arg>

source: Inserts a date/time string as defined by the specified <userinput>format</userinput>, or the format <quote>yyyy-MM-dd hh:mm:ss</quote> if none is specified. The following translations are done when interpreting <userinput>format</userinput>:
tr: Tanımlı <userinput>biçim</userinput> veya yoksa <quote>yyyy-MM-dd hh:mm:ss</quote> biçimi ile bir tarih/zaman dizisi ekler. <userinput>biçim</userinput> yorumlanırken aşağıdaki çeviriler kullanılır:

source: The day as number without a leading zero (1-31).
tr: Başında sıfır olmadan sayı olarak gün (1–31).

source: The day as number with a leading zero (01-31).
tr: Başında sıfır olacak şekilde gün (01–31).

source: The abbreviated localized day name (&eg; 'Mon'..'Sun').
tr: Kısa yerelleştirilmiş gün adı (&eg;, “Pzt”‥“Paz”).

source: The long localized day name (&eg; 'Monday'..'Sunday').
tr: Uzun yerelleştirilmiş gün adı (&eg;, “Pazartesi”‥“Pazar”).

source: The month as number without a leading zero (1-12).
tr: Başında sıfır olmadan sayı olarak ay (1–12).

source: The month as number with a leading zero (01-12).
tr: Başında sıfır olacak şekilde ay (01–12).

source: The long localized month name (&eg; 'January'..'December').
tr: Uzun yerelleştirilmiş ay adı (&eg;, “Ocak”‥“Şubat”).

source: The abbreviated localized month name (&eg; 'Jan'..'Dec').
tr: Kısa yerelleştirilmiş ay adı (&eg;, “Oca”‥“Şub”).

source: The year as two digit number (00-99).
tr: İki basamaklı sayı olarak yıl (00–99).

source: The year as four digit number (1752-8000).
tr: Dört basamaklı sayı olarak yıl (1752–8000).

source: The hour without a leading zero (0..23 or 1..12 if AM/PM display).
tr: Başında sıfır olmadan saat (0‥23 veya ÖÖ/ÖS görüntüleniyorsa 1‥12).

source: The hour with a leading zero (00..23 or 01..12 if AM/PM display).
tr: Başında sıfır olarak saat (00‥23 veya ÖÖ/ÖS görüntüleniyorsa 01‥02).

source: The minute without a leading zero (0..59).
tr: Başında sıfır olmadan dakika (0‥59).

source: The minute with a leading zero (00..59).
tr: Başında sıfır olarak dakika (00‥59).

source: The second without a leading zero (0..59).
tr: Başında sıfır olmadan saniye (0‥59).

source: The second with a leading zero (00..59).
tr: Önünde sıfır olarak saniye (00‥59).

source: The milliseconds without leading zeroes (0..999).
tr: Başında sıfır olmadan milisaniye (0‥999).

source: The milliseconds with leading zeroes (000..999).
tr: Başında sıfır olarak milisaniye (000‥999).

source: Use AM/PM display. AP will be replaced by either "AM" or "PM".
tr: ÖÖ/ÖS görüntüsünü kullanın. AP, "ÖÖ" veya "ÖS" ile değiştirilir.

source: Use am/pm display. ap will be replaced by either "am" or "pm".
tr: ÖÖ/ÖS görüntüsünü kullanın. AP, "AM" veya "PM" olarak değiştirilir.
