Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_development.po
Languages: tr

source: <para>&kate;'s settings dialog box with the color theme management.</para>
tr: <para>&kate;’in renk teması yönetimini gösteren ayarlar iletişim kutusu.</para>

source: In this <link linkend="config-dialog">dialog</link> you can configure all the colors in any theme you have, as well as create/copy new themes, delete them, export them to a <userinput>.theme</userinput> file with <link linkend="color-themes-json">&JSON; format</link> or import them from external <userinput>.theme</userinput> files. Each theme has settings for text colors and styles.
tr: Bu <link linkend="config-dialog">iletişim kutusunda</link>, sahip olduğunuz tüm temalardaki tüm renkleri düzenleyebilir, yeni temalar oluşuturabilir/kopyalayabilir, onları silebilir, onları <link linkend="color-themes-json">&JSON; biçimindeki</link> bir <userinput>.theme</userinput> dosyasına dışa aktarabilir veya başka <userinput>.theme</userinput> dosyalarından içe aktarabilirsiniz. Her bir temanın metin renkleri ve biçemleri için ayarları vardır.

source: The built-in themes cannot be modified by default. To do this, you need to copy them and give them a new name.
tr: Öntanımlı olarak yerleşik temalar değiştirilemez. Bunu yapmak için bunları kopyalamanız ve onlara yeni bir ad vermeniz gerekir.

source: To use a theme permanently in your text editor, you must select it in the combobox labeled <guilabel>Default theme for <replaceable>Application</replaceable></guilabel> at the bottom of the dialog and press <guibutton>Apply</guibutton> or <guibutton>OK</guibutton>. By default, the <userinput><guilabel>Automatic Selection</guilabel></userinput> option is active, which chooses a more appropriate color theme according to the <emphasis>&kde; &plasma; color scheme</emphasis> used in the text editing application; it usually chooses between <quote>Breeze Light</quote> and <quote>Breeze Dark</quote> if the scheme is light or dark, respectively.
tr: Bir temayı metin düzenleyicinizde kalıcı olarak kullanmak için öncelikle onu iletişim kutusunun altındaki <guilabel><replaceable>Uygulama</replaceable> için öntanımlı tema</guilabel> bölümünde seçmeli ve <guibutton>Uygula</guibutton> veya <guibutton>Tamam</guibutton> düğmelerine basmalısınız. Öntanımlı olarak, <userinput><guilabel>Kendiliğinden seçim</guilabel></userinput> seçeneği etkindir; bu, metin düzenleme uygulamasında kullanılan <emphasis>&kde; &plasma; renk şemasına</emphasis> daha uygun bir temayı seçer. Şema açık veya koyuysa, genellikle sırasıyla <quote>Esinti Açık</quote> ve <quote>Esinti Koyu</quote> temaları arasında geçiş yapılır.

source: You can adjust the &kde; global color scheme in the <ulink url="help:/kcontrol/colors/"><quote>Colors</quote> module in &systemsettings;</ulink>. You can also change it in some applications individually such as &kate; or &kdevelop;, from the menu <menuchoice><guimenu>Settings</guimenu><guisubmenu>Color Scheme</guisubmenu></menuchoice>.
tr: &kde; global renk şemasını <ulink url="help:/kcontrol/colors/">&systemsettings; içindeki <quote>Renkler</quote> modülünde ayarlayabilirsiniz</ulink>. Bunu, &kate; veya &kdevelop; gibi bazı uygulamalarda <menuchoice><guimenu>Ayarlar</guimenu><guisubmenu>Renk Teması</guisubmenu></menuchoice> menüsünden bireysel olarak değiştirebilirsiniz.

source: Create a new theme
tr: Yeni bir tema oluştur

source: To create a new theme, it is first necessary to copy an existing one. Select an existing theme which you want to use as a base, such as <quote>Breeze Light</quote> or <quote>Breeze Dark</quote>, and click <guibutton>Copy</guibutton>. Then write a name for the new theme.
tr: Yeni bir tema oluşturmak için öncelikle var olan bir tanesini kopyalamanız gerekir. <quote>Esinti Açık</quote> veya <quote>Esinti Koyu</quote> gibi temel olarak kullanmak istediğiniz var olan bir temayı seçin ve <guibutton>Kopyala</guibutton>’ya tıklayın. Daha sonra yeni tema için bir ad yazın.

source: If you want to modify a built-in or read-only theme, you must first copy it under a different name.
tr: Yerleşik veya saltokunur bir temayı değiştirmek istiyorsanız önce onu farklı bir adla kopyalamanız gerekir.

source: Import or export &JSON; theme files
tr: &JSON; tema dosyalarını içe/dışa aktar

source: You can export a selected theme (including built-in ones) to a <link linkend="color-themes-json">&JSON; file</link> with <userinput>.theme</userinput> extension, with the <guibutton>Export</guibutton> button. This will open a dialog to save the file. To add a color theme from an external <link linkend="color-themes-json">&JSON; file</link>, just press the <guibutton>Import</guibutton> button and select the <userinput>.theme</userinput> file from the dialog.
tr: Seçili bir temayı (yerleşik olanları da) bir <link linkend="color-themes-json">&JSON; dosyasına</link> <userinput>.theme</userinput> uzantısıyla <guibutton>Dışa Aktar</guibutton> düğmesini kullanarak dışa aktarabilirsiniz. Bu, dosyayı kaydetmek için bir iletişim kutusu açacaktır. Başka dış bir <link linkend="color-themes-json">&JSON; dosyasından</link> bir renk teması eklemek için <guibutton>İçe Aktar</guibutton> düğmesine basın ve iletişim kutusundan <userinput>.theme</userinput> dosyasını seçin.

source: As <link linkend="color-themes-json-overview">mentioned above</link>, user-customized theme files are stored in the <filename class="directory">org.kde.syntax-highlighting/themes/</filename> directory. When you copy or create a theme, it will automatically appear there. Also, importing or adding a theme is equivalent to copying an external <userinput>.theme</userinput> file into this directory. KSyntaxHighlighting automatically picks up color theme files from this directory.
tr: <link linkend="color-themes-json-overview">Yukarıda belirtildiği üzere</link>, kullanıcı tanımlı tema dosyaları <filename class="directory">org.kde.syntax-highlighting/themes/</filename> dizininde depolanırlar. Bir tema oluşturduğunuzda veya kopyaladığınızda orada kendiliğinden oluşur. Ek olarak, bir tema içe aktarmak veya eklemek, bir <userinput>.theme</userinput> dosyasını bu dizine koymakla eşdeğerdir. KSyntaxHighlighting, bu dizinden renk teması dosyalarını kendiliğinden alır.

source: If you want to publish a theme created by you, it is essential to check the <link linkend="color-themes-json-metadata">metadata</link> object of the <link linkend="color-themes-json">&JSON; file</link>, adding the respective license and checking the revision number.
tr: Sizin tarafınızdan oluşturulan bir temayı yayımlamak istiyorsanız <link linkend="color-themes-json">&JSON; dosyasının</link> <link linkend="color-themes-json-metadata">metadata</link> nesnesine ilgili lisansı eklemeniz ve revizyon numarasını denetlemeniz önemlidir.

source: Editing color themes
tr: Renk temalarını düzenlemek

source: Colors
tr: Renkler

source: Here the colors of the text editing area are adjusted. These are detailed in <xref linkend="color-themes-editor-colors"/>.
tr: Burada, metin düzenleme alanının renkleri düzenlenirken görebilirsiniz. Bunlar, <xref linkend="color-themes-editor-colors"/> bölümünde ayrıntılı olarak açıklanmıştır.

source: The name in the list of styles is using the style configured for the item, providing you with an immediate preview when configuring a style.
tr: Biçem listesindeki ad, öge için yapılandırılan biçemi kullanır ve bir biçemi yapılandırırken size anında bir önizleme sağlar.

source: Each style lets you select common attributes as well as foreground and background colors. To unset a background color, right-click to use the context menu.
tr: Her biçem, ortak özelliklerin yanı sıra ön plan ve arka plan renklerini de seçmenize olanak tanır. Bir arka plan rengini kaldırmak için bağlam menüsünü kullanmak üzere sağ tıklayın.

source: The attributes of this area are detailed in <xref linkend="color-themes-text-styles"/>.
tr: Bu bölümün öznitelikleri <xref linkend="color-themes-text-styles"/> bölümünde ayrıntılı olarak açıklanmıştır.

source: Highlighting Text Styles
tr: Metin Vurgulama Biçemleri

source: Here you can edit the text styles used by a specific highlight definition. The editor preselects the highlight used by your current document. To work on a different highlight, select one in the <guilabel>Highlight</guilabel> combobox above the style list.
tr: Burada, belirli bir vurgu tanımı tarafından kullanılan metin biçemlerini düzenleyebilirsiniz. Düzenleyici, geçerli belgenizin kullandığı vurguyu önceden seçer. Farklı bir vurgu üzerinde çalışmak için biçem listesinin üzerindeki <guilabel>Vurgula</guilabel> çoklu kutusundan birini seçin.

source: Each style lets you select common attributes as well as foreground and background colors. To unset a background color, right-click to use the context menu. In addition you can see if a style is equal to the default style used for the item, and set it to that if not.
tr: Her biçem, ortak özelliklerin yanı sıra ön plan ve arka plan renklerini de seçmenize olanak tanır. Bir arka plan rengini kaldırmak için bağlam menüsünü kullanmak üzere sağ tıklayın. Ayrıca bir biçemin, öge için kullanılan öntanımlı biçeme eşit olup olmadığını görebilir ve değilse bunu buna ayarlayabilirsiniz.

source: You will notice that many highlights contain other highlights represented by groups in the style list. For example most highlights import the Alert highlight, and many source code formats imports the Doxygen highlight. Editing colors in those groups only affects the styles when used in the edited highlight format.
tr: Pek çok vurgunun, biçem listesindeki gruplar tarafından temsil edilen diğer vurguları içerdiğini fark edeceksiniz. Örneğin, çoğu vurgu, Uyarı vurgusunu içe aktarır ve birçok kaynak kodu biçimi, Doxygen vurgusunu içe aktarır. Bu gruplardaki renkleri düzenlemek, yalnızca düzenlenen vurgu biçiminde kullanıldığında biçemleri etkiler.

source: Contrast of Text Colors
tr: Metin Renklerinin Karşıtlığı

source: An important aspect when working with color themes is to choose a text contrast that makes it easier to read, especially in combination with the background.
tr: Renk temalarıyla çalışırken önemli bir konu, özellikle arka planla birlikte okumayı kolaylaştıracak bir metin karşıtlığı seçmektir.

source: The <userinput>Kontrast</userinput> application is a color contrast checker. It tells you that the text color and background color combinations are readable and accessible, so this is an excellent tool to help you create color themes.
tr: <userinput>Kontrast</userinput> uygulaması bir renk karşıtlığı denetleyicisidir. Size metin rengi ve arka plan rengi kombinasyonlarının okunabilir ve erişilebilir olduğunu söyler; dolayısıyla bu, renk temaları oluşturmanıza yardımcı olacak mükemmel bir araçtır.

source: You can download <userinput>Kontrast</userinput> from <ulink url="https://apps.kde.org/en/kontrast">the &kde; Applications website</ulink> or from <ulink url="https://flathub.org/apps/details/org.kde.kontrast">the Flatpak package on Flathub</ulink> (only in GNU/Linux).
tr: <userinput>Kontrast</userinput> uygulamasını from <ulink url="https://apps.kde.org/en/kontrast">&kde; uygulamaları web sitesinden</ulink> veya <ulink url="https://flathub.org/apps/details/org.kde.kontrast">Flathub’daki Flatpak paketiyle</ulink> indirebilirsiniz (yalnızca GNU/Linux).

source: The GNOME <userinput>Contrast</userinput> application is similar. You can download <ulink url="https://flathub.org/apps/details/org.gnome.design.Contrast">the Flatpak package on Flathub</ulink> (only in GNU/Linux).
tr: GNOME <userinput>Contrast</userinput> uygulaması da benzer bir uygulamadır. <ulink url="https://flathub.org/apps/details/org.gnome.design.Contrast">Flathub’daki Flatpak paketiyle</ulink> indirebilirsiniz (yalnızca GNU/Linux).

source: A python script in <ulink url="https://invent.kde.org/frameworks/syntax-highlighting/-/blob/master/utils/theme_contrast_checker.py?ref_type=heads">Syntax Highlighting repository</ulink> lets you visualize all the colors in a theme, as well as the contrast with the various backgrounds configured.
tr: <ulink url="https://invent.kde.org/frameworks/syntax-highlighting/-/blob/master/utils/theme_contrast_checker.py?ref_type=heads">Syntax Highlighting deposundaki</ulink> bir Python betiği, bir temadaki tüm renkleri ve tüm arka planlardaki karşıtlığı ayarlamanıza olanak tanır.

source: Suggestions of Consistency with Syntax Highlighting
tr: Sözdizim Vurgulamada Tutarlılık Önerileri

source: KSyntaxHighlighting includes <ulink url="https://kate-editor.org/syntax/">more than 300 syntax highlighting definitions</ulink>, therefore it is ideal that you make sure your new theme looks good in all syntax highlighting definitions. The built-in color themes have the following similarities that it is recommended (but not required) to follow to achieve a correct display of all syntax highlighting definitions:
tr: KSyntaxHighlighting, <ulink url="https://kate-editor.org/syntax/">300’den fazla sözdizimi vurgulama tanımı</ulink> içerir, bu nedenle yeni temanızın tüm sözdizim vurgulama tanımlarında iyi göründüğünden emin olmanız idealdir. Yerleşik renk temaları, tüm sözdizim vurgulama tanımlarının doğru bir şekilde görüntülenmesini sağlamak için takip edilmesi önerilen (ancak zorunlu olmayan) aşağıdaki benzerliklere sahiptir:

source: Use bold for the <quote>Keyword</quote> and <quote>ControlFlow</quote> <link linkend="color-themes-text-styles">text styles</link>.
tr: <quote>Keyword</quote> ve <quote>ControlFlow</quote> <link linkend="color-themes-text-styles">metin biçemleri</link> için kalın metin kullanın.

source: Do not use background color in any <link linkend="color-themes-text-styles">text style</link>, except <quote>Alert</quote> and <quote>RegionMarker</quote>.
tr: <quote>Alert</quote> ve <quote>RegionMarker</quote> dışındaki herhangi bir <link linkend="color-themes-text-styles">metin biçeminde</link> arka plan rengi kullanmayın.

source: Most of the syntax highlighters are intended to look good on the default themes <quote>Breeze Light</quote> and <quote>Breeze Dark</quote>, therefore, another way to maintain consistency is to use similar colors in the <link linkend="color-themes-text-styles">text styles</link>, like <emphasis>green</emphasis> for <quote>Preprocessor</quote> and <quote>Others</quote>, <emphasis>blue</emphasis> for <quote>DataType</quote> and <quote>Attribute</quote>, or <emphasis>purple</emphasis> for <quote>Function</quote>.
tr: Çoğu sözdizim vurgulayıcı, öntanımlı <quote>Esinti Açık</quote> ve <quote>Esinti Koyu</quote> temalarında güzel görünmesi için tasarlanmıştır; dolayısıyla, tutarlılığı korumanın bir başka yolu da <link linkend="color-themes-text-styles">metin biçemlerinde</link> benzer renkler kullanmaktır; örneğin, <quote>Preprocessor</quote> ve <quote>Others</quote> için <emphasis>yeşil</emphasis>; <quote>DataType</quote> ve <quote>Attribute</quote> için <emphasis>mavi</emphasis> veya <quote>Function</quote> için <emphasis>mor</emphasis>.

source: Note that these recommendations are not mandatory when creating and publishing a theme.
tr: Bir tema oluştururken ve yayımlarken bu önerilerin zorunlu olmadığını unutmayın.

source: Scripting with &javascript;
tr: &javascript; ile betik yazımı

source: The &kappname; editor component is easily extensible by writing scripts. The scripting language is ECMAScript (widely known as &javascript;). &kappname; supports two kinds of scripts: indentation and command line scripts. A functionality similar to command line scripts is also provided in the <ulink url="help:/kate/kate-application-plugin-snippets.html">snippets plugin</ulink>.
tr: &kappname; düzenleyici bileşeni, betik yazımı ile kolaylıkla genişletilebilir. Bunun içn kullanılan dil ECMAScript’tir (genellikle &javascript; olarak bilinir). &kappname; iki tür betiği destekler: Girintileme ve komut satırı betikleri. Komut satırı betiklerine benzer bir işlevsellik ayrıca <ulink url="help:/kate/kate-application-plugin-snippets.html">parçacıklar eklentisinde</ulink> sunulmaktadır. Bu eklenti, özellikle küçük özelleştirilmiş betikler için daha iyi bir başlangıç noktası sağlayabilir.

source: Indentation Scripts
tr: Girintileme Betikleri

source: Indentation scripts - also referred as indenters - automatically indent the source code while typing text. As an example, after hitting the return key the indentation level often increases.
tr: Girintileme betikleri (aynı zamanda girintileyiciler olarak da bilinir) metin yazarken kaynak kodu kendiliğinden girintiler. Örnek olarak, Dönüş düğmesine bastıktan sonra girinti düzeyi genelde artar.

source: The following sections describe step by step how to create the skeleton for a simple indenter. As a first step, create a new <filename>*.js</filename> file called &eg; <filename>javascript.js</filename> in the local home folder <filename>$<envar>XDG_DATA_HOME</envar>/katepart5/script/indentation</filename>. Therein, the environment variable <envar>XDG_DATA_HOME</envar> typically expands to either <filename>~/.local</filename> or <filename>~/.local/share</filename>.
tr: Aşağıdaki bölümlerde basit bir girintileyici için temel çerçevenin nasıl oluşturulacağı adım adım açıklanmaktadır. İlk adım olarak, yerel ana klasör olan <filename>$<envar>XDG_DATA_HOME</envar>/katepart5/script/indentation</filename> klasöründe yeni bir <filename>*.js</filename> dosyası oluşturun; &eg;, <filename>javascript.js</filename>. Burada, <envar>XDG_DATA_HOME</envar> çevre değişkeni genellikle <filename>~/.local</filename> veya <filename>~/.local/share</filename> olarak genişletilir.

source: On &Windows; these files are located in <filename>%USERPROFILE%\AppData\Local\katepart5\script\indentation</filename>. <replaceable>%USERPROFILE%</replaceable> usually expands to <filename>C:\\Users\\<replaceable>user</replaceable></filename>.
tr: &Windows;’ta bu dosyalar genelde <filename>C:\\Users\\<replaceable>user</replaceable></filename> olarak genişleyen <filename>%USERPROFILE%\AppData\Local\katepart5\script\indentation</filename>. <replaceable>%USERPROFILE%</replaceable> konumundadır.

source: The Indentation Script Header
tr: Girintileme Betiği Üstbilgisi

source: The header of the file <filename>javascript.js</filename> is embedded as &JSON; at the beginning of the document as follows: <programlisting> var katescript = { "name": "JavaScript", "author": "Example Name &lt;example.name@some.address.org&gt;", "license": "BSD License", "revision": 1, "kate-version": "5.1", "required-syntax-style": "javascript", "indent-languages": ["javascript"], "priority": 0, }; // kate-script-header, must be at the start of the file without comments </programlisting> Each entry is explained in detail now:
tr: <filename>javascript.js</filename> dosyasının üstbilgisi, aşağıdaki gibi belgenin başına &JSON; olarak gömülür: <programlisting> var katescript = { "name": "JavaScript", "author": "Örnek Ad &lt;örnek.ad@bir.adres.org&gt;", "license": "BSD License", "revision": 1, "kate-version": "5.1", "required-syntax-style": "javascript", "indent-languages": ["javascript"], "priority": 0, }; // kate-script-header, dosyanın başında yorumsuz olmalıdır </programlisting> Burada her giriş ayrıntılı olarak açıklanır:

source: <literal>name</literal> [required]: This is the indenter name that appears in the menu <menuchoice><guimenu>Tools</guimenu><guimenuitem>Indentation</guimenuitem></menuchoice> and in the configuration dialog.
tr: <literal>name</literal> [zorunlu]: Bu, <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Girintileme</guimenuitem></menuchoice> menüsünde ve yapılandırma iletişim kutusunda görünen girintileyici adıdır.

source: <literal>author</literal> [optional]: The author's name and contact information.
tr: <literal>author</literal> [isteğe bağlı]: Yazarın adı ve iletişim bilgisi.

source: <literal>license</literal> [optional]: Short form of the license, such as BSD License or LGPLv3.
tr: <literal>license</literal> [isteğe bağlı]: Lisansın kısa adı; örneğin, BSD License veya LGPLv3.

source: <literal>revision</literal> [required]: The revision of the script. This number should be increased whenever the script is modified.
tr: <literal>revision</literal> [zorunlu]: Betiğin revizyonu. Komut dosyasında her değişiklik yapıldığında bu sayının artırılması gerekir.

source: <literal>kate-version</literal> [required]: Minimum required &kappname; version.
tr: <literal>kate-version</literal> [zorunlu]: Zorunlu en düşük &kappname; sürümü.

source: <literal>required-syntax-style</literal> [optional]: The required syntax style, which matches the specified <literal>style</literal> in syntax highlighting files. This is important for indenters that rely on specific highlight information in the document. If a required syntax style is specified, the indenter is available only when the appropriate highlighter is active. This prevents <quote>undefined behavior</quote> caused by using the indenter without the expected highlighting schema. For instance, the Ruby indenter makes use of this in the files <filename>ruby.js</filename> and <filename>ruby.xml</filename>.
tr: <literal>required-syntax-style</literal> [isteğe bağlı]: Sözdizim vurgulama dosyalarında belirtilen <literal>biçem</literal> ile eşleşen gerekli sözdizim biçemi. Bu, belgedeki belirli vurgulama bilgilerine dayanan girintileyiciler için önemlidir. Gerekli bir sözdizim biçemi belirtilirse girintileyici yalnızca uygun vurgulayıcı etkin olduğunda kullanılabilir. Bu, girintileyicinin beklenen vurgulama şeması olmadan kullanılmasından kaynaklanan <quote>tanımsız davranışı</quote> önler. Örneğin, Ruby girintileyicisi bunu, <filename>ruby.js</filename> ve <filename>ruby.xml</filename> dosyalarında kullanır.

source: <literal>indent-languages</literal> [optional]: &JSON; array of syntax styles the indenter can indent correctly, &eg;: <literal>["c++", "java"]</literal>.
tr: <literal>indent-languages</literal> [isteğe bağlı]: Girintileyicinin düzgünce girintileyebildiği sözdizim biçemlerinin &JSON; dizilişi; &eg;: <literal>["c++", "java"]</literal>.

source: <literal>priority</literal> [optional]: If several indenters are suited for a certain highlighted file, the priority decides which indenter is chosen as default indenter.
tr: <literal>priority</literal> [isteğe bağlı]: Vurgulanan belirli bir dosya için birden fazla girintileyici uygunsa öncelik, öntanımlı girintileyici olarak hangi girintileyicinin seçileceğine karar verir.

source: The Indenter Source Code
tr: Girintileyici Kaynak Kodu
