Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_menus.po
Languages: tr

source: This action jumps the previous editing line in the <link linkend="multicursor-modifier-configure">multicursor configuration</link>.
tr: Bu eylem, <link linkend="multicursor-modifier-configure">çoklu imleç yapılandırmasındaki</link> bir önceki düzenleme satırına atlar.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>E</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Go to Next Editing Line</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>E</keycap></keycombo> </shortcut> <guimenu>Git</guimenu> <guimenuitem>Sonraki Düzenleme Konumuna Git</guimenuitem>

source: This action jumps the next editing line in the <link linkend="multicursor-modifier-configure">multicursor configuration</link>.
tr: Bu eylem, <link linkend="multicursor-modifier-configure">çoklu imleç yapılandırmasındaki</link> bir sonraki düzenleme satırına atlar.

source: <guimenu>Go</guimenu> <guimenuitem>Go to Previous Modified Line</guimenuitem>
tr: <guimenu>Git</guimenu> <guimenuitem>Önceki Değiştirilen Satıra Git</guimenuitem>

source: Lines that were changed since opening the file are called modified lines. This action jumps the previous modified line.
tr: Dosya açıldıktan sonra değiştirilmiş satırlara değiştirilen satırlar denir. Bu eylem, önceki değiştirilen satıra atlar.

source: <guimenu>Go</guimenu> <guimenuitem>Go to Next Modified Line</guimenuitem>
tr: <guimenu>Git</guimenu> <guimenuitem>Sonraki Değiştirilen Satıra Git</guimenuitem>

source: Lines that were changed since opening the file are called modified lines. This action jumps the next modified line.
tr: Dosya açıldıktan sonra değiştirilmiş satırlara değiştirilen satırlar denir. Bu eylem, sonraki değiştirilen satıra atlar.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>6</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Go to Matching Bracket</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>6</keycap></keycombo> </shortcut> <guimenu>Git</guimenu> <guimenuitem>Ayracın Eşine Git</guimenuitem>

source: Move the cursor to the associated opening or closing bracket.
tr: İmleci ilgili açılış veya kapanış ayracına taşıyın.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>6</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Select to Matching Bracket</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>6</keycap></keycombo> </shortcut> <guimenu>Git</guimenu> <guimenuitem>Ayracın Eşine Kadar Seç</guimenuitem>

source: Selects the text between associated opening and closing brackets.
tr: İlgili açılış ve kapanış ayraçları arasındaki metni seçer.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>6</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guisubmenu>Bookmarks</guisubmenu>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>6</keycap></keycombo> </shortcut> <guimenu>Git</guimenu> <guisubmenu>Yer İmleri</guisubmenu>

source: Below the entries described here, one entry for each bookmark in the active document will be available. The text will be the first few words of the marked line. Choose an item to move the cursor to the start of that line. The editor will scroll as necessary to make that line visible.
tr: Burada açıklanan girişlerin altında, etkin belgedeki her yer imi için bir giriş kullanılabilir olacaktır. Metin, imli satırın ilk birkaç sözcüğü olacaktır. İmleci o satırın başına taşımak için bir öge seçin. Düzenleyici, bu satırı görünür kılmak için gerektiği kadar kaydıracaktır.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guisubmenu>Bookmarks</guisubmenu> <guimenuitem>Set Bookmark</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Git</guimenu> <guisubmenu>Yer İmleri</guisubmenu> <guimenuitem>Yer İmi Koy</guimenuitem>

source: Sets or removes a bookmark in the current line of the active document. (If it's there, it is removed, otherwise one is set.)
tr: Etkin belgenin geçerli satırına bir yer imi koyar veya kaldırır. (Eğer oradaysa kaldırılır, aksi takdirde bir tane koyulur.)

source: <guimenu>Go</guimenu> <guisubmenu>Bookmarks</guisubmenu> <guimenuitem>Clear All Bookmarks</guimenuitem>
tr: <guimenu>Git</guimenu> <guisubmenu>Yer İmleri</guisubmenu> <guimenuitem>Tüm Yer İmlerini Temizle</guimenuitem>

source: This command will remove all the markers from the document as well as the list of markers which is appended at the bottom of this menu item.
tr: Bu komut, belgedeki tüm imleyicilerin yanı sıra bu menü ögesinin altına eklenen imleyiciler listesini de kaldıracaktır.

source: <shortcut> <keycombo action="simul">&Alt;&PgUp;</keycombo> </shortcut> <guimenu>Go</guimenu> <guisubmenu>Bookmarks</guisubmenu> <guimenuitem>Previous</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;&PgUp;</keycombo> </shortcut> <guimenu>Git</guimenu> <guisubmenu>Yer İmleri</guisubmenu> <guimenuitem>Önceki</guimenuitem>

source: This will move the cursor to beginning of the first above line with a bookmark. The menuitem text will include the line number and the first piece of text on the line. This item is only available when there is a bookmark in a line above the cursor.
tr: Bu, imleci yukarıdaki yer iminin bulunduğu ilk satırın başına taşır. Menü ögesi metni, satır numarasını ve satırdaki ilk metin parçasını içerecektir. Bu öge yalnızca imlecin üzerindeki satırda bir yer imi bulunduğunda kullanılabilir.

source: <shortcut> <keycombo action="simul">&Alt;&PgDn;</keycombo> </shortcut> <guimenu>Go</guimenu> <guisubmenu>Bookmarks</guisubmenu> <guimenuitem>Next</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;&PgDn;</keycombo> </shortcut> <guimenu>Git</guimenu> <guisubmenu>Yer İmleri</guisubmenu> <guimenuitem>Sonraki</guimenuitem>

source: This will move the cursor to beginning of the next line with a bookmark. The menuitem text will include the line number and the first piece of text on the line. This item is only available when there is a bookmark in a line below the cursor.
tr: Bu, imleci yukarıdaki yer iminin bulunduğu ilk satırın başına taşır. Menü ögesi metni, satır numarasını ve satırdaki ilk metin parçasını içerecektir. Bu öge yalnızca imlecin altındaki satırda bir yer imi bulunduğunda kullanılabilir.

source: The Tools Menu
tr: Araçlar Menüsü

source: <guimenu>Tools</guimenu> <guisubmenu>Mode</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Kip</guisubmenu>

source: Choose the filetype scheme you prefer for the active document. This overwrites the global filetype mode set in <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Configure Editor...</guimenuitem></menuchoice> in the Filetypes tab for your current document only.
tr: Etkin belge için tercih ettiğiniz dosya türü şemasını seçin. Bu, yalnızca geçerli belgeniz için Dosya Türleri sekmesindeki <menuchoice> <guimenu>Ayarlar</guimenu><guimenuitem>Düzenleyiciyi Yapılandır…</guimenuitem></menuchoice> bölümünde ayarlanan global dosya türü kipinin üzerine yazar.

source: <guimenu>Tools</guimenu> <guisubmenu>Highlighting</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Vurgulama</guisubmenu>

source: Choose the Highlighting scheme you prefer for the active document. This overwrites the global highlighting mode set in <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Configure Editor...</guimenuitem> </menuchoice> for your current document only.
tr: Etkin belge için tercih ettiğiniz vurgulama şemasını seçin. Bu, yalnızca geçerli belgeniz için <menuchoice> <guimenu>Ayarlar</guimenu><guimenuitem>Düzenleyiciyi Yapılandır…</guimenuitem></menuchoice> iletişim kutusunda ayarlanan global vurgulama kipinin üzerine yazar.

source: <guimenu>Tools</guimenu> <guisubmenu>Indentation</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Girintileme</guisubmenu>

source: Choose the style of indentation you want for your active document. This overwrites the global indentation mode set in <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Configure Editor...</guimenuitem> </menuchoice> for your current document only.
tr: Etkin belge için tercih ettiğiniz girintileme biçemini seçin. Bu, yalnızca geçerli belgeniz için <menuchoice> <guimenu>Ayarlar</guimenu><guimenuitem>Düzenleyiciyi Yapılandır…</guimenuitem></menuchoice> iletişim kutusunda ayarlanan global girintileme kipinin üzerine yazar.

source: <guimenu>Tools</guimenu> <guisubmenu>Encoding</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Kodlama</guisubmenu>

source: You can overwrite the default encoding set in <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Configure Editor...</guimenuitem> </menuchoice> in the <guilabel>Open/Save</guilabel> page to set a different encoding for your current document. The encoding you set here will be only valid for your current document.
tr: <menuchoice> <guimenu>Ayarlar</guimenu><guimenuitem>Düzenleyiciyi Yapılandır…</guimenuitem> </menuchoice> iletişim kutusunun <guilabel>Aç/Kaydet</guilabel> sayfasında ayarlanan öntanımlı kodlamayı, geçerli belgeniz için geçersiz kılabilirsiniz. Burada ayarladığınız kodlama, yalnızca geçerli belgeniz için geçerli olur.

source: <guimenu>Tools</guimenu> <guisubmenu>Add Byte Mark Order (BOM)</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Bayt Sırası İmi (BOM) Ekle</guisubmenu>

source: Checking this action you can explicitly add a byte order mark for unicode encoded documents. The byte order mark (BOM) is a Unicode character used to signal the endianness (byte order) of a text file or stream, for more information see <ulink url="https://en.wikipedia.org/wiki/Byte_order_mark">Byte Order Mark</ulink>.
tr: Bu eylemi işaretleyerek Unicode ile kodlanan belgelere açıkça bir bayt sırası imi ekleyebilirsiniz. Bayt sırası imi (BOM), bir metin dosyasının ve akışının son haneliliğini (bayt sırasını) sinyalleyen bir Unicode karakterdir; daha fazla bilgi için <ulink url="https://en.wikipedia.org/wiki/Byte_order_mark">Bayt Sırası İmi</ulink> sayfasına bakın.

source: <guimenu>Tools</guimenu> <guisubmenu>End of Line</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Satır Sonu</guisubmenu>

source: Choose your preferred end of line mode for your active document. This overwrites the global end of line mode set in <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Configure Editor...</guimenuitem> </menuchoice> for your current document only.
tr: Etkin belgeniz için tercih ettiğiniz satır sonu kipini seçin. Bu, <menuchoice> <guimenu>Ayarlar</guimenu><guimenuitem>Düzenleyiciyi Yapılandır…</guimenuitem> </menuchoice> bölümünden ayarlanan global satır sonu kipini yalnızca geçerli belgeniz için geçersiz kılar.

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu>

source: This submenu contains a list of all scripted actions. The list can easily be modified by <link linkend="dev-scripting-command-line">writing your own scripts</link>. This way, &katepart; can be extended with user-defined tools.
tr: Bu alt menü, betiklerle denetlenen tüm eylemlerin bir listesini içerir. Bu liste, <link linkend="dev-scripting-command-line">kendi betiklerinizi yazarak</link> kolaylıkla değiştirilebilir. Böylece &katepart;, kullanıcı tanımlı araçlarla daha da genişletilebilir.

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Navigation</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Dolaşım</guisubmenu>

source: <shortcut> <keycombo action="simul">&Alt;&Shift;&Up;</keycombo> </shortcut> <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Navigation</guisubmenu> <guimenuitem>Move cursor to previous matching indent</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;&Shift;&Up;</keycombo> </shortcut> <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Dolaşım</guisubmenu> <guimenuitem>İmleci Önceki Eşleşen Girintiye Taşı</guimenuitem>

source: Moves the cursor to the first line above the current line that is indented at the same level as the current line.
tr: İmleci geçerli satırın üzerindeki, geçerli satırla aynı düzeyde girintili olan ilk satıra taşır.

source: <shortcut> <keycombo action="simul">&Alt;&Shift;&Down;</keycombo> </shortcut> <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Navigation</guisubmenu> <guimenuitem>Move cursor to next matching indent</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;&Shift;&Up;</keycombo> </shortcut> <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Dolaşım</guisubmenu> <guimenuitem>İmleci Sonraki Eşleşen Girintiye Taşı</guimenuitem>

source: Moves the cursor to the first line below the current line that is indented at the same level as the current line.
tr: İmleci geçerli satırın altındaki, geçerli satırla aynı düzeyde girintili olan ilk satıra taşır.

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Editing</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Düzenleme</guisubmenu>

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Editing</guisubmenu> <guimenuitem>Sort Selected Text</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Editing</guisubmenu> <guimenuitem>Seçili Metni Sırala</guimenuitem>

source: Sorts the selected text or whole document in ascending order.
tr: Seçili metni veya tüm belgeyi artan sırada sıralar.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;&Down;</keycombo> </shortcut> <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Editing</guisubmenu> <guimenuitem>Move Lines Down</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;&Down;</keycombo> </shortcut> <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Düzenleme</guisubmenu> <guimenuitem>Satırları Aşağı Taşı</guimenuitem>

source: Move selected lines down.
tr: Seçili satırları aşağı taşıyın.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;&Up;</keycombo> </shortcut> <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Editing</guisubmenu> <guimenuitem>Move Lines Up</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;&Down;</keycombo> </shortcut> <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Düzenleme</guisubmenu> <guimenuitem>Satırları Yukarı Taşı</guimenuitem>

source: Move selected lines up.
tr: Seçili satırları yukarı taşıyın.

source: <shortcut> <keycombo action="simul">&Ctrl;&Alt;&Down;</keycombo> </shortcut> <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Editing</guisubmenu> <guimenuitem>Duplicate Selected Lines Down</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Alt;&Down;</keycombo> </shortcut> <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Düzenleme</guisubmenu> <guimenuitem>Seçili Satırları Aşağıya Çoğalt</guimenuitem>

source: Duplicates the selected lines down.
tr: Seçili satırları aşağısında çoğaltır.

source: <shortcut> <keycombo action="simul">&Ctrl;&Alt;&Up;</keycombo> </shortcut> <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Editing</guisubmenu> <guimenuitem>Duplicate Selected Lines Up</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Alt;&Down;</keycombo> </shortcut> <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Düzenleme</guisubmenu> <guimenuitem>Seçili Satırları Yukarıya Çoğalt</guimenuitem>

source: Duplicates the selected lines up.
tr: Seçili satırları yukarısında çoğaltır.

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Editing</guisubmenu> <guimenuitem>URI-encode selected text</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Düzenleme</guisubmenu> <guimenuitem>Seçili Metnin URI Kodlamasını Yap</guimenuitem>

source: Encodes the selected text so that it can be used as part of a query string in a &URL;, replacing the selection with the encoded text.
tr: Seçili metni, seçimi kodlanmış metinle değiştirerek, bir &URL;’deki sorgu dizisinin parçası olarak kullanılabilecek şekilde kodlar.

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Editing</guisubmenu> <guimenuitem>URI-decode selected text</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Düzenleme</guisubmenu> <guimenuitem>Seçili Metnin URI Kodunu Çöz</guimenuitem>

source: If part of the query string of a &URL; is selected, this will decode it and replace the selection with the original raw text.
tr: Bir &URL;’nin sorgu dizisinin bir kısmı seçilirse bu, onun kodunu çözer ve seçimi özgün ham metinle değiştirir.

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Emmet</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Emmet</guisubmenu>

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Expand abbreviation</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Kısaltmayı Genişlet</guimenuitem>

source: Converts the selected text to a pair of opening and closing &HTML; or &XML; tags. For example, if <userinput>div</userinput> is selected, this item will replace that with <computeroutput>&lt;div&gt;&lt;/div&gt;</computeroutput>.
tr: Seçili metni bir çift açılış ve kapanış &HTML; veya &XML; etiketlerine dönüştürür. Örneğin, <userinput>div</userinput> seçiliyse bu öge onu <computeroutput>&lt;div&gt;&lt;/div&gt;</computeroutput> ile değiştirir.

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Wrap with tag</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Etiketle Sar</guimenuitem>

source: Wraps the selected text with the tag provided on the <link linkend="dev-scripting-command-line">command line</link>.
tr: Seçili metni <link linkend="dev-scripting-command-line">komut satırında</link> sağlanan etiketle çevreler.

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Move cursor to matching tag</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>İmleci Eşleşen Etikete Taşı</guimenuitem>

source: If the cursor is inside an opening &HTML;/&XML; tag, this item will move it to the closing tag. If the cursor is inside the closing tag, it will instead move it to the opening tag.
tr: İmleç açık bir &HTML;/&XML; etiketinin içindeyse bu öge onu kapatma etiketine taşır. İmleç kapatma etiketinin içindeyse onu bu kez de açma etiketinin içine taşır.

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Select &HTML;/&XML; tag contents inwards</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>&HTML;/&XML; Etiket İçeriğini İçe Doğru Seç</guimenuitem>

source: When the cursor is inside a pair of &HTML;/&XML; tags, this option will change the selection to include the contents of those &HTML;/&XML; tags, without selecting the tags themselves.
tr: İmleç bir &HTML;/&XML; etiketlerinin içindeyse bu seçenek seçimi bu &HTML;/&XML; etiketlerinin içeriğini de etiketlerin kendisini seçmeden içerir.

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Select &HTML;/&XML; tag contents outwards</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>&HTML;/&XML; Etiket İçeriğini Dışa Doğru Seç</guimenuitem>

source: When the cursor is inside a pair of &HTML;/&XML; tags, this item will change the selection to include the contents of those &HTML;/&XML; tags, including the tags themselves.
tr: İmleç bir &HTML;/&XML; etiketlerinin içindeyse bu seçenek seçimi bu &HTML;/&XML; etiketlerinin içeriğini de etiketlerin kendisini seçmeden içerir.

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Toggle Comment</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Yorum/Yorumları Kaldır</guimenuitem>

source: If the selected portion is not a comment, this item will enclose that portion in &HTML;/&XML; comments (&eg; <computeroutput>&lt;!-- selected text --&gt;</computeroutput>). If the selected portion is a comment, the comment tags will be removed instead.
tr: Seçili kısım bir yorum değilse bu öge onları &HTML;/&XML; yorumları içine alır (örneğin, <computeroutput>&lt;!-- seçili metin --&gt;</computeroutput>). Seçili kısım bir yorumsa yorum etiketleri kaldırılır.

source: <guimenu>Tools</guimenu><guisubmenu>Scripts</guisubmenu><guisubmenu>Emmet</guisubmenu> <guimenuitem>Delete tag under cursor</guimenuitem>
tr: <guimenu>Araçlar</guimenu><guisubmenu>Betikler</guisubmenu><guisubmenu>Emmet</guisubmenu> <guimenuitem>İmleç Altındaki Etiketi Sil</guimenuitem>

source: If the cursor is presently inside a &HTML;/&XML; tag, this item will delete the entire tag.
tr: İmleç bir &HTML;/&XML; etiketi içindeyse bu öge tüm etiketi siler.

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Decrement number by 1</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Sayıyı 1 Azalt</guimenuitem>

source: This item will subtract one from the currently selected text, if it is a number. For example, if <userinput>5</userinput> is selected, it will become <computeroutput>4</computeroutput>.
tr: Bu öge bir sayıysa o anda seçili olan metinden 1 çıkarır. Örneğin, <userinput>5</userinput> seçiliyse <computeroutput>4</computeroutput> olur.

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Decrement number by 10</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Sayıyı 10 Azalt</guimenuitem>

source: This item will subtract 10 from the currently selected text, if it is a number. For example, if <userinput>15</userinput> is selected, it will become <computeroutput>5</computeroutput>.
tr: Bu öge bir sayıysa o anda seçili olan metinden 10 çıkarır. Örneğin, <userinput>15</userinput> seçiliyse <computeroutput>5</computeroutput> olur.

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Decrement number by 0.1</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Sayıyı 0,1 Azalt</guimenuitem>

source: This item will subtract 0.1 from the currently selected text, if it is a number. For example, if <userinput>4.5</userinput> is selected, it will become <computeroutput>4.4</computeroutput>.
tr: Bu öge bir sayıysa o anda seçili olan metinden 0,1 çıkarır. Örneğin, <userinput>4,5</userinput> seçiliyse <computeroutput>4,4</computeroutput> olur.

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Increment number by 1</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Betikler</guisubmenu> <guisubmenu>Emmet</guisubmenu> <guimenuitem>Sayıyı 1 Artır</guimenuitem>
