Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_development.po
Languages: tr

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Extending &katepart;
tr: &katepart;’ı genişletmek

source: Introduction
tr: Giriş

source: Like any advanced text editor component, &katepart; offers a variety of ways to extend its functionality. You can <link linkend="dev-scripting">write simple scripts to add functionality with &javascript;</link>. Finally, once you have extended &katepart;, you are welcome to <ulink url="https://kate-editor.org/join-us/">join us</ulink> and share your enhancements with the world!
tr: Herhangi bir gelişmiş metin düzenleyicisi bileşeni gibi &katepart; da işlevselliğini genişletmek için çeşitli yollar sunar. &javascript; ile <link linkend="dev-scripting">basit betikler yazarak</link> yeni özellikler ekleyebilirsiniz. Son olarak, &katepart; için yeni özellikler yazdıktan sonra <ulink url="https://kate-editor.org/join-us/">bize katılın</ulink> ve iyileştirmelerinizi dünyanın geri kalanıyla paylaşın!

source: Working with Syntax Highlighting
tr: Sözdizim Vurgulama ile çalışmak

source: Overview
tr: Genel Bakış

source: Syntax Highlighting is what makes the editor automatically display text in different styles/colors, depending on the function of the string in relation to the purpose of the file. In program source code for example, control statements may be rendered bold, while data types and comments get different colors from the rest of the text. This greatly enhances the readability of the text, and thus helps the author to be more efficient and productive.
tr: Sözdizim Vurgulama, dosyanın amacına göre dizinin işlevine bağlı olarak düzenleyicinin metni kendiliğinden farklı biçemlerde/renklerde görüntülemesini sağlayan şeydir. Örneğin program kaynak kodunda, denetim ifadeleri kalın harflerle gösterilebilirken, veri türleri ve yorumlar metnin geri kalanından farklı renkler alır. Bu, metnin okunabilirliğini büyük ölçüde artırır ve böylece yazarın daha verimli ve üretken olmasına yardımcı olur.

source: <phrase>A C++ function, rendered with syntax highlighting.</phrase>
tr: <phrase>Sözdizim vurgulama ile gösterilen bir C++ işlevi.</phrase>

source: <para>A C++ function, rendered with syntax highlighting.</para>
tr: <para>Sözdizim vurgulama ile gösterilen bir C++ işlevi.</para>

source: <phrase>The same C++ function, without highlighting.</phrase>
tr: <phrase>Aynı C++ işlevi, vurgulama olmadan.</phrase>

source: <para>The same C++ function, without highlighting.</para>
tr: <para>Aynı C++ işlevi, vurgulama olmadan.</para>

source: Of the two examples, which is easiest to read?
tr: İki örnekten hangisini okuması daha kolay?

source: &kappname; comes with a flexible, configurable and capable system for doing syntax highlighting, and the standard distribution provides definitions for a wide range of programming, scripting and markup languages and other text file formats. In addition you can provide your own definitions in simple &XML; files.
tr: &kappname;, sözdizim vurgulaması yapmak için esnek, yapılandırılabilir ve yetenekli bir sistemle birlikte gelir ve standart dağıtım, çok çeşitli programlama, komut dosyası yazma ve işaretleme dilleri ve diğer metin dosyası biçimleri için tanımlar sağlar. Ayrıca basit &XML; dosyalarında kendi tanımlarınızı da sağlayabilirsiniz.

source: &kappname; will automatically detect the right syntax rules when you open a file, based on the &MIME; Type of the file, determined by its extension, or, if it has none, the contents. Should you experience a bad choice, you can manually set the syntax to use from the <menuchoice><guimenu>Tools</guimenu><guisubmenu>Highlighting </guisubmenu></menuchoice> menu.
tr: &kappname;, bir dosyayı açtığınızda onun doğru sözdizim kurallarını sırasıyla &MIME; türü, dosya uzantısı veya bunlardan ikisi de yoksa içeriğine bakarak algılayacaktır. Yanlış bir seçimle karşı karşıya kalırsanız <menuchoice><guimenu>Araçlar</guimenu><guisubmenu>Vurgulama</guisubmenu></menuchoice> menüsünden elle bir vurgulama türü seçebilirsiniz.

source: The styles and colors used by each syntax highlight definition can be configured using the <link linkend="prefcolors-highlighting-text-styles">Highlighting Text Styles</link> tab of the <link linkend="config-dialog">Config Dialog</link>, while the &MIME; Types and file extensions it should be used for are handled by the <link linkend="pref-open-save-modes-filetypes">Modes &amp; Filetypes</link> tab.
tr: Sözdizim vurgulamaları tarafından kullanılan biçemler ve renkler <link linkend="config-dialog">yapılandırma iletişim kutusunun</link> <link linkend="prefcolors-highlighting-text-styles">Vurgulanan Metin Biçemleri</link> sekmesinden düzenlenebilirken, &MIME; türleri ve kullanması gereken dosya uzantıları ise <link linkend="pref-open-save-modes-filetypes">Kipler ve Dosya Türleri</link> sekmesinden ayarlanır.

source: Syntax highlighting is there to enhance the readability of correct text, but you cannot trust it to validate your text. Marking text for syntax is difficult depending on the format you are using, and in some cases the authors of the syntax rules will be proud if 98% of text gets correctly rendered, though most often you need a rare style to see the incorrect 2%.
tr: Sözdizim vurgulama, doğru metnin okunabilirliğini artırmak için vardır; ancak metninizi doğrulamak için ona güvenemezsiniz. Kullandığınız biçime bağlı olarak metni sözdizimi için işaretlemek zordur ve bazı durumlarda sözdizim kurallarının yazarları metnin %​98’i doğru şekilde oluşturulursa gurur duyacaktır; ancak çoğunlukla yanlış %​2’yi görmek için nadir bir biçeme gereksiniminiz vardır.

source: The &kappname; Syntax Highlight System
tr: &kappname; Sözdizim Vurgulama Sistemi

source: This section will discuss the &kappname; syntax highlighting mechanism in more detail. It is for you if you want to know about it, or if you want to change or create syntax definitions.
tr: Bu bölümde &kappname; sözdizim vurgulama mekanizmasını daha ayrıntılı olarak ele alacağız. Bu konuda bilgi sahibi olmak istiyor ve sözdizim tanımlarını değiştirmek veya yeni bir tane oluşturmak istiyorsanız tam size göre.

source: How it Works
tr: Nasıl Çalışır

source: Whenever you open a file, one of the first things the &kappname; editor does is detect which syntax definition to use for the file. While reading the text of the file, and while you type away in it, the syntax highlighting system will analyze the text using the rules defined by the syntax definition and mark in it where different contexts and styles begin and end.
tr: Bir dosyayı açtığınızda &kappname; düzenleyicisinin yaptığı ilk şeylerden biri, dosya için hangi sözdizim tanımının kullanılacağını algılamaktır. Dosya metnini okurken ve siz dosyaya bir şeyler yazarken, sözdizim vurgulama sistemi, sözdizim tanımıyla tanımlanan kuralları kullanarak metni çözümleyecek ve farklı bağlamların ve biçimlerin başladığı ve bittiği yerleri imleyecektir.

source: When you type in the document, the new text is analyzed and marked on the fly, so that if you delete a character that is marked as the beginning or end of a context, the style of surrounding text changes accordingly.
tr: Belgeye bir şeyler yazdığınızda, yeni metin anında çözümlenir ve imlenir; böylece, bir bağlamın başlangıcı veya sonu olarak imlenen bir karakteri silerseniz çevreleyen metnin biçemi buna göre değişir.

source: The syntax definitions used by the &kappname; Syntax Highlighting System are &XML; files, containing
tr: &kappname; Sözdizim Vurgulama Sistemi tarafından kullanılan sözdizim tanımları &XML; dosyalarıdır ve şunları içerir:

source: Rules for detecting the role of text, organized into context blocks
tr: Bağlam blokları halinde düzenlenmiş metnin rolünü algılamaya yönelik kurallar

source: Keyword lists
tr: Anahtar sözcük listeleri

source: Style Item definitions
tr: Biçem ögesi tanımları

source: When analyzing the text, the detection rules are evaluated in the order in which they are defined, and if the beginning of the current string matches a rule, the related context is used. The start point in the text is moved to the final point at which that rule matched and a new loop of the rules begins, starting in the context set by the matched rule.
tr: Metin çözümlenirken algılama kuralları tanımlandıkları sıraya göre değerlendirilir ve geçerli dizinin başlangıcı bir kuralla eşleşiyorsa ilgili bağlam kullanılır. Metindeki başlangıç noktası, kuralın eşleştiği son noktaya taşınır ve eşleşen kural tarafından belirlenen bağlamdan başlayarak yeni bir kurallar döngüsü başlar.

source: Rules
tr: Kurallar

source: The detection rules are the heart of the highlighting detection system. A rule is a string, character or <link linkend="regular-expressions">regular expression</link> against which to match the text being analyzed. It contains information about which style to use for the matching part of the text. It may switch the working context of the system either to an explicitly mentioned context or to the previous context used by the text.
tr: Algılama kuralları, vurgulama algılama sisteminin kalbidir. Kural, çözümlenen metinle eşleştirilecek bir dizi, karakter veya <link linkend="regular-expressions">düzenli ifadedir</link>. Metnin eşleşen kısmı için hangi biçemin kullanılacağı hakkında bilgi içerir. Sistemin çalışma bağlamını ya açıkça belirtilen bir bağlama ya da metin tarafından kullanılan önceki bağlama çevirebilir.

source: Rules are organized in context groups. A context group is used for main text concepts within the format, for example quoted text strings or comment blocks in program source code. This ensures that the highlighting system does not need to loop through all rules when it is not necessary, and that some character sequences in the text can be treated differently depending on the current context.
tr: Kurallar bağlam gruplarında düzenlenir. Bir bağlam grubu, biçim içindeki ana metin kavramları için kullanılır; örneğin, alıntılanan metin dizileri veya program kaynak kodundaki yorum blokları. Bu, vurgulama sisteminin gerekli olmadığında tüm kurallar arasında döngü yapmasına gerek kalmamasını ve metindeki bazı karakter dizilerinin geçerli bağlama bağlı olarak farklı şekilde ele alınabilmesini sağlar.

source: Contexts may be generated dynamically to allow the usage of instance specific data in rules.
tr: Örneklere özgü verinin kurallarda kullanılmasına izin vermek için bağlamlar devingen olarak oluşturulabilir.

source: Context Styles and Keywords
tr: Bağlam Biçemleri ve Anahtar Sözcükler

source: In some programming languages, integer numbers are treated differently from floating point ones by the compiler (the program that converts the source code to a binary executable), and there may be characters having a special meaning within a quoted string. In such cases, it makes sense to render them differently from the surroundings so that they are easy to identify while reading the text. So even if they do not represent special contexts, they may be seen as such by the syntax highlighting system, so that they can be marked for different rendering.
tr: Bazı programlama dillerinde tamsayılar, derleyici (kaynak kodunu ikili yürütülebilir dosyaya dönüştüren program) tarafından kayan noktalı sayılardan farklı şekilde ele alınır ve tırnak içine alınan bir dizi içinde özel bir anlama sahip karakterler olabilir. Bu gibi durumlarda, metni okurken kolayca tespit edilebilmeleri için onları çevreden farklı kılmak mantıklıdır. Dolayısıyla, özel bağlamları temsil etmeseler bile sözdizim vurgulama sistemi tarafından bu şekilde görülebilirler, böylece farklı sunum için imlenebilirler.

source: A syntax definition may contain as many styles as required to cover the concepts of the format it is used for.
tr: Bir sözdizim tanımı, kullanıldığı biçimin kavramlarını kapsayacak kadar çok sayıda biçem içerebilir.

source: In many formats, there are lists of words that represent a specific concept. For example, in programming languages, control statements are one concept, data type names another, and built in functions of the language a third. The &kappname; Syntax Highlighting System can use such lists to detect and mark words in the text to emphasize concepts of the text formats.
tr: Pek çok biçimde belirli bir kavramı temsil eden sözcük listeleri bulunur. Örneğin, programlama dillerinde, denetim ifadeleri bir kavramdır, veri türü adları başka bir kavramdır ve dilin yerleşik işlevleri üçüncüsüdür. &kappname; Sözdizim Vurgulama Sistemi, metin biçimlerinin kavramlarını vurgulamak amacıyla metindeki sözcükleri tespit etmek ve imlemek için bu tür listeleri kullanabilir.

source: Default Styles
tr: Öntanımlı Biçemler

source: If you open a C++ source file, a &Java; source file and an &HTML; document in &kappname;, you will see that even though the formats are different, and thus different words are chosen for special treatment, the colors used are the same. This is because &kappname; has a predefined list of Default Styles which are employed by the individual syntax definitions.
tr: &kappname;’de bir C++ kaynak dosyası, bir &Java; kaynak dosyası ve bir &HTML; belgesi açarsanız biçimler farklı olsa ve dolayısıyla özel işlem için farklı sözcükler seçilse bile, kullanılan renklerin aynı olduğunu göreceksiniz. Bunun nedeni, &kappname;’in ayrı ayrı sözdizimi tanımları tarafından kullanılan, önceden tanımlanmış bir Öntanımlı Biçemler listesine sahip olmasıdır.

source: This makes it easy to recognize similar concepts in different text formats. For example, comments are present in almost any programming, scripting or markup language, and when they are rendered using the same style in all languages, you do not have to stop and think to identify them within the text.
tr: Bu, farklı metin biçimlerindeki benzer kavramların tanınmasını kolaylaştırır. Örneğin, yorumlar hemen hemen her programlama, komut dosyası veya biçimlendirme dilinde bulunur ve tüm dillerde aynı biçem kullanılarak oluşturulduklarında, bunları metin içinde bunların ne olduğunu tanımlamaya çalışmakla vakit kaybetmezsiniz.

source: All styles in a syntax definition use one of the default styles. A few syntax definitions use more styles than there are defaults, so if you use a format often, it may be worth launching the configuration dialog to see if some concepts use the same style. For example, there is only one default style for strings, but as the Perl programming language operates with two types of strings, you can enhance the highlighting by configuring those to be slightly different. All <link linkend="kate-highlight-default-styles">available default styles</link> will be explained later.
tr: Bir sözdizim tanımındaki tüm biçemler, öntanımlı biçemlerden birini kullanır. Birkaç sözdizim tanımı, öntanımlılardan daha çok biçem kullanır; bu nedenle, bir biçimi sık sık kullanıyorsanız bazı kavramların aynı biçemi kullanıp kullanmadığını görmek için yapılandırma iletişim kutusunu açmanız faydalı olabilir. Örneğin, diziler için yalnızca bir öntanımlı biçem vardır; ancak Perl programlama dili iki tür diziyle çalıştığından, bunları biraz farklı olacak şekilde yapılandırarak vurgulamayı geliştirebilirsiniz. Tüm <link linkend="kate-highlight-default-styles">kullanılabilir öntanımlı biçemler</link> daha sonra açıklanacaktır.

source: The Highlight Definition &XML; Format
tr: &XML; Vurgu Tanımı Biçimi

source: &kappname; uses the Syntax-Highlighting framework from &kde-frameworks;. The default highlighting &XML; files shipped with &kappname; are compiled into the Syntax-Highlighting library by default.
tr: &kappname;, &kde-frameworks;’ten Syntax-Highlighting kitaplığını kullanır. &kappname; ile verilen öntanımlı &XML; vurgulama dosyaları, Syntax-Highlighting tarafından öntanımlı olarak derlenirler.

source: This section is an overview of the Highlight Definition &XML; format. Based on a small example it will describe the main components and their meaning and usage. The next section will go into detail with the highlight detection rules.
tr: Bu bölüm, &XML; Vurgu Tanımı biçimine genel bir bakış sunar. Küçük bir örneğe dayanarak ana bileşenleri, bunların anlamlarını ve kullanımlarını açıklayacağız. Bir sonraki bölümde vurgu algılama kurallarının ayrıntılarına girilecektir.

source: The formal definition, also known as the <acronym>XSD</acronym> you find in <ulink url="https://commits.kde.org/syntax-highlighting?path=data/schema">Syntax Highlighting repository</ulink> in the file <filename>language.xsd</filename>
tr: <acronym>XSD</acronym> olarak da bilinen resmi tanım, <ulink url="https://commits.kde.org/syntax-highlighting?path=data/schema">Sözdizim Vurgulama</ulink> deposundaki <filename>language.xsd</filename> dosyasında bulunabilir

source: Custom <filename class="extension">.xml</filename> highlight definition files are located in <filename class="directory">org.kde.syntax-highlighting/syntax/</filename> in your user folder found with <userinput><command>qtpaths</command><option> --paths GenericDataLocation</option></userinput> which usually are <filename class="directory"><envar>$HOME</envar>/.local/share/</filename> and <filename class="directory">/usr/share/</filename>.
tr: <filename class="extension">.xml</filename> vurgu tanımlama dosyaları, kullanıcı klasörünüzde genelde <filename class="directory"><envar>$HOME</envar>/.local/share/</filename> ve <filename class="directory">/usr/share/</filename> olan <userinput><command>qtpaths</command><option> --paths GenericDataLocation</option></userinput> ile <filename class="directory">org.kde.syntax-highlighting/syntax/</filename> konumunda bulunur.

source: In Flatpak and Snap packages, the above directory will not work as the data location is different for each application. In a Flatpak application, the location of custom &XML; files is usually <filename class="directory"><envar>$HOME</envar>/.var/app/<replaceable>flatpak-package-name</replaceable>/data/org.kde.syntax-highlighting/syntax/</filename> and in a Snap application that location is <filename class="directory"><envar>$HOME</envar>/snap/<replaceable>snap-package-name</replaceable>/current/.local/share/org.kde.syntax-highlighting/syntax/</filename>.
tr: Flatpak ve Snap paketlerinde, yukarıdaki dizin işe yaramaz; çünkü her bir uygulamanın veri konumları farklıdır. Bir Flatpak uygulamasında, özel &XML; dosyalarının konumu genellikle <filename class="directory"><envar>$HOME</envar>/.var/app/<replaceable>flatpak-package-name</replaceable>/data/org.kde.syntax-highlighting/syntax/</filename> olup Snap uygulamalarında ise <filename class="directory"><envar>$HOME</envar>/snap/<replaceable>snap-package-name</replaceable>/current/.local/share/org.kde.syntax-highlighting/syntax/</filename> olur.

source: On &Windows; these files are located <filename>%USERPROFILE%&#92;AppData&#92;Local&#92;org.kde.syntax-highlighting&#92;syntax</filename>. <replaceable>%USERPROFILE%</replaceable> usually expands to <filename>C:&#92;Users&#92;<replaceable>user</replaceable></filename>.
tr: &Windows;’ta bu dosyalar genelde <filename>C:&#92;Users&#92;<replaceable>user</replaceable></filename> <filename>%USERPROFILE%&#92;AppData&#92;Local&#92;org.kde.syntax-highlighting&#92;syntax</filename> olarak genişleyen <replaceable>%USERPROFILE%</replaceable> konumundadır.

source: In summary, for most configurations the directory of custom &XML; files is as follows:
tr: Özetle, çoğu yapılandırma için özel &XML; dosyalarının dizini aşağıdaki gibidir:

source: For local user
tr: Yerel kullanıcı için

source: For all users
tr: Tüm kullanıcılar için

source: For Flatpak packages
tr: Flatpak paketleri için

source: For Snap packages
tr: Snap paketleri için

source: On &Windows;
tr: &Windows; üzerinde

source: On &macOS;
tr: &macOS; üzerinde

source: If multiple files exist for the same language, the file with the highest <userinput>version</userinput> attribute in the <userinput>language</userinput> element will be loaded.
tr: Aynı dil için birden çok dosya varsa <userinput>language</userinput> ögesindeki en yüksek <userinput>version</userinput> özniteliğine sahip dosya yüklenir.

source: Main sections of &kappname; Highlight Definition files
tr: &kappname; Vurgu Tanımı dosyalarının ana bölümleri

source: A highlighting file contains a header that sets the &XML; version:
tr: Vurgulama dosyası, &XML; sürümünü ayarlayan bir üstbilgi içerir:

source: The root of the definition file is the element <userinput>language</userinput>. Available attributes are:
tr: Tanım dosyasının kökü öge <userinput>dilidir</userinput>. Kullanılabilir öznitelikler şunlardır:

source: Required attributes:
tr: Zorunlu öznitelikler:

source: <userinput>name</userinput> sets the name of the language. It appears in the menus and dialogs afterwards.
tr: <userinput>name</userinput>, dilin adını ayarlar. Sonrasında menülerde ve iletişim kutularında görünür.

source: <userinput>section</userinput> specifies the category.
tr: <userinput>section</userinput>, kategoriyi belirtir.

source: <userinput>extensions</userinput> defines file extensions, such as &quot;*.cpp;*.h&quot;
tr: <userinput>extensions</userinput>, dosya uzantılarını tanımlar, &quot;*.cpp;*.h&quot; gibi

source: <userinput>version</userinput> specifies the current revision of the definition file in terms of an integer number. Whenever you change a highlighting definition file, make sure to increase this number.
tr: <userinput>version</userinput>, tanım dosyasının geçerli revizyonunu bir tamsayı türünden belirtir. Vurgu tanımı dosyasını değiştirdiğinizde bu sayıyı artırdığınızdan emin olun.

source: <userinput>kateversion</userinput> specifies the latest supported &kappname; version.
tr: <userinput>kateversion</userinput>, en son desteklenen &kappname; sürümünü belirtir.

source: Optional attributes:
tr: İsteğe bağlı öznitelikler:

source: <userinput>mimetype</userinput> associates files &MIME; type.
tr: <userinput>mimetype</userinput>, dosyaların &MIME; türlerini ilişkilendirir.

source: <userinput>casesensitive</userinput> defines, whether the keywords are case sensitive or not.
tr: <userinput>casesensitive</userinput>, anahtar sözcüklerin BÜYÜK/küçük harf duyarlı olup olmadığını tanımlar.

source: <userinput>priority</userinput> is necessary if another highlight definition file uses the same extensions. The higher priority will win.
tr: <userinput>priority</userinput>, başka bir vurgu tanım dosyası aynı uzantıları kullanıyorsa gereklidir. Daha yüksek öncelik kazanır.

source: <userinput>author</userinput> contains the name of the author and his email-address.
tr: <userinput>author</userinput>, yazarın adını ve e-posta adresini içerir.

source: <userinput>license</userinput> contains the license, usually the MIT license for new syntax-highlighting files.
tr: <userinput>license</userinput>, lisansı içerir. Yeni sözdizim vurgulama dosyaları için genelde MIT lisansıdır.

source: <userinput>style</userinput> contains the provided language and is used by the indenters for the attribute <literal>required-syntax-style</literal>.
tr: <userinput>style</userinput>, sağlanan dili içerir ve <literal>required-syntax-style</literal> özniteliği için olan girintileyiciler tarafından kullanılır.

source: <userinput>indenter</userinput> defines which indenter will be used by default. Available indenters are: <emphasis>ada, normal, cstyle, cmake, haskell, latex, lilypond, lisp, lua, pascal, python, replicode, ruby</emphasis> and <emphasis>xml</emphasis>.
tr: <userinput>indenter</userinput>, öntanımlı olarak hangi girintileyicinin kullanılacağını tanımlar. Kullanılabilir girintileyiciler: <emphasis>ada, normal, cstyle, cmake, haskell, latex, lilypond, lisp, lua, pascal, python, replicode, ruby</emphasis> ve <emphasis>xml</emphasis>.
