Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_part.po
Languages: tr

source: To replace text, launch the power search and replace bar using the <menuchoice><guimenu>Edit</guimenu> <guimenuitem>Replace</guimenuitem></menuchoice> command, or the <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> shortcut.
tr: Metni değiştirmek için <menuchoice><guimenu>Düzen</guimenu> <guimenuitem>Değiştir</guimenuitem></menuchoice> menü ögesini veya <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> kısayolunu kullanarak gelişmiş arama çubuğunu başlatın.

source: On the upper left side of the bar is a button with an icon to close the bar, followed by a small combo box for entering the search pattern. The box remembers recently used patterns.
tr: Çubuğun sol üst tarafında, çubuğu kapatmak için bir simge bulunan bir düğme ve ardından arama dizgisini girmek için küçük bir birleşik giriş kutusu bulunur. Kutu, son kullanılan dizgileri anımsar.

source: You can control the search mode by selecting the options <guilabel>Plain Text</guilabel>, <guilabel>Whole Words</guilabel>, <guilabel>Escape Sequences</guilabel> or <guilabel>Regular Expression</guilabel> from the drop down box.
tr: Arama kipini, açılır kutudan <guilabel>Düz metin</guilabel>, <guilabel>Tam sözcükler</guilabel>, <guilabel>Kaçış dizileri</guilabel> veya <guilabel>Düzenli ifade</guilabel> seçeneklerini kullanarak denetleyebilirsiniz.

source: If <guilabel>Escape sequences</guilabel> or <guilabel>Regular expression</guilabel> are selected, the <guibutton>Add...</guibutton> menuitem at the bottom of the context menu of the text boxes will be enabled and allows you to add escape sequences or regular expression items to the search or replace pattern from predefined lists.
tr: <guilabel>Kaçış dizileri</guilabel> veya <guilabel>Düzenli ifade</guilabel> seçilirse metin kutularının bağlam menüsünün altında bulunan <guibutton>Ekle…</guibutton> düğmesi etkinleştirilir ve ara ve değiştir dizgilerine önceden tanımlanan listelerden kaçış dizileri veya düzenli ifade ögeleri eklemenize olanak tanır.

source: Enter the text to replace with in the text box labeled <guilabel>Replace</guilabel> and click the <guibutton>Replace</guibutton> button to replace only the highlighted text or the <guibutton>Replace All</guibutton> button to replace the search text in the whole document.
tr: <guilabel>Değiştir</guilabel> etiketli metin kutusuna değiştirilecek metni girin ve yalnızca vurgulanan metni değiştirmek için <guibutton>Değiştir</guibutton> düğmesini veya tüm belgedeki arama metnini değiştirmek için <guibutton>Tümünü Değiştir</guibutton> düğmesine tıklayın.

source: You can modify the search and replace behavior by selecting different options at the bottom of the bar. Selecting <inlinemediaobject><imageobject><imagedata fileref="format-text-superscript-22.png" format="PNG"/></imageobject></inlinemediaobject> will limit finds to entries that match the case (upper or lower) of each of the characters in the search pattern. <inlinemediaobject><imageobject><imagedata fileref="edit-select-all-22.png" format="PNG"/></imageobject></inlinemediaobject> will search and replace within the current selection only. The <guilabel>Find All</guilabel> button highlights all matches in the document and shows the number of found matches in a small popup.
tr: Çubuğun altındaki bölümden değişik seçenekler seçerek ara ve değiştir davranışını değiştirebilirsiniz. <inlinemediaobject><imageobject><imagedata fileref="format-text-superscript-22.png" format="PNG"/></imageobject></inlinemediaobject> seçmek, aramayı BÜYÜK/küçük harf eşleşen girdilere sınırlar. <inlinemediaobject><imageobject><imagedata fileref="edit-select-all-22.png" format="PNG"/></imageobject></inlinemediaobject>, yalnızca geçerli seçimde ara ve değiştir yapar. <guilabel>Tümünü Bul</guilabel> düğmesi, belgedeki tüm eşleşmeleri vurgular ve küçük bir açılır pencerede bulunan eşleşme sayısını görüntüler.

source: Click on the <inlinemediaobject><imageobject><imagedata fileref="configure-shortcuts-22.png" format="PNG"/></imageobject></inlinemediaobject> button at the right side of the power search and replace bar to switch to the incremental search bar.
tr: Artımlı arama çubuğuna geçmek için gelişmiş arama çubuğunun sağ tarafındaki <inlinemediaobject><imageobject><imagedata fileref="configure-shortcuts-22.png" format="PNG"/></imageobject></inlinemediaobject> düğmesine tıklayın.

source: If you are using a regular expression to find the text to replace, you can employ backreferences to reuse text captured in parenthesized subpatterns of the expression.
tr: Değiştirilecek metni bulmak için düzenli bir ifade kullanıyorsanız ifadenin parantez içindeki alt dizgilerinde yakalanan metni yeniden kullanmak için geriye başvurulardan yararlanabilirsiniz.

source: See <link linkend="regular-expressions">Regular Expressions</link> for more on those.
tr: Bu konu hakkında daha fazla bilgi için <link linkend="regular-expressions">Düzenli İfadeler</link> bölümüne bakın.

source: You can do <command>find</command>, <command>replace</command> and <command>ifind</command> (incremental search) from the <link linkend="advanced-editing-tools-commandline">command line</link>.
tr: <link linkend="advanced-editing-tools-commandline">Komut satırından</link> <command>find</command> (bul), <command>replace</command> (değiştir) ve <command>ifind</command> (artımlı arama) yapabilirsiniz.

source: <title>Using Bookmarks</title>
tr: <title>Yer İmlerini Kullanmak</title>

source: The bookmarks feature allows you to mark certain lines, to be able to easily find them again.
tr: Yer imleri özelliği, belirli satırları imlemenize ve bunları yeniden kolayca bulabilmenize olanak tanır.

source: You can set or remove a bookmark in a line in two ways:
tr: Bir satırdaki yer imini iki yolla koyabilir veya kaldırabilirsiniz:

source: Move the insertion cursor to the line and activate the <menuchoice><guimenu>Bookmarks</guimenu><guimenuitem>Set Bookmark</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo>) command.
tr: Ekleme imlecini satıra götürün ve <menuchoice><guimenu>Yer İmleri</guimenu><guimenuitem>Yer İmi Koy</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo>) komutunu kullanın.

source: Click in the Icon Border next to the line.
tr: Satırın yanındaki simge kenarlığına tıklayın.

source: Bookmarks are available in the <guimenu>Bookmarks</guimenu> menu. The individual bookmarks are available as menu items, labeled with the line number of the line with the bookmark, and the first few characters of the text in the line. To move the insertion cursor to the beginning of a bookmarked line, open the menu and select the bookmark.
tr: Yer imleri, <guimenu>Yer İmleri</guimenu> menüsünden kullanılabilir. Bireysel yer imleri, yer iminin bulunduğu satırın satır numarasıyla ve satırdaki metnin ilk birkaç karakteriyle etiketlenmiş menü ögeleri olarak bulunur. Ekleme imlecini, yer imi koyulmuş bir satırın başına taşımak için menüyü açın ve yer imini seçin.

source: To quickly move between bookmarks or to the next/previous bookmark, use the <menuchoice><guimenu>Bookmarks</guimenu><guimenuitem>Next</guimenuitem> </menuchoice> (<keycombo action="simul">&Alt;&PgDn;</keycombo>) or <menuchoice> <guimenu>Bookmarks</guimenu><guimenuitem>Previous</guimenuitem></menuchoice> (<keycombo action="simul">&Alt;&PgUp;</keycombo>) commands.
tr: Yer imleri arasında tez gezinmek veya önceki/sonraki yer imine gitmek için <menuchoice><guimenu>Yer İmleri</guimenu><guimenuitem>Sonraki</guimenuitem> </menuchoice> (<keycombo action="simul">&Alt;&PgDn;</keycombo>) veya <menuchoice> <guimenu>Yer İmleri</guimenu><guimenuitem>Önceki</guimenuitem></menuchoice> (<keycombo action="simul">&Alt;&PgUp;</keycombo>) komutlarını kullanın.

source: Automatically Wrapping text
tr: Metni Kendiliğinden Kaydırmak

source: This feature allows you to have the text formatted in a very simple way: the text will be wrapped, so that no lines exceed a maximum number of characters per line, unless there is a longer string of non-whitespace characters.
tr: Bu özellik, metni çok basit bir şekilde biçimlendirmenize olanak tanır: Metin kaydırılır, böylece boşluk olmayan karakterlerden oluşan daha uzun bir dizi olmadığı sürece hiçbir satır, satır başına en çok karakter sayısını aşmaz.

source: To enable/disable it, check/uncheck the <guibutton>Static Word Wrap</guibutton> checkbox in the <link linkend="pref-word-wrap">edit page</link> of the <link linkend="config-dialog">configuration dialog</link>.
tr: Etkinleştirmek veya devre dışı bırakmak için <link linkend="config-dialog">yapılandırma iletişim kutusundaki</link> <link linkend="pref-word-wrap">Düzenleme</link> sayfasından <guibutton>Durağan Sözcük Kaydırma</guibutton> onay kutusunu işaretleyin veya işaretini kaldırın.

source: To set the maximum line width (maximum characters per line), use the <link linkend="pref-wrap-words-at"><guibutton>Wrap Words At</guibutton></link> option in the <link linkend="pref-edit">Editing</link> page of the <link linkend="config-dialog">configuration dialog</link>.
tr: En büyük satır genişliğini ayarlamak için (satır başına en çok karakter) <link linkend="config-dialog">yapılandırma iletişim kutusundaki</link> <link linkend="pref-word-wrap">Düzenleme</link> sayfasından <link linkend="pref-wrap-words-at"><guibutton>Sözcükleri şurada kaydır</guibutton></link> seçeneğini kullanın.

source: If enabled, it has the following effects:
tr: Etkinleştirilirse şunlara neden olur:

source: While typing, the editor will automatically insert a hard line break after the last whitespace character at a position before the maximum line width is reached.
tr: Yazarken düzenleyici, en çok satır genişliğine ulaşılmadan önceki bir konuma, son boşluk karakterinden sonra kendiliğinden sabit bir satır sonu ekleyecektir.

source: While loading a document, the editor will wrap the text in a similar way, so that no lines are longer than the maximum line width, if they contain any whitespace allowing that.
tr: Bir belgeyi yüklerken düzenleyici, metni benzer şekilde kaydırır, böylece herhangi bir boşluk varsa hiçbir satır en büyük satır genişliğinden daha uzun olmayacaktır.

source: There is currently no way to set word wrap for document types, or even to enable or disable the feature on a per document level. This will be fixed in a future version of &kappname;.
tr: Şu anda belge türleri için sözcük kaydırmayı ayarlamanın, hatta özelliği belge başına etkinleştirmenin veya devre dışı bırakmanın bir yolu yoktur. Bu, &kappname;’in gelecekteki bir sürümünde düzeltilecektir.

source: <title>Using automatic indenting</title>
tr: <title>Kendiliğinden Girintilemeyi Kullanmak</title>

source: &kappname;s editor component supports a variety of autoindenting modes, designed for different text formats. You can pick from the available modes using the <menuchoice><guimenu>Tools</guimenu><guisubmenu>Indentation</guisubmenu></menuchoice> menu. The autoindent modules also provide a function <menuchoice><guimenu>Tools</guimenu><guimenuitem>Format Indentation</guimenuitem></menuchoice> which will recalculate the indentation of the selected or current line. Thus, you may reindent your entire document by selecting all the text and activating that action.
tr: &kappname;’in düzenleyici bileşeni, çeşitli metin biçimleri için tasarlanan birçok kendiliğinden girintileme aracını destekler. <menuchoice><guimenu>Araçlar</guimenu><guisubmenu>Girintileme</guisubmenu></menuchoice> menüsünden kullanılabilir kipleri seçebilirsiniz. Kendiliğinden girintileme modülleri ayrıca, seçili veya geçerli satırın girintilemesini yeniden hesaplayan bir <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Girintilemeyi Biçimlendir</guimenuitem></menuchoice> işlevine sahiptir. Böylece, metni seçip bu eylemi etkinleştirerek tüm belgenizi yeniden girintileyebilirsiniz.

source: All the indent modes use the indentation related settings in the active document.
tr: Tüm girinti kipleri, etkin belgedeki girintilemeyle ilgili ayarları kullanır.

source: You can set all sorts of configuration variables, including those related to indentation using <link linkend="config-variables">Document Variables</link> and <link linkend="pref-open-save-modes-filetypes">File types</link>.
tr: Girintilemeyle ilgili her tür yapılandırma değişkenini <link linkend="config-variables">Belge Değişkenleri</link> ve <link linkend="pref-open-save-modes-filetypes">Dosya Türleri</link> kullanarak ayarlayabilirsiniz.

source: Available Autoindent Modes
tr: Kullanılabilir Kendiliğinden Girintileme Kipleri

source: None
tr: Yok

source: Selecting this mode turns automatic indenting off entirely.
tr: Bu kipi seçmek kendiliğinden girintilemeyi tümüyle kapatır.

source: This indenter simply keeps the indentation similar to the previous line with any content other than whitespace. You can combine this with using the indent and unindent actions for indenting to your own taste.
tr: Bu girinti, boşluk dışındaki herhangi bir içerikteki girintiyi önceki satıra benzer şekilde tutar. Bunu, kendi zevkinize göre girinti yapmak için girintileme ve girintiyi kaldırma eylemlerini kullanarak birleştirebilirsiniz.

source: C Style
tr: C Tarzı

source: An indenter for C and similar languages, such as C++, C#, &Java;, &javascript; and so on. This indenter will not work with scripting languages such as Perl or PHP.
tr: C ve benzeri diller (C++, C#, &Java;, &javascript; vb.) için bir girintileyici. Bu girintileyici, Perl veya PHP gibi betik yazımı dilleriyle çalışmaz.

source: An indenter for the functional programming language Haskell.
tr: İşlevsel programlama dili Haskell için bir girintileyici.

source: An indenter for the Lilypond notation language for music.
tr: Müzik simgelemi yazım dili Lilypond için bir girintileyici.

source: An indenter specifically for the Lisp scripting language and Lisp dialects.
tr: Özellikle Lisp betik yazımı dili ve Lisp lehçeleri için bir girintileyici.

source: An indenter specifically for the python scripting language.
tr: Python betik yazımı dili için özel girintileyici.

source: XML Style
tr: XML Tarzı

source: An indenter specifically for XML like languages.
tr: XML benzeri diller için özel bir girintileyici.

source: Line Modification Indicators
tr: Satır Değişiklik Göstergeleri

source: &kappname;'s line modification indicators let you easily see what you have recently changed in a file. By default, saved changes are indicated by a green bar to the left of a document, while unsaved changes are indicated by an orange bar.
tr: &kappname;’in satır değişikliği göstergeleri, bir dosyada en son neleri değiştirdiğinizi kolayca görmenizi sağlar. Öntanımlı olarak, kaydedilen değişiklikler belgenin solundaki yeşil bir çubukla gösterilirken, kaydedilmemiş değişiklikler turuncu bir çubukla gösterilir.

source: Line Modification Indicators in action.
tr: Satır Değişiklik Göstergeleri kullanılırken.

source: You can change the colors used in the <link linkend="prefcolors"><guilabel>Fonts &amp; Colors</guilabel> configuration panel</link>, or you can disable this feature completely in the <link linkend="appearance-borders"><guilabel>Borders</guilabel> tab of the <guilabel>Appearance</guilabel> configuration panel</link>.
tr: Kullanılan renkleri, <link linkend="prefcolors"><guilabel>Yazıtipleri ve Renkler</guilabel> yapılandırma panelinden</link> değiştirebilir veya bu özelliği <guilabel>Appearance</guilabel> yapılandırma panelinin <link linkend="appearance-borders"><guilabel>Kenarlıklar</guilabel> sekmesinden devre dışı bırakabilirsiniz</link>.

source: The Scrollbar Minimap
tr: Sarma Çubuğu Mini Haritası

source: &kappname;'s Scrollbar Minimap displays a preview of documents in place of the scrollbar. The currently visible portion of the document is highlighted.
tr: &kappname;’in Sarma Çubuğu Mini Haritası, sarma çubuğu yerine belgenin önizlemesini görüntüler. Belgenin o anda görünen kısmı vurgulanır.

source: The Scrollbar Minimap shows a preview of the &kate; source code.
tr: Sarma Çubuğu Mini Haritası, &kate; kaynak kodunun bir önizlemesini gösterirken.

source: You can temporarily enable or disable the minimap by selecting <menuchoice><guimenu>View</guimenu><guimenuitem>View Scrollbar Minimap</guimenuitem></menuchoice> or permanently in <link linkend="appearance-borders">the Appearance section of &kappname;'s configuration</link>.
tr: <menuchoice><guimenu>Görünüm</guimenu><guimenuitem>Sarma Çubuğu Mini Haritası</guimenuitem></menuchoice> menü ögesini seçerek veya &kappname; yapılandırmasının <link linkend="appearance-borders">Görünüş</link> bölümünden kalıcı olarak etkinleştirebilir veya devre dışı bırakabilirsiniz.

source: Multiple cursors
tr: Çoklu İmleçler

source: Multiple cursor support was introduced with version 5.93 of katepart.
tr: Çoklu imleç desteği, katepart 5.93 sürümünde eklendi.

source: Creating multiple cursors
tr: Birden çok imleç oluşturmak

source: To create them via mouse, use &Alt; + &LMB;. The modifier is configurable, see <link linkend="multicursor-modifier-configure">Configure multicursor modifier</link>
tr: Onları oluşturmak için &Alt; + &LMB; kullanın. Niteleyici kombinasyon yapılandırılabilirdir; <link linkend="multicursor-modifier-configure">Çoklu imleç niteleyicisini yapılandırmak</link> bölümüne bakın

source: To create via keyboard, press <keycombo action="simul">&Ctrl;&Alt;&Up;</keycombo> to create cursor above primary cursor and <keycombo action="simul">&Ctrl;&Alt;&Down;</keycombo> to create cursor below. These shortcuts are also configurable
tr: Klavyeyle birincil imlecin üstünde oluşturmak için <keycombo action="simul">&Ctrl;&Alt;&Up;</keycombo>, altında oluşturmak için <keycombo action="simul">&Ctrl;&Alt;&Down;</keycombo> kısayollarını kullanın. Bu kısayollar yapılandırılabilirdir

source: To create cursors out of a selection, first select some text and then press <keycombo action="simul">&Shift;&Alt;<keycap>I</keycap></keycombo>. This will create a cursor at the end of each line in selection.
tr: Bir seçimden imleçler oluşturmak için önce biraz metin seçin ve sonrasında <keycombo action="simul">&Shift;&Alt;<keycap>I</keycap></keycombo> kısayolunu kullanın. Bu, seçimdeki her bir satırın sonunda bir imleç oluşturacaktır.

source: Use <keycombo action="simul">&Alt;<keycap>J</keycap></keycombo> to find the next occurrence of the word under cursor and select it + create a cursor. If you want to skip the current word under cursor, press <keycombo action="simul">&Alt;<keycap>K</keycap></keycombo> and it will mark the currently selected word as skipped. When you press <keycombo action="simul">&Alt;<keycap>J</keycap></keycombo> again it will unselect the current word and move to the next word.
tr: İmlecin altındaki sözcüğün bir sonraki oluşunu bulmak için <keycombo action="simul">&Alt;<keycap>J</keycap></keycombo> kısayolunu kullanın ve onu seçin, sonrasında bir imleç oluşturun. İmleç altındaki geçerli sözcüğü atlamak istiyorsanız <keycombo action="simul">&Alt;<keycap>K</keycap></keycombo> kısayolunu kullanın ve bu, geçerli seçili sözcüğü atlanmış olarak imler. <keycombo action="simul">&Alt;<keycap>J</keycap></keycombo> kısayoluna yeniden basarsanız geçerli sözcüğün seçimini kaldırır ve sonraki sözcüğe geçer.

source: Use <keycombo action="simul">&Ctrl;&Alt;&Shift;<keycap>J</keycap></keycombo> to find all occurrences of the word under cursor and select them with a cursor at the end of each selection. You can use <keycombo action="simul">&Alt;<keycap>J</keycap></keycombo> to cycle through the selected words and use <keycombo action="simul">&Alt;<keycap>K</keycap></keycombo> to unselect any word as mentioned in the previous paragraph.
tr: İmlecin altındaki sözcüğün tüm oluşlarını bulmak için <keycombo action="simul">&Ctrl;&Alt;&Shift;<keycap>J</keycap></keycombo> kısayolunu kullanın ve bunları her seçimin sonunda imleçle seçin. Seçili sözcükler arasında geçiş yapmak için <keycombo action="simul">&Alt;<keycap>J</keycap></keycombo> kullanabilir ve önceki paragrafta belirtildiği gibi herhangi bir kelimenin seçimini kaldırmak için <keycombo action="simul">&Alt;<keycap>K</keycap></keycombo> kısayolunu kullanabilirsiniz.

source: Working with multiple cursors
tr: Birden çok imleçle çalışmak

source: Once you have created a few cursors, you can perform most of the editing operations on them as you would on a single cursor. For example, typing a letter will type it for each cursor. Similarly you can perform text transforms &eg;, capitalization for all the positions or selections.
tr: Birkaç imleç oluşturduğunuzda, tek bir imleçte yaptığınız gibi düzenleme işlemlerinin çoğunu bunlar üzerinde gerçekleştirebilirsiniz. Örneğin, bir harf yazmak, her imleç için o harfi yazacaktır. Benzer şekilde metin dönüşümleri gerçekleştirebilirsiniz; örneğin tüm pozisyonlar veya seçimler için büyük harf kullanımı gibi.

source: Sometimes you will want to remove cursors. To do so, you can &Alt; + &LMB; on the cursor that you want to remove. If you just want to remove cursors on lines that are empty, there is a ready-made action for it that will do it for you. To invoke the action, open the Command Bar using <keycombo action="simul">&Ctrl;&Alt;<keycap>I</keycap></keycombo> and look for <guimenuitem>Remove cursors from empty lines</guimenuitem> and hit &Enter;. You can also configure a shortcut for this action.
tr: Bazen imleçleri kaldırmak isteyeceksiniz. Bunu yapmak için kaldırmak istediğiniz imlecin üzerinde &Alt;+&LMB; kullanın. Yalnızca boş satırlardaki imleçleri kaldırmak istiyorsanız bunu sizin için yapacak bir işlev bulunur. Eylemi başlatmak için <keycombo action="simul">&Ctrl;&Alt;<keycap>I</keycap></keycombo> kullanarak Komut Çubuğu’nu açın ve <guimenuitem>Boş satırlardan imleçleri kaldır</guimenuitem> ögesini arayın ve &Enter;’a basın. Ayrıca bu eylem için bir kısayol da yapılandırabilirsiniz.
