Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_menus.po
Languages: tr

source: The Menu Entries
tr: Menü Girdileri

source: The File Menu
tr: Dosya Menüsü

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Yeni</guimenuitem>

source: This command <action>starts a new document</action> in the editing window. In the <guibutton>Documents</guibutton> list on the left the new file is named <emphasis>Untitled</emphasis>.
tr: Bu komut, düzenleme penceresinde <action>yeni bir belge başlatır</action>. Yeni dosya, soldaki <guibutton>Belgeler</guibutton> listesinde <emphasis>Adsız</emphasis> olarak görünür.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Aç…</guimenuitem>

source: Displays a standard &kde; <guilabel>Open File</guilabel> dialog. Use the file view to select the file you want to open, and click on <guibutton>Open</guibutton> to open it.
tr: Standart bir &kde; <guilabel>Dosya Aç</guilabel> iletişim kutusu görüntüler. Açmak istediğiniz dosyayı seçmek için dosya görünümünü kullanın ve açmak için <guibutton>Aç</guibutton>’a tıklayın.

source: <guimenu>File</guimenu> <guisubmenu>Open Recent</guisubmenu>
tr: <guimenu>Dosya</guimenu> <guisubmenu>Son Kullanılanı Aç</guisubmenu>

source: This is a shortcut to open recently saved documents. Clicking on this item opens a list to the side of the menu with several of the most recently saved files. Clicking on a specific file will open it in &kappname; - if the file still resides at the same location.
tr: Bu, yakın zamanda kaydedilen belgeleri açmak için kullanılan bir kısayoldur. Bu ögeye tıklamak, menünün yanında en son kaydedilen dosyalardan birkaçını içeren bir liste açar. Belirli bir dosyaya tıklamak dosya hâlâ aynı konumdaysa onu &kappname; ile açar.

source: <guimenu>File</guimenu> <guisubmenu>Open With</guisubmenu>
tr: <guimenu>Dosya</guimenu> <guisubmenu>Birlikte Aç</guisubmenu>

source: This submenu presents a list of applications known to handle the &MIME; type of your current document. Activating an entry will open the current document with that application.
tr: Bu alt menü, geçerli belgenizin &MIME; türünü işlediği bilinen uygulamaların bir listesini sunar. Bir girdinin etkinleştirilmesi, geçerli belgenin o uygulamayla açılmasını sağlar.

source: In addition, an entry <guimenuitem>Other...</guimenuitem> launches the open with dialog box that allows you to <action>select another application to open the active file</action>. Your file will still be open in &kate;.
tr: Ek olarak, bir <guimenuitem>Diğer…</guimenuitem> girdisi, etkin dosyayı açmak için <action>başka bir uygulama seçmenize olanak veren</action> Birlikte Aç iletişim kutusunu açar. Dosyanız hâlâ &kate;’de açık olacaktır.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Kaydet</guimenuitem>

source: This saves the current document. If there has already been a save of the document then this will overwrite the previously saved file without asking for the user's consent. If it is the first save of a new document the save as dialog (described below) will be invoked.
tr: Bu, geçerli belgeyi kaydeder. Belge halihazırda kaydedilmişse kullanıcının izni istenmeden önceden kaydedilen dosyanın üzerine yazılır. Yeni bir belgenin ilk kaydı ise farklı kaydet iletişim kutusu (aşağıda açıklanmıştır) çağrılacaktır.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save As...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Farklı Kaydet…</guimenuitem>

source: This allows a document to be saved with a new file name. This is done by means of the file dialog box described above in the <link linkend="file-open">Open</link> section of this help file.
tr: Bu, belgenin yeni bir dosya adıyla kaydedilmesine olanak tanır. Bu, yukarıda bu yardım dosyasının <link linkend="file-open">Aç</link> bölümünde açıklanan dosya iletişim kutusu aracılığıyla yapılır.

source: <guimenu>File</guimenu> <guimenuitem>Save As with Encoding</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Kodlamayla Farklı Kaydet</guimenuitem>

source: Save a document with a new file name in a different encoding.
tr: Belgeyi yeni bir dosya adıyla farklı bir kodlamayla kaydedin.

source: <guimenu>File</guimenu> <guimenuitem>Save Copy As</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Kopyayı Farklı Kaydet</guimenuitem>

source: Save a copy of the document with a new file name and continue editing the original document.
tr: Belgenin bir kopyasını yeni bir dosya adıyla kaydedin ve özgün belgeyi düzenlemeyi sürdürün.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save All</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Tümünü Kaydet</guimenuitem>

source: This command <action>saves all modified open files</action>.
tr: Bu komut, <action>değiştirilen tüm açık dosyaları kaydeder</action>.

source: <shortcut> <keycombo action="simul"><keycap>F5</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Reload</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>F5</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Yeniden Yükle</guimenuitem>

source: Reloads the active file from disk. This command is useful if another program or process has changed the file while you have it open in &kappname;.
tr: Etkin dosyayı diskten yeniden yükler. Bu komut, dosyayı &kappname; ile açıkken başka bir program veya işlem değiştirmişse kullanışlıdır.

source: <guimenu>File</guimenu> <guimenuitem>Reload All</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Tümünü Yeniden Yükle</guimenuitem>

source: <action>Reloads all opened files.</action>.
tr: <action>Tüm açık dosyaları yeniden yükler.</action>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Print...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Yazdır…</guimenuitem>

source: Opens a simple print dialog allowing the user to specify what, where, and how to print.
tr: Kullanıcının neyi, nerede ve nasıl yazdıracağını belirlemesine olanak tanıyan basit bir yazdırma iletişim kutusu açar.

source: <guimenu>File</guimenu> <guimenuitem>Export as HTML</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>HTML Olarak Dışa Aktar</guimenuitem>

source: Save the currently open document as an &HTML; file, which will be formatted using the current syntax highlighting and color scheme settings.
tr: Şu anda açık olan belgeyi, geçerli sözdizim vurgulama ve renk şeması ayarları kullanılarak biçimlendirilecek bir &HTML; dosyası olarak kaydedin.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Close</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Kaydet</guimenuitem>

source: Close the active file with this command. If you have made unsaved changes, you will be prompted to save the file before &kate; closes it.
tr: Etkin dosyayı bu komutla kapatın. Kaydedilmemiş değişiklikler yaptıysanız &kate; dosyayı kapatmadan önce dosyayı kaydetmeniz istenecektir.

source: <guimenu>File</guimenu> <guimenuitem>Close Other</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Diğerlerini Kapat</guimenuitem>

source: Close other open documents.
tr: Diğer açık belgeleri kapatın.

source: <guimenu>File</guimenu> <guimenuitem>Close All</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Tümünü Kapat</guimenuitem>

source: This command <action>closes all the files you have open</action> in &kate;.
tr: Bu komut, &kate;’de <action>açtığınız tüm dosyaları kapatır</action>.

source: <guimenu>File</guimenu> <guimenuitem>Close Orphaned</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Terk Edilmişi Kapat</guimenuitem>

source: <action>Close</action> all documents in the file list, which could not be reopened during startup, because they are not accessible anymore.
tr: Dosya listesindeki, artık erişilebilir olmadıkları için başlatma sırasında yeniden açılamayan tüm belgeleri <action>kapatın</action>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Çık</guimenuitem>

source: This command <action>closes &kate;</action> and any files you were editing. If you have made unsaved changes to any of the files you were editing, you will be prompted to save them.
tr: Bu komut, <action>&kate;’i ve düzenlediğiniz tüm dosyaları kapatır</action>. Düzenlediğiniz dosyalardan herhangi birinde kaydedilmemiş değişiklikler yaptıysanız bunları kaydetmeniz istenecektir.

source: The Edit Menu
tr: Düzen Menüsü

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Geri Al</guimenuitem>

source: Undo the last editing command (typing, copying, cutting &etc;)
tr: Son düzenleme komutunu geri alın (yazma, kopyalama, kesme &etc;)

source: This may undo several editing commands of the same type, like typing in characters.
tr: Bu, karakterlerin yazılması gibi aynı türden birkaç düzenleme komutunun geri alınmasına neden olabilir.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Redo</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Yinele</guimenuitem>

source: This will reverse the most recent change (if any) made using Undo.
tr: Bu, Geri Al kullanılarak yapılan en son değişikliği (varsa) tersine çevirir.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Cut</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Kes</guimenuitem>

source: This command deletes the current selection and places it on the clipboard. The clipboard works invisibly and provides a way to transfer data between applications.
tr: Bu komut geçerli seçimi siler ve panoya yerleştirir. Pano görünmez bir şekilde çalışır ve uygulamalar arasında veri aktarımı için bir yol sağlar.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Kopyala</guimenuitem>

source: This copies the currently selected text to the clipboard so that it may be pasted elsewhere. The clipboard works invisibly and provides a way to transfer data between applications.
tr: Bu, o anda seçili olan metni başka bir yere yapıştırılabilmesi için panoya kopyalar. Pano görünmez bir şekilde çalışır ve uygulamalar arasında veri aktarımı için bir yol sağlar.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Yapıştır</guimenuitem>

source: This will insert the first item in the clipboard at the cursor position. The clipboard works invisibly and provides a way to transfer data between applications.
tr: Bu, panodaki ilk öğeyi imleç konumuna yerleştirir. Pano görünmez bir şekilde çalışır ve uygulamalar arasında veri aktarımı için bir yol sağlar.

source: If Overwrite Selection is enabled, the pasted text will overwrite the selection, if any.
tr: Seçimin Üzerine Yaz etkinleştirilirse yapıştırılan metin, varsa seçimin üzerine yazılır.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;&Ins;</keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste Selection</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;&Ins;</keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Seçimi Yapıştır</guimenuitem>

source: This will paste the <ulink url="https://en.wikipedia.org/wiki/Clipboard_(computing)#X_Window_System">mouse selection</ulink> contents that were chosen previously. Mark some text with the mouse pointer to paste it in the currently open file using this menu item.
tr: Bu, daha önce seçilmiş olan <ulink url="https://en.wikipedia.org/wiki/Clipboard_(computing)#X_Window_System">fare seçimi</ulink> içeriğini yapıştırır. Bu menü ögesini kullanarak, o anda açık olan dosyaya yapıştırmak için fare işaretçisiyle bir metni işaretleyin.

source: <guimenu>Edit</guimenu> <guimenuitem>Swap with clipboard contents</guimenuitem>
tr: <guimenu>Düzen</guimenu> <guimenuitem>Pano İçeriği ile Değiştir</guimenuitem>

source: This will swap the selected text with the <ulink url="https://en.wikipedia.org/wiki/Clipboard_(computing)#X_Window_System">clipboard</ulink> contents.
tr: Bu, seçili metni <ulink url="https://en.wikipedia.org/wiki/Clipboard_(computing)#X_Window_System">pano</ulink> içeriğiyle değiştirir.

source: <guimenu>Edit</guimenu> <guisubmenu>Clipboard History</guisubmenu>
tr: <guimenu>Düzen</guimenu> <guisubmenu>Pano Geçmişi</guisubmenu>

source: This submenu will display the beginning of portions of text recently copied to the clipboard. Select an item from this menu to paste it in the currently open file.
tr: Bu alt menü, yakın zamanda panoya kopyalanan metin bölümlerinin başlangıcını görüntüler. Şu anda açık olan dosyaya yapıştırmak için bu menüden bir öge seçin.

source: <guimenu>Edit</guimenu> <guimenuitem>Copy as HTML</guimenuitem>
tr: <guimenu>Düzen</guimenu> <guimenuitem>HTML Olarak Kopyala</guimenuitem>

source: Copy the selection as &HTML;, formatted using the current syntax highlighting and color scheme settings.
tr: Seçimi, geçerli sözdizim vurgulama ve renk şeması ayarları kullanılarak biçimlendirilecek &HTML; olarak kopyalayın.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Select All</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Tümünü Seç</guimenuitem>

source: This will select the entire document. This could be very useful for copying the entire file to another application.
tr: Bu, belgenin tamamını seçer. Bu, dosyanın tümünü başka bir uygulamaya kopyalamak için çok yararlı olabilir.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Deselect</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Seçimi Kaldır</guimenuitem>

source: Deselects the selected text in the editor if any.
tr: Varsa düzenleyicide seçili metnin seçimini kaldırır.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Block Selection Mode</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Blok Seçim Kipi</guimenuitem>

source: Toggles Selection Mode. When the Selection Mode is <guilabel>BLOCK</guilabel>, the status bar contains the string <guilabel>[BLOCK]</guilabel> and you can make vertical selections, &eg; select column 5 to 10 in lines 9 to 15.
tr: Seçim Kipi’ni açar/kapatır. Seçim Kipi <guilabel>BLOK</guilabel> olduğunda, durum çubuğu <guilabel>[BLOK]</guilabel> dizisini içerir ve dikey seçimler yapabilirsiniz; &eg;, 9’dan 15’e kadar olan satırlarda 5’ten 10’a kadar olan sütunları seçebilirsiniz.

source: <guimenu>Edit</guimenu> <guimenuitem>Input Modes</guimenuitem>
tr: <guimenu>Düzen</guimenu> <guimenuitem>Giriş Kipleri</guimenuitem>

source: Switch between a normal and a vi-like, modal editing mode. The vi input mode supports the most used commands and motions from vim's normal and visual mode and has an optional vi mode statusbar. This status bar shows commands while they are being entered, output from commands and the current mode. The behavior of this mode can be configured in the <ulink url="help:/katepart/config-dialog-editor.html#pref-edit-vi-input-mode">Vi Input Mode</ulink> section of the <guilabel>Editing</guilabel> page in &kappname;'s settings dialog.
tr: Normal ve vi benzeri kipsel düzenleme kipi arasında geçiş yapın. Vi giriş kipi, Vim’in normal ve görsel modundan en çok kullanılan komutları ve hareketleri destekler ve isteğe bağlı bir Vi kipi durum çubuğuna sahiptir. Bu durum çubuğu, girilirken komutları, komutlardan çıktıyı ve geçerli kipi gösterir. Bu kipin davranışı &kappname;’in ayarlar iletişim kutusundaki <guilabel>Düzenleme</guilabel> sayfasının <ulink url="help:/katepart/config-dialog-editor.html#pref-edit-vi-input-mode">Vi Giriş Kipi</ulink> bölümünde yapılandırılabilir.

source: <shortcut> <keycombo action="simul"><keycap>Ins</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Overwrite Mode</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>Ekle</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Üzerine Yazma Kipi</guimenuitem>

source: Toggles the Insert/Overwrite modes. When the mode is <guilabel>INS</guilabel>, you insert characters where the cursor is. When the mode is <guilabel>OVR</guilabel>, writing characters will replace the current characters if your cursor is positioned before any character. The status bar shows the current state of the Overwrite Mode, either <guilabel>INS</guilabel> or <guilabel>OVR</guilabel>.
tr: Ekle/Üzerine Yaz kiplerini açar/kapatır. Kip <guilabel>EKLE</guilabel> iken karakterleri imlecin olduğu yere eklersiniz. Kip <guilabel>ÜZERİNE YAZ</guilabel> iken, yazdığınız karakterler imleciniz herhangi bir karakterden önce konumlandıysa var olan karakterlerin yerine geçer. Durum çubuğu, ya <guilabel>EKLE</guilabel> ya da <guilabel>ÜZERİNE YAZ</guilabel> olacak şekilde Üzerine Yazma Kipi’nin geçerli durumunu gösterir.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Bul…</guimenuitem>

source: This opens the incremental search bar at the bottom of the editor window. On the left side of the bar is a button with an icon to close the bar, followed by a small text box for entering the search pattern.
tr: Bu, düzenleyici penceresinin altındaki artımlı arama çubuğunu açar. Çubuğun sol tarafında, çubuğu kapatmak için bir simgenin bulunduğu bir düğme ve ardından arama dizgisini girmek için küçük bir metin kutusu bulunur.

source: When you start entering characters of your search pattern, the search starts immediately. If there is a match in the text this is highlighted and the background color of the entry field changes to light green. If the search pattern does not match any string in the text, this is indicated by a light red background color of the entry field.
tr: Arama dizginizin karakterlerini girmeye başladığınızda arama hemen başlar. Metinde bir eşleşme varsa bu vurgulanır ve giriş alanının arka plan rengi açık yeşile döner. Arama modeli metindeki herhangi bir diziyle eşleşmiyorsa bu durum giriş alanının açık kırmızı arka plan rengiyle gösterilir.

source: Use the <inlinemediaobject><imageobject><imagedata fileref="arrow-up-double-22.png" format="PNG"/></imageobject></inlinemediaobject> or <inlinemediaobject><imageobject><imagedata fileref="arrow-down-double-22.png" format="PNG"/></imageobject></inlinemediaobject> button to jump to the next or previous match in the document.
tr: Belgedeki önceki veya sonraki eşleşmeye atlamak için <inlinemediaobject><imageobject><imagedata fileref="arrow-up-double-22.png" format="PNG"/></imageobject></inlinemediaobject> veya <inlinemediaobject><imageobject><imagedata fileref="arrow-down-double-22.png" format="PNG"/></imageobject></inlinemediaobject> düğmelerini kullanın.

source: Matches in the document are highlighted even when you close the search bar. To clear this highlighting, press the &Esc; key.
tr: Arama çubuğunu kapattığınızda bile belgedeki eşleşmeler vurgulanır. Bu vurgulamayı temizlemek için &Esc; düğmesine basın.

source: You can choose whether the search should be case sensitive. Selecting <inlinemediaobject><imageobject><imagedata fileref="format-text-superscript-22.png" format="PNG"/></imageobject></inlinemediaobject> will limit finds to entries that match the case (upper or lower) of each of the characters in the search pattern.
tr: Aramanın BÜYÜK/küçük harf duyarlı olup olmayacağını seçebilirsiniz. <inlinemediaobject><imageobject><imagedata fileref="format-text-superscript-22.png" format="PNG"/></imageobject></inlinemediaobject> seçmek, arama dizgisindeki karakterlerin her birini BÜYÜK/küçük harf durumuyla (BÜYÜK veya küçük) eşleşen girdileri bulmaya sınırlayacaktır.

source: Click on the <inlinemediaobject><imageobject><imagedata fileref="configure-shortcuts-22.png" format="PNG"/></imageobject></inlinemediaobject> button at the right side of the incremental search bar to switch to the power search and replace bar.
tr: Güçlü arama ve değiştirme çubuğuna geçmek için artımlı arama çubuğunun sağ tarafındaki <inlinemediaobject><imageobject><imagedata fileref="configure-shortcuts-22.png" format="PNG"/></imageobject></inlinemediaobject> düğmesine tıklayın.

source: <shortcut> <keycombo action="simul"><keycap>F3</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guisubmenu>Find Variants</guisubmenu> <guimenuitem>Find Next</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>F3</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guisubmenu>Benzerlerini Bul</guisubmenu> <guimenuitem>Sonrakini Bul</guimenuitem>

source: This repeats the last find operation, if any, without calling the incremental search bar, and searching forwards through the document starting from the cursor position.
tr: Bu, artımlı arama çubuğunu çağırmadan ve imleç konumundan başlayarak belgede ileriye doğru arama yapmadan, varsa son bulma işlemini yineler.
