Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_menus.po
Languages: tr

source: The Menu Entries
tr: Menü Girdileri

source: The File Menu
tr: Dosya Menüsü

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Yeni</guimenuitem>

source: This starts a new document in a new and independent editor window.
tr: Bu, yeni ve bağımsız bir düzenleyici penceresinde yeni bir belge başlatır.

source: <guimenu>File</guimenu> <guimenuitem>New Window</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Yeni Pencere</guimenuitem>

source: Create another window containing the current document. All changes to the document in one window are reflected in the other window and vice versa.
tr: Geçerli belgeyi içeren başka bir pencere oluşturun. Bir pencerede belgede yapılan tüm değişiklikler diğer pencereye yansıtılır ve bunun tersi de geçerlidir.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Aç…</guimenuitem>

source: Displays a standard &kde; <guilabel>Open File</guilabel> dialog. Use the file view to select the file you want to open, and click on <guibutton>Open</guibutton> to open it.
tr: Bir standart &kde; <guilabel>Dosya Aç</guilabel> iletişim kutusu görüntüler. Açmak istediğiniz dosyayı seçmek için dosya görünümünü kullanın ve onu açmak için <guibutton>Aç</guibutton> düğmesine tıklayın.

source: <guimenu>File</guimenu> <guisubmenu>Open Recent</guisubmenu>
tr: <guimenu>Dosya</guimenu> <guisubmenu>Son Kullanılanı Aç</guisubmenu>

source: This is a shortcut to open recently saved documents. Clicking on this item opens a list to the side of the menu with several of the most recently saved files. Clicking on a specific file will open it in &kappname; - if the file still resides at the same location.
tr: Bu, yakın zamanda kaydedilen belgeleri açmak için kullanılan bir kısayoldur. Bu ögeye tıklamak, menünün yan tarafında en son kaydedilen dosyalardan birkaçını içeren bir liste açar. Belirli bir dosyaya tıklamak onu &kappname;’de açacaktır — eğer dosya hâlâ aynı konumda bulunuyorsa.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Kaydet</guimenuitem>

source: This saves the current document. If there has already been a save of the document then this will overwrite the previously saved file without asking for the user's consent. If it is the first save of a new document the save as dialog (described below) will be invoked.
tr: Bu, geçerli belgeyi kaydeder. Belge halihazırda kaydedilmişse kullanıcının izni istenmeden önceden kaydedilen dosyanın üzerine yazılacaktır. Yeni bir belgenin ilk kaydı ise farklı kaydet iletişim kutusu (aşağıda açıklanmıştır) çağrılır.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save As...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Farklı Kaydet…</guimenuitem>

source: This allows a document to be saved with a new file name. This is done by means of the file dialog box described above in the <link linkend="file-open">Open</link> section of this help file.
tr: Bu, belgenin yeni bir dosya adıyla kaydedilmesine olanak tanır. Bu, yukarıda bu yardım dosyasının <link linkend="file-open">Aç</link> bölümünde açıklanan dosya iletişim kutusu aracılığıyla yapılır.

source: <guimenu>File</guimenu> <guimenuitem>Save As with Encoding</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Kodlamayla Farklı Kaydet</guimenuitem>

source: Save a document with a new file name in a different encoding.
tr: Belgeyi yeni bir dosya adıyla farklı bir kodlamayla kaydedin.

source: <guimenu>File</guimenu> <guimenuitem>Save Copy As</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Kopyayı Farklı Kaydet</guimenuitem>

source: Save a copy of the document with a new file name and continue editing the original document.
tr: Belgenin bir kopyasını yeni bir dosya adıyla kaydedin ve özgün belgeyi düzenlemeyi sürdürün.

source: <shortcut> <keycombo action="simul"><keycap>F5</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Reload</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>F5</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Yeniden Yükle</guimenuitem>

source: Reloads the active file from disk. This command is useful if another program or process has changed the file while you have it open in &kappname;.
tr: Etkin dosyayı diskten yeniden yükler. Bu komut, dosyayı &kappname;’de açıkken başka bir program veya işlem değiştirmişse kullanışlıdır.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Print...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Yazdır…</guimenuitem>

source: Opens a simple print dialog allowing the user to specify what, where, and how to print.
tr: Kullanıcının neyi, nerede ve nasıl yazdıracağını belirlemesine olanak tanıyan basit bir yazdırma iletişim kutusu açar.

source: <guimenu>File</guimenu> <guimenuitem>Export as HTML</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>HTML Olarak Dışa Aktar</guimenuitem>

source: Save the currently open document as an &HTML; file, which will be formatted using the current syntax highlighting and color scheme settings.
tr: Şu anda açık olan belgeyi, geçerli sözdizim vurgulama ve renk şeması ayarları kullanılarak biçimlendirilecek bir &HTML; dosyası olarak kaydedin.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Close</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Kapat</guimenuitem>

source: Close the active file with this command. If you have made unsaved changes, you will be prompted to save the file before &kappname; closes it.
tr: Etkin dosyayı bu komutla kapatın. Kaydedilmemiş değişiklikler yaptıysanız &kappname; dosyayı kapatmadan önce dosyayı kaydetmeniz istenecektir.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Çık</guimenuitem>

source: This will close the editor window, if you have more than one instance of &kappname; running, through the <guimenuitem>New</guimenuitem> or <guimenuitem>New Window</guimenuitem> menu items, those instances will not be closed.
tr: Bu, düzenleyici penceresini kapatacaktır; <guimenuitem>Yeni</guimenuitem> veya <guimenuitem>Yeni Pencere</guimenuitem> menü ögeleri aracılığıyla birden fazla &kappname; örneği açılmışsa bu örnekler olduğu gibi bırakılır.

source: The Edit Menu
tr: Düzen Menüsü

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Geri Al</guimenuitem>

source: Undo the last editing command (typing, copying, cutting &etc;)
tr: Son düzenleme komutunu geri alın (yazma, kopyalama, kesme vb.)

source: This may undo several editing commands of the same type, like typing in characters.
tr: Bu, karakterler girmek gibi aynı türden birkaç düzenleme komutunun geri alınmasına neden olabilir.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Redo</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Yinele</guimenuitem>

source: This will reverse the most recent change (if any) made using Undo.
tr: Bu, Geri Al kullanılarak yapılan en son değişikliği (varsa) tersine çevirecektir.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Cut</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Kes</guimenuitem>

source: This command deletes the current selection and places it on the clipboard. The clipboard works invisibly and provides a way to transfer data between applications.
tr: Bu komut, geçerli seçimi siler ve panoya yerleştirir. Pano görünmez bir şekilde çalışır ve uygulamalar arasında veri aktarımı için bir yol sağlar.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Kopyala</guimenuitem>

source: This copies the currently selected text to the clipboard so that it may be pasted elsewhere. The clipboard works invisibly and provides a way to transfer data between applications.
tr: Bu, o anda seçili olan metni başka bir yere yapıştırılabilmesi için panoya kopyalar. Pano görünmez bir şekilde çalışır ve uygulamalar arasında veri aktarımı için bir yol sağlar.

source: <guimenu>Edit</guimenu> <guimenuitem>Copy as HTML</guimenuitem>
tr: <guimenu>Düzen</guimenu> <guimenuitem>HTML Olarak Kopyala</guimenuitem>

source: Copy the selection as &HTML;, formatted using the current syntax highlighting and color scheme settings.
tr: Seçimi, geçerli sözdizim vurgulama ve renk şeması ayarları kullanılarak biçimlendirilmiş &HTML; olarak kopyalayın.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Yapıştır</guimenuitem>

source: This will insert the first item in the clipboard at the cursor position. The clipboard works invisibly and provides a way to transfer data between applications.
tr: Bu, panodaki ilk ögeyi imleç konumuna yerleştirecektir. Pano görünmez bir şekilde çalışır ve uygulamalar arasında veri aktarımı için bir yol sağlar.

source: If Overwrite Selection is enabled, the pasted text will overwrite the selection, if any.
tr: Seçimin Üzerine Yaz etkinse yapıştırılan metin, varsa seçimin üzerine yazılır.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;&Ins;</keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste Selection</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;&Ins;</keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Seçimi Yapıştır</guimenuitem>

source: This will paste the <ulink url="https://en.wikipedia.org/wiki/Clipboard_(computing)#X_Window_System">mouse selection</ulink> contents that were chosen previously. Mark some text with the mouse pointer to paste it in the currently open file using this menu item.
tr: Bu, daha önce seçili olan <ulink url="https://en.wikipedia.org/wiki/Clipboard_(computing)#X_Window_System">fare seçimi</ulink> içeriğini yapıştıracaktır. Bu menü ögesini kullanarak, o anda açık olan dosyaya yapıştırmak için fare işaretçisiyle bir metni imleyin.

source: <guimenu>Edit</guimenu> <guimenuitem>Swap with clipboard contents</guimenuitem>
tr: <guimenu>Düzen</guimenu> <guimenuitem>Pano İçeriği ile Değiştir</guimenuitem>

source: This will swap the selected text with the <ulink url="https://en.wikipedia.org/wiki/Clipboard_(computing)#X_Window_System">clipboard</ulink> contents.
tr: Bu, seçili metni <ulink url="https://en.wikipedia.org/wiki/Clipboard_(computing)#X_Window_System">pano</ulink> içeriğiyle değiştirecektir.

source: <guimenu>Edit</guimenu> <guimenuitem>Clipboard History Paste</guimenuitem>
tr: <guimenu>Düzen</guimenu> <guimenuitem>Pano Geçmişini Yapıştır</guimenuitem>

source: This will open a dialog to select and paste an entry from the clipboard history.
tr: Bu, pano geçmişinden bir girdiyi seçip yapıştırmak için bir iletişim kutusu açacaktır.

source: <guimenu>Edit</guimenu> <guimenuitem>Input Modes</guimenuitem>
tr: <guimenu>Düzen</guimenu> <guimenuitem>Giriş Kipleri</guimenuitem>

source: Switch between a normal and a vi-like, modal editing mode. The vi input mode supports the most used commands and motions from vim's normal and visual mode and has an optional vi mode statusbar. This status bar shows commands while they are being entered, output from commands and the current mode. The behavior of this mode can be configured in the <link linkend="pref-edit-vi-input-mode">Vi Input Mode</link> tab of the <guilabel>Editing</guilabel> page in &kappname;'s settings dialog.
tr: Normal ve Vi benzeri kipsel düzenleme kipi arasında geçiş yapın. Vi giriş kipi, Vim’in normal ve görsel kipinden en çok kullanılan komutları ve hareketleri destekler ve isteğe bağlı bir Vi kipi durum çubuğuna sahiptir. Bu durum çubuğu, girilirken komutları, komutlardan çıktıyı ve geçerli kipi gösterir. Bu kipin davranışı, &kappname;’in ayarlar iletişim kutusunda bulunan <guilabel>Düzenleme</guilabel> sayfasındaki <link linkend="pref-edit-vi-input-mode">Vi Giriş Kipi</link> sekmesinde yapılandırılabilir.

source: <shortcut> <keycombo action="simul">&Ins;</keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Overwrite Mode</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ins;</keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Üzerine Yazma Kipi</guimenuitem>

source: Toggles the Insert/Overwrite modes. When the mode is <guilabel>INS</guilabel>, you insert characters where the cursor is. When the mode is <guilabel>OVR</guilabel>, writing characters will replace the current characters if your cursor is positioned before any character. The status bar shows the current state of the Overwrite Mode, either <guilabel>INS</guilabel> or <guilabel>OVR</guilabel>.
tr: Ekle/Üzerine Yaz kipleri arasında geçiş yapar. Kip <guilabel>EKLE</guilabel> iken, imlecin olduğu yere karakterler girersiniz. Kip <guilabel>ÜZERİNE YAZ</guilabel> ise yazılan karakterler, imleç başka bir karakterden önce konumlandırılmışsa imleçten sonraki karakterlerin üzerine yazar. Durum çubuğu, Üzerine Yazma Kipi’nin geçerli durumunu <guilabel>EKLE</guilabel> veya <guilabel>ÜZERİNE YAZ</guilabel> olarak gösterir.

source: <guimenu>Edit</guimenu> <guimenuitem>Read Only Mode</guimenuitem>
tr: <guimenu>Düzen</guimenu> <guimenuitem>Saltokunur Kip</guimenuitem>

source: Set the current document to Read Only mode. This prevents any text addition and any changes in the document formatting.
tr: Geçerli belgeyi saltokunur kipe ayarlayın. Bu, herhangi bir metin eklenmesini ve belge biçimindeki herhangi bir değişikliği önler.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Bul…</guimenuitem>

source: This opens the incremental search bar at the bottom of the editor window. On the left side of the bar is a button with an icon to close the bar, followed by a small text box for entering the search pattern.
tr: Bu, düzenleyici penceresinin altındaki artımlı arama çubuğunu açar. Çubuğun sol tarafında, çubuğu kapatmak için bir simgenin bulunduğu bir düğme ve ardından arama dizgisini girmek için küçük bir metin kutusu bulunur.

source: When you start entering characters of your search pattern, the search starts immediately. If there is a match in the text this is highlighted and the background color of the entry field changes to light green. If the search pattern does not match any string in the text, this is indicated by a light red background color of the entry field.
tr: Arama dizginizin karakterlerini girmeye başladığınızda arama hemen başlar. Metinde bir eşleşme varsa bu vurgulanır ve giriş alanının arka plan rengi açık yeşile döner. Arama dizgisi metindeki herhangi bir diziyle eşleşmiyorsa bu durum giriş alanının açık kırmızı arka plan rengiyle gösterilir.

source: Use the <inlinemediaobject><imageobject><imagedata fileref="arrow-up-double-22.png" format="PNG"/></imageobject></inlinemediaobject> or <inlinemediaobject><imageobject><imagedata fileref="arrow-down-double-22.png" format="PNG"/></imageobject></inlinemediaobject> button to jump to the next or previous match in the document.
tr: Belgedeki önceki veya sonraki eşleşmeye atlamak için <inlinemediaobject><imageobject><imagedata fileref="arrow-up-double-22.png" format="PNG"/></imageobject></inlinemediaobject> veya <inlinemediaobject><imageobject><imagedata fileref="arrow-down-double-22.png" format="PNG"/></imageobject></inlinemediaobject> düğmelerini kullanın.

source: Matches in the document are highlighted even when you close the search bar. To clear this highlighting, press the &Esc; key.
tr: Arama çubuğunu kapattığınızda bile belgedeki eşleşmeler vurgulanır. Bu vurgulamayı temizlemek için &Esc; düğmesine basın.

source: You can choose whether the search should be case sensitive. Selecting <inlinemediaobject><imageobject><imagedata fileref="format-text-superscript-22.png" format="PNG"/></imageobject></inlinemediaobject> will limit finds to entries that match the case (upper or lower) of each of the characters in the search pattern.
tr: Aramanın BÜYÜK/küçük harfe duyarlı olup olmayacağını seçebilirsiniz. <inlinemediaobject><imageobject><imagedata fileref="format-text-superscript-22.png" format="PNG"/></imageobject></inlinemediaobject> seçildiğinde bulguları, arama dizgisindeki karakterlerin her birinin BÜYÜK/küçük harf durumuyla eşleşen girdilerle sınırlandırır.

source: Click on the <inlinemediaobject><imageobject><imagedata fileref="configure-shortcuts-22.png" format="PNG"/></imageobject></inlinemediaobject> button at the right side of the incremental search bar to switch to the power search and replace bar.
tr: Artımlı arama çubuğunun sağ tarafındaki <inlinemediaobject><imageobject><imagedata fileref="configure-shortcuts-22.png" format="PNG"/></imageobject></inlinemediaobject> düğmesine basarak gelişmiş arama ve değiştirme çubuğuna geçebilirsiniz.

source: <shortcut> <keycombo action="simul"><keycap>F3</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guisubmenu>Find Variants</guisubmenu> <guimenuitem>Find Next</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>F3</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guisubmenu>Benzerlerini Bul</guisubmenu> <guimenuitem>Sonrakini Bul</guimenuitem>

source: This repeats the last find operation, if any, without calling the incremental search bar, and searching forwards through the document starting from the cursor position.
tr: Bu, artımlı arama çubuğunu çağırmadan ve imleç konumundan başlayarak belgede ileriye doğru arama yapmadan, varsa son bulma işlemini yineler.

source: <shortcut> <keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guisubmenu>Find Variants</guisubmenu> <guimenuitem>Find Previous</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guisubmenu>Benzerlerini Bul</guisubmenu> <guimenuitem>Öncekini Bul</guimenuitem>

source: This repeats the last find operation, if any, without calling the incremental search bar, and searching backwards instead of forwards through the document.
tr: Bu, artımlı arama çubuğunu çağırmadan ve belgede ileri yerine geriye doğru arama yapmadan, varsa son bulma işlemini yineler.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guisubmenu>Find Variants</guisubmenu> <guimenuitem>Find Selected</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guisubmenu>Benzerlerini Bul</guisubmenu> <guimenuitem>Seçiliyi Bul</guimenuitem>

source: Finds next occurrence of selected text.
tr: Seçili metnin bir sonraki oluşunu bulur.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guisubmenu>Find Variants</guisubmenu> <guimenuitem>Find Selected Backwards</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guisubmenu>Benzerlerini Bul</guisubmenu> <guimenuitem>Seçiliyi Geriye Doğru Bul</guimenuitem>

source: Finds previous occurrence of selected text.
tr: Seçili metnin bir önceki oluşunu bulur.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Replace...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Değiştir…</guimenuitem>

source: This command opens the power search and replace bar. On the upper left side of the bar is a button with an icon to close the bar, followed by a small text box for entering the search pattern.
tr: Bu komut, gelişmiş arama ve değiştirme çubuğunu açar. Çubuğun sol üst tarafında, çubuğu kapatmak için bir simgenin bulunduğu bir düğme ve ardından arama dizgisini girmek için küçük bir metin kutusu bulunur.

source: You can control the search mode by selecting <guilabel>Plain text</guilabel>, <guilabel>Whole words</guilabel>, <guilabel>Escape sequences</guilabel> or <guilabel>Regular expression</guilabel> from the drop down box.
tr: Arama kipini, açılır kutudan <guilabel>Düz metin</guilabel>, <guilabel>Tam sözcükler</guilabel>, <guilabel>Kaçış dizileri</guilabel> veya <guilabel>Düzenli ifade</guilabel> seçeneklerini kullanarak denetleyebilirsiniz.

source: If <guilabel>Escape sequences</guilabel> or <guilabel>Regular expression</guilabel> are selected, the <guibutton>Add...</guibutton> menuitem at the bottom of the context menu of the text boxes will be enabled and allows you to add escape sequences or regular expression items to the search or replace pattern from predefined lists.
tr: <guilabel>Kaçış dizileri</guilabel> veya <guilabel>Düzenli ifade</guilabel> seçilirse metin kutularının bağlam menüsünün altında bulunan <guibutton>Ekle…</guibutton> düğmesi etkinleştirilir ve ara ve değiştir dizgilerine önceden tanımlanan listelerden kaçış dizileri veya düzenli ifade ögeleri eklemenize olanak tanır.

source: Enter the text to replace with in the text box labeled <guilabel>Replace</guilabel> and click the <guibutton>Replace</guibutton> button to replace only the highlighted text or the <guibutton>Replace All</guibutton> button to replace the search text in the whole document.
tr: <guilabel>Değiştir</guilabel> etiketli metin kutusuna değiştirilecek metni girin ve yalnızca vurgulanan metni değiştirmek için <guibutton>Değiştir</guibutton> düğmesini veya tüm belgedeki arama metnini değiştirmek için <guibutton>Tümünü Değiştir</guibutton> düğmesine tıklayın.
