Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_plugins.po
Languages: tr

source: <guimenu>LSP Client</guimenu> <guisubmenu>Show hover information</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Üzerine Gelince Bilgi Göster</guisubmenu>

source: Show hover information upon (mouse cursor) hover. Regardless of this setting, the request can always be manually initiated.
tr: (Fare imleci) üzerine geldiğinden bilgi göster. Bu ayardan bağımsız olarak istek her zaman elle başlatılabilir.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Format on typing</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Yazarken Biçimlendir</guisubmenu>

source: [document/onTypeFormatting] Format parts of document when typing certain trigger characters. For example, this might apply indentation upon newline, or as otherwise determined by LSP Server. Note that editor indentation scripts might be trying to do the same (depending on the mode) and so it may not be advisable to have both enabled at the same time.
tr: [document/onTypeFormatting] Belirli tetikleyici karakterleri yazarken belgenin bölümlerini biçimlendirin. Örneğin bu, yeni satıra girintileme uygulayabilir veya LSP Sunucusu tarafından başka şekilde belirlenebilir. Düzenleyici girintileme betiklerinin (kipe bağlı olarak) aynı şeyi yapmaya çalışıyor olabileceğini ve bu nedenle her ikisinin de aynı anda etkinleştirilmesinin önerilmeyebileceğini unutmayın.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Incremental document synchronization</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Artımlı Belge Eşzamanlaması</guisubmenu>

source: Send partial document edits to update the server rather than whole document text (if supported).
tr: Sunucuyu güncellemek için belge metninin tamamı yerine (destekleniyorsa) kısımsal belge düzenlemeleri gönderin.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Highlight goto location</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>goto Konumunu Vurgula</guisubmenu>

source: Provide a transient visual cue after performing a goto to a location (of definition, declaration, etc).
tr: Bir konuma (tanım, beyan vb.) gittikten sonra geçici bir görsel işaret sağlayın.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Show diagnostics notifications</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Tanı Bildirimlerini Göster</guisubmenu>

source: [textDocument/publishDiagnostics] Process and show diagnostics notifications sent by server.
tr: [textDocument/publishDiagnostics] Sunucu tarafından gönderilen tanı bildirimlerini işleyin ve gösterin.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Show diagnostics highlights</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Tanı Vurgulamalarını Göster</guisubmenu>

source: Add text highlights for ranges indicated in diagnostics.
tr: Tanıda belirtilen erimler için metin vurguları ekleyin.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Show diagnostics marks</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Tanı İmlerini Göster</guisubmenu>

source: Add document marks for lines indicated in diagnostics.
tr: Tanıda belirtilen satırlar için belge imleri ekleyin.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Switch to diagnostic tab</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Tanı Sekmesine Geç</guisubmenu>

source: Switch to the diagnostic tab in the plugin toolview.
tr: Eklenti araç görünümündeki tanı sekmesine geçin.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Close all non-diagnostics tabs</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Tanı Olmayan Tüm Sekmeleri Kapat</guisubmenu>

source: Close all non-diagnostics (&eg; references) tabs in plugin toolview.
tr: Eklenti araç görünümündeki tüm tanı olmayan sekmeleri (örneğin, başvurular) kapatın.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Restart LSP Server</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>LSP Sunucusunu Yeniden Başlat</guisubmenu>

source: Restart current document's LSP Server.
tr: Geçerli belgenin LSP sunucusunu yeniden başlatın.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Restart all LSP Servers</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Tüm LSP Sunucularını Yeniden Başlat</guisubmenu>

source: Stop all LSP Servers which will then be (re)started as needed.
tr: Tüm LSP sunucularını durdurun. Gerektiğinde yeniden başlatılacaklardır.

source: Goto Symbol support
tr: Goto Sembolü Desteği

source: LSP Client can help you jump to any symbol in your project or current file. To jump to any symbol in the file, use the toolview "LSP Client Symbol Outline" on the right border of kate. This toolview lists all symbols found by the server in current document.
tr: LSP İstemcisi, projenizdeki veya geçerli dosyanızdaki herhangi bir sembole atlamanıza yardımcı olabilir. Dosyadaki herhangi bir sembole atlamak için Kate’in sağ kenarındaki “LSP İstemcisi Sembolü Ana Hattı” araç görünümünü kullanın. Bu araç görünümü, sunucu tarafından geçerli belgede bulunan tüm sembolleri listeler.

source: Configuring LSP Client Symbol Outline
tr: LSP İstemcisi Sembolü Ana Hattı

source: By default the symbols are sorted by their occurrence in the document but you can change the sort to be alphabetical. To do so, right click in the toolview and check "Sort Alphabetically".
tr: Öntanımlı olarak semboller belgedeki oluşumlarına göre sıralanır; ancak sıralamayı abecesel olacak biçimde değiştirebilirsiniz. Bunu yapmak için araç görünümüne sağ tıklayın ve “Abecesel Olarak Sırala” seçeneğini işaretleyin.

source: The toolview shows the symbols in tree mode by default, however you can change it to a list using the context menu.
tr: Araç görünümü, sembolleri öntanımlı olarak ağaç kipinde gösterir; ancak bağlam menüsünü kullanarak bunu bir listeye değiştirebilirsiniz.

source: Global Goto symbol support
tr: Global Goto sembolü desteği

source: To jump to any symbol in your project, you can open the goto symbol dialog using <keycombo action="simul">&Ctrl;&Alt;<keycap>p</keycap></keycombo>. The dialog is empty when it opens but as soon as you type something the dialog will start showing you matching symbols. The quality of matches as well as filtering capabilities depend upon the server that you use. For example, clangd supports fuzzy filtering but some other server may not.
tr: Projenizdeki herhangi bir sembole atlamak için goto sembolü iletişim kutusunu <keycombo action="simul">&Ctrl;&Alt;<keycap>p</keycap></keycombo>. kullanarak açabilirsiniz. İletişim kutusu açıldığında boştur; ancak bir şey yazdığınız anda iletişim kutusu size eşleşen sembolleri göstermeye başlayacaktır. Eşleşmelerin kalitesi ve süzme yetenekleri kullandığınız sunucuya bağlıdır. Örneğin, clangd bulanık süzmeyi destekler; ancak diğer bazı sunucular desteklemeyebilir.

source: Other Features
tr: Diğer Özellikler

source: Clangd switch source header command is supported. To switch source header in a C or C++ project either use the "Switch Source Header" option from the context menu or the shortcut <keycombo action="simul"><keycap>F12</keycap></keycombo>.
tr: Clangd kaynak üstbilgisini değiştirme komutu desteklenir. Bir C veya C++ projesinde kaynak üstbilgisini değiştirmek için bağlam menüsündeki “Kaynak Üstbilgisini Değiştir” seçeneğini veya <keycombo action="simul"><keycap>F12</keycap></keycombo> kısayolunu kullanın.

source: You can jump to a symbol quickly by putting your mouse over the symbol and then pressing <keycombo action="simul">&Ctrl;</keycombo> + left mouse button.
tr: Farenizi bir sembolün üzerine getirip <keycombo action="simul">&Ctrl;</keycombo> + sol fare düğmesini kullanarak herhangi bir sembole kolaylıkla atlayabilirsiniz.

source: The plugin's configuration page mostly allows for persistent configuration of some of the above menu items. However, there is one additional entry to specify the Server Configuration file. This is a &JSON; file that can be used to specify the LSP server to start (and then to communicate with over stdin/stdout). For convenience, some default configuration is included, which can be inspected in the plugin's configuration page. To aid in the explanation below, an excerpt of that configuration is given here:
tr: Eklentinin yapılandırma sayfası çoğunlukla yukarıdaki menü ögelerinin bazılarının kalıcı olarak yapılandırılmasına izin verir. Ancak Sunucu Yapılandırması dosyasını belirtmek için ek bir girdi daha vardır. Bu, başlatılacak LSP sunucusunu belirtmek (ve ardından stdin/stdout üzerinden iletişim kurmak) için kullanılabilecek bir &JSON; dosyasıdır. Kolaylık sağlamak amacıyla, eklentinin yapılandırma sayfasında incelenebilecek bazı öntanımlı yapılandırmalar eklenmiştir. Aşağıdaki açıklamaya yardımcı olmak için burada bu yapılandırmadan bir alıntı verilmiştir:

source: Note that each "command" may be an array or a string (in which case it is split into an array). Also, a top-level "global" entry (next to "server") is considered as well (see further below). The specified binary is searched for in the usual way, e.g. using <literal>PATH</literal>. If it is installed in some custom location, then the latter may have to be extended. Or alternatively, a (sym)link or wrapper script may be used in a location that is within the usual <literal>PATH</literal>. As illustrated above, one may also specify a "path" that will be searched for after the standard locations.
tr: Her “komutun” bir diziliş veya dizi olabileceğini unutmayın (bu durumda bir dizilişe bölünmüştür). Ayrıca, üst düzey bir “global” girdi (“server”ın yanında) da dikkate alınır (aşağıya bakınız). Belirtilen ikili dosya olağan şekilde aranır; örneğin, <literal>PATH</literal> kullanarak. Özel bir konuma kurulursa ikincisinin genişletilmesi gerekebilir. Veya alternatif olarak, olağan <literal>PATH</literal> içindeki bir konumda bir sembolik bağlantı veya bir sarmalayıcı betik kullanılabilir. Yukarıda gösterildiği gibi standart konumlardan sonra aranacak bir “yol” da belirtilebilir.

source: All of the entries in "command", "root" and "path" are subject to variable expansion.
tr: “command”, “root” ve “path” içindeki tüm girdiler değişken genişletmeye tabidir.

source: The "highlightingModeRegex" is used to map the highlighting mode as used by &kate; to the language id of the server. If no regular expression is given, the language id itself is used. If a "documentLanguageId" entry is set to false, then no language id is provided to the server when opening the document. This may have better results for some servers that are more precise in determining the document type than doing so based on a kate mode.
tr: “highlightingModeRegex”, &kate; tarafından kullanılan vurgulama kipini sunucunun dil kimliğine eşlemek için kullanılır. Düzenli ifade verilmezse dil kimliğinin kendisi kullanılır. Bir “documentLanguageId” girişi false olarak ayarlanırsa belgeyi açarken sunucuya herhangi bir dil kimliği sağlanmaz. Bu, belge türünü belirlemede Kate kipine dayalı olarak yapmaktan daha hassas olan bazı sunucular için daha iyi sonuçlara sahip olabilir.

source: From the above example, the gist is presumably clear. In addition, each server entry object may also have an "initializationOptions" entry, which is passed along to the server as part of the 'initialize' method. If present, a "settings" entry is passed to the server by means of the 'workspace/didChangeConfiguration' notification. Either of "completionTriggerCharacters" or "signatureTriggerCharacters" may be specified as a JSON object with string members "exclude" and/or "include". These will be used to respectively exclude or add some characters to the respective trigger set as provided by the server.
tr: Yukarıdaki örnekte ana düşünce açıktır. Ek olarak, her sunucu girdi nesnesi, “initialize” yönteminin bir parçası olarak sunucuya iletilen bir “initializationOptions” girdisine de sahip olabilir. Varsa “workspace/didChangeConfiguration” bildirimi aracılığıyla sunucuya bir “settings” girdisi iletilir. “completionTriggerCharacters” veya “signatureTriggerCharacters” dizileri üyeleri “exclude” ve/veya “include” olan bir JSON nesnesi olarak belirtilebilir. Bunlar, sunucu tarafından sağlanan ilgili tetikleyici kümesine bazı karakterleri sırasıyla dışlamak veya eklemek için kullanılacaktır.

source: Various stages of override/merge are applied;
tr: Üzerine yazma veya birleştirmenin çeşitli aşamaları uygulanır;

source: user configuration (loaded from file) overrides (internal) default configuration
tr: kullanıcı yapılandırması (dosyadan yüklenen), öntanımlı (içsel) yapılandırmanın üzerine yazar

source: "lspclient" entry in <filename>.kateproject</filename> project configuration overrides the above
tr: <filename>.kateproject</filename> projesindeki “lspclient” girdisi, yukarıdakini geçersiz kılar

source: the resulting "global" entry is used to supplement (not override) any server entry
tr: sonuç olarak çıkan “global” girdisi, herhangi bir sunucu girdisini desteklemek (geçersiz kılmak değil) için kullanılır

source: One server instance is used per (root, servertype) combination. If "root" is specified as an absolute path, then it used as-is, otherwise it is relative to the <quote>projectBase</quote> (as determined by the <link linkend="kate-application-plugin-projects">Project plugin</link>) if applicable, or otherwise relative to the document's directory. If not specified and "rootIndicationFileNames" is an array as filenames, then a parent directory of current document containing such a file is selected. Alternatively, if "root" is not specified and "rootIndicationFilePatterns" is an array of file patterns, then a parent directory of the current document matching the file pattern is selected. As a last fallback, the home directory is selected as "root". For any document, the resulting "root" then determines whether or not a separate instance is needed. If so, the "root" is passed as rootUri/rootPath.
tr: (root, servertype) kombinasyonu başına bir sunucu örneği kullanılır. “root” mutlak yol olarak belirtilirse olduğu gibi kullanılır, aksi takdirde <quote>projectBase</quote>’e görelidir (<link linkend="kate-application-plugin-projects">Proje Eklentisi</link> tarafından belirlendiği üzere) varsa veya belgenin dizinine göre değilse. Belirtilmemişse ve “rootIndicationFileNames” dosya adı olarak bir dizilişse bu tür bir dosyayı içeren geçerli belgenin ana dizini seçilir. Alternatif olarak, “root” belirtilmemişse ve “rootIndicationFilePatterns” bir dosya dizgileri dizilişiyse geçerli belgenin dosya dizgisiyle eşleşen bir üst dizini seçilir. Son çare olarak ana dizin “root” olarak seçilir. Herhangi bir belge için ortaya çıkan “root”, ayrı bir örneğin gerekli olup olmadığını belirler. Eğer öyleyse “root” rootUri/rootPath olarak iletilir.

source: In general, it is recommended to leave root unspecified, as it is not that important for a server (your mileage may vary though). Fewer server instances are obviously more efficient, and they also have a 'wider' view than the view of many separate instances.
tr: Genel olarak, bir sunucu için o kadar da önemli olmadığından kökü belirtmeden bırakmanız önerilir (ancak sizin için aynı durum geçerli olmayabilir). Daha az sayıda sunucu örneği açıkça daha verimlidir ve aynı zamanda birçok ayrı örneğin görünümünden “daha geniş” bir görünüme sahiptirler.

source: As mentioned above, several entries are subject to variable expansion. A suitable application of that combined with "wrapper script" approaches allows for customization to a great many circumstances. For example, consider a python development scenario that consists of multiple projects (e.g. git repos), each with its own virtualenv setup. Using the default configuration, the python language server will not be aware of the virtual env. However, that can be remedied with the following approach. First, the following fragment can be entered in LSPClient plugin's "User Server Settings":
tr: Yukarıda belirtildiği gibi, çeşitli girdiler değişken genişlemeye tabidir. Bunun “sarmalayıcı betik” yaklaşımlarıyla birleştirilmiş uygun bir uygulaması, birçok duruma göre özelleştirmeye olanak tanır. Örneğin, her biri kendi virtualenv kurulumuna sahip birden fazla projeden (örn. git depoları) oluşan bir python geliştirme senaryosunu düşünün. Öntanımlı yapılandırma kullanıldığında python dil sunucusu sanal ortamdan haberdar olmayacaktır. Ancak aşağıdaki yaklaşımla bu sorun çözülebilir. İlk olarak, LSP İstemcisi eklentisinin “Kullanıcı Sunucu Ayarları”na aşağıdaki parça girilebilir:

source: The root entry above is relative to the project directory and ensures that a separate language server is started for each project, which is necessary in this case as each has a distinct virtual environment.
tr: Yukarıdaki kök girdisi proje dizinine bağlıdır ve her proje için ayrı bir dil sunucusunun başlatılmasını sağlar; bu durumda her birinin farklı bir sanal ortamı olması nedeniyle bu gereklidir.

source: <filename>pylsp_in_env</filename> is a small "wrapper script" that should be placed in <literal>PATH</literal> with the following (to-be-adjusted) content:
tr: <filename>pylsp_in_env</filename>, aşağıdaki içerikle (düzeltilmek üzere) <literal>PATH</literal>’e yerleştirilmesi gereken küçük bir “sarmalayıcı betik”tir:

source: #!/bin/bash cd $1 # run the server (python-lsp-server) within the virtualenv # (i.e. with virtualenv variables setup) # so source the virtualenv source XYZ # server mileage or arguments may vary exec myserver
tr: #!/bin/bash cd $1 # sunucuyu (python-lsp-server) virtualenv içinde çalıştır # (demek oluyor ki virtualenv değişkenleri ayarıyla) # bundan dolayı virtualenv’i kaynakla source XYZ # sunucu durumu veya argümanlar değişebilir exec myserver

source: LSP Server Configuration
tr: LSP Sunucusu Yapılandırması

source: Each particular LSP server has its own way of customization and may use language/tool specific means for configuration, &eg; <filename>tox.ini</filename> (a.o. for python), <filename>.clang-format</filename> for C++ style format. Such configuration may then also be used by other (non-LSP) tools (such as then <application>tox</application> or <application>clang-format</application>). On top of that, some LSP servers also load configuration from custom files (&eg; <filename>.ccls</filename>). Furthermore, custom server configuration can also be passed through LSP (protocol), see the aforementioned "initializationOptions" and "settings" entries in server configuration.
tr: Her bir LSP sunucusunun kendi özelleştirme yolları vardır ve yapılandırma için dile/araca özel yöntemler kullanabilirler; örneğin, Python için <filename>tox.ini</filename>, C++ tarzı biçimlendirme için <filename>.clang-format</filename>. Bu tür yapılandırmalar başka (LSP olmayan) araçlar için de kullanılabilirler (<application>tox</application> veya <application>clang-format</application> gibi). Bunun üzerine, bazı LSP sunucuları ayrıca özel dosyalardan da yapılandırma yükleyebilirler (&eg;, <filename>.ccls</filename>). Dahası, özel sunucu yapılandırmaları ayrıca LSP (protokol) üzerinden de geçirilebilirler; sunucu yapılandırmasında yukarıda belirtilen “initializationOptions” ve “settings” girdilerine bakın.

source: Since various level of override/merge are applied, the following example of user specified client configuration tweaks some python-language-server configuration.
tr: Çeşitli düzeylerde geçersiz kılma/birleştirme uygulandığından, aşağıdaki kullanıcı tarafından belirlenen istemci yapılandırması örneği, bazı python dili sunucusu yapılandırmasında ince ayarlar yapar.

source: Unfortunately, LSP server configuration/customization is often not so well documented, in ways that only examining the source code shows configuration approaches and the set of available configuration options. In particular, the above example's server supports many more options in "settings". See <ulink url="https://github.com/neoclide/coc.nvim/wiki/Language-servers"> another LSP client's documentation</ulink> for various other language server examples and corresponding settings, which can easily and readily be transformed to the &JSON; configuration that is used here and outlined above.
tr: Ne yazık ki, LSP sunucusu yapılandırması/özelleştirmesi çoğu zaman o kadar iyi belgelenmemiştir; yalnızca kaynak kodunun incelenmesi, yapılandırma yaklaşımlarını ve kullanılabilir yapılandırma seçenekleri kümesini gösterir. Özellikle yukarıdaki örneğin sunucusu “settings” içinde çok daha fazla seçeneği desteklemektedir. Kolayca değiştirilebilen diğer çeşitli dil sunucusu örnekleri ve ilgili ayarlar için burada kullanılan ve yukarıda özetlenen JSON yapılandırmasına dönüştürülen <ulink url="https://github.com/neoclide/coc.nvim/wiki/Language-servers"> başka bir LSP istemcisinin belgelerine</ulink> bakın.

source: LSP Server Format On Save
tr: LSP Sunucusu Kaydederken Biçimlendirme

source: You can enable "format on save" from LSP settings in configure dialog.
tr: Yapılandırma iletişim kutusunda “Kaydederken biçimlendir” özelliğini LSP ayarlarından etkinleştirebilirsiniz.

source: LSP Server Diagnostic Suppression
tr: LSP Sunucusu Tanı Susturması

source: It may happen that diagnostics are reported which are not quite useful. This can be quite cumbersome, especially if there are many (often of the same kind). In some cases, this may be tweaked by language (server) specific means. For example, the <ulink url="https://clangd.llvm.org/config.html">clangd configuration mechanism</ulink> allows tweaking of some diagnostics aspects. In general, however, it may not always be evident how to do so, or it may not even be possible at all in desired ways due to server limitations or bug.
tr: Pek kullanışlı olmayan tanıların bildirilmesi olanaklıdır. Bu, özellikle de çok sayıda varsa (çoğunlukla aynı türden) oldukça zahmetli olabilir. Bazı durumlarda bu, dile (sunucuya) özgü yöntemlerle değiştirilebilir. Örneğin, <ulink url="https://clangd.llvm.org/config.html">clangd yapılandırma mekanizması</ulink> bazı tanı hususlarında ince ayarlar yapılmasına olanak tanır. Ancak genel olarak bunun nasıl yapılacağı her zaman açık olmayabilir veya sunucu sınırlamaları veya hata nedeniyle istenilen şekillerde hiç olanaklı olmayabilir.

source: As such, the plugin supports diagnostics suppression similar to e.g. valgrind suppressions. The most fine-grained configuration can be supplied in a "suppressions" key in the (merged) &JSON; configuration.
tr: Bu nedenle eklenti; örneğin, valgrind susturmaları. En ayrıntılı yapılandırma, (birleştirilmiş) &JSON; yapılandırmasındaki “suppressions” anahtarında sağlanabilir.

source: Each (valid) rule has an arbitrary name and is defined by an array of length 2 or 3 which provides a regex to match against the (full) filename, a regex to match against the diagnostic (text) and an optional regex matched against the (source code range of) text to which the diagnostic applies.
tr: Her (geçerli) kuralın rastgele bir adı vardır ve 2 veya 3 uzunluğunda bir dizilişle tanımlanır. Bunlar; (tam) dosya adıyla eşleşecek bir düzenli ifade, tanıyla (metin) eşleşecek bir düzenli ifade ve tanının geçerli olduğu metinle (kaynak kodu aralığı) eşleşen isteğe bağlı bir düzenli ifade.

source: In addition to the above fine-grained configuration, the context menu in the diagnostics tab also supports add/remove of suppressions that match a particular diagnostic (text) exactly, either globally (any file) or locally (the specific file in question). These suppression are stored in and loaded from session config.
tr: Yukarıdaki ayrıntılı yapılandırmaya ek olarak, tanı sekmesindeki bağlam menüsü aynı zamanda genel olarak (herhangi bir dosya) veya yerel olarak (söz konusu belirli dosya) belirli bir tanıyla (metinle) tam olarak eşleşen gizlemelerin eklenmesini/kaldırılmasını da destekler. Bu susturma, oturum yapılandırmasında saklanır ve buradan yüklenir.
