Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_plugins.po
Languages: tr

source: <phrase>The Settings dialog</phrase>
tr: <phrase>Ayarlar iletişim kutusu</phrase>

source: The <guilabel>Settings</guilabel> dialog displaying the configuration of a debugging session.
tr: Bir hata ayıklama oturumunun yapılandırmasını görüntüleyen<guilabel>Ayarlar</guilabel> iletişim kutusu.

source: <guilabel>IO</guilabel>
tr: <guilabel>Girdi-Çıktı</guilabel>

source: Contains an area that displays output from the running program and a command line where you may provide input to it.
tr: Çalışan programın çıktısını görüntüleyen bir alan ve bu programa girdi sağlayabileceğiniz bir komut satırı içerir.

source: The IO Tab
tr: Girdi-Çıktı Sekmesi

source: The IO tab.
tr: Girdi-Çıktı sekmesi.

source: The <guilabel>IO</guilabel> tab displaying output from a simple test program.
tr: <guilabel>Girdi-Çıktı</guilabel> sekmesi, basit bir sınama programından çıktı görüntüler.

source: Call Stack and Locals
tr: Çağrı Yığını ve Yereller

source: The <guilabel>Call Stack</guilabel> tool view contains a list of the formatted backtrace returned from &gdb;.
tr: <guilabel>Çağrı Yığını</guilabel> araç görünümü, &gdb;’den dönen biçimlendirilmiş bir geri iz listesi içerir.

source: The &gdb; Call Stack Tool View
tr: &gdb; Çağrı Yığını Araç Görünümü

source: The Call Stack tool view.
tr: Çağrı Yığını araç görünümü.

source: The &gdb; Plugin's <guilabel>Call Stack</guilabel> tool view.
tr: &gdb; eklentisinin <guilabel>Çağrı Yığını</guilabel> araç görünümü.

source: The <guilabel>Locals</guilabel> tool view contains a list of all currently loaded variables from the program and their corresponding values.
tr: <guilabel>Yereller</guilabel> araç görünümü, programdan o anda yüklü olan tüm değişkenlerin ve bunlara karşılık gelen değerlerin bir listesini içerir.

source: The &gdb; Locals Tool View
tr: &gdb; Yereller Araç Görünümü

source: The Locals tool view.
tr: Yereller araç görünümü.

source: The &gdb; Plugin's <guilabel>Locals</guilabel> tool view.
tr: &gdb; eklentisinin <guilabel>Yereller</guilabel> araç görünümü.

source: Special thanks to Google Code-In 2011 participant Martin Gergov for writing much of this section.
tr: Bu bölümün çoğunu yazan Google Code-In 2011 katılımcısı Martin Gergov’a özellikle teşekkürler.

source: Project Plugin
tr: Proje Eklentisi

source: The basic idea of the Project plugin is to have a structured list of files belonging to the project with the following properties:
tr: Project eklentisinin temel fikri, aşağıdaki özelliklere sahip, projeye ait dosyaların yapılandırılmış bir listesine sahip olmaktır:

source: Provide a structured view of the files
tr: Dosyaların yapısal bir görünümünü sağla

source: Make it easy and very fast to open and switch projects
tr: Projeleri açmayı ve aralarında geçiş yapmayı kolay ve çok hızlı hale getir

source: Support search and replace for a project
tr: Bir proje için aramayı ve değiştirmeyi destekle

source: Provide simple auto completion
tr: Temel kendiliğinden tamamlama sağla

source: Make it simple to quickly open files in the project
tr: Projede tez dosya açmayı kolaylaştır

source: Support for building the project
tr: Projeyi derleme desteği sağla

source: Structured View of the Files
tr: Dosyaların Yapısal Görünümü

source: Once the Project plugin is loaded in the &kate; configuration page, open a file in a project and a sidebar appears that lists all projects as well as the project files as follows:
tr: Proje eklentisi &kate; yapılandırma sayfasına yüklendikten sonra, bir projede bir dosya açın; tüm projelerin yanı sıra proje dosyalarını da listeleyen bir kenar çubuğu aşağıdaki gibi görünür:

source: Project View
tr: Proje Görünümü

source: As you can see, the currently active project is <quote>Kate</quote>, and its contents is listed in the tree view. Clicking on files in the tree view opens the file in the editor. Further, a context menu is provided with which you can open files with other applications, such as a <filename class="extension">.ui</filename> file with Qt Designer.
tr: Gördüğünüz gibi şu anda etkin olan proje <quote>Kate</quote>’tir ve içeriği ağaç görünümünde listelenmektedir. Ağaç görünümünde dosyalara tıklamak, dosyayı düzenleyicide açar. Ayrıca, Qt Designer ile <filename class="extension">.ui</filename> dosyası gibi dosyaları diğer uygulamalarla açabileceğiniz bir bağlam menüsü de sağlanır.

source: You can filter the items by typing parts of the file name you are looking for into the search bar at the bottom of the list.
tr: Aradığınız dosya adının bazı kısımlarını listenin alt kısmındaki arama çubuğuna yazarak ögeleri süzebilirsiniz.

source: Switching Projects
tr: Projeler Arasında Geçiş Yapmak

source: The idea is that you never have to open a project manually, this is even not supported at all. Hence, what happens if you open a file, the Project plugin quickly scans the folder and its parent folders for a <filename>.kateproject</filename> file. If found, the project is automatically loaded.
tr: Buradaki fikir hiçbir zaman bir projeyi elle açmak zorunda kalmamanızdır, hatta bu hiç desteklenmemektedir. Bu nedenle, bir dosyayı açtığınızda olan şey şudur; proje eklentisi tez klasörü ve onun üst klasörlerini bir <filename>.kateproject</filename> dosyası için tarar. Bulunursa proje kendiliğinden yüklenir.

source: Furthermore, if you open another document in &kate;, that belongs to another project, the Project plugin automatically switches the current project. So intuitively, always the correct project is active. Of course, you can also switch the currently active project using the combo box.
tr: Ayrıca &kate;’de başka bir projeye ait başka bir belge açarsanız proje eklentisi kendiliğinden geçerli projeye geçiş yapar. Yani sezgisel olarak her zaman doğru proje etkindir. Tabii ki, halihazırda etkin olan projeyi açılır kutuyu kullanarak da değiştirebilirsiniz.

source: Search and Replace in Projects
tr: Projelerde Ara ve Değiştir

source: &kate; has a Search and Replace plugin that shows up in the bottom sidebar. If a project is loaded, open the Search and Replace sidebar, and switch to the mode to search and replace in the current project:
tr: &kate;’in alt kenar çubuğunda görünen bir Ara ve Değiştir eklentisi vardır. Bir proje yüklüyse Ara ve Değiştir kenar çubuğunu açın ve geçerli projede arama ve değiştirme kipine geçin:

source: Search in Projects
tr: Projelerde Ara

source: Simple Auto Completion
tr: Temel Kendiliğinden Tamamlama

source: With the knowledge of all files belonging to a project, the Project plugin provides simple auto completion facilities based on CTags. If a project is initially opened, CTags parses all project files in a background thread and saves the CTags information to <filename class="directory">/tmp</filename>. This file then is used to populate the auto completion popup in &kate;.
tr: Bir projeye ait tüm dosyalar hakkında bilgi sahibi olan proje eklentisi, CTags’lere dayalı temel kendiliğinden tamamlama olanakları sağlar. Bir proje başlangıçta açılırsa CTags tüm proje dosyalarını bir arka plan iş parçacığında ayrıştırır ve CTags bilgisini <filename class="directory">/tmp</filename> dosyasına kaydeder. Bu dosya daha sonra &kate;’deki kendiliğinden tamamlama açılır penceresini doldurmak için kullanılır.

source: In contrast, without this auto completion, &kate; is only capable of showing auto completion items based on the words in the current file. So the auto completion provided by the Project plugin is much more powerful.
tr: Bunun aksine, bu kendiliğinden tamamlama olmadan Kate yalnızca geçerli dosyadaki sözcüklere dayalı olarak kendiliğinden tamamlama ögelerini gösterebilir. Demeli ki, proje eklentisinin sağladığı kendiliğinden tamamlama çok daha güçlüdür.

source: Completion in Projects
tr: Projelerde Tamamlama

source: If CTags is missing, a passive popup warns you about this issue. It is also noteworthy, that the CTags file in <filename class="directory">/tmp</filename> is cleaned up when &kate; exits, so the plugin does not pollute any folder with unwanted files.
tr: CTags eksikse, pasif bir açılır pencere sizi bu konuda uyarır. &kate; çıktığında <filename class="directory">/tmp</filename> konumundaki CTags dosyası temizlenir, böylece eklenti, sisteminizi gereksiz dosyalarla kirletmez.

source: Support for Building the Project
tr: Proje Derleme Desteği

source: Another feature is to have support for the <link linkend="projects-build-support">Build Plugin</link>, so that it automatically is configured correctly.
tr: Bir diğer özellik ise <link linkend="projects-build-support">Yapı Eklentisi</link> desteğidir; böylece kendiliğinden düzgünce yapılandırılır.

source: Creating Projects
tr: Proje Oluşturmak

source: Loading Projects Automatically
tr: Projeleri Kendiliğinden Yüklemek

source: The Project plugin has an auto-loading feature. You can read the file list from the version control system. To this end, auto-loading for the respective version control system needs to be enabled in the settings (enabled by default):
tr: Proje eklentisinin kendiliğinden yükleme özelliği vardır. Dosya listesini sürüm denetim sisteminden okuyabilirsiniz. Bu amaçla, ilgili sürüm denetim sistemi için kendiliğinden yüklemenin ayarlarda etkinleştirilmesi gerekir (öntanımlı olarak etkindir):

source: Project Plugin Configuration
tr: Proje Eklentisi Yapılandırması

source: Creating Projects Manually
tr: Projeleri Elle Oluşturmak

source: You just have to create a <filename>.kateproject</filename> file in the root folder of the project. For instance, the <quote>Kate</quote> <filename>.kateproject</filename> file looks like this:
tr: Yalnızca, projenizin kök klasöründe bir <filename>.kateproject</filename> dosyası oluşturmalısınız. Örneğin, <quote>Kate</quote> <filename>.kateproject</filename> dosyası şöyle görünür:

source: The file content is written in &JSON; syntax. The project name is <quote>Kate</quote>, and the files contained in should be read from &git;.
tr: Dosya içeriği, &JSON; sözdizimi ile yazılır. Proje adı <quote>Kate</quote>’dir ve içerdiği dosyalar &git; ile okunmalıdır.

source: Also supported instead of <literal>git</literal> is subversion through <literal>svn</literal> and mercurial through <literal>hg</literal>. If you do not want to read files from a version control system, you can just invoke kate from command line as: <screen> kate /path/to/folder </screen> or you can tell it to recursively load files from directories as follows:
tr: <literal>git</literal> yerine, <literal>svn</literal> üzerinden Subversion ve <literal>hg</literal> üzerinden Mercurial da desteklenir. Dosyaları bir sürüm denetim sisteminden okumak istemiyorsanız Kate’i komut satırından şöyle çalıştırabilirsiniz: <screen> kate /klasöre/olan/yol </screen> veya aşağıdaki gibi dosyaları klasörlerden özyineli olarak yüklemesini söyleyebilirsiniz:

source: Here, subfolders and filters define what’s part of the project. You can also mix version control and files based on filters. Hidden files will not be retrieved if the option <code>"hidden"</code> is 0. <code>"exclude_patterns"</code> is a list of regex patterns that can be used to exclude folders and files from the project tree. In this example, All files and folders in a directory <filename>build</filename> from the root will be excluded.
tr: Burada, alt klasörler ve süzgeçler neyin projenin bir parçası olduğunu tanımlar. Ayrıca süzgeçlere dayalı tanımları ve sürüm denetim sistemini aynı anda kullanabilirsiniz. <code>"hidden"</code> seçeneği 0 ise gizli dosyalar alınmaz. <code>"exclude_patterns"</code>, dosyaları ve klasörleri proje ağacından dışlamak için kullanılabilecek bir düzenli ifade dizgileri listesidir. Bu örnekte, kök düzeydeki <filename>build</filename> klasöründeki tüm dosyalar ve klasörler dışlanacaktır.

source: If you want to add support for the building, you can write a <filename>.kateproject</filename> like this:
tr: Yapım desteği eklemek istiyorsanız <filename>.kateproject</filename> dosyasını aşağıdaki gibi yazabilirsiniz:

source: The targets specified above will then appear in the <link linkend="kate-application-plugin-build">Build Plugin </link> under <emphasis role="bold"> "Project Plugin Targets"</emphasis>. If the <code>"targets"</code> array is specified then <code>"build"</code>, <code>"clean"</code> and <code>"install"</code> are ignored. Each element in the array specifies a target. <code>"name"</code> is the name of the target, <code>"build_cmd"</code> will be used to build the target, <code>"run_cmd"</code> will be used to run the target. Most important of all is <code>"directory"</code>, this is where the commands will be executed.
tr: Yukarıda belirtilen hedefler <emphasis role="bold">“Proje Eklenti Hedefleri”</emphasis> altındaki <link linkend="kate-application-plugin-build">Yapı Eklentisi</link>’nde görünür. <code>"targets"</code> dizilişi belirtilmişse <code>"build"</code>, <code>"clean"</code> ve <code>"install"</code> yok sayılır. Dizilişteki her bir öge bir hedef belirtir. <code>"name"</code>, hedefin adıdır; <code>"build_cmd"</code>, hedefi yapmak için kullanılır; <code>"run_cmd"</code>, hedefi çalıştırmak için kullanılır. Bunlardan en önemlisi, komutların yürütüleceği <code>"directory"</code>’dir.

source: In case you have a <filename>.kateproject</filename> file tracked by a control version system, but you need to tweak the configuration for a particular workspace, you can save those changes to a separated file named <filename>.kateproject.local</filename>. The content of this file will take precedence over <filename>.kateproject</filename>.
tr: Bir sürüm denetim sistemi tarafından izlenen bir <filename>.kateproject</filename> dosyanız varsa; ancak belirli bir çalışma alanın için olan yapılandırmada ayarlar yapmanız gerekiyorsa bu değişiklikleri <filename>.kateproject.local</filename> adındaki başka bir dosyaya kaydedebilirsiniz. Bu dosyanın içeriğine <filename>.kateproject</filename> dosyasına kıyasla öncelik verilir.

source: <title>Current Project</title>
tr: <title>Geçerli Proje</title>

source: Using <menuchoice><shortcut><keycombo action="simul">&Alt;<keycap>1</keycap></keycombo></shortcut> <guimenu>Projects</guimenu><guimenuitem>Go To</guimenuitem></menuchoice> you can open the <guilabel>Current Project</guilabel> view at the bottom of the editor window with four tabs:
tr: <menuchoice><shortcut><keycombo action="simul">&Alt;<keycap>1</keycap></keycombo></shortcut> <guimenu>Projeler</guimenu><guimenuitem>Git</guimenuitem></menuchoice> menüsünü kullanarak, düzenleyici penceresinin altında dört adet sekmeyle görünecek olan <guilabel>Geçerli Proje</guilabel> görünümünü açabilirsiniz:

source: <screeninfo>Current Project</screeninfo>
tr: <screeninfo>Geçerli Proje</screeninfo>

source: Terminal Panel
tr: Uçbirim Paneli

source: A <link linkend="kate-application-plugin-konsole">Terminal emulator</link> starting in the root folder of the project.
tr: Projenin kök klasöründe başlayan bir <link linkend="kate-application-plugin-konsole">Uçbirim Öykünücüsü</link>.

source: Code Index
tr: Kod İndeksi

source: Entering characters into the search bar will start the search and display matching names of functions, classes, symbols &etc; together with kind, filename and line number.
tr: Arama çubuğuna karakterlerin girilmesi, aramayı başlatacak ve tür, dosya adı ve satır numarasıyla birlikte işlevlerin, sınıfların, sembollerin vb. eşleşen adlarını görüntüleyecektir.

source: Code Analysis
tr: Kod Çözümlemesi

source: Click <guilabel>Start Analysis</guilabel> to run a static code analysis for the C and C++ using <command>cppcheck</command> and to generate a report showing filename, line number, severity (style, warning &etc;) and the issue found.
tr: C ve C++ için <command>cppcheck</command> kullanarak bir durağan kod çözümlemesi başlatmak için <guilabel>Çözümlemeyi Başlat</guilabel>’a tıklayın. Bu; dosya adı, satır numarası, öncelik (biçem, uyarı vb.) ve bulunan sorunu görüntüleyecektir.

source: Notes
tr: Notlar

source: Text entered in this tab will be saved in the file <filename>.kateproject.notes</filename>.
tr: Bu sekmeye girilen metin <filename>.kateproject.notes</filename> dosyasına kaydedilir.

source: The Projects Menu
tr: Projeler Menüsü

source: The <guimenu>Projects</guimenu> menu allows you to switch between currently open projects. It is displayed by the Project plugin.
tr: <guimenu>Projeler</guimenu> menüsü, şu anda açık olan projeler arasında geçiş yapmanızı sağlar. Proje eklentisi tarafından görüntülenir.

source: <shortcut> <keycombo action="simul">&Ctrl;&Alt;&Left;</keycombo> </shortcut> <guimenu>Projects</guimenu> <guimenuitem>Back</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Alt;&Left;</keycombo> </shortcut> <guimenu>Projeler</guimenu> <guimenuitem>Geri</guimenuitem>

source: Switch to the previous project.
tr: Önceki projeye geçin.

source: <shortcut> <keycombo action="simul">&Ctrl;&Alt;&Right;</keycombo> </shortcut> <guimenu>Projects</guimenu> <guimenuitem>Forward</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Alt;&Right;</keycombo> </shortcut> <guimenu>Projeler</guimenu> <guimenuitem>İleri</guimenuitem>

source: Switch to the next project.
tr: Sonraki projeye geçin.

source: <shortcut> <keycombo action="simul">&Alt;<keycap>1</keycap></keycombo> </shortcut> <guimenu>Projects</guimenu><guimenuitem>Go To</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;<keycap>1</keycap></keycombo> </shortcut> <guimenu>Projeler</guimenu><guimenuitem>Git</guimenuitem>

source: Open the <guilabel>Current Project</guilabel> view at the bottom of the editor window.
tr: Düzenleyici penceresinin alt kısmındaki <guilabel>Geçerli Proje</guilabel> görünümünü açın.

source: LSP Client Plugin
tr: LSP İstemcisi Eklentisi

source: The LSP Client plugin provides many language features such as code completion, code navigation or finding references based on the <ulink url="https://microsoft.github.io/language-server-protocol/">Language Server Protocol</ulink>.
tr: <ulink url="https://microsoft.github.io/language-server-protocol/">Dil Sunucusu Protokolü</ulink> tabanlı bir özellik olan LSP İstemcisi eklentisi; kod tamamlama, kod dolaşımı veya başvuru bulma gibi birçok dil özelliği sağlar.

source: Once you have enabled the LSP Client in the plugin page, a new page called LSP Client will appear in your &kate; configuration dialog.
tr: Eklenti sayfasında LSP İstemcisini etkinleştirdiğinizde, &kate; yapılandırma iletişim kutusunda LSP İstemcisi adında yeni bir sayfa görünecektir.

source: If appropriate, a corresponding LSP command is also mentioned in the explanation below, the documentation of which may then provide additional background and interpretation, though it may vary depending on the actual language. The phrase 'current symbol' refers to the symbol corresponding to the current cursor position, as so determined by the language and server implementation.
tr: Uygun olması halinde, aşağıdaki açıklamada karşılık gelen bir LSP komutundan da söz edilmektedir; bunun belgelendirmesi daha sonra ek arka plan ve yorum sağlayabilir; ancak gerçek dile bağlı olarak değişiklik gösterebilir. “Geçerli Sembol” ifadesi, dil ve sunucu uygulaması tarafından belirlenen geçerli imleç konumuna karşılık gelen simgeyi ifade eder.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Go to Definition</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Tanıma Git</guisubmenu>

source: [textDocument/definition] Go to current symbol definition.
tr: [textDocument/definition] Geçerli sembolün tanımına gidin.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Go to Declaration</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Beyana Git</guisubmenu>

source: [textDocument/declaration] Go to current symbol declaration.
tr: [textDocument/declaration] Geçerli sembolün beyanına gidin.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Go to Type Definition</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Tür Tanımına Git</guisubmenu>

source: [textDocument/typeDefinition] Go to current symbol type definition.
tr: [textDocument/typeDefinition] Geçerli sembolün tür tanımına gidin.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Find References</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Başvuruları Bul</guisubmenu>

source: [textDocument/references] Find references to current symbol.
tr: [textDocument/references] Geçerli sembole olan başvuruları bulun.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Find Implementations</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Uygulama Noktalarını Bul</guisubmenu>

source: [textDocument/implementation] Find implementations of current symbol.
tr: [textDocument/implementation] Geçerli sembolün uygulandığı noktaları bulun.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Highlight</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Vurgula</guisubmenu>

source: [textDocument/documentHighlight] Highlight current symbol references in current document.
tr: [textDocument/documentHighlight] Geçerli belgede geçerli sembol başvurularını vurgulayın.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Hover</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Üzerine Gelince Bilgi Göster</guisubmenu>

source: [textDocument/hover] Hover info for current symbol.
tr: [textDocument/hover] Geçerli sembol için üzerine gelinince gösterilen bilgi.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Format</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Biçimlendir</guisubmenu>

source: [textDocument/formatting] [textDocument/rangeFormatting] Format the current document or current selection.
tr: [textDocument/formatting] [textDocument/rangeFormatting] Geçerli belgeyi veya seçimi biçimlendirin.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Rename</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Yeniden Adlandır</guisubmenu>

source: [textDocument/rename] Rename current symbol.
tr: [textDocument/rename] Geçerli sembolü yeniden adlandırın.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Quick Fix</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Tez Düzelt</guisubmenu>

source: [textDocument/codeAction, workspace/executeCommand] Computes and applies a quick fix for a diagnostic on current position (or line).
tr: [textDocument/codeAction, workspace/executeCommand] Geçerli konumda (veya satırda) tanılama için tez bir düzeltmeyi hesaplar ve uygular.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Show selected completion documentation</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Seçili Tamamlama Belgelendirmesini Göster</guisubmenu>

source: Show documentation for a selected item in the completion list.
tr: Tamamlama listesinde seçili bir ögeye ilişkin belgeleri gösterin.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Enable signature help with auto completion</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Kendiliğinden Tamamlamalı İmza Yardımını Etkinleştir</guisubmenu>

source: Also show signature help in the completion list.
tr: Ayrıca tamamlanma listesinde imza yardımını da gösterin.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Include declaration in references</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>Başvurularda Beyanları İçer</guisubmenu>

source: Request to include a symbol's declaration when requesting references.
tr: Başvuru isterken bir sembolün beyanını ekleme talebi.

source: <guimenu>LSP Client</guimenu> <guisubmenu>Add parentheses upon function completion</guisubmenu>
tr: <guimenu>LSP İstemcisi</guimenu> <guisubmenu>İşlev Tamamlamasında Ayraçlar Ekle</guisubmenu>

source: Automatically add a pair of parentheses after completion of a function.
tr: Bir işlevin tamamlanmasından sonra kendiliğinden bir çift ayraç ekleyin.
