Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kate_plugins.po
Languages: tr

source: This allows closing the built-in terminal by pressing the &Esc; key. May cause issues with terminal applications that use &Esc; key, &eg; <application>vim</application>. Add such applications in the text input box below. The items in the list should be separated with comma.
tr: Bu, &Esc; düğmesine basılarak yerleşik uçbirimin kapatılmasına olanak sağlar. &Esc; düğmesini kullanan uçbirim uygulamalarında sorunlara neden olabilir; örneğin, <application>vim</application>. Bu tür uygulamaları aşağıdaki metin kutusuna ekleyin. Listedeki ögeler virgülle ayrılmalıdır.

source: Text Filter Plugin
tr: Metin Süzgeci Eklentisi

source: Using the Text Filter Plugin
tr: Metin Süzgeci eklentisini kullanmak

source: You can use this plugin to process selected text using terminal commands. The selection will be used as input for the command, and the output will either replace the selection or be copied to the clipboard, depending on the user's preference.
tr: Seçili metni uçbirim komutlarını kullanarak işlemek için bu eklentiyi kullanabilirsiniz. Seçim, komutun girdisi olarak kullanılacak ve kullanıcının tercihine bağlı olarak çıktı ya seçimin yerini alacak ya da panoya kopyalanacaktır.

source: Examples:
tr: Örnekler:

source: <command>less /etc/fstab</command> - paste the contents of this file or copy it to the clipboard
tr: <command>less /etc/fstab</command> — bu dosyanın içeriğini yapıştır veya panoya kopyala

source: <command>wc</command> - count lines, words and characters of the selection and paste this into the document or copy it to the clipboard
tr: <command>wc</command> — satırları, sözcükleri ve karakterleri say ve sayıyı belgeye yapıştır veya panoya kopyala

source: <command>sort</command> - sort lines of the selection and paste the result into the document or copy it to the clipboard
tr: <command>sort</command> — seçili satırları sırala ve sonucu belgeye yapıştır veya panoya kopyala

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>\</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guisubmenu>Filter Text</guisubmenu>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>\</keycap></keycombo> </shortcut> <guimenu>Araçlar</guimenu> <guisubmenu>Metni Süz</guisubmenu>

source: <action>Opens</action> the Text Filter dialog:
tr: Metin Süzgeci iletişim kutusunu <action>açar</action>:

source: Text Filter dialog
tr: Metin Süzgeci iletişim kutusu

source: Enter the shell command into the combobox or select a previous command from the history.
tr: Kabuk komutunu çoklu kutuya girin veya geçmişten önceki bir komutu seçin.

source: Copy the result instead of pasting it
tr: Sonucu yapıştırmak yerine kopyala

source: Copy the result to clipboard leaving a document unchanged.
tr: Belgeyi değiştirmeden bırakarak sonucu panoya kopyalayın.

source: Merge STDOUT and STDERR
tr: STDOUT ve STDERR’ı birleştir

source: If checked, an output from STDOUT and STDERR will be merged and no errors will be reported. Otherwise, STDERR will be displayed as a passive message.
tr: İşaretlenirse STDOUT ve STDERR’den gelen çıktılar birleştirilecek ve hiçbir hata bildirilmeyecektir. Aksi halde STDERR pasif bir ileti olarak görüntülenecektir.

source: &XML; Validation
tr: &XML; Doğrulama

source: This plugin checks &XML; files for validity and being well-formed.
tr: Bu eklenti, &XML; dosyalarının geçerliliğini ve iyi biçimliliğini denetler.

source: This plugin checks the current file. A list of warnings and errors will appear at the bottom of &kate;'s main window. You can click on an error message to jump to the corresponding place in the file. If the file has a <quote>DOCTYPE</quote> the DTD given with this doctype will be used to check the file for validity. The DTD is expected at a position relative to the current file, &eg; if the doctype refers to <quote>DTD/xhtml1-transitional.dtd</quote> and the file is <filename>/home/peter/test.xml</filename> the DTD is expected to be located at <filename>/home/peter/DTD/xhtml1-transitional.dtd</filename>. However, remote DTDs specified via http are supported.
tr: Bu eklenti geçerli dosyayı denetler. &kate;’in ana penceresinin altında bir uyarı ve hata listesi görünecektir. Dosyadaki ilgili yere atlamak için bir hata iletisine tıklayabilirsiniz. Dosyanın bir <quote>DOCTYPE</quote>’ı varsa bu belge türüyle verilen DTD, dosyanın geçerliliğini denetlemek için kullanılacaktır. DTD’nin geçerli dosyaya göreceli bir konumda olması beklenir; örneğin, doctype <quote>DTD/xhtml1-transitional.dtd</quote> ise ve dosya da <filename>/home/peter/test.xml</filename> ise DTD’nin <filename>/home/peter/DTD/xhtml1-transitional.dtd</filename> konumunda olması beklenir. Ancak HTTP aracılığıyla uzak DTD’ler de desteklenir.

source: If the file has no doctype it will be checked for being well-formed.
tr: Dosyanın doctype’ı yoksa iyi biçimlendirilmiş olup olmadığı denetlenir.

source: To learn more about &XML; check out the <ulink url="https://www.w3.org/XML/"> official W3C &XML; pages</ulink>.
tr: &XML; hakkında daha fazla bilgi için <ulink url="https://www.w3.org/XML/">resmi W3C &XML; sayfalarına</ulink> bir bakın.

source: Internally this plugin calls the external command <command>xmllint</command>, which is part of libxml2. If this command is not correctly installed on your system, the plugin will not work.
tr: Bu eklenti, içsel olarak libxml2’nin bir parçası olan <command>xmllint</command> dış komutunu çağırır. Bu komut sisteminize doğru şekilde kurulmamışsa eklenti çalışmayacaktır.

source: To load this plugin open &kate;'s configuration dialog under <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &kate;...</guimenuitem></menuchoice>. Then select <guilabel>&XML; Validation</guilabel> which will appear in the <guilabel>Application</guilabel> / <guilabel>Plugins</guilabel> section and close the dialog.
tr: Bu eklentiyi yüklemek için <menuchoice><guimenu>Ayarlar</guimenu> <guimenuitem>&kate; Uygulamasını Yapılandır…</guimenuitem></menuchoice> altındaki &kate; yapılandırma iletişim kutusunu açın. Sonrasında, <guilabel>Uygulama</guilabel>/<guilabel>Eklentiler</guilabel> altındaki <guilabel>&XML; Doğrulama</guilabel>’yı seçin ve iletişim kutusunu kapatın.

source: <guimenu>&XML;</guimenu> <guimenuitem>Validate &XML;</guimenuitem>
tr: <guimenu>&XML;</guimenu> <guimenuitem>&XML;’yi Doğrula</guimenuitem>

source: This will start the check, as described above.
tr: Bu, yukarıda açıklandığı üzere denetimi başlatacaktır.

source: &kate; Plugin <quote>&XML; Validation</quote> copyright 2002 &Daniel.Naber; &Daniel.Naber.mail;.
tr: &kate; eklentisi <quote>&XML; Doğrulama</quote>, Telif hakkı 2002 &Daniel.Naber; &Daniel.Naber.mail;.

source: Documentation copyright 2002 &Daniel.Naber;
tr: Belgelendirme telif hakkı 2002 &Daniel.Naber;

source: &XML; Completion
tr: &XML; Tamamlama

source: This plugin gives hints about what is allowed at a certain position in an &XML; file, according to the file's DTD. It will list possible elements, attributes, attribute values or entities, depending on the cursor position (&eg; all entities are listed if the character on the left of the cursor is <quote>&amp;</quote>). It's also possible to close the nearest open tag on the left.
tr: Bu eklenti, dosyanın DTD’sine göre bir &XML; dosyasında belirli bir konumda nelere izin verildiğine dair ipuçları verir. İmlecin konumuna bağlı olarak olası ögeleri, öznitelikleri, öznitelik değerlerini veya varlıkları listeleyecektir (örneğin, imlecin solundaki karakter <quote>&amp;</quote> ise tüm varlıklar listelenir). Soldaki en yakın açık etiketi kapatmak da olanaklıdır.

source: The <acronym>DTD</acronym> must exist in &XML; format, as produced by the Perl program <command>dtdparse</command>. We will call a DTD in this format <quote>meta DTD</quote>. Some meta DTDs are supplied. They are installed in <filename class="directory">katexmltools/</filename> in <userinput><command>qtpaths</command> <option>--paths GenericDataLocation </option></userinput>, which is also the default folder when you choose <guimenuitem>Assign Meta DTD...</guimenuitem>. To produce your own meta DTDs, get <command>dtdparse</command> from <ulink url="http://dtdparse.sourceforge.net">http://dtdparse.sourceforge.net</ulink>.
tr: <acronym>DTD</acronym> kısaltması, <command>dtdparse</command> Perl programının ürettiği biçimde &XML; biçiminde var olmalıdır. Bu biçimdeki bir DTD’yi <quote>meta DTD</quote> olarak adlandıracağız. Bazı meta DTD’ler sağlanır. Aynı zamanda <guimenuitem>Meta DTD Ata…</guimenuitem> ögesini seçtiğinizdeki öntanımlı klasör olan <userinput><command>qtpaths</command> <option>--paths GenericDataLocation </option></userinput> içindeki <filename class="directory">katexmltools/</filename> bünyesinde kuruludurlar. Kendi meta DTD’lerinizi üretmek için <ulink url="http://dtdparse.sourceforge.net">http://dtdparse.sourceforge.net</ulink> konumundan <command>dtdparse</command>’yi alın.

source: How to Use
tr: Nasıl Kullanılır

source: Start &kate; and open the configuration dialog under <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &kate;...</guimenuitem></menuchoice>. Then select <guilabel>&XML; Completion</guilabel> which will appear in the <menuchoice><guimenu>Application</guimenu> <guimenuitem>Plugins</guimenuitem></menuchoice> page and close the dialog. After that, select <menuchoice><guimenu>&XML;</guimenu><guimenuitem>Assign Meta DTD...</guimenuitem></menuchoice>. If your document contains no <quote>DOCTYPE</quote> or the doctype is unknown, you will have to select a meta DTD from the file system. Otherwise the meta DTD that matches the current document's DOCTYPE will be loaded automatically.
tr: &kate;’i başlatın ve <menuchoice><guimenu>Ayarlar</guimenu> <guimenuitem>&kate; Uygulamasını Yapılandır…</guimenuitem></menuchoice> altındaki yapılandırma iletişim kutusunu açın. Sonrasında, <menuchoice><guimenu>Uygulama</guimenu> <guimenuitem>Eklentiler</guimenuitem></menuchoice> sayfasından <guilabel>&XML; Tamamlama</guilabel>’yı seçin ve iletişim kutusunu kapatın. İzleyen adım olarak, <menuchoice><guimenu>&XML;</guimenu><guimenuitem>Meta DTD Ata…</guimenuitem></menuchoice> yolunu izleyin. Belgenizde bir <quote>DOCTYPE</quote> yoksa veya doctype bilinmiyorsa dosya sisteminizden bir meta DTD seçmeniz gerekecektir. Aksi takdirde, geçerli belgenin DOCTYPE’ı ile eşleşen meta DTD kendiliğinden yüklenir.

source: You can now use the plugin while typing your text:
tr: Şimdi metninizi yazarken eklentiyi kullanabilirsiniz:

source: <keycap>&lt;</keycap> (less than key)
tr: <keycap>&lt;</keycap> (küçüktür)

source: This will trigger a list of possible elements unless the cursor is inside a tag already. Note that you currently cannot use this to insert the top level element (&eg; <quote>&lt;html&gt;</quote>).
tr: Bu, imleç zaten bir etiketin içinde olmadığı sürece olası ögelerin bir listesini tetikleyecektir. Şu anda bunu üst düzey ögeyi eklemek için kullanamayacağınızı unutmayın (&eg; <quote>&lt;html&gt;</quote>).

source: <keycap>&lt;</keycap><keycap>/</keycap>(less than key + slash)
tr: <keycap>&lt;</keycap><keycap>/</keycap>(küçüktür + bölü)

source: Entering these characters will offer to close the current element (nearest open one to the left of the cursor). Press &Enter; to accept the suggestion. Unlike the <guimenuitem>Close Element</guimenuitem> menu item, this works only with a DTD assigned.
tr: Bu karakterlerin girilmesi, geçerli ögenin kapatılmasını sağlayacaktır (imlecin solundaki en yakın açık öğe). Öneriyi kabul etmek için &Enter; düğmesine basın. <guimenuitem>Ögeyi Kapat</guimenuitem> menü ögesinin aksine, bu yalnızca atanmış bir DTD ile çalışır.

source: <keycap>"</keycap> (quote key)
tr: <keycap>"</keycap> (tırnak)

source: The quote key will trigger a list of possible attribute values (if there are any) if you are inside a tag.
tr: Tırnak karakteri, bir etiketin içindeyseniz olası öznitelik değerlerinin (varsa) bir listesini tetikler.

source: <keycap>&nbsp;</keycap> (space key)
tr: <keycap>&nbsp;</keycap> (boşluk)

source: This key will trigger a list of possible attributes for the current element if you are inside a tag.
tr: Bu düğme, eğer bir etiketin içindeyseniz geçerli öge için olası özniteliklerin bir listesini tetikleyecektir.

source: <keycap>&amp;</keycap> (ampersand key)
tr: <keycap>&amp;</keycap> (ve)

source: This key will trigger a list of named entities.
tr: Bu düğme, adlı varlıkların bir listesini tetikler.

source: Features and Limitations
tr: Özellikler ve Sınırlamalar

source: You can test all functions and limitations by loading <filename>katexmltools/testcases.xml</filename> in <userinput><command>qtpaths</command> <option>--paths GenericDataLocation </option></userinput> into &kate; and following the instructions.
tr: <userinput><command>qtpaths</command> <option>--paths GenericDataLocation </option></userinput> içindeki <filename>katexmltools/testcases.xml</filename> dosyasını &kate;’e yükleyip yönergeleri izleyerek tüm işlevleri ve sınırlamaları sınayabilirsiniz.

source: <shortcut> <keycombo action="simul">&Ctrl;&Enter;</keycombo> </shortcut> <guimenu>&XML;</guimenu> <guimenuitem>Insert Element...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Enter;</keycombo> </shortcut> <guimenu>&XML;</guimenu> <guimenuitem>Öge Ekle…</guimenuitem>

source: This will open a dialog that lets you insert an &XML; element. The &lt;, &gt; characters and the closing tag will be inserted automatically. If you have selected text when this menu item is selected, the selected text will be surrounded by the opening and the closing tag. The dialog also offers completion of all elements that may be inserted at the current cursor position if you have assigned a meta DTD by using <guimenuitem>Assign Meta DTD...</guimenuitem>.
tr: Bu bir &XML; ögesi eklemenizi sağlayacak bir iletişim kutusu açacaktır. &lt;, &gt; karakterleri ve kapama etiketi kendiliğinden eklenir. Bu menü ögesi seçildiğinde seçili metin varsa seçili metin açılış ve kapanış etiketi ile çevrili olacaktır. İletişim kutusu ayrıca, <guimenuitem>Meta DTD Ata…</guimenuitem> kullanarak bir meta DTD atadıysanız geçerli imleç konumuna eklenebilecek tüm ögelerin tamamlanmasını da sunar.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>&lt;</keycap></keycombo> </shortcut> <guimenu>&XML;</guimenu> <guimenuitem>Close Element</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>&lt;</keycap></keycombo> </shortcut> <guimenu>&XML;</guimenu> <guimenuitem>Ögeyi Kapat</guimenuitem>

source: This will search your text for a tag that is not yet closed and will close it by inserting the corresponding closing tag. The search starts at the cursor position and goes left. If it cannot find an open tag nothing will happen.
tr: Bu, metninizde henüz kapatılmamış bir etiketi arayacak ve ilgili kapanış etiketini ekleyerek metni kapatacaktır. Arama imleç konumunda başlar ve sola doğru gider. Açık bir etiket bulamazsa hiçbir şey olmayacaktır.

source: <guimenu>&XML;</guimenu> <guimenuitem>Assign Meta DTD...</guimenuitem>
tr: <guimenu>&XML;</guimenu> <guimenuitem>Meta DTD Ata…</guimenuitem>

source: This will tell the plugin which meta DTD to use for the current document. Note that this assignment will not be saved. You will have to repeat it when you start &kate; the next time.
tr: Bu, eklentiye geçerli belge için hangi meta DTD’nin kullanılacağını söyleyecektir. Bu atamanın kaydedilmeyeceğini unutmayın. Bir dahaki kere &kate;’i başlattığınızda bunu yinelemeniz gerekir.

source: &kate; Plugin <quote>&XML; Completion</quote> copyright 2001,2002 &Daniel.Naber; &Daniel.Naber.mail;.
tr: &kate; eklentisi <quote>&XML; Tamamlama</quote>, Telif hakkı 2001,2002 &Daniel.Naber; &Daniel.Naber.mail;.

source: &kde; SC 4 version copyright 2010 Tomáš Trnka
tr: &kde; SC 4 sürümü telif hakkı 2010 Tomáš Trnka

source: Documentation copyright 2001,2002 &Daniel.Naber;
tr: Belgelendirme telif hakkı 2001,2002 &Daniel.Naber;

source: Compiler Explorer Plugin
tr: Derleyici Gezgini Eklentisi

source: The compiler explorer plugin allows you to use compiler explorer from within Kate. Compiler explorer is usually limited to 1 file only and it is difficult to use it to see the codegen of a file in your project. This plugin aims to simplify this process by automatically detecting compile commands for your file.
tr: Derleyici Gezgini eklentisi, Kate’in içinden derleyici gezginini kullanmanızı sağlar. Derleyici Gezgini, genellikle yalnızca 1 dosya ile sınırlıdır ve projenizdeki bir dosyanın kod üretimini görmek için kullanmak zordur. Bu eklenti, dosyanız için derleme komutlarını kendiliğinden algılayarak bu işlemi basitleştirmeyi amaçlamaktadır.

source: Usage
tr: Kullanım

source: The first thing you need to do is to open a compiler explorer tab. Hit <keycombo action="simul">&Ctrl;&Alt;<keycap>I</keycap></keycombo> to open the command bar and search for "Open Current File in Compiler Explorer" and hit enter. You can add this action to the toolbar or assign a shortcut to it for easier access.
tr: İlk yapmanız gereken şey bir derleyici gezgini sekmesi açmaktır. <keycombo action="simul">&Ctrl;&Alt;<keycap>I</keycap></keycombo> kısayolunu kullanarak komut çubuğunu açın ve “Geçerli Dosyayı Derleyici Gezgininde Aç” ifadesini arayıp Giriş düğmesine basın. Daha hızlı erişim için bu eylemi bir araç çubuğuna ekleyebilir veya bir kısayol atayabilirsiniz.

source: Next you need to setup a local instance of compiler explorer or use the public <ulink url="https://godbolt.org/">https://godbolt.org/</ulink> instance. See <ulink url="https://github.com/compiler-explorer/compiler-explorer">https://github.com/compiler-explorer/compiler-explorer</ulink>. Once you have an instance, click on <guilabel>Option</guilabel> combobox in the compiler explorer tab you opened earlier and select <guilabel>Change Url...</guilabel> and then enter the url of the compiler explorer server.
tr: Sonrasında, yerel bir derleyici gezgini örneği ayarlamalı veya genel <ulink url="https://godbolt.org/">https://godbolt.org/</ulink> örneğini kullanacak biçimde yapılandırmalısınız. <ulink url="https://github.com/compiler-explorer/compiler-explorer">https://github.com/compiler-explorer/compiler-explorer</ulink> sayfasına bakın. Bir örneğinin olduktan sonra, daha önce açtığınız derleyici gezgini sekmesindeki <guilabel>Seçenek</guilabel> çoklu kutusuna tıklayın ve <guilabel>URL’yi Değiştir…</guilabel> seçeneğini kullanıp derleyici gezgini sunucusunun URL’sini girin.

source: Next you need a compile_commands.json if you need to see codegen for a file in your project. Otherwise you can skip this part. This can easily be obtained if you are using a modern build system like CMake or Meson. For CMake it is enough to pass <code>-DCMAKE_EXPORT_COMPILE_COMMANDS=ON</code> when invoking cmake. The <code>compile_commands.json</code> should be placed at the root of your project. Close and reopen the compiler explorer tab in Kate. After reopening the tab it should show the compile commands need to compile the file
tr: Sonrasında, projenizdeki bir dosyanın kod üretimini görmek istiyorsanız bir compile_commands.json dosyasına gereksiniminiz olaacak. İstemiyorsanız bu kısmı atlayabilirsiniz. Bu, CMake veya Meson gibi çağdaş bir yapı sistemi kullanıyorsanız kolaylıkla elde edilebilir. CMake için onu çağırırken <code>-DCMAKE_EXPORT_COMPILE_COMMANDS=ON</code> argümanını geçirmek yeterlidir. <code>compile_commands.json</code> dosyası, projenizin kök dizinine yerleştirilir. Kate içindeki derleyici gezgini sekmesini kapatıp yeniden açın. Sekme yeniden açıldıktan sonra dosyayı derlemek için gerekli derleme komutlarını göstermelidir.

source: If you are just using compiler explorer to see the codegen for something temporary, you can just write down the compile commands for your file and click the <guilabel>Compile</guilabel>. Note that auto recompilation on editing is not supported. You need to click Compile every time you want to recompile the file
tr: Derleyici Gezgini’ni yalnızca geçici bir şeyin kod üretimini görmek için kullanıyorsanız dosyanız için olan derleme komutlarını yazıp <guilabel>Derle</guilabel>’ye tıklayabilirsiniz. Kendiliğinden yeniden derleme veya düzenleme desteklenmemektedir. Dosyayı yeniden derlemek istediğiniz her zaman Derle’ye tıklamanız gerekir.

source: Once the file is compiled you should see the codegen on the right hand side. You can right-click and select <guilabel>Reveal linked code</guilabel> to see the codegen for a particular line. Similarly on the right hand side, you can right click and select <guilabel>Scroll to source</guilabel> to show the source code for a given codegen line
tr: Dosya derlendiğinde kod üretimini sağ tarafta görüyor olmalısınız. Belirli bir satır için olan kod üretimini görmek istiyorsanız satıra sağ tıklayıp <guilabel>Bağlantılı Kodu Ortaya Çıkar</guilabel> seçeneğini kullanın. Yine aynı biçimde sağ tarafta sağ tıklayıp <guilabel>Kaynağa Sar</guilabel> yaparak verilen bir kod üretimi satırı için olan kaynak kodu görebilirsiniz.

source: Formatting Plugin
tr: Biçimlendirme Eklentisi

source: The formatting plugin allows one to format code easily. The plugin aims to preserve the document's undo history and user's cursor position when formatting the code so that the formatting of code doesn't disrupt user's work. This is especially important for automatic formatting on save.
tr: Biçimlendirme eklentisi, kodun kolayca biçimlendirilmesini sağlar. Eklenti, kodun biçimlendirilmesinin kullanıcının çalışmasını bozmaması için kodu biçimlendirirken belgenin geri alma geçmişini ve kullanıcının imleç konumunu korumayı amaçlamaktadır. Bu, özellikle kaydederken kendiliğinden biçimlendirme için önemlidir.

source: It allows the user to format code in two ways:
tr: Bu, kullanıcının kodu iki şekilde biçimlendirmesine olanak tanır:

source: Manually using the "Format Document" action.
tr: “Belgeyi Biçimlendir” seçeneğini kullanarak elle

source: Automatically on save
tr: Kaydederken kendiliğinden

source: You can search for this action in the command bar and bind a shortcut to it for easier access
tr: Bu eylemi komut çubuğunda arayabilir ve kolay erişim için onu bir kısayola bağıntılayabilirsiniz.

source: Supported languages and formatters
tr: Desteklenen diller ve biçimlendiriciler

source: The current list of supported languages and formatters are as follows:
tr: Şu anda desteklenen dillerin ve biçimlendiricilerin bir listesi aşağıdadır:

source: Configuring
tr: Yapılandırma

source: The plugin can be configured in two ways:
tr: Eklenti iki şekilde yapılandırılabilir:

source: Globally, from the Configure dialog
tr: Yapılandırma iletişim kutusundan global olarak

source: On a per project basis using the <filename>.kateproject</filename> file
tr: <filename>.kateproject</filename> dosyasını kullanarak projeye özel bir biçimde

source: When reading the config, the plugin will first try to read the config from <filename>.kateproject</filename> file and then read the global config. Example:
tr: Yapılandırmayı okurken eklenti, ilk <filename>.kateproject</filename> dosyasındaki yapılandırmayı okumaya çalışacak, sonra global yapılandırmaya geçecektir. Örneğin:

source: The above:
tr: Yukarıda:

source: enables "format on save" globally
tr: “kaydederken biçimlendirme”yi global olarak etkinleştirir

source: specifies "jq" as the formatter for JSON
tr: “jq”yü JSON biçimlendiricisi olarak belirtir

source: disables "format on save" for cmake-format and autopep8
tr: cmake-format ve autopep8 için “kaydederken biçimlendirme”yi devre dışı bırakır
