Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_configuring.po
Languages: tr

source: In this example, all files use a tab-width of 4 spaces, an indent-width of 4 spaces, and tabs are replaced expanded to spaces. However, for all <filename class="extension">*.xml</filename> files, the indent width is set to 2 spaces. And Makefiles use tabs, &ie; tabs are not replaced with spaces.
tr: Bu örnekte, tüm dosyalar 4 boşluktan oluşan sekme genişliği kullanır, girinti genişliği 4 boşluktur ve sekmeler genişletilerek boşluklarla değiştirilir. Ancak tüm <filename class="extension">*.xml</filename> dosyaları için girinti genişliği 2 boşluktur. Makefile dosyaları sekmeler kullanır; örneğin, sekmeler boşluklarla değiştirilmez.

source: Wildcards are semicolon separated, &ie; you can also specify multiple file extensions as follows:
tr: Joker karakterleri noktalı virgülle ayrılır; ayrıca birden fazla dosya uzantısını aşağıdaki gibi de belirtebilirsiniz:

source: Further, you can also use the &MIME; type to match certain files, &eg; to indent all C++ source files with 4 spaces, you can write:
tr: Ayrıca, belirli dosyaları eşleştirmek için &MIME; türünü de kullanabilirsiniz; örneğin, tüm C++ kaynak dosyalarını 4 boşlukla girintilemek için şunu yazabilirsiniz:

source: Next to the support in <filename>.kateconfig</filename> files, wildcard and &MIME; type dependent document variables are also supported in the files itself as comments.
tr: <filename>.kateconfig</filename> dosyalarındaki desteğin yanı sıra, joker karakterlerine ve &MIME; türüne bağlı belge değişkenleri de dosyaların kendisinde yorumlar olarak desteklenir.
