Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/katepart_regular-expressions.po
Languages: tr

source: To avoid ambiguities with usage of <userinput>\1</userinput> with some digits behind it (&eg; <userinput>\12</userinput> can be 12th subpattern or just the first subpattern with <userinput>2</userinput>) we use <userinput>\{12}</userinput> as syntax for multi-digit subpatterns.
tr: <userinput>\1</userinput> kullanımı ile ilgili anlatım bozukluklarını önlemek için ardına birkaç rakam koyun (&eg; <userinput>\12</userinput>, 12. alt dizgi veya <userinput>2</userinput> içeren ilk alt dizgi olabilir); birden çok rakamlı alt dizgiler için biz <userinput>\{12}</userinput> kullanıyoruz.

source: Examples:
tr: Örnekler:

source: <userinput>\{12}1</userinput> is <quote>use subpattern 12</quote>
tr: <userinput>\{12}1</userinput>, <quote>12 alt dizgisini kullan</quote> anlamına gelir

source: <userinput>\123</userinput> is <quote>use capture 1 then 23 as the normal text</quote>
tr: <userinput>\123</userinput>, <quote>yakalama 1’i kullan, sonrasında 23’ü normal metin olarak kullan</quote> anlamına gelir

source: Lookahead Assertions
tr: İleri Savlar

source: A lookahead assertion is a sub pattern, starting with either <literal>?=</literal> or <literal>?!</literal>.
tr: Bir ileri sav, ya <literal>?=</literal> ya da <literal>?!</literal> ile başlayan bir alt dizgidir.

source: For example to match the literal string <quote>Bill</quote> but only if not followed by <quote> Gates</quote>, you could use this expression: <userinput>Bill(?! Gates)</userinput>. (This would find <quote>Bill Clinton</quote> as well as <quote>Billy the kid</quote>, but silently ignore the other matches.)
tr: <quote>Bill</quote> dizisi ile yalnızca ardından <quote> Gates</quote> gelmiyorsa eşleşmek istiyorsanız şu ifadeyi kullanabilirsiniz: <userinput>Bill(?! Gates)</userinput>. (Bu, hem <quote>Bill Clinton</quote>’u hem de <quote>Billy the kid</quote>’i bulur; ancak diğer eşleşmeleri sessizce yok sayar.)

source: Sub patterns used for assertions are not captured.
tr: Savlar için kullanılan alt dizgiler yakalanmaz.

source: See also <link linkend="assertions">Assertions</link>.
tr: Ayrıca <link linkend="assertions">Savlar</link> bölümüne bakın.

source: Lookbehind Assertions
tr: Arkaya Savlar

source: A lookbehind assertion is a sub pattern, starting with either <literal>?&lt;=</literal> or <literal>?&lt;!</literal>.
tr: Bir arkaya sav, ya <literal>?&lt;=</literal> ya da <literal>?&lt;!</literal> ile başlayan bir alt dizgidir.

source: Lookbehind has the same effect as the lookahead, but works backwards. For example to match the literal string <quote>fruit</quote> but only if not preceded by <quote>grape</quote>, you could use this expression: <userinput>(?&lt;!grape)fruit</userinput>.
tr: Arka sav, ileri sav ile aynı etkiye sahiptir; ancak geriye doğru çalışır. Örneğin, <quote>fruit</quote> gerçek dizisiyle yalnızca önünde <quote>grape</quote> yoksa eşleşmek istiyorsanız <userinput>(?&lt;!grape)fruit</userinput> ifadesini kullanabilirsiniz.

source: See also <link linkend="assertions">Assertions</link>
tr: Ayrıca <link linkend="assertions">Savlar</link> bölümüne bakın

source: Characters with a special meaning inside patterns
tr: Dizgiler içinde özel anlam taşıyan karakterler

source: The following characters have meaning inside a pattern, and must be escaped if you want to literally match them:
tr: Aşağıdaki karakterlerin bir dizgi içinde anlamı vardır ve bunları tam anlamıyla eşleştirmek istiyorsanız kaçış karakterlerinin kullanılması gerekir:

source: The escape character.
tr: Kaçış karakteri.

source: Asserts the beginning of the string.
tr: Dizinin başını bildirir.

source: Asserts the end of string.
tr: Dizinin sonunu bildirir.

source: <userinput>()</userinput> (left and right parentheses)
tr: <userinput>()</userinput> (sol ve sağ parantez)

source: Denotes sub patterns.
tr: Alt dizgileri bildirir.

source: <userinput>{}</userinput> (left and right curly braces)
tr: <userinput>{}</userinput> (sol ve sağ süslü ayraçlar)

source: Denotes numeric quantifiers.
tr: Sayısal niceleyicileri bildirir.

source: <userinput>[]</userinput> (left and right square brackets)
tr: <userinput>[]</userinput> (sol ve sağ köşeli ayraçlar)

source: Denotes character classes.
tr: Karakter sınıflarını bildirir.

source: <userinput>|</userinput> (vertical bar)
tr: <userinput>|</userinput> (dikey çubuk)

source: logical OR. Separates alternatives.
tr: Mantıksal OR. Alternatifleri ayırır.

source: <userinput>+</userinput> (plus sign)
tr: <userinput>+</userinput> (artı işareti)

source: Quantifier, 1 or more.
tr: Niceleyici, 1 veya daha çok.

source: <userinput>*</userinput> (asterisk)
tr: <userinput>*</userinput> (yıldız işareti)

source: Quantifier, 0 or more.
tr: Niceleyici, 0 veya daha çok.

source: <userinput>?</userinput> (question mark)
tr: <userinput>?</userinput> (soru işareti)

source: An optional character. Can be interpreted as a quantifier, 0 or 1.
tr: İsteğe bağlı bir karakter. Bir niceleyici olarak yorumlanabilir, 0 veya 1.

source: <title>Quantifiers</title>
tr: <title>Niceleyiciler</title>

source: <emphasis>Quantifiers</emphasis> allows a regular expression to match a specified number or range of numbers of either a character, character class or sub pattern.
tr: <emphasis>Niceleyiciler</emphasis>, düzenli bir ifadenin bir karakterin, karakter sınıfının veya alt dizginin belirli bir sayısı veya sayı erimiyle eşleşmesine olanak tanır.

source: Quantifiers are enclosed in curly brackets (<literal>{</literal> and <literal>}</literal>) and have the general form <literal>{[minimum-occurrences][,[maximum-occurrences]]}</literal>
tr: Niceleyiciler süslü ayraçlar içine alınır (<literal>{</literal> ve <literal>}</literal>) ve genellikle <literal>{[en-az-oluş][,[en-çok-oluş]]}</literal> biçimindedirler

source: The usage is best explained by example:
tr: Kullanımları en iyi örnekle açıklanabilir:

source: Exactly 1 occurrence
tr: Tam 1 oluş

source: Zero or 1 occurrences
tr: Sıfır veya 1 oluş

source: The same, with less work;)
tr: Aynısı, daha kısası ;)

source: At least 5 but maximum 10 occurrences.
tr: En az 5; ancak en çok 10 oluş.

source: At least 5 occurrences, no maximum.
tr: En az 5 oluş, sınırsız.

source: Additionally, there are some abbreviations:
tr: Ek olarak, bazı kısaltmalar vardır:

source: similar to <literal>{0,}</literal>, find any number of occurrences.
tr: <literal>{0,}</literal> gibi, herhangi bir sayıda oluş bul.

source: similar to <literal>{1,}</literal>, at least 1 occurrence.
tr: <literal>{1,}</literal> gibi, en az 1 oluş.

source: similar to <literal>{0,1}</literal>, zero or 1 occurrence.
tr: <literal>{0,1}</literal> gibi, sıfır veya 1 oluş.

source: Greed
tr: Açgözlülük

source: When using quantifiers with no maximum, regular expressions defaults to match as much of the searched string as possible, commonly known as <emphasis>greedy</emphasis> behavior.
tr: En çok değere sahip olmayan niceleyiciler kullanılırken, düzenli ifadeler aranan dizinin olabildiğince büyük bölümüyle eşleşmeye öntanımlıdır, buna genellikle <emphasis>açgözlü</emphasis> davranış denir.

source: Modern regular expression software provides the means of <quote>turning off greediness</quote>, though in a graphical environment it is up to the interface to provide you with access to this feature. For example a search dialog providing a regular expression search could have a check box labeled <quote>Minimal matching</quote> as well as it ought to indicate if greediness is the default behavior.
tr: Çağdaş düzenli ifade yazılımları, <quote>açgözlülüğü kapatmanın</quote> yollarını sağlar; ancak grafiksel bir ortamda bu özelliğe erişmenizi sağlamak arayüzün sorumluluğundadır. Örneğin, düzenli ifade araması sağlayan bir arama iletişim kutusunda <quote>En az eşleşme</quote> etiketli bir onay kutusu bulunabilir ve ayrıca açgözlülüğün öntanımlı davranış olup olmadığının belirtilmesi gerekir.

source: In context examples
tr: Bağlamsal örnekler

source: Here are a few examples of using quantifiers:
tr: Niceleyicilerin kullanımına ilişkin birkaç örnek:

source: Matches the digits in <quote>1234 go</quote> and <quote>12345 now</quote>, but neither in <quote>567 eleven</quote> nor in <quote>223459 somewhere</quote>.
tr: <quote>1234 go</quote> ve <quote>12345 now</quote> içindeki rakamlarla eşleşir; ancak <quote>567 eleven</quote> veya <quote>223459 somewhere</quote> içindekilerle eşleşmez.

source: Matches one or more whitespace characters.
tr: Bir veya daha çok boşluk karakteriyle eşleşir.

source: Matches all of <quote>blablabla</quote> and the <quote>bla</quote> in <quote>blackbird</quote> or <quote>tabla</quote>.
tr: <quote>blablabla</quote> dizisinin tümüyle ve <quote>blackbird</quote> veya <quote>tabla</quote> içindeki <quote>bla</quote> ile eşleşir.

source: Matches <quote>/&gt;</quote> in <quote>&lt;closeditem/&gt;</quote> as well as <quote>&gt;</quote> in <quote>&lt;openitem&gt;</quote>.
tr: <quote>&lt;closeditem/&gt;</quote> içindeki <quote>/&gt;</quote> ile ve <quote>&lt;openitem&gt;</quote> içindeki <quote>&gt;</quote> ile eşleşir.

source: <title>Assertions</title>
tr: <title>Savlar</title>

source: <emphasis>Assertions</emphasis> allows a regular expression to match only under certain controlled conditions.
tr: <emphasis>Savlar</emphasis>, düzenli bir ifadenin yalnızca belirli denetimli koşullar altında eşleşmesine olanak tanır.

source: An assertion does not need a character to match, it rather investigates the surroundings of a possible match before acknowledging it. For example the <emphasis>word boundary</emphasis> assertion does not try to find a non word character opposite a word one at its position, instead it makes sure that there is not a word character. This means that the assertion can match where there is no character, &ie; at the ends of a searched string.
tr: Bir savın eşleşecek bir karaktere gereksinimi yoktur; olası bir eşleşmeyi onaylamadan önce çevreyi araştırır. Örneğin, <emphasis>sözcük sınırı</emphasis> savı, konumunda bir sözcüğün karşısında sözcük olmayan bir karakter bulmaya çalışmaz, bunun yerine bir sözcük karakterinin bulunmadığından emin olur. Bu, hiçbir karakterin olmadığı durumda iddianın eşleşebileceği anlamına gelir; örneğin aranan bir dizinin sonunda.

source: Some assertions actually do have a pattern to match, but the part of the string matching that will not be a part of the result of the match of the full expression.
tr: Bazı savların aslında eşleşecek bir dizgisi vardır; ancak dizi eşleşmesinin parçası, tam ifade eşleşmesinin sonucunun bir parçası olmayacaktır.

source: Regular Expressions as documented here supports the following assertions:
tr: Burada belgelenen düzenli ifadeler aşağıdaki savları destekler:

source: <userinput>^</userinput> (caret: beginning of string)
tr: <userinput>^</userinput> (şapka: dizinin başı)

source: Matches the beginning of the searched string.
tr: Aranan dizinin başlangıcıyla eşleşir.

source: The expression <userinput>^Peter</userinput> will match at <quote>Peter</quote> in the string <quote>Peter, hey!</quote> but not in <quote>Hey, Peter!</quote>
tr: <userinput>^Peter</userinput> ifadesi, <quote>Peter, hey!</quote> dizisindeki <quote>Peter</quote> ile eşleşir; ancak <quote>Hey, Peter!</quote> ile eşleşmez

source: <userinput>$</userinput> (end of string)
tr: <userinput>$</userinput> (dizi sonu)

source: Matches the end of the searched string.
tr: Aranan dizinin sonuyla eşleşir.

source: The expression <userinput>you\?$</userinput> will match at the last you in the string <quote>You didn't do that, did you?</quote> but nowhere in <quote>You didn't do that, right?</quote>
tr: <userinput>you\?$</userinput> ifadesi, <quote>You didn’t do that, did you?</quote> dizisindeki son you ile eşleşir; ancak <quote>You didn’t do that, right?</quote> ile eşleşmez

source: <userinput>\b</userinput> (word boundary)
tr: <userinput>\b</userinput> (sözcük sınırı)

source: Matches if there is a word character at one side and not a word character at the other.
tr: Bir tarafta sözcük karakteri varken diğer tarafta yoksa eşleşir.

source: This is useful to find word ends, for example both ends to find a whole word. The expression <userinput>\bin\b</userinput> will match at the separate <quote>in</quote> in the string <quote>He came in through the window</quote>, but not at the <quote>in</quote> in <quote>window</quote>.
tr: Bu, sözcük sonlarını bulmak için kullanışlıdır; örneğin, bir sözcüğün tamamını bulmak için her iki uç da kullanılabilir. <userinput>\bin\b</userinput> ifadesi, <quote>He came in through the window</quote> dizisindeki <quote>in</quote> ile eşleşir; ancak <quote>window</quote> içindeki <quote>in</quote> ile eşleşmez.

source: <userinput>\B</userinput> (non word boundary)
tr: <userinput>\B</userinput> (sözcük sınırı olmayan)

source: Matches wherever <quote>\b</quote> does not.
tr: <quote>\b</quote> ifadesinin eşleşmediği her yerde eşleşir.

source: That means that it will match for example within words: The expression <userinput>\Bin\B</userinput> will match at in <quote>window</quote> but not in <quote>integer</quote> or <quote>I'm in love</quote>.
tr: Bu, örneğin sözcüğün içinde eşleşeceği anlamına gelir: <userinput>\Bin\B</userinput> ifadesi, <quote>window</quote> ile eşleşir; ancak <quote>integer</quote> veya <quote>I’m in love</quote> ile eşleşmez.

source: <userinput>(?=PATTERN)</userinput> (Positive lookahead)
tr: <userinput>(?=DİZGİ)</userinput> (pozitif ileri bakış)

source: A lookahead assertion looks at the part of the string following a possible match. The positive lookahead will prevent the string from matching if the text following the possible match does not match the <emphasis>PATTERN</emphasis> of the assertion, but the text matched by that will not be included in the result.
tr: İleriye bakan bir sav, dizinin olası bir eşleşmeyi takip eden kısmına bakar. Olası eşleşmeyi takip eden metin savın <emphasis>DİZGİ</emphasis>’siyle eşleşmezse pozitif bakış dizinin eşleşmesini engeller; ancak bununla eşleşen metin sonuçta içerilmez.

source: The expression <userinput>handy(?=\w)</userinput> will match at <quote>handy</quote> in <quote>handyman</quote> but not in <quote>That came in handy!</quote>
tr: <userinput>handy(?=\w)</userinput> ifadesi <quote>handyman</quote> içindeki <quote>handy</quote> ile eşleşir; ancak <quote>That came in handy!</quote> içindekiyle eşleşmez

source: <userinput>(?!PATTERN)</userinput> (Negative lookahead)
tr: <userinput>(?!DİZGİ)</userinput> (negatif ileri bakış)

source: The negative lookahead prevents a possible match to be acknowledged if the following part of the searched string does match its <emphasis>PATTERN</emphasis>.
tr: Negatif bakış, aranan dizinin aşağıdaki bölümünün <emphasis>DİZGİ</emphasis> ile eşleşmesi durumunda olası bir eşleşmenin onaylanmasını önler.

source: The expression <userinput>const \w+\b(?!\s*&amp;)</userinput> will match at <quote>const char</quote> in the string <quote>const char* foo</quote> while it can not match <quote>const QString</quote> in <quote>const QString&amp; bar</quote> because the <quote>&amp;</quote> matches the negative lookahead assertion pattern.
tr: <userinput>const \w+\b(?!\s*&amp;)</userinput> ifadesi, <quote>const char* foo</quote> içindeki <quote>const char</quote> ile eşleşir; ancak <quote>const QString&amp; bar</quote> içindeki <quote>const QString</quote> ile eşleşmez; çünkü <quote>&amp;</quote> negatif ileriye bakan sav dizgisi ile eşleşir.

source: <userinput>(?&lt;=PATTERN)</userinput> (Positive lookbehind)
tr: <userinput>(?&lt;=DİZGİ)</userinput> (pozitif geri bakış)

source: Lookbehind has the same effect as the lookahead, but works backwards. A lookbehind looks at the part of the string previous a possible match. The positive lookbehind will match a string only if it is preceded by the <emphasis>PATTERN</emphasis> of the assertion, but the text matched by that will not be included in the result.
tr: Arkaya bakma, ileriye bakmayla aynı etkiye sahiptir; ancak geriye doğru çalışır. Geriye doğru bir bakış, dizinin olası bir eşleşmeden önceki kısmına bakar. Pozitif geriye bakış, yalnızca savın <emphasis>DİZGİ</emphasis>’sinden önce geliyorsa bir diziyle eşleşir; ancak bununla eşleşen metin sonuçta içerilmez.

source: The expression <userinput>(?&lt;=cup)cake</userinput> will match at <quote>cake</quote> if it is succeeded by <quote>cup</quote> (in <quote>cupcake</quote> but not in <quote>cheesecake</quote> or in <quote>cake</quote> alone).
tr: <userinput>(?&lt;=cup)cake</userinput> ifadesi,<quote>cake</quote> ile yalnızca önünde <quote>cup</quote> geliyorsa eşleşir (<quote>cupcake</quote> gibi; ancak <quote>cheesecake</quote> veya tek başına <quote>cake</quote> değilse).

source: <userinput>(?&lt;!PATTERN)</userinput> (Negative lookbehind)
tr: <userinput>(?&lt;!DİZGİ)</userinput> (negatif geri bakış)

source: The negative lookbehind prevents a possible match to be acknowledged if the previous part of the searched string does match its <emphasis>PATTERN</emphasis>.
tr: Negatif geriye bakış, aranan dizinin önceki kısmı <emphasis>DİZGİ</emphasis> ile eşleşmiyorsa olası bir eşleşmenin onaylanmasını önler.

source: The expression <userinput>(?&lt;![\w\.])[0-9]+</userinput> will match at <quote>123</quote> in the strings <quote>=123</quote> and <quote>-123</quote> while it can not match <quote>123</quote> in <quote>.123</quote> or <quote>word123</quote>.
tr: <userinput>(?&lt;![\w\.])[0-9]+</userinput> ifadesi, <quote>=123</quote> ve <quote>-123</quote> dizilerindeki <quote>123</quote> ile eşleşir; ancak <quote>.123</quote> veya <quote>word123</quote> içindeki <quote>123</quote> ile eşleşemez.

source: <userinput>(PATTERN)</userinput> (Capturing group)
tr: <userinput>(DİZGİ)</userinput> (yakalayan grup)

source: The sub pattern within the parentheses is captured and remembered, so that it can be used in back references. For example, the expression <userinput>(&amp;quot;+)[^&amp;quot;]*\1</userinput> matches <userinput>&quot;&quot;&quot;&quot;text&quot;&quot;&quot;&quot;</userinput> and <userinput>&quot;text&quot;</userinput>.
tr: Parantez içindeki alt dizgi yakalanır ve anımsanır; böylece geriye başvurularda kullanılabilir. Örneğin, <userinput>(&amp;quot;+)[^&amp;quot;]*\1</userinput> ifadesi, <userinput>&quot;&quot;&quot;&quot;text&quot;&quot;&quot;&quot;</userinput> ve <userinput>&quot;text&quot;</userinput> ile eşleşir.

source: See the section <link linkend="regex-capturing">Capturing matching text (back references)</link> for more information.
tr: Daha fazla bilgi için <link linkend="regex-capturing">Eşleşen metni yakalamak (geriye başvurular)</link> bölümüne bakın.

source: <userinput>(?:PATTERN)</userinput> (Non-capturing group)
tr: <userinput>(?:DİZGİ)</userinput> (yakalamayan grup)

source: The sub pattern within the parentheses is not captured and is not remembered. It is preferable to always use non-capturing groups if the captures will not be used.
tr: Parantez içindeki alt dizgi yakalanmaz ve anımsanmaz. Yakalamalar kullanılmayacaksa her zaman yakalamayan grupların kullanılması tercih edilir.
