Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kbackup.po
Languages: tr

source: The &kbackup; Handbook
tr: &kbackup; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Applications 18.04
tr: Uygulamalar 18.04

source: &kbackup; is an application which lets you back up your data in a simple, user friendly way.
tr: &kbackup;, verilerinizi basit, kullanıcı dostu bir şekilde yedeklemenizi sağlayan bir uygulamadır.

source: system
tr: sistem

source: KBackup
tr: K Yedek

source: backup
tr: yedek

source: storage
tr: depolama

source: archive
tr: arşiv

source: Introduction
tr: Giriş

source: &kbackup; is a program that lets you back up any folders or files, whereby it uses an easy to use folder tree to select the things to back up. It lets you save your settings in so-called <quote>profile</quote> files, where a profile is a simple text file containing definitions for folders and files to be included or excluded from the backup process. Also, it lets you define where the backup shall be saved to. The target can be either a local folder (&eg; a locally mounted device like a ZIP drive, USB stick, &etc;) but it can also be any remote &URL; (&eg; smb://remote/some_path) to back up your data to some central server, &etc;
tr: &kbackup;, herhangi bir klasörü veya dosyayı yedeklemenizi sağlayan bir programdır; bu sayede, yedeklenecek şeyleri seçmek için kullanımı kolay bir klasör ağacı kullanır. Ayarlarınızı <quote>profil</quote> adı verilen dosyalara kaydetmenize olanak tanır; burada profil, yedekleme işlemine dahil edilecek veya yedekleme işleminden dışlanacak klasörler ve dosyalar için tanımları içeren basit bir metin dosyasıdır. Ayrıca yedeğin nereye kaydedileceğini tanımlamanıza da olanak tanır. Bu, bir yerel klasör olabileceği gibi (örn. yerel olarak bağlanmış bir ZIP sürücüsü, USB bellek vb.) verinizi herhangi merkezi bir sunucuya yedeklemek için uzak bir &URL; de olabilir (&eg; smb://uzak/yol).

source: The program can also run an automated backup without using a graphical user interface. One can simply create a profile and use these settings to tell &kbackup; what to do when running in non-interactive mode, &eg; by starting it from a cron job.
tr: Program ayrıca grafiksel bir kullanıcı arayüzü kullanmadan otomatik bir yedekleme çalıştırabilir. Bir profil oluşturulup bu ayarları kullanarak &kbackup;’e etkileşimli olmayan kipte kullanılırken ne yapacağını söyleyebilir; örneğin, bir cron işinden başlatılarak.

source: The program was designed to be very simple in its use so that it can be used by non-computer experts.
tr: Program, bilgisayar uzmanı olmayan kişilerin de kullanabileceği şekilde kullanımı oldukça basit olacak şekilde tasarlandı.

source: The storage format is the well known TAR format, whereby the data can still be stored in compressed format (xz, bzip2 or gzip).
tr: Depolama biçimi, iyi bilinen TAR biçimidir, bu sayede veriler hâlâ sıkıştırılmış biçimde (xz, bzip2 veya gzip) saklanabilir.

source: The current implementation features only the backup step. To restore data back into your system, you currently have to use, &eg;, &dolphin; to open the TAR backup files and drag/drop the files back to your file system. This is also an advantage of the usage of the well known and well supported TAR file format.
tr: Geçerli uygulama şekli yalnızca yedekleme adımını içerir. Veriyi sisteminize geri yüklemek için şu anda; örneğin, TAR yedekleme dosyalarını açmak ve dosyaları dosya sisteminize geri sürükleyip bırakmak için &dolphin; kullanmanız gerekir. Bu aynı zamanda iyi bilinen ve iyi desteklenen TAR dosya biçimini kullanmanın da bir avantajıdır.

source: If the files are compressed, you can uncompress all files from the current folder recursively down with the following command:
tr: Dosyalar sıkıştırılmışsa aşağıdaki komutu kullanarak geçerli klasördeki tüm dosyaları özyineli olarak açabilirsiniz:

source: Alternatively you can use &ark; to extract a full backup or just a few files from a backup.
tr: Alternatif olarak, tam bir yedeklemeyi çıkarmak veya yedek içinden birkaç dosya seçmek için &ark; kullanabilirsiniz.

source: Using &kbackup;
tr: &kbackup; Kullanımı

source: All you need to do is to select which folders you want to store. This is done by selecting all the folders in the tree view on the left side of the main window.
tr: Tek yapmanız gereken hangi klasörleri depolamak istediğinizi seçmektir. Bu, ana pencerenin sol tarafındaki ağaç görünümündeki tüm klasörlerin seçilmesiyle yapılır.

source: If you select a folder, &kbackup; will automatically store all files and subfolders below it. If you want to exclude parts of a selected folder, simply deselect that files/folders inside the still selected folder.
tr: Bir klasör seçerseniz &kbackup;, altındaki tüm dosyaları ve alt klasörleri kendiliğinden depolayacaktır. Seçilen bir klasörün bazı kısımlarını dışlamak istiyorsanız hâlâ seçili olan klasördeki dosyaların/klasörlerin seçimini kaldırmanız yeterlidir.

source: In general, this means: A selected folder will store everything in it and below it, except the deselected parts in it. This also means, whenever you reuse a profile (see below) later on and new files have been added to a folder already selected for backup, all the new files will also be stored.
tr: Genel olarak bu şu anlama gelir: Seçili bir klasör, içindeki seçili olmayan parçalar dışında, içindeki ve altındaki her şeyi depolar. Bu aynı zamanda, bir profili daha sonra yeniden kullandığınızda (aşağıya bakın) ve yedekleme için önceden seçilmiş bir klasöre yeni dosyalar eklendiğinde, tüm yeni dosyaların da depolanacağı anlamına gelir.

source: Here's a screenshot of &kbackup;
tr: İşte bir &kbackup; ekran görüntüsü

source: Screenshot of the Main Window
tr: Ana Pencerenin Ekran Görüntüsü

source: Using profiles
tr: Profilleri kullanmak

source: To keep a selection for later use, simply save it into a &kbackup; profile file. Use the <guimenu>File</guimenu> menu and select <guimenuitem>Save Profile</guimenuitem>.
tr: Bir seçimi daha sonrası için kaydetmek isterseniz onu bir &kbackup; profil dosyasına kaydedin. <guimenu>Dosya</guimenu> menüsünden <guimenuitem>Profili Kaydet</guimenuitem> seçeneğini kullanın.

source: To reload a selection into &kbackup;, use the <menuchoice><guimenu>File</guimenu> <guimenuitem>Load Profile...</guimenuitem></menuchoice> menu item.
tr: Bir seçimi &kbackup;’e yeniden yüklemek için <menuchoice><guimenu>Dosya</guimenu><guimenuitem>Profil Yükle…</guimenuitem></menuchoice> seçeneğini kullanın.

source: &kbackup; saves in a profile the selections for all included folders/files, excluded folders/files, the target folder/&URL;, defined archive prefix, the defined maximum slice file size, &etc;
tr: &kbackup; bir profil içine şunları kaydeder: İçerilen dosyalar/klasörler, dışlanan dosyalar/klasörler, hedef klasör/&URL;, tanımlı arşiv öneki, tanımlı en büyük dilim boyutu &etc;

source: If you want to ease the usage of backing up every day the same set of files, simply store your settings into a &kbackup; profile (a <filename class="extension">.kbp</filename> file) and pass that file on the command line.
tr: Aynı dosyalar kümesini kullanan yedeğinizin yürütülmesini daha kolay kılmak için ayarlarınızı bir &kbackup; dosyasına (bir <filename class="extension">.kbp</filename> dosyası) kaydedin ve bunu komut satırına geçirin.

source: kbackup myData.kbp
tr: kbackup verim.kbp

source: Hint: you can also create a shortcut on your desktop to a <filename class="extension">.kbp</filename> file as the file type is registered to start &kbackup; on double click.
tr: İpucu: Bir <filename class="extension">.kbp</filename> dosyasına kısayol oluşturabilir ve o kısayola çift tıklayarak da çalıştırabilirsiniz. Bu dosya türü, çift tıklanıldığında &kbackup;’i çalıştıracak biçimde kaydedilmiştir.

source: Archive slices
tr: Arşiv dilimleri

source: As a medium has normally limited capacity (&eg; 100MB ZIP disc), &kbackup; will create several archive slices.
tr: Bir ortamın genelde sığası sınırlı olduğundan (&eg; 100 MB ZIP diski), &kbackup; birkaç arşiv dilimleri oluşturur.

source: Each archive slice will get its own name, which looks like this:
tr: Her arşiv dilimi şu şekilde görünen kendi adını alacaktır:

source: The name contains the creation date and time (which will be the same for all slices of one backup) and a trailing slice sequence number (_1 in this example).
tr: Ad, oluşturma tarihini ve saatini (bir yedeklemenin tüm dilimleri için aynı olacaktır) ve sondaki dilim sıra numarasını (bu örnekte _1) içerir.

source: In the menu <menuchoice><guimenu>File</guimenu> <guimenuitem>Profile Settings...</guimenuitem></menuchoice>, you can define a different archive prefix than the default <quote>backup</quote>.
tr: <menuchoice><guimenu>Dosya</guimenu> <guimenuitem>Profil Ayarları…</guimenuitem></menuchoice> menüsünden, öntanımlı <quote>backup</quote> yerine başka bir yedek öneki tanımlayabilirsiniz.

source: In the <guilabel>Profile Settings</guilabel> dialog, you can also define a maximum archive slice size, which limits the slice size even if there would be more space left on the target device. This helps to create archive slices which can then be later burned on a &CD;/&DVD;, &etc; If you explicitly limit the size of an archive slice, the available size will be marked with (*) in the main window.
tr: <guilabel>Profil Ayarları</guilabel> iletişim kutusunda, hedef aygıtta daha çok alan kalsa bile dilim boyutunu sınırlayan en büyük arşiv dilim boyutunu da tanımlayabilirsiniz. Bu, daha sonra &CD;/&DVD;, &etc;. üzerine yazılabilecek arşiv dilimleri oluşturmaya yardımcı olur. Bir arşiv diliminin boyutunu açıkça sınırlandırırsanız kullanılabilir boyut ana pencerede (*) ile işaretlenecektir.

source: But even if you define a slice to be of <quote>unlimited</quote> size, there are other constraints which limit the size of a slice:
tr: Ancak bir dilimi <quote>sınırsız</quote> boyutta tanımlasanız bile dilimin boyutunu sınırlayan başka kısıtlamalar da vardır:

source: limited by the target folder (when stored directly into a local folder)
tr: hedef klasörle sınırlıdır (doğrudan yerel bir klasöre depolandığında)

source: limited by the <filename class="directory">/tmp</filename> folder when we create a tmp file for later upload to a remote &URL;
tr: daha sonra uzak bir &URL;’ye yüklemek üzere bir tmp dosyası oluşturduğumuzda <filename class="directory">/tmp</filename> klasörüyle sınırlıdır

source: In the <guilabel>Profile Settings</guilabel>, you can also define a maximum number of full backups being kept in the target folder, and therefore automatically deleting all older backups there. &eg; if you set it to 3, &kbackup; will keep the last 3 backups and delete all older ones.
tr: <guilabel>Profil Ayarları</guilabel> bölümünde, hedef klasörde saklanacak en çok tam yedekleme sayısını da tanımlayabilir ve dolayısıyla oradaki tüm eski yedeklemelerin kendiliğinden silinmesini sağlayabilirsiniz. Örneğin, 3’e ayarlarsanız &kbackup; son 3 yedeği saklar ve eskilerin tümünü siler.

source: Incremental Backup
tr: Artımlı Yedek

source: With an incremental backup not all files will be saved every time the backup runs, but only the files which have changed since the last backup. This has the great advantage that the incremental backup will usually include much fewer files than a full backup and therefore will be finished in a much shorter time.
tr: Artımlı yedeklemede, yedekleme her çalıştırıldığında tüm dosyalar kaydedilmez, yalnızca son yedeklemeden bu yana değişen dosyalar kaydedilir. Bunun büyük avantajı, artımlı yedeklemenin genellikle tam yedeklemeden çok daha az dosya içermesi ve dolayısıyla çok daha kısa sürede tamamlanmasıdır.

source: This works as follows: In the profile, you define an interval (in days) for the full backup. &eg; when you define 5 days, then &kbackup; will do a full backup of all files every 5 days. Whenever you start &kbackup; before the interval expires with this profile - regardless how often you run a backup - only the files which have changed since the last backup will be saved. &kbackup; stores the time stamp of the last backup into the profile and knows therefore what to do when running the next time.
tr: Bu şöyle çalışır: Profilde tam yedekleme için bir aralık (gün olarak) tanımlarsınız. Örneğin, 5 gün tanımladığınızda, &kbackup; tüm dosyaların her 5 günde bir tam yedeğini alır. Bu profille aralık dolmadan önce &kbackup;’i başlattığınızda —ne sıklıkta yedekleme yaptığınıza bakılmaksızın— yalnızca son yedeklemeden bu yana değişen dosyalar kaydedilecektir. &kbackup;, son yedeklemenin zaman damgasını profile kaydeder ve bu nedenle bir dahaki kez çalıştırıldığında ne yapacağını bilir.

source: The archive slice files created during an incremental backup will contain the text <quote>_inc</quote>, &eg;:
tr: Artımlı yedek sırasında oluşturulan arşiv dilimi dosyaları, <quote>_inc</quote> metnini içerir; örneğin:

source: Full backup slice files will not include <quote>_inc</quote> in the name, &eg;:
tr: Tam yedek dilimi dosyaları adlarında <quote>_inc</quote> içermez; örneğin:

source: When one wants to restore files from an incremental backup, it's important to look for the most recent version of a file to be restored in all <quote>_inc</quote> files and finally also the last full backup slice file. This exactly is also the disadvantage of the incremental backup (but no advantage without disadvantage ;-) )
tr: Dosyaları artımlı bir yedeklemeden geri yüklemek istediğinizde, tüm <quote>_inc</quote> dosyalarında ve son olarak son tam yedek dilim dosyasında geri yüklenecek dosyanın en son sürümünü aramak önemlidir. Bu tam olarak artımlı yedeklemenin dezavantajıdır (ancak dezavantaj olmadan avantaj yoktur ;-))

source: If you want to do a full backup earlier than the defined incremental cycle time defined in a profile, you can do so by checking the <guilabel>Force Full Backup</guilabel> option in the user interface. When &kbackup; is started via the command line, this can be achieved by using the option <option>--forceFull</option>
tr: Bir profilde tanımlanan tanımlı artımlı döngü süresinden daha erken bir tam yedekleme yapmak istiyorsanız bunu kullanıcı arayüzündeki <guilabel>Tam Yedeklemeyi Zorla</guilabel> seçeneğini işaretleyerek yapabilirsiniz. &kbackup; komut satırı aracılığıyla başlatıldığında bu, <option>--forceFull</option> seçeneği kullanılarak gerçekleştirilebilir.

source: A forced full backup will restart the backup cycle, &ie; &kbackup; counts the days to the next full backup from the time of the last full backup.
tr: Zorlanan tam bir yedekleme, yedek döngüsünü yeniden başlatır; örneğin, &kbackup; son tam yedekleme zamanından itibaren bir sonraki tam yedeklemeye kadar geçen günleri sayar.

source: Archive Compression
tr: Arşiv Sıkıştırma

source: &kbackup; will compress the files stored if you activate this in the profile settings. Depending on the availability on your system it chooses <command>xz</command>, <command>bzip2</command> or <command>gzip</command> compression. &kbackup; will compress every single file and store all files with an added file extension (<filename class="extension">.xz</filename>, <filename class="extension">.bzip2</filename> or <filename class="extension">.gz</filename>) into the then not-compressed <filename class="extension">.tar</filename> archive.
tr: Profil ayarlarında bunu etkinleştirirseniz &kbackup;, depolanan dosyaları sıkıştırır. Sisteminizde neyin kullanılabilir olduğuna bağlı olarak <command>xz</command>, <command>bzip2</command> veya <command>gzip</command> sıkıştırmalarından birini kullanır. &kbackup;, her bir dosyayı sıkıştırıp depolar ve henüz sıkıştırılmamış <filename class="extension">.tar</filename> dosyasının sonuna bir uzantı ekler (<filename class="extension">.xz</filename>, <filename class="extension">.bzip2</filename> veya <filename class="extension">.gz</filename>).

source: When you have selected to create the backup on some local filesystem (&eg; your extra disc, ZIP drive, &etc;) - which means you did not enter a remote target &URL; - &kbackup; might split the whole backup into several archive slices due to media capacity limitations.
tr: Yedeklemeyi bazı yerel dosya sistemlerinde (&eg; ek diskiniz, ZIP sürücünüz vb.) oluşturmayı seçtiğinizde; bu, uzak bir hedef &URL; girmediğiniz anlamına gelir; — &kbackup; ortam sığası sınırlamaları nedeniyle tüm yedeği birkaç arşiv dilimine bölebilir.

source: Automating Backup
tr: Yedeği Otomatikleştirmek

source: If you want to automate the process of the backup, &kbackup; offers different command line options to help with this:
tr: Yedekleme işlemini otomatikleştirmek istiyorsanız &kbackup; bu konuda yardımcı olacak farklı komut satırı seçenekleri sunar:

source: When you run &kbackup; with this option and a given <filename class="extension">.kbp</filename> profile, it will start, load the given profile, run the backup and terminate when done. All this is done with a visible &kbackup; user interface.
tr: &kbackup;’i bu seçenekle çalıştırıp bir <filename class="extension">.kbp</filename> profili verirseniz başlar, verilen profili yükler, yedeklemeyi çalıştırır ve işi bitince sonlanır. Bunların tümü yapılırken bir &kbackup; arayüzü görünür.

source: When you run &kbackup; with this option and a given <filename class="extension">.kbp</filename> profile, it will run the same process as with <option>--auto</option> but <emphasis>without</emphasis> showing any graphical user interface. Therefore the suffix <quote>bg</quote> which stands for <quote>background</quote> - everything is done in the background so this is the right option to be used when you do your backups, &eg;, started by a cron job.
tr: &kbackup;’i bu seçenekle çalıştırıp bir <filename class="extension">.kbp</filename> profili verirseniz <option>--auto</option> seçeneğiyle aynı işlemi yapar; ancak bir grafiksel kullanıcı arayüzü <emphasis>olmadan</emphasis> süreci tamamlar. <quote>bg</quote> eki burada <quote>background</quote> (arka plan) anlamına gelir — her şey arka planda yapılır. Bu nedenle, yedeklerinizi genelde bir cron işiyle yapıyorsanız en uygun seçenektir.

source: When using <option>--autobg</option> the output from &kbackup; - showing the progress of the backup - is written to stderr. By default, the output includes just a few important messages and a summary at the end. If you pass <option>--verbose</option> in addition, then you will also see each file name currently being backed up.
tr: <option>--autobg</option> seçeneği kullanılırken, yedeklemenin ilerlemesini gösteren &kbackup; çıktısı stderr’e yazılır. Öntanımlı olarak, çıktı genelde birkaç önemli ileti ve sonunda bir özet içerir. Ek olarak <option>--verbose</option> seçeneğini eklerseniz yedeklenen her bir dosyanın adını görürsünüz.

source: Command Reference
tr: Komut Başvurusu

source: The main &kbackup; window
tr: Ana &kbackup; penceresi

source: The File Menu
tr: Dosya Menüsü

source: <guimenu>File</guimenu> <guimenuitem>Open Recent</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Son Kullanılanı Aç</guimenuitem>

source: Shows a submenu with the recently used profiles for easy selection.
tr: Kolay seçim için son kullanılan profilleri içeren bir alt menüyü gösterir.

source: <guimenu>File</guimenu> <guimenuitem>New Profile</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Yeni Profil</guimenuitem>

source: Clears the selection and the target input field, to be able to define a new profile.
tr: Yeni bir profil tanımlayabilmek için seçimi ve hedef giriş alanını temizler.

source: <guimenu>File</guimenu> <guimenuitem>Load Profile...</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Profil Yükle…</guimenuitem>

source: Loads a profile.
tr: Bir profil yükler.

source: <guimenu>File</guimenu> <guimenuitem>Save Profile</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Profili Kaydet</guimenuitem>

source: Saves all settings into the currently loaded profile.
tr: Tüm ayarları o anda yüklü olan profile kaydeder.

source: <guimenu>File</guimenu> <guimenuitem>Save Profile As...</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Profili Farklı Kaydet…</guimenuitem>

source: Saves all settings into a profile with a new name.
tr: Tüm ayarları yeni bir adla bir profile kaydeder.

source: <guimenu>File</guimenu> <guimenuitem>Profile Settings...</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Profil Ayarları…</guimenuitem>

source: In the settings, you can define whether the archive-slice files start with the default name <quote>backup</quote> or with an alternative name. Also you can limit the archive slice size. See chapter <link linkend="archive-slices">Archive Slices</link>. These settings are also stored into the profile.
tr: Ayarlarda, arşiv dilimi dosyalarının <quote>backup</quote> öntanımlı adıyla mı yoksa alternatif bir adla mı başlayacağını tanımlayabilirsiniz. Ayrıca arşiv dilim boyutunu da sınırlayabilirsiniz. <link linkend="archive-slices">Arşiv Dilimleri</link> bölümüne bakın. Bu ayarlar ayrıca profile de kaydedilirler.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Çık</guimenuitem>

source: <action>Quits</action> &kbackup;.
tr: &kbackup; uygulamasından <action>çıkar</action>.

source: The Settings Menu
tr: Ayarlar Menüsü

source: <guimenu>Settings</guimenu> <guimenuitem>Dock in System Tray</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Sistem Tepsisine Rıhtımla</guimenuitem>

source: When this option is activated, an icon is shown in the system tray, which reflects the current status of a backup operation. An animation is shown when a backup is in progress, else you see a static icon. If this option is selected, the closing of the main window will not terminate &kbackup;. The application must be explicitly terminated by selecting the <guimenuitem>Quit</guimenuitem> action. Via the context menu of the &kbackup; system tray icon you can start and cancel a backup operation - which is the same as you can do in the main window. The tooltip on this icon also gives progress information (Number of saved files, size of the backup and the last saved file).
tr: Bu seçenek etkinleştirildiğinde sistem tepsisinde yedekleme işleminin geçerli durumunu yansıtan bir simge gösterilir. Yedekleme sürerken bir canlandırma gösterilir, aksi takdirde statik bir simge görürsünüz.

source: <guimenu>Settings</guimenu> <guimenuitem>Enable All Messages</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Tüm İletileri Etkinleştir</guimenuitem>

source: Activating this entry clears all internally stored <guilabel>Do not ask again</guilabel> flags for the dialogs shown in &kbackup;.
tr: Bu girdiyi etkinleştirmek, &kbackup; içinde gösterilen tüm <guilabel>Bir kez daha sorma</guilabel> iletilerinin temizlenmesine neden olur.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Hidden Files</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Gizli Dosyaları Göster</guimenuitem>

source: <action>Enable or disable</action> the display of hidden files (preceded by a dot character) in the tree view. Use this option if you want to exclude some hidden files from the backup. If you want to exclude all hidden files, use a filename filter in the profile settings.
tr: Ağaç görünümünde gizli dosyaların (öncesinde nokta karakteri olan) görüntülenmesini <action>etkinleştirin veya devre dışı bırakın</action>. Bazı gizli dosyaları yedekten dışlamak istiyorsanız bu seçeneği kullanın. Tüm gizli dosyaları dışlamak istiyorsanız profil ayarlarında bir dosya adı süzgeci kullanın.
