Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kbackup.po
Languages: tr

source: The Help Menu
tr: Yardım Menüsü

source: &kbackup; has the common &kde; <guimenu>Help</guimenu> menu item, for more information read the section about the <ulink url="help:/fundamentals/menus.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
tr: &kbackup;, ortak &kde; <guimenu>Yardım</guimenu> menüsüne sahiptir; daha fazla bilgi için &kde; Temelleri’nin <ulink url="help:/fundamentals/menus.html#menus-help">Yardım Menüsü</ulink> bölümünü okuyun.

source: Developer's Guide to &kbackup;
tr: &kbackup; Geliştirici Kılavuzu

source: &kbackup; can be extended by using a shell script (or any other executable) which will be started at three different points during the backup process. The idea behind it is to allow to mount, unmount, eject media in a system specific way, or do other things with the produced archive files.
tr: &kbackup; yedekleme işlemi sırasında üç farklı noktada başlatılacak olan bir kabuk betiği (veya başka bir yürütülebilir dosya) kullanılarak genişletilebilir. Bunun arkasındaki düşünce, ortamı sisteme özel bir şekilde bağlamaya, bağlantısını kesmeye, çıkarmaya veya üretilen arşiv dosyalarıyla başka şeyler yapmaya izin vermektir.

source: The script to execute must be given with the <option>--script</option> command line option.
tr: Yürütülecek betik <option>--script</option> komut satırı seçeneğiyle verilmelidir.

source: Here is a sample script:
tr: İşte örnek bir betik:

source: sliceScript.sh
tr: dilimBetiği.sh

source: The script is always invoked with four command line arguments:
tr: Betik her zaman dört komut satırı argümanıyla çağrılır:

source: invocation mode
tr: çağırma kipi

source: archive (slice) file name
tr: arşiv (dilim) dosya adı

source: target directory/&URL;
tr: hedef dizin/&URL;

source: mountpoint of the target directory if it's a local directory, else an empty string
tr: hedef dizinin bağlanma noktası, eğer yerel bir dizinse aksi takdirde boş bir dizi

source: There are three possible invocation modes:
tr: Üç olası çağırma kipi vardır:

source: called before a new archive slice is being created on disc
tr: diskte yeni bir arşiv dilimi oluşturulmadan önce çağrılır

source: called after an archive slice has been created, but before it has been put into the target directory
tr: bir arşiv dilimi oluşturulduktan sonra; ancak hedef dizine yerleştirilmeden önce çağrılır

source: This can be used if you want to copy the archive slice to some additional place, &eg; the archive is sent to the main server (via a target &URL;), but you want to keep the last backup also onto the local disc.
tr: Arşiv dilimini ek bir yere kopyalamak istiyorsanız bu kullanılabilir; örneğin, arşiv ana sunucuya gönderildiğinde (bir hedef &URL; aracılığıyla); ancak son yedeği de yerel diskte tutmak istediğinizde.

source: called after an archive slice has been successfully transferred into the target directory
tr: bir arşiv dilimi başarıyla hedef dizine aktarıldıktan sonra çağrılır

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Program copyright &copy; 2006 - 2009 Martin Koller <email>martin@kollix.at</email>
tr: Program telif hakkı &copy; 2006–2009 Martin Koller <email>martin@kollix.at</email>

source: Documentation Copyright &copy; 2006 - 2009 Martin Koller
tr: Belgelendirme telif hakkı &copy; 2006–2009 Martin Koller

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
