Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kbackup_man-kbackup.1.po
Languages: tr

source: KBackup User's Manual
tr: K Yedek Kullanıcı Kılavuzu

source: Applications 20.04
tr: Uygulamalar 20.04

source: KDE Applications
tr: KDE Uygulamaları

source: Backup program with an easy-to-use interface
tr: Kullanımı kolay arayüze sahip yedekleme programı

source: <command>kbackup</command> <arg rep="repeat"><replaceable>OPTIONS</replaceable></arg> <arg rep="repeat"><replaceable>Module name | Module set name</replaceable></arg>
tr: <command>kbackup</command> <arg rep="repeat"><replaceable>SEÇENEKLER</replaceable></arg> <arg rep="repeat"><replaceable>Modül adı | Modül kümesi adı</replaceable></arg>

source: DESCRIPTION
tr: AÇIKLAMA

source: Kbackup is a program that lets you back up any directories or files. It uses an easy to use directory tree to select the things to back up and lets you save your settings in "profile" files. These are simple textfiles containing definitions for directories and files to be included or excluded from the backup process.
tr: K Yedek, herhangi bir dizini veya dosyayı yedeklemenizi sağlayan bir programdır. Yedeklenecek şeyleri seçmek için kullanımı kolay bir dizin ağacı kullanır ve ayarlarınızı "profil" dosyalarına kaydetmenize olanak tanır. Bunlar, yedekleme sürecinde içerilecek veya yedekleme işleminden dışlanacak dizinler ve dosyalar için tanımları içeren basit metin dosyalarıdır.

source: OPTIONS
tr: SEÇENEKLER

source: Displays version information.
tr: Sürüm bilgisini görüntüler.

source: Displays help on commandline options.
tr: Komut satırı seçenekleri için yardımı görüntüler.

source: Displays help including Qt specific options.
tr: Qt’a özel seçenekler için yardımı görüntüler.

source: --help-all --qmljsdebugger <replaceable>value</replaceable>
tr: --help-all --qmljsdebugger <replaceable>değer</replaceable>

source: Activates the QML/JS debugger with a specified port. The value must be of format port:1234[,block]. "block" makes the application wait for a connection.
tr: QML/JS hata ayıklayıcısını belirli bir kapıyla etkinleştirir. Değer, kapı:1234[,blok] kipinde olmalıdır; "blok", uygulamayı bir bağlantı için bekletir.

source: --script <replaceable>file</replaceable>
tr: --script <replaceable>dosya</replaceable>

source: Script to run after finishing one archive slice.
tr: Bir arşiv dilimini tamamladıktan sonra çalıştırılacak betik.

source: --auto <replaceable>profile</replaceable>
tr: --auto <replaceable>profil</replaceable>

source: Automatically run the backup with the given profile and terminate when done.
tr: Yedeklemeyi verilen profille kendiliğinden çalıştırın ve bittiğinde sonlandırın.

source: --autobg <replaceable>profile</replaceable>
tr: --autobg <replaceable>profil</replaceable>

source: Automatically run the backup with the given profile in the background (without showing a window) and terminate when done.
tr: Yedeklemeyi arka planda verilen profille (pencere göstermeden) kendiliğinden çalıştırın ve bittiğinde sonlandırın.

source: --verbose <replaceable>profile</replaceable>
tr: --verbose <replaceable>profil</replaceable>

source: In autobg mode be verbose and print every single filename during backup.
tr: autobg kipinde ayrıntılı olun ve yedekleme sırasında her bir dosya adını yazdırın.

source: In auto/autobg mode force the backup to be a full backup instead of acting on the profile settings.
tr: auto/autobg kipinde, profil ayarlarına göre davranmak yerine yedeklemeyi tam bir yedeğe zorlayın.

source: Show author information.
tr: Yazar bilgisini gösterin.

source: Show license information.
tr: Lisans bilgisini gösterin.

source: --desktopfile <replaceable>file</replaceable>
tr: --desktopfile <replaceable>dosya</replaceable>

source: The base file name of the desktop entry for this application.
tr: Bu uygulamanın masaüstü girdisinin temel dosya adı.

source: ENVIRONMENT
tr: ORTAM

source: FILES
tr: DOSYALAR

source: .kbp profile files. Generated by user on save profile.
tr: .kbp profil dosyaları. Profil kaydedilirken kullanıcı tarafından üretilir.

source: See Also
tr: Ayrıca

source: More detailed user documentation is available from <ulink url="help:/ --commandname-- ">help:/kbackup</ulink> (either enter this &URL; into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>man:/kbackup</parameter></userinput>).
tr: Daha ayrıntılı kullanıcı belgelendirmesi <ulink url="help:/ --commandname-- ">help:/kbackup</ulink> adresinde bulunabilir (ya bu &URL;’yi &konqueror;,’a girin veya <userinput><command>khelpcenter</command> <parameter>man:/kbackup</parameter></userinput> komutunu çalıştırın).

source: There is also further information available at <ulink url="https://apps.kde.org/kbackup">https://apps.kde.org/kbackup</ulink>
tr: Ayrıca, <ulink url="https://apps.kde.org/kbackup">https://apps.kde.org/kbackup</ulink> adresinde ek bilgi bulunabilir

source: Examples
tr: Örnekler

source: kbackup myData.kbp Used to load existing profile.
tr: kbackup verim.kbp Var olan profili yüklemek için kullanılır.

source: Authors
tr: Yazarlar

source: Kbackup was written by Martin Koller <email> martin@kollix.at</email> This man-page was created by Scott Kitterman <email>scott@kitterman.com</email> and updated by Scarlett Moore <email>sgmoore@kde.org</email>, it is licensed under the same terms as kbackup.
tr: K Yedek, Martin Koller <email>martin@kollix.at</email> tarafından yazıldı. Bu man sayfası Scott Kitterman <email>scott@kitterman.com</email> tarafından oluşturuldu ve Scarlett Moore <email>sgmoore@kde.org</email> tarafından güncellendi; K Yedek ile aynı lisans koşulları altında sunulur.
