Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kbounce.po
Languages: tr

source: The &kbounce; Handbook
tr: &kbounce; El Kitabı

source: Reviewer
tr: Gözden Geçiren

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@îcloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: This documentation describes the game of &kbounce; version 21.04
tr: Bu belgelendirme, &kbounce; 21.04 sürümündeki oyunu anlatmaktadır

source: kdegames
tr: kde oyunları

source: game
tr: oyun

source: arcade
tr: yarış

source: puzzle
tr: Yapboz

source: balls
tr: toplar

source: KBounce
tr: K Zıpla

source: Introduction
tr: Giriş

source: Gametype:
tr: Oyun türü:

source: Puzzle, Arcade
tr: Yapboz, Yarış

source: Number of possible players:
tr: Olası oyuncu sayısı:

source: <para>One</para>
tr: <para>Bir</para>

source: &kbounce; is a single player arcade game with the elements of puzzle.
tr: &kbounce;, bulmaca unsurları ile tek oyunculu bir eğlence oyunudur.

source: It is played on a field, surrounded by walls, with two or more balls that move about in the field bouncing off of walls. The player can build new walls, decreasing the size of the active field.
tr: Duvarlarla çevrili, alanın duvarlarından sıçrayan alanda hareket eden iki veya daha fazla topla oynanan bir alanda oynanır. Oyuncu, etkin alanın boyutunu küçülterek yeni duvarlar yapabilir.

source: The goal of the game is to fill at least 75&percnt; of the field and advance to the next level.
tr: Oyunun amacı, en az yüzde 75 veya daha fazla alanı doldurmak ve bir sonraki düzeye geçmektir.

source: How To Play
tr: Nasıl Oynanır

source: The player is presented a rectangular tiled field surrounded by walls. Two or more balls move about in the field and bounce off of the walls. The object of the game is to limit the size of room for the balls.
tr: Oyuncuya duvarlarıyla çevrili dikdörtgen kiremitli bir alan sunulmaktadır. İki veya daha fazla top, sahada dolaşır ve duvarlardan zıplar. Oyunun amacı toplar için odanın boyutunu sınırlamaktır.

source: The size of the active area of the field is decreased by making new walls that enclose areas without balls in them. To complete a level, the player must decrease the size of the active field by at least 75&percnt; within the time allowed.
tr: Etkin alanın boyutu, içinde toplar bulunmayen yeni duvarlar yaparak azaltılır. Bir düzeyi tamamlamak için oyuncu, etkin alanın boyutunu izin verilen süre içinde en az yüzde 75 azaltmalıdır.

source: New walls are built by clicking the &LMB; in an active area of the field, at which point one wall will begin to grow in opposite directions from the square the mouse was clicked in. Only one wall in each direction may be growing on the screen at any given time.
tr: Yeni duvarlar, alanın etkin bir bölgesinde &LMB; tıklanarak yapılır. Bu yapıldığında bir duvar, farenin tıklandığı karenin tersi yönlerde büyümeye başlayacaktır. Herhangi bir zamanda yalnızca bir duvar her bir yönde büyüyebilir.

source: When the mouse is on the field, the cursor is shown as a pair of arrows pointing in opposite directions, either horizontally or vertically. The arrows point in the direction the walls will grow when the &LMB; is clicked. This direction can be changed by clicking the &RMB;.
tr: Fare alana geldiğinde, imleç, karşıt yönde yatay veya dikey olarak işaret eden bir çift ok olarak gösterilir. Oklar, &LMB; tıklandığı zaman duvarların büyüyeceği yönü gösterir. Bu yön, &RMB;’ni tıklayarak değiştirilebilir.

source: A new wall has a <quote>head</quote> which moves away from the point where the mouse was clicked. A wall is not permanent until this <quote>head</quote> runs into another wall. If a ball collides with any part of the wall except the head, before the head has run into another wall, the new wall will disappear completely and one life will be lost. If a ball collides with the head in the direction of the wall's growth, the wall will stop growing there, and become permanent, with no loss of life. If a ball collides with the head from any other side, the ball will bounce off and the wall will continue to grow normally.
tr: Yeni bir duvar, farenin tıklandığı noktadan uzaklaşan bir <quote>kafa</quote>içerir. Bu <quote>kafa</quote> başka bir duvara girene kadar bir duvar kalıcı değildir. Kafa bir başka duvarda girmeden önce bir top başın dışındaki herhangi bir bölüme çarparsa yeni duvar tamamen kaybolur ve bir can kaybedilir. Bir top duvarın büyümesi yönünde kafayla çarpışırsa duvar büyümeyi durduracak ve can kaybı olmaksızın kalıcı hale gelecektir. Bir top diğer taraftan kafa ile çarpışırsa top sıçramalı ve duvar normal olarak büyümeyi sürdürecektir.

source: Game Rules, Strategies and Tips
tr: Oyun Kuralları, Stratejileri, İpuçları

source: Game Rules
tr: Oyun Kuralları

source: The game starts with level 1 in which two balls move around in the field. The player has two lives and 90 seconds to successfully complete the level.
tr: Oyun, sahada iki topun hareket ettiği birinci düzey ile başlar. Düzeyi başarıyla tamamlamak için oyuncunun iki canı ve 90 saniyesi vardır.

source: In n-th level there are n + 1 balls. The player is given n + 1 lives. They have 30 * ( n + 2 ) seconds to complete it.
tr: N. düzeyde n + 1 top olur. Oyuncuya n + 1 can verilir. Tamamlamakiçin 30 * (n + 2) saniyeleri vardır.

source: When a ball collides with a growing wall the player looses one life. An exception is the collision with wall's <quote>head</quote> when no life is lost.
tr: Bir top, büyüyen bir duvara çarptığında oyuncu bir can kaybeder. Bir istisna olarak, bir duvar <quote>kafa</quote> ile çarpışırsa can kaybedilmez.

source: The goal of each level is to cover at least 75&percnt; of the field with wall.
tr: Her bir düzeyin hedefi, alanın en az yüzde 75’ini duvarlarla kaplamaktır.

source: The loss of all lives and exceeding the time allowed result in the end of the game.
tr: Tüm canların kaybı ve izin verilen sürenin aşılması oyunun sona ermesine neden olur.

source: If a player completes a level he receives 15 points for each life left, and a bonus depending on the number of balls and the number of tiles filled above 75&percnt;. They also advance to the next level.
tr: Bir oyuncu bir düzeyi tamamlarsa kalan her can için 15 puan, ve top sayısına ve yüzde 75 üzerindeki karoların sayısına bağlı olarak bir bonus alır. Ayrıca bir sonraki düzeye geçerler.

source: Strategies and Tips
tr: Stratejiler ve İpuçları

source: Many players find the game becomes quite difficult by only the third or fourth level, given the number of balls on the field at once.
tr: Çoğu oyuncu, sahada aynı anda olabilen top sayıları göz önüne alındığında, oyunu yalnızca üçüncü veya dördüncü düzeyde oldukça zor buluyor.

source: The trick playing &kbounce; successfully is to build <quote>corridors</quote>. To build a corridor, start a pair of walls growing close to another wall, and time it so that one of the walls will be hit by a ball and one of the walls will not, and thus become permanent.
tr: &kbounce;’yı başarılı olarak oynamanın püf noktası; <quote>koridorlar</quote> yapmaktır. Bir koridor yapmak için başka bir duvara yakın büyüyen bir çift duvar başlatın ve öyle bir zamanlayın ki duvarların birine top çarpsın; ancak diğerine çarpmasın; böylelikle kalıcı olsun.

source: <screeninfo>Building a corridor</screeninfo>
tr: <screeninfo>Bir koridor yapılıyor</screeninfo>

source: <phrase>Building a corridor</phrase>
tr: <phrase>Bir koridor yapılıyor</phrase>

source: This will leave a narrow corridor only a few squares high on the field, surrounded on three sides by walls. Wait for the balls to bounce into the open end of the corridor, and close the corridor behind the ball with a new wall. Although you will most likely lose a life for each corridor created, you can trap several balls in a single corridor.
tr: Bu, dar bir koridoru tarlada yalnızca birkaç kare yüksek, üç tarafı duvarlarla çevrili bırakacaktır. Topların koridorun açık ucuna sıçramasını bekleyin ve topun arkasındaki koridoru yeni bir duvarla kapatın. Yaratılan her koridor için büyük olasılıkla bir can kaybedecekseniz de, tek bir koridorda birden fazla topu yakalayabilirsiniz.

source: <screeninfo>Capturing balls in a corridor</screeninfo>
tr: <screeninfo>Topları bir koridorda yakalama</screeninfo>

source: <phrase>Capturing balls in a corridor</phrase>
tr: <phrase>Topları bir koridorda yakalama</phrase>

source: A final tip &mdash; take your time! There is plenty of time, as shown in the <guilabel>Time</guilabel> display at the bottom of the screen. Rushing will just get you in trouble!
tr: Son bir ipucu &mdash; acele etmeyin! Ekranın altındaki <guilabel>Time</guilabel> görüntüsünde gösterildiği üzere bolca zaman var. Acele, yalnızca başını belaya sokar!

source: Interface Overview
tr: Arayüze Genel Bakış

source: The Tool Bar
tr: Araç Çubuğu

source: The toolbar provides buttons for the commonly used functions.
tr: Araç çubuğu genel kullanılan işlevler için düğmeler sağlar.

source: Toolbar Buttons
tr: Araç Çubuğu Düğmeleri

source: Button
tr: Düğme

source: Name
tr: Ad

source: Menu Equivalent
tr: Menü Karşılığı

source: Action
tr: Eylem

source: New Game Button
tr: Yeni Oyun Düğmesi

source: <guiicon>New</guiicon>
tr: <guiicon>Yeni</guiicon>

source: <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
tr: <guimenu>Oyun</guimenu> <guimenuitem>Yeni</guimenuitem>

source: Starts a new game. If a game is currently played clears the field and sets the level to 1.
tr: Yeni bir oyun başlatır. Geçerli bir oyun varsa temizlenir ve düzey 1 olarak ayarlanır.

source: Pause Button
tr: Duraklat Düğmesi

source: Pause
tr: Duraklat

source: <guimenu>Game</guimenu> <guimenuitem>Pause</guimenuitem>
tr: <guimenu>Oyun</guimenu> <guimenuitem>Duraklat</guimenuitem>

source: Pauses or resumes the current game.
tr: Geçerli oyunu duraklatır ve sürdürür

source: The Menu Items
tr: Menü Ögeleri

source: The Game Menu
tr: Oyun Menüsü

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Y</keycap></keycombo> </shortcut> <guimenu>Oyun</guimenu> <guimenuitem>Yeni</guimenuitem>

source: Starts a new game.
tr: Yeni bir oyun başlatır.

source: <shortcut> <keycombo action="simul">&Ctrl;&End;</keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>End Game</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&End;</keycombo> </shortcut> <guimenu>Oyun</guimenu> <guimenuitem>Oyunu Bitir</guimenuitem>

source: Ends the current game.
tr: Geçerli oyunu sonlandırır.

source: <shortcut> <keycap>P</keycap> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Pause</guimenuitem>
tr: <shortcut> <keycap>P</keycap> </shortcut> <guimenu>Oyun</guimenu> <guimenuitem>Duraklat</guimenuitem>

source: Pauses or resumes the game.
tr: Oyunu duraklatır veya sürdürür

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Show High Scores</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Y</keycap></keycombo> </shortcut> <guimenu>Oyun</guimenu> <guimenuitem>Yüksek Puanları Göster</guimenuitem>

source: Opens a dialog that displays different high score tables.
tr: Farklı yüksek puan tablolarını görüntüleyen bir iletişim kutusu açar.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Oyun</guimenu> <guimenuitem>Çık</guimenuitem>

source: <action>Quit</action> and close &kbounce;. If a game is currently played, it's status is lost.
tr: <action>Çık</action> ve &kbounce;’yı kapat. Şu anda bir oyun oynanıyorsa durumu kaybolur.

source: The Settings Menu
tr: Ayarlar Menüsü

source: <guimenu>Settings</guimenu> <guimenuitem>Play Sounds</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Sesleri Çal</guimenuitem>

source: If checked, &kbounce; game sounds are played.
tr: Seçiliyse &kbounce; oyun sesleri çalınır.

source: <guimenu>Settings</guimenu> <guisubmenu>Difficulty</guisubmenu>
tr: <guimenu>Ayarlar</guimenu> <guisubmenu>Zorluk Derecesi</guisubmenu>

source: Select a game difficulty. On higher difficulty levels the walls are build slower while balls move faster. That makes it harder to fence an area in the board.
tr: Bir oyun zorluğu seçin. Yüksek zorluk düzeylerinde toplar daha hızlı hareket ederlen duvarlar daha yavaş yapılır. Bu, lider listesindeki bir alanı korumayı zorlaştırır.

source: Additionally &kbounce; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/menus.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/menus.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
tr: Ek olarak, &kbounce;’da ortak &kde; <guimenu>Ayarlar</guimenu> menü ögeleri vardır; daha fazla bilgi için &kde; Temelleri’nde <ulink url="help:/fundamentals/menus.html#menus-settings">Ayarlar Menüsü</ulink> ve <ulink url="help:/fundamentals/menus.html#menus-help">Yardım Menüsü</ulink> ile ilgili bölüme bakın.

source: Frequently asked questions
tr: Sıkça Sorulan Sorular

source: I want to change the way this game looks. Can I?
tr: Bu oyunun görünümünü değiştirmek istiyorum. Yapabilir miyim?

source: Yes. To change &kbounce; visual theme you can use <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kbounce;…</guimenuitem></menuchoice> option on the menubar.
tr: Evet. &kbounce; görsel temasını değiştirmek için araç çubuğundaki <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem> &kbounce; Uygulamasını Yapılandır…</guimenuitem></menuchoice> seçeneğini kullanabilirsiniz.

source: I have made a mistake. Can I undo?
tr: Ben bir hata yaptım. Geri alabilir miyim?

source: &kbounce; does not have an <quote>Undo</quote> feature.
tr: &kbounce;, <quote>Geri Al</quote> özelliğine sahip değildir.

source: Can I use the keyboard to play this game?
tr: Bu oyunu oynamak için klavyeyi kullanabilir miyim?

source: No. &kbounce; cannot be played using keyboard.
tr: Hayır. &kbounce; klavye kullanılarak oynanamaz.

source: I have to quit the game now, but I am not finished yet. Can I save my progress?
tr: Oyundan şimdi çıkmak zorundayım; ancak henüz bitirmedim. İlerlememi kaydedebilir miyim?

source: &kbounce; does not have a <quote>Save</quote> feature at the moment.
tr: &kbounce;, şu anda <quote>Kaydet</quote> özelliğine sahip değildir.

source: Game Configuration
tr: Oyun Yapılandırması

source: The &kbounce; configuration dialog allows you to select visual themes for &kbounce;.
tr: &kbounce; yapılandırma iletişim kutusu, &kbounce; için görsel temalar seçmenize izin verir.

source: To select a new theme simply choose the theme from the selection list. Each item in the list shows a small preview left to the theme name. A selection is immediately applied.
tr: Yeni bir tema seçmek için seçim listesinden temayı seçin. Listedeki her öge, tema adına bırakılmış küçük bir önizleme gösterir. Bir seçim hemen uygulanır.

source: You can select random background pictures from a user defined folder with images.
tr: Görsellerle birlikte kullanıcı tarafından tanımlanan bir klasörden rastgele arka plan resimleri seçebilirsiniz.

source: Once you are satisfied with the theme you have selected you can click the <guibutton>OK</guibutton> button, located at the bottom part of this dialog.
tr: Seçtiğiniz temadan memnun olduğunuzda, bu diyalogun alt kısmında yer alan <guibutton>Tamam</guibutton> düğmesini tıklayabilirsiniz.

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Stefan Schimanski <email>schimmi@kde.org</email> - Original Author
tr: Stefan Schimanski <email>schimmi@kde.org</email> — Özgün Yazar

source: Sandro Sigala <email>ssigala@globalnet.it</email> - Highscore
tr: Sandro Sigala <email>ssigala@globalnet.it</email> — Rekor

source: Benjamin Meyer <email>ben+kbounce@meyerhome.net</email> - Contributions
tr: Benjamin Meyer <email>ben+kbounce@meyerhome.net</email> — Katkılar

source: Dmitry Suzdalev <email>dimsuz@gmail.com</email>
tr: Dmitriy Suzdalev <email>dimsuz@gmail.com</email>

source: Tomasz Boczkowski <email>tboczkowski@onet.pl</email> - Port to KDE4 and KGameCavas
tr: Tomasz Boczkowski <email>tboczkowski@onet.pl</email> — KDE4’e ve KGameCavas’a geçiş

source: Documentation copyright 2002, &Aaron.J.Seigo; &Aaron.J.Seigo.mail;
tr: Belgelendirme telif hakkı 2002, &Aaron.J.Seigo; &Aaron.J.Seigo.mail;

source: Documentation copyright 2007, Tomasz Boczkowski <email>tboczkowski@onet.pl</email>
tr: Belgelendirme telif hakkı 2007, Tomasz Boczkowski <email>tboczkowski@onet.pl</email>

source: This handbook is dedicated to Dennis E. Powell.
tr: Bu el kitabı Dennis E. Powell’a adanmıştır.

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
