Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcalc.po
Languages: tr

source: The six constants buttons <guibutton>C1</guibutton> to <guibutton>C6</guibutton> will only be visible after activating the item <guilabel>Constants Buttons</guilabel> in the menu <guimenu>Settings</guimenu> of the menu bar. They are available in <guilabel>Science mode</guilabel> and <guilabel>Statistics mode</guilabel>
tr: <guibutton>C1</guibutton> ve <guibutton>C6</guibutton> aralığındaki altı sabit düğmesi, yalnızca menü çubuğundan erişilebilen <guimenu>Ayarlar</guimenu><guilabel>Sabit Düğmeleri</guilabel> etkinleştirilmişse görünür olur. <guilabel>Bilim Kipi</guilabel>’nde ve <guilabel>İstatistik Kipi</guilabel>’nde kullanılabilirler.

source: To see the value stored in each constant hover the button with the mouse pointer.
tr: Her bir sabitte saklanan değeri görmek için fareyi düğmenin üzerinde gezdirin.

source: To store the number shown in the &kcalc; display in one of the six constants, first press <guibutton>&Shift;</guibutton> followed by the desired button key <guibutton>C1</guibutton> up to <guibutton>C6</guibutton>.
tr: &kcalc; görüntüsündeki değeri bu altı sabitten birinde saklamak için önce <guibutton>&Shift;</guibutton> düğmesine ve sonrasında <guibutton>C1</guibutton>-<guibutton>C6</guibutton> arasındaki istediğiniz düğmeye basın.

source: To use the value stored in any of the constants in a calculation, just press the desired button (<guibutton>C1</guibutton> to <guibutton>C6</guibutton>), and the corresponding number will appear in the display.
tr: Bir hesaplamada sabitlerden herhangi birini kullanmak için yalnızca istenen düğmeye basın (<guibutton>C1</guibutton>-<guibutton>C6</guibutton>), ilişkili sayı görüntülenecektir.

source: It is possible to change the label of the constants button to make it easier to remember which button holds which constant. Click with the right mouse button on one of the buttons <guibutton>C1</guibutton> to <guibutton> C6</guibutton>. A popup menu appears, in which you select <guilabel> Set Name</guilabel>.
tr: Sabitler düğmesinin etiketini hangi düğmenin hangi sabiti tuttuğunu hatırlamasını kolaylaştırmak için değiştirmek olanaklıdır. <guibutton>C1</guibutton>-<guibutton>C6</guibutton> düğmelerinin üzerine farenin sağ düğmesi ile tıklayın. <guilabel>Ad Ayarla</guilabel> yapabileceğiniz bir açılır menü görüntülenir.

source: There are many (mostly physical) predefined constants, which can be put on any of the six buttons <guibutton>C1</guibutton> - <guibutton>C6</guibutton> by selecting the desired constant in the popup menu that appears after right clicking on one of the constant buttons and selecting <guilabel>Choose from List</guilabel>. Though the predefined constants can also be accessed via the <guimenu>Constants</guimenu> in the menu bar, storing it on a constants button is very handy, if the number is used frequently.
tr: <guibutton>C1</guibutton>-<guibutton>C6</guibutton> düğmelerinden birine tıklanıp açılan menüden <guilabel>Listeden Seç</guilabel> kullanılarak seçilebilecek birçok önceden tanımlı sabit vardır. Sabitlere menü çubuğundaki <guimenu>Constants</guimenu> ögesinden de ulaşılabildiği halde, onları özel bir düğmede saklamak eğer bu sayı çok sık kullanılıyorsa gerçekten yardımcı olacaktır.

source: Single Key Accelerators
tr: Tek Düğmeli İvmelendiriciler

source: To simplify entering calculations from the keyboard &kcalc; has single key accelerators for most functions. For example entering <userinput>7R</userinput> or <userinput>7r</userinput> will calculate the reciprocal of 7 (1/7).
tr: Hesapların klavyeden girişini basitleştirmek için &kcalc; çoğu işlev için tek düğmeli ivmelendiricilere sahiptir. Örneğin, <userinput>7R</userinput> veya <userinput>7r</userinput> girildiğinde, karşılık gelen 7 (1/7) hesaplanır.

source: During a computation, you can always press &Ctrl; to make each button display its key-binding.
tr: Bir hesaplama sırasında, &Ctrl; düğmesini basılı tutarak her bir düğmenin anahtar bağıntısını göstermesini sağlayabilirsiniz.

source: <entry>Key</entry>
tr: <entry>Anahtar</entry>

source: Notes
tr: Notlar

source: Hyperbolic as in Hyp Sin, the sinh
tr: Hyp Sin’deki gibi Hiperbolik, sinh

source: log base e
tr: e tabanında logaritma

source: log base 10
tr: 10 tabanında logaritma

source: Ctrl-2
tr: Kontrol-2

source: Second function for this button. &eg; if you want arcsin type <userinput>Ctrl-2 s </userinput>
tr: Bu düğme için ikinci işlev. &eg; eğer arcsin istiyorsanız <userinput>Kontrol-2 s </userinput> yazın

source: Change sign
tr: İşareti değiştir

source: Factorial
tr: Faktöriyel

source: Exponent
tr: Üs

source: Left shift
tr: Sola kaydır

source: Right shift.
tr: Sağa kaydır.

source: Logical AND
tr: Mantıksal AND

source: <keysym>x</keysym> or <keysym>*</keysym>
tr: <keysym>x</keysym> ya da <keysym>*</keysym>

source: Multiply
tr: Çarp

source: Divide
tr: Böl

source: Enter data item in statistical mode
tr: İstatistiksel kipde veri ögesi girin

source: Logical OR. Note: <guibutton>&Shift;</guibutton> <guibutton>OR</guibutton> is XOR
tr: Mantıksal OR. Unutmayın: <guibutton>&Shift;</guibutton> <guibutton>OR</guibutton> XOR’dur

source: Reciprocal
tr: Evrik değer

source: Return
tr: Dönüş

source: Delete last number
tr: Son sayıyı sil

source: PgUp
tr: Sayfa Yukarı

source: Clear
tr: Temizle

source: PgDown
tr: Sayfa Aşağı

source: Clear all
tr: Tümünü temizle

source: <keycap>Del</keycap>
tr: <keycap>Sil</keycap>

source: remainder of dividing
tr: bölme kalanı

source: &Alt;+<keycap>1</keycap> to &Alt;+<keycap>6</keycap>
tr: &Alt;+<keycap>6</keycap> → &Alt;+<keycap>1</keycap>

source: use the value stored in C1 to C6
tr: C1’den C6’ya kadar depolanmış değeri kullan

source: Comments on Specific Functions
tr: Belirli İşlevlerdeki Açıklamalar

source: Mod and IntDiv
tr: Mod ve IntDiv

source: <guibutton>Mod</guibutton> gives the remainder of dividing the displayed number by the next input number.
tr: <guibutton>Mod</guibutton>, görüntüdeki sayıyı sonraki girilecek sayıya bölümünden kalanını gösterir.

source: <userinput>22 Mod 8 = </userinput> will give the result <emphasis>6</emphasis>
tr: <userinput>22 Mod 8 = </userinput> <emphasis>6</emphasis> sonucunu verecektir

source: <userinput>22.345 Mod 8 = </userinput> will give the result <emphasis>6.345</emphasis>
tr: <userinput>22.345 Mod 8 = </userinput> <emphasis>6.345</emphasis> sonucunu verecektir

source: <guibutton>&Shift;</guibutton> <guibutton>IntDiv</guibutton> does integer division of the displayed number by the next input number.
tr: <guibutton>&Shift;</guibutton> <guibutton>IntDiv</guibutton>, görüntüdeki sayının sonra girilecek sayıya tam sayı bölümünü yapar.

source: <userinput>22 Shift IntDiv 8 = </userinput> will give the result <emphasis>2</emphasis>
tr: <userinput>22 Üst Karakter IntDiv 8 = </userinput> sonucu <emphasis>2</emphasis>

source: <userinput>22.345 Shift IntDiv 8 = </userinput> also gives <emphasis>2</emphasis>
tr: <userinput>22.345 Üst Karakter IntDiv 8 = </userinput> sonucu <emphasis>2</emphasis>

source: Used instead of the <guibutton>=</guibutton> key, <guibutton>%</guibutton> interprets the final operation carried out in the current calculation as follows:
tr: <guibutton>=</guibutton> düğmesi yerine kullanılır, <guibutton>%</guibutton> hesaplamada yapılan son işlemi aşağıdaki gibi yorumlar:

source: If the final operator is + or - the second argument is interpreted as percentage of the first operand.
tr: Eğer son işleç + ya da − ise ikinci değişken ilk işlenenin yüzdesi olarak yorumlanır.

source: If the final operator is * divide the result of the multiplication by 100.
tr: Eğer son işleç * ise bölüm sonucun 100 ile çarpımıdır.

source: If the final operator is / give the left operand as a percentage of the right operand.
tr: Eğer son işleç / ise sol işleninin, sağ işlenene göre yüzdesini ver.

source: In all other cases the &percnt; key gives identical results to the = key.
tr: Diğer tüm durumlarda &percnt;, = düğmesi ile aynı sonuçları verir.

source: Examples:
tr: Örnekler:

source: <userinput>150 + 50 %</userinput> gives <emphasis>225</emphasis> (150 plus 50 percent of this amount)
tr: <userinput>150 + 50 %</userinput> sonucu <emphasis>225</emphasis> (150 artı 50 sonucunun yüzdesi)

source: <userinput>42 * 3 %</userinput> gives <emphasis>1.26</emphasis> (42 * 3 / 100)
tr: <userinput>42 * 3 %</userinput> sonucu <emphasis>1.26</emphasis> (42 * 3 / 100)

source: <userinput>45 / 55 %</userinput> gives <emphasis>81.81...</emphasis> (45 is 81.81.. percent of 55)
tr: <userinput>45 / 55 %</userinput> sonucu <emphasis>81.81…</emphasis> (45, 81.81… 55 yüzdesi)

source: Lsh and Rsh
tr: Lsh ve Rsh

source: <guibutton>Lsh</guibutton> left shifts the integer part of the displayed value (multiplies it by 2) n times, where n is the next input number, and gives an integer result (base is set to <guibutton>Bin</guibutton>):
tr: <guibutton>Lsh</guibutton> sola görüntülenen değerin tamsayı bölümünü sola kaydırır (2 ile çarpar), n bir sonraki giriş numarasıdır ve bir tamsayı sonucu verir (taban <guibutton>Bin</guibutton> olarak ayarlanır):

source: <userinput>10 Lsh 3 =</userinput> gives <emphasis>80</emphasis> (10 multiplied by 2 three times).
tr: <userinput>10 Lsh 3 =</userinput> <emphasis>80</emphasis> verir (10 üç kere 2 ile çoğaltılmıştır).

source: <userinput>10.345 Lsh 3 =</userinput> also gives <emphasis>80</emphasis>.
tr: <userinput>10,345 Lsh 3 =</userinput> da <emphasis>80</emphasis> verir.

source: <guibutton>Rsh</guibutton> right shifts the value (performs an integer divide by 2) n times.
tr: <guibutton>Rsh</guibutton> değeri n kere sağa kaydırır (2’ye tam sayı bölünmeyi gerçekleştirir).

source: <userinput>16 Rsh 2 =</userinput> gives <emphasis>4</emphasis> (16 divided by 2 twice).
tr: <userinput>16 Rsh 2 =</userinput> <emphasis>4</emphasis> verir (16 iki kere 2’ye bölünmüştür).

source: <userinput>16.999 Rsh 2 =</userinput> also gives <emphasis>4</emphasis>.
tr: <userinput>16,999 Rsh 2 =</userinput> da <emphasis>4</emphasis> verir.

source: Cmp, And, Or and Xor
tr: Cmp, And, Or ve Xor

source: The <guibutton>Cmp</guibutton>, <guibutton>And</guibutton> and <guibutton>Or</guibutton> functions perform bitwise logical operations and therefore appear more meaningful if the base is set to <guilabel>Hex</guilabel>, <guilabel>Oct</guilabel> or <guilabel>Bin</guilabel> rather than <guilabel>Dec</guilabel>. In the following examples base is set to <guilabel>Bin</guilabel>.
tr: <guibutton>Cmp</guibutton>, <guibutton>And</guibutton> ve <guibutton>Or</guibutton> işlevleri bit tabanlı mantıksal işlemler gerçekleştirir ve bu nedenle taban <guilabel>Onluk</guilabel> yerine <guilabel>Onaltılık</guilabel>, <guilabel>Sekizlik</guilabel> veya<guilabel>İkilik</guilabel> olarak ayarlanırsa daha anlamlı görünür. Aşağıdaki örneklerde taban <guilabel>Bin</guilabel> olarak ayarlanmıştır.

source: <guibutton>Cmp</guibutton> performs a 1's complement (inverts the bits).
tr: <guibutton>Cmp</guibutton> 1’e göre tamamlayıcı (biti ters çevirir) gerçekleştirir.

source: <userinput>101 Cmp</userinput> gives <emphasis>111...111010</emphasis>
tr: <userinput>101 Cmp</userinput> <emphasis>111…111010</emphasis> verir

source: <guibutton>AND</guibutton> does a logical AND.
tr: <guibutton>AND</guibutton> mantıksal AND yapar.

source: <userinput>101 AND 110 =</userinput> gives <emphasis>100</emphasis>
tr: <userinput>101 AND 110 =</userinput> sonucu <emphasis>100</emphasis>

source: <guibutton>OR</guibutton> does the logical OR.
tr: <guibutton>OR</guibutton> mantıksal OR yapar.

source: <userinput>101 OR 110 =</userinput> gives <emphasis>111</emphasis>
tr: <userinput>101 OR 110 =</userinput> sonucu <emphasis>111</emphasis>

source: <guibutton>XOR</guibutton> performs the logical XOR (exclusive OR) operation.
tr: <guibutton>XOR</guibutton> mantıksal XOR (özel OR) işlemini gerçekleştirir.

source: <userinput>101 XOR 110 =</userinput> gives <emphasis>11</emphasis>
tr: <userinput>101 XOR 110 =</userinput> <emphasis>11</emphasis> verir

source: Questions and Answers
tr: Sorular ve Yanıtlar

source: How do I get e, the Euler number?
tr: Euler sayısı e’yi nasıl elde ederim?

source: Press <userinput>1 Shift e<superscript>x</superscript></userinput> in the &kcalc; window, press <userinput>1 <keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo> <keycap>N</keycap></userinput> on the keyboard or use the <menuchoice><guimenu>Constants</guimenu><guimenuitem>Mathematics</guimenuitem> </menuchoice> menu.
tr: &kcalc; penceresinde <userinput>1 Üst Karakter e<superscript>x</superscript></userinput> düğmelerine basın; klavyede <userinput>1 <keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo> <keycap>N</keycap></userinput> düğmelerine basın veya <menuchoice><guimenu>Sabitler</guimenu><guimenuitem>Matematik</guimenuitem> </menuchoice> menüsünü kullanın.

source: How do I get two fixed digits after the period?
tr: Virgülden sonra sabit basamakları nasıl elde ederim?

source: Select <menuchoice><guimenu>Settings</guimenu><guimenuitem> Configure &kcalc;...</guimenuitem></menuchoice> on the menu bar, this will bring up the configuration dialog. Check <guilabel>Set decimal precision</guilabel> and adjust the spin control so that it shows a 2.
tr: Menü çubuğundan <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem> &kcalc; Uygulamasını Yapılandır…</guimenuitem></menuchoice> ögesini seçin, bu size bir yapılandırma penceresi açacaktır. <guilabel>Ondalık kesinlik ayarlayıcısı</guilabel>’nı denetleyin ve denetleyiciyi 2 gösterecek biçimde ayarlayın.

source: What about Precision?
tr: Peki ya kesinlik?

source: The main factor determining the precision of &kcalc; is whether your libc and libmath supports the C data type <type>long double</type>. If this is the case, &kcalc; will detect this at compile time and use it as its fundamental data type to represent numbers.
tr: &kcalc; kesinliğini belirleyen ana faktör libc ve libmath’inizin <type>long double</type> C veri türünü destekleyip desteklemediğidir. Eğer öyle ise &kcalc; bunu derleme zamanında algılar ve sayıları temsil etmek için temel veri türü olarak kullanır.

source: Adjust the <guilabel>Precision</guilabel> in &kcalc;'s <guibutton>Configure</guibutton> dialog so that the above computations work correctly. I recommend a precision of 14 if the fundamental data type for your copy of &kcalc; is <type>long double</type>, otherwise 8 or 10.
tr: Yukarıdaki hesaplamaların doğru şekilde çalışması için &kcalc;’ın <guibutton>Yapılandır</guibutton> penceresindeki <guilabel>Kesinlik</guilabel>’i ayarlayın. &kcalc; kopyanız için temel veri türü varsa <type>long double</type> için olan 14 kesinliğini öneriyorum, aksi halde 8 veya 10’dur.

source: Higher precision doesn't necessarily lead to better results. Play with the precision and you will see what I mean.
tr: Daha yüksek kesinlik, mutlaka daha iyi sonuçlar doğurmaz. Duyarlılıkla oynayın ve ne demek istediğimi anlayacaksınız.

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: &kcalc; Program Copyright &copy;:
tr: &kcalc; Program Telif Hakkı &copy;:

source: The &kde; Team 2000-2008
tr: &kde; takımı 2000–2008

source: &kcalc; was inspired by <personname><firstname>Martin</firstname> <surname>Bartlett</surname></personname>'s <application>xfrmcalc</application>, whose stack engine is still part of &kcalc;.
tr: &kcalc;, <personname><firstname>Martin</firstname> <surname>Bartlett</surname></personname>’in yığın işletkesi hâlâ &kcalc;’ın bir parçası olan <application>xfrmcalc</application>’dan esinlenilmiştir.

source: Documentation Copyright &copy; 2001,2002,2005, 2006,2010:
tr: Belgelendirme Telif Hakkı &copy; 2001,2002,2005, 2006,2010:

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Mesutcan Kurt <email>mesutcank@gmail.com</email></para><para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
