Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcalc_commands.po
Languages: tr

source: Command Reference
tr: Komut Başvurusu

source: Menu Items
tr: Menü Ögeleri

source: A brief overview of some special menu items in &kcalc;:
tr: &kcalc; içindeki bazı özel menü ögelerine kısa bir bakış:

source: <guimenu>Constants</guimenu> <guimenuitem>Mathematics</guimenuitem>
tr: <guimenu>Sabitler</guimenu> <guimenuitem>Matematik</guimenuitem>

source: Display Pi, Euler Number or Golden Ratio.
tr: Şunları göster: Pi, Euler Sayısı veya Altın Oran.

source: <guimenu>Constants</guimenu> <guimenuitem>Electromagnetism</guimenuitem>
tr: <guimenu>Sabitler</guimenu> <guimenuitem>Elektromanyetizma</guimenuitem>

source: Display Light Speed, Elementary Charge, Impedance of Vacuum, Permeability of Vacuum or Permittivity of Vacuum.
tr: Şunları göster: Işık Hızı, Birim Yük, Boşluğun Empedansı, Boşluğun Geçirgenliği veya Boşluğun Yüklenilebilirliği.

source: <guimenu>Constants</guimenu> <guimenuitem>Atomic &amp; Nuclear</guimenuitem>
tr: <guimenu>Sabitler</guimenu> <guimenuitem>Atomik ve Nükleer</guimenuitem>

source: Display Planck's Constant, Elementary Charge or Fine-Structure Constant.
tr: Şunları göster: Planck Sabiti, Birim Yük veya Hassas Yapı Sabiti.

source: <guimenu>Constants</guimenu> <guimenuitem>Thermodynamics</guimenuitem>
tr: <guimenu>Sabitler</guimenu> <guimenuitem>Termodinamik</guimenuitem>

source: Display Boltzmann Constant, Atomic Mass Unit, Molar Gas Constant, Stefan-Boltzmann Constant or Avogadro's Number.
tr: Şunları göster: Boltzmann Sabiti, Atomik Kütle Birimi, Molar Gaz Sabiti, Stefan-Boltzmann Sabiti veya-Avogadro Sayısı.

source: <guimenu>Constants</guimenu> <guimenuitem>Gravitation</guimenuitem>
tr: <guimenu>Sabitler</guimenu> <guimenuitem>Yerçekimi</guimenuitem>

source: Display Constant of Gravitation or Earth Acceleration.
tr: Şunları göster: Yerçekimi Sabiti veya Yeryüzü İvmesi.

source: <guimenu>Settings</guimenu> <guimenuitem>Simple Mode</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Basit Kip</guimenuitem>

source: Displays the simple math buttons.
tr: Basit matematik düğmelerini görüntüler.

source: <guimenu>Settings</guimenu> <guimenuitem>Science Mode</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Bilim Kipi</guimenuitem>

source: Displays trigonometric and science buttons.
tr: Trigonometrik ve bilim düğmelerini görüntüler.

source: <guimenu>Settings</guimenu> <guimenuitem>Statistic Mode</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>İstatistik Kipi</guimenuitem>

source: Displays <link linkend="statistical-mode">statistic buttons.</link>
tr: <link linkend="statistical-mode">İstatistik düğmelerini</link> görüntüler.

source: <guimenu>Settings</guimenu> <guimenuitem>Numeral System Mode</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Sayısal Sistem Kipi</guimenuitem>

source: Displays <link linkend="and-or-xor">logic buttons</link> and allows changing the numeral system.
tr: <link linkend="and-or-xor">Mantıksal düğmeleri</link> gösterir ve sayı sistemini değiştirmeye izin verir.

source: <guimenu>Settings</guimenu> <guimenuitem>Show History</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Geçmişi Göster</guimenuitem>

source: Display the history.
tr: Geçmişi görüntüler.

source: <guimenu>Settings</guimenu> <guimenuitem>Constants Buttons</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Sabit Düğmeleri</guimenuitem>

source: Display constants buttons. They are available in <link linkend="science-mode">science mode</link> and <link linkend="statistical-mode">statistic mode</link>.
tr: Sabitlerin düğmelerini gösterir. Bunlar; <link linkend="science-mode">bilim kipi</link> ve <link linkend="statistical-mode">istatistik kipi</link> içinde kullanılabilir.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Bit Edit</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Bit Düzenlemeyi Göster</guimenuitem>

source: Displays a bit edit field. Click on a bit to toggle it. Only available in <link linkend="numeral-system-mode">numeral system mode</link>.
tr: Bit düzeni alanını gösterir. Geçiş yapmak için üzerine tıklayın. Yalnızca <link linkend="numeral-system-mode">sayısal sistem kipi</link> içinde kullanılabilir.

source: Additionally &kcalc; has the common <guimenu>File</guimenu>, <guimenu>Edit</guimenu>, <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/menus.html">Menus</ulink> in the &kde; Fundamentals.
tr: Ayrıca &kcalc;, yaygınca kullanılan <guimenu>Dosya</guimenu>, <guimenu>Düzen</guimenu>, <guimenu>Ayarlar</guimenu> ve <guimenu>Yardım</guimenu> menü ögelerine de sahiptir; daha fazla bilgi için &kde; Temelleri altındaki <ulink url="help:/fundamentals/ui.html#menus">Menüler</ulink> bölümüne göz atın.
