Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcalc.po
Languages: tr

source: The &kcalc; Handbook
tr: &kcalc; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Mesutcan</firstname><surname>Kurt</surname><affiliation><address><email>mesutcank@gmail.com</email></address></affiliation><contrib>-</contrib></othercredit>

source: Applications 16.08
tr: Uygulamalar 16.08

source: &kcalc; is a calculator for your desktop environment. In the simple mode it can be used for basic arithmetic operations, but provides advanced modes for scientific, statistical and numeral system calculations.
tr: &kcalc; masaüstü ortamınız için bir hesap makinesidir. Basit kipte, temel aritmetik işlemler için kullanılabilir; ancak bilimsel, istatistiksel ve sayısal sistem hesaplamaları için gelişmiş kipler de sağlar.

source: KCalc
tr: K Hesap

source: calculator
tr: hesap makinesi

source: Introduction
tr: Giriş

source: &kcalc; offers many more mathematical functions than meets the eye at a first glance. Please study the section on keyboard accelerators and modes in this handbook to learn more about the many functions available.
tr: &kcalc; ilk bakışta göze çarpandan çok daha fazla matematiksel işlev sunar. Kullanılabilecek birçok işlev hakkında daha fazla bilgi edinmek için lütfen bu el kitabındaki klavye ivmelendiricileri ve kipleri bölümünü inceleyin.

source: In addition to the usual functionality offered by most scientific calculators, &kcalc; offers a number of features, which I think are worthwhile pointing out:
tr: Birçok bilimsel hesap makinesinin olağan işlevselliğine ek olarak, &kcalc;’ın işaret etmeye değer şeyler sunduğunu düşünüyorum:

source: &kcalc; provides trigonometric functions, logic operations, and it is able to do statistical calculations.
tr: &kcalc; trigonometrik işlevler, mantık işlemleri sağlar ve istatistiksel hesaplamalar yapabilir.

source: &kcalc; allows you to cut and paste numbers from/into its display.
tr: &kcalc; kendi görüntüsünden sayıları kesip yapıştırmanızı sağlar.

source: &kcalc; features a <firstterm>results-stack</firstterm> which lets you conveniently recall previous results.
tr: &kcalc; önceki sonuçları rahatlıkla geri çağırmanızı sağlayan bir <firstterm>sonuç yığını</firstterm> içerir.

source: You can configure &kcalc;'s display colors and font.
tr: &kcalc;’ın görüntü renklerini ve yazıtipini yapılandırabilirsiniz.

source: You can configure &kcalc;'s precision, the number of displayed digits and the number of digits after the period in the settings dialog.
tr: Ayarlar iletişim kutusundaki &kcalc;’ın duyarlılığını, görüntülenen basamak sayısını ve virgülden sonraki basamak sayısını yapılandırabilirsiniz.

source: &kcalc; offers a great number of useful <link linkend="key-accels"> key-bindings</link>, which make using &kcalc; without using a pointing device easy.
tr: &kcalc; bir işaretleme aygıtı kullanmadan &kcalc;’ı kullanmayı sağlayan, çok sayıda yararlı <link linkend="key-accels">düğme bağıntıları</link> sunar.

source: Hint: pressing (and holding) the &Ctrl;-key, displays on every button,the corresponding key-binding.
tr: İpucu: &Ctrl;− ikilisine basmak (ve basılı tutmak), her düğme üzerindeki ilgili düğme bağıntısını gösterir.

source: &kcalc; uses <ulink url="https://en.wikipedia.org/wiki/Calculator_input_methods#Infix_notation">Infix notation</ulink> which enforces correct order of operations as taught in school; contrary to <ulink url="https://en.wikipedia.org/wiki/Calculator_input_methods#Immediate_execution">Immediate execution</ulink> used by many simple calculators.
tr: &kcalc;, pek çok yalın hesap makinesi tarafından kullanılan <ulink url="https://en.wikipedia.org/wiki/Calculator_input_methods#Immediate_execution">anında yürütme</ulink> yerine okullarda öğretildiği biçimiyle düzgün işlem sırası sağlayan <ulink url="https://en.wikipedia.org/wiki/Calculator_input_methods#Infix_notation">Infix simgelemi</ulink>’ni kullanır.

source: Have fun with &kcalc;!
tr: &kcalc; ile iyi eğlenceler!

source: Usage
tr: Kullanım

source: General Usage
tr: Genel Kullanım

source: General usage is straightforward and similar to the way most simple scientific calculators operate, but take note of the following special &kcalc; features:
tr: Genel kullanım basittir ve en basit bilimsel hesap makinesinin çalışma şekline benzer; ancak aşağıdaki özel &kcalc; özelliklerini not edin:

source: Result Stack
tr: Sonuç Yığını

source: Each time you &LMB; click on the <guibutton>=</guibutton> button or press your keyboard's &Enter; or <keysym>=</keysym> keys, the display result is written to &kcalc;'s result stack. You can navigate through the result stack with your keyboard's <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> and <keycombo action="simul">&Ctrl; &Shift;<keycap>Z</keycap></keycombo> keys.
tr: &LMB; ile <guibutton>=</guibutton> düğmesine, klavyenizin &Enter; düğmesine veya <keysym>=</keysym> düğmesine bastığınız her zaman, görüntüdeki sonuç, &kcalc; yazılımının sonuç yığınına yazılır. Sonuç yığını arasında klavyenizin <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> ve <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> düğme ikililerini kullanarak gezinebilirsiniz.

source: Percent Function
tr: Yüzde İşlevi

source: The percent function works somewhat differently to that on most calculators. However, once understood, its enhanced functionality proves quite useful. See the section about the <link linkend="percent">percent</link> function for further details.
tr: Yüzde işlevi, çoğu hesap makinesindeki işleve göre biraz farklı çalışır. Ancak, bir kere anlaşıldığında, geliştirilmiş işlevselliği oldukça yararlıdır. Daha fazla ayrıntı için <link linkend="percent">yüzde</link> işlevi ile ilgili bölüme bakın.

source: Cut and Paste
tr: Kes ve Yapıştır

source: Pressing <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> will place the displayed number onto the clipboard.
tr: <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> basmak gösterilen sayıyı panoya yapıştıracaktır.

source: Pressing <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> will paste the clipboard content into the display if the content of the clipboard is a valid floating point number.
tr: <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> basarak panonun içeriği geçerli bir kayan noktalı değerse görüntüye yapıştıracaktır.

source: It is still possible to copy/paste by clicking on &kcalc;'s display, but this may disappear in future versions.
tr: &kcalc; görüntüsüne tıklayarak kopyalayıp yapıştırmak hâlâ olanaklıdır; ancak bu gelecekteki sürümlerde kaybolabilir.

source: Advanced functions
tr: Gelişmiş işlevler

source: When you start &kcalc; for the first time, the calculator will only display buttons for basic arithmetic computations.
tr: &kcalc;’ı ilk defa başlattığınızda, hesap makinesi yalnızca temel aritmetik hesaplamalar için düğmeler görüntüler.

source: Under the menu entry <guimenu>Settings</guimenu> it is possible to select a mode for &kcalc;: it is possible to choose <link linkend="simple-mode">Simple</link> or <link linkend="science-mode">Science</link> or <link linkend="statistical-mode">Statistic</link> or <link linkend="numeral-system-mode">Numeral System</link> mode. Please note, that these modes will slightly change as &kcalc; evolves.
tr: <guimenu>Ayarlar</guimenu> menü girişinin altında &kcalc; için kip seçmek olanaklıdır: <link linkend="simple-mode">Basit</link> veya <link linkend="science-mode">Bilim</link> veya <link linkend="statistical-mode">İstatistik</link> veya <link linkend="numeral-system-mode">Sayısal Sistem</link> kipleri seçilebilirdir. Lütfen unutmayın ki, bu kipler &kcalc; geliştikçe yavaşça değişecektir.

source: Button Layout
tr: Düğme Yerleşimi

source: To give easy access to all the functions in advanced modes in &kcalc;, many keys have a second layout. Click on <guibutton>&Shift;</guibutton> or press the shortcut <keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo> to make the second layout of the buttons visible.
tr: &kcalc; içerisindeki gelişmiş kiplere kolay erişim sağlamak için çoğu düğme ikinci bir yerleşime sahiptir. Düğmelerin ikinci yerleşimini görünür kılmak için <guibutton>&Shift;</guibutton> veya <keycombo action="simul">&Ctrl;<keycap><keycap>2</keycap></keycap></keycombo> kısayollarını kullanın.

source: History
tr: Geçmiş

source: The history area shows all the calculations done in &kcalc; for the active session of &kcalc;. Click on <guibutton>AC</guibutton> or press the shortcut <keycap>Del</keycap> to clear the content of the history. To activate or deactivate it, use the item <guilabel>Show History</guilabel> in the menu <guimenu>Settings</guimenu> of the menu bar, or press <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo>.
tr: Geçmiş alanı, &kcalc;’ın etkin oturumu dahilinde &kcalc;’ta yapılan tüm hesaplamaları gösterir. Geçmiş içeriğini temizlemek için <guibutton>AC</guibutton>’ye tıklayın veya <keycap>Sil</keycap> düğmesine basın. Geçmişi etkinleştirmek veya devre dışı bırakmak için menü çubuğundan <guimenu>Ayarlar</guimenu> ve <guilabel>Geçmişi Göster</guilabel> yolunu izleyin veya <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> kısayolunu kullanın.

source: Simple Mode
tr: Basit Kip

source: This mode contains only those buttons and functions, which are essential necessary for basic calculations.
tr: Bu kipte yalnızca temel hesaplamalar için gerekli olan düğmeler ve işlevler bulunur.

source: If you just want to sum up all items on an invoice this mode may be your choice.
tr: Bir faturadaki tüm ögeleri toplamak istiyorsanız bu kipi seçmek isteyebilirsiniz.

source: Science Mode
tr: Bilim Kipi

source: In this mode the left column of buttons is allocated to trigonometric functions:
tr: Bu kip içerisinde düğmelerin sol sütunları trigonometrik işlevlere ayrılır:

source: Buttons
tr: Düğmeler

source: Function
tr: İşlev

source: Enter Hyperbolic sub mode. Hyp Sin for example is the hyperbolic sine: sinh
tr: Hiperbolik alt kipine girin. Hyp Sin; örneğin hiperbolik sinüstür: sinh

source: Compute the sine
tr: Sinüsü hesapla

source: &Shift; <guibutton>Sin</guibutton> or <guibutton>Asin</guibutton>
tr: &Shift; <guibutton>Sin</guibutton> veya <guibutton>Asin</guibutton>

source: Compute the inverse sine
tr: Ters sinüsü hesapla

source: Compute the cosine
tr: Kosinüsü hesapla

source: &Shift; <guibutton>Cos</guibutton> or <guibutton>Acos</guibutton>
tr: &Shift; <guibutton>Cos</guibutton> veya <guibutton>Acos</guibutton>

source: Compute the inverse cosine
tr: Ters kosinüsü hesapla

source: Compute the tangent
tr: Tanjantı hesapla

source: &Shift; <guibutton>Tan</guibutton> or <guibutton>Atan</guibutton>
tr: &Shift; <guibutton>Tan</guibutton> veya <guibutton>Atan</guibutton>

source: Compute the inverse tangent
tr: Ters tanjantı hesapla

source: Compute the Log base 10
tr: 10 tabanında logaritma hesaplar

source: &Shift; <guibutton>Log</guibutton> or 10<superscript>x</superscript>
tr: &Shift; <guibutton>Log</guibutton> veya 10<superscript>x</superscript>

source: Compute 10 to the power of x
tr: 10 üzeri x kuvvetini hesapla

source: Compute the natural logarithm. That is the log to base e
tr: Doğal logaritmayı hesaplayın. Bu log e tabanındadır

source: &Shift; <guibutton>Ln</guibutton> or e<superscript>x</superscript>
tr: &Shift; <guibutton>Ln</guibutton> veya e<superscript>x</superscript>

source: Compute e (the base of the natural logarithm) to the power of x
tr: x üssünde e (doğal logaritma tabanı) hesapla

source: The second column has buttons for algebraic functions:
tr: İkinci sütunda cebirsel işlevler için düğmeler bulunur:

source: <guibutton>Mod</guibutton>
tr: <guibutton>Kip</guibutton>

source: Compute the remainder in Euclidean division
tr: Öklit bölmesinin kalanını hesapla

source: <guibutton>&Shift;</guibutton> <guibutton>Mod</guibutton> or <guibutton>IntDiv</guibutton>
tr: <guibutton>&Shift;</guibutton> <guibutton>Mod</guibutton> veya <guibutton>IntDiv</guibutton>

source: Integer division (integer part of the quotient)
tr: Tamsayı bölme (bölümün tamsayı kısmı)

source: Compute the reciprocal for a number
tr: Bir numara için karşılıklı hesap yap

source: <guibutton>&Shift;</guibutton> <guibutton>1/x</guibutton> or <guibutton>nCm</guibutton>
tr: <guibutton>&Shift;</guibutton> <guibutton>1/x</guibutton> veya <guibutton>nCm</guibutton>

source: Compute the number of distinct second-operand-element subsets of it that can be formed for any set containing first operand elements (binomial coefficient)
tr: İlk operand ögesini içeren herhangi bir küme için oluşturulabilen farklı ikinci operand ögesi alt kümelerinin sayısını hesapla (binom katsayısı)

source: <guibutton>x!</guibutton>
tr: <guibutton>xl</guibutton>

source: Compute the product of all positive integers less than or equal to the current integer operand (factorial)
tr: Şu anki tamsayı işlenene (faktöriyel) eşit veya küçük olan tüm pozitif tamsayıların çarpımını hesapla

source: Compute the square of x
tr: x’in karesini hesapla

source: <guibutton>&Shift;</guibutton> <guibutton>x²</guibutton> or <guibutton>√x</guibutton>
tr: <guibutton>&Shift;</guibutton> <guibutton>x²</guibutton> veya <guibutton>√x</guibutton>

source: Compute the square root of x
tr: x’in karekökünü hesapla

source: x power y
tr: x üzeri y

source: &Shift; x<superscript>y</superscript> or x<superscript>1/y</superscript>
tr: &Shift; x<superscript>y</superscript> veya x<superscript>1/y</superscript>

source: x power 1/y
tr: x üzeri 1/y

source: Computes the third (cubic) power of x
tr: x’in üçüncü (kübik) kuvvetini hesaplar

source: <guibutton>&Shift;</guibutton> <guibutton>x³</guibutton> or <guibutton>∛x</guibutton>
tr: <guibutton>&Shift;</guibutton> <guibutton>x³</guibutton> veya <guibutton>∛x</guibutton>

source: Computes the third (cubic) root of x
tr: x’in üçüncü (kübik) kökünü hesaplar

source: Computes the product of the first operand and decimal exponent of the second operand
tr: İkinci işlenenin birinci işlenen ve ondalık basamağının çarpımını hesaplar

source: Statistical Mode
tr: İstatistiksel Kip

source: In this mode the left column of buttons is allocated to statistical functions:
tr: Bu kipte düğmelerin sol sütunları istatistiksel işlevlere ayrılmıştır:

source: Most of the functionality in this mode is centered around the <guibutton>Dat</guibutton> button. To create a data list of numbers, enter a number into the calculator and press <guibutton>Dat</guibutton>. A sequentially increasing number is shown on the display indicating which position in the Data <quote>list</quote> the number occupies. A traditional calculator only stores three values for statistical functions: The number of discrete items in a list, the sum of the data items entered and the sum of the square of all data items in the list. &kcalc; differs by actually storing each discrete value, allowing you to calculate the median value of the data.
tr: Bu kipteki işlevselliğin çoğu, <guibutton>Dat</guibutton> düğmesinin çevresinde ortalanır. Bir sayı veri listesi oluşturmak için hesap makinesine bir sayı girin ve <guibutton>Dat</guibutton>’a basın. Art arda artan sayı, görüntüdeki veri <quote>listesinin</quote> hangi konumda yer aldığını gösterir. Geleneksel bir hesap makinesi yalnızca istatistiksel işlevler için üç değer saklar: Bir listedeki ayrı öge sayısı, girilen veri ögelerinin toplamı ve listedeki tüm veri ögelerinin karesinin toplamı. &kcalc; aslında her ayrı değeri saklarken, verinin ortanca değerini hesaplamanıza izin vererek farklılık gösterir.

source: Recall the number of data items entered
tr: Girilen veri ögelerinin sayısını anımsa

source: <guibutton>&Shift;</guibutton> <guibutton>N</guibutton> or <guibutton>&Sgr;x</guibutton>
tr: <guibutton>&Shift;</guibutton> <guibutton>N</guibutton> veya <guibutton>&Sgr;x</guibutton>

source: Display the sum of all data items entered
tr: Girilen tüm veri kalemlerinin toplamını göster

source: Display the mean of the data items entered
tr: Girilen veri öğelerinin ortalamasını görüntüle

source: <guibutton>&Shift;</guibutton> <guibutton>Mea</guibutton> or <guibutton>&Sgr;x²</guibutton>
tr: <guibutton>&Shift;</guibutton> <guibutton>Mea</guibutton> veya <guibutton>&Sgr;x²</guibutton>

source: Display the sum of the square of all data items entered
tr: Girilen tüm veri kalemlerinin karesinin toplamını görüntüle

source: Display the standard deviation (n)
tr: Standart sapmayı (n) göster

source: <guibutton>&Shift;</guibutton> &sgr;<subscript>N</subscript> or &sgr;<subscript>N-1</subscript>
tr: <guibutton>&Shift;</guibutton> &sgr;<subscript>N</subscript> veya &sgr;<subscript>N−1</subscript>

source: Display the population standard deviation (n-1)
tr: Popülasyonun standart sapmasını göster (n−1)

source: Display the median
tr: Ortancayı görüntüle

source: Enter a data item
tr: Bir veri ögesi gir

source: <guibutton>&Shift;</guibutton> <guibutton>Dat</guibutton> or <guibutton>CDat</guibutton>
tr: <guibutton>&Shift;</guibutton> <guibutton>Dat</guibutton> veya <guibutton>CDat</guibutton>

source: Clear last data item entered
tr: Girilen son veri ögesini temizle

source: Clear the store of all data item entered
tr: Girilen tüm veri ögesi deposunu temizle

source: The next two columns hold the buttons with trigonometric and algebraic functions described in the <link linkend="science-mode">Science</link> mode section.
tr: Sonraki iki sütun, <link linkend="science-mode">Bilim</link> kipi bölümünde açıklanan trigonometrik ve cebirsel işlevler düğmelerini barındırır.

source: Numeral System Mode
tr: Sayısal Sistem Kipi

source: This mode contains buttons and functions to calculate in binary, hexadecimal, octal and decimal.
tr: Bu kip, ikilik, onaltılık, sekizlik ve ondalık olarak hesaplamak için düğmeler ve işlevler içerir.

source: You select the base from the dropdown menu on the left. To insert a hexadecimal number for example, just do the following: Select <guilabel>Hex</guilabel> from the dropdown menu. Then enter a number and note that you can use the letters <guibutton>A</guibutton> to <guibutton>F</guibutton> for digits larger than 9. In the numeral system view, you can see the number converted to decimal, octal and binary.
tr: Soldaki açılır menü ile tabanı seçersiniz. Örneğin onaltılık bir sayı eklemek için aşağıdakileri yapın: Açılır menüden <guilabel>Hex</guilabel>’i seçin. Ardından bir numara girin ve 9’dan büyük rakamlar için <guibutton>A</guibutton> ve <guibutton>F</guibutton> harflerini kullanabilirsiniz. Rakam sistemi görünümünde, sayının ondalık, sekizlik ve ikilik sisteme dönüştürüldüğünü görebilirsiniz.

source: Binary, octal and hexadecimal numbers can be displayed as groups of digits separated by whitespaces. Such grouping can improve readability of numbers. For example, hexadecimal number <emphasis>AF1C42</emphasis> can be displayed as <emphasis>AF 1C 42</emphasis> with separation every second digit. Grouping can be turned off or tweaked. Select <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kcalc;...</guimenuitem></menuchoice> to bring up the configuration dialog and change the setting on the <guilabel>General</guilabel> page as appropriate.
tr: İkilik, sekizlik ve onaltılık sayılar, boşluklarla ayrılmaş basamak grupları olarak görüntülenebilirler. Bu tür gruplandırmalar sayıların okunabilirliğini artırır. Örneğin, <emphasis>AF1C42</emphasis> onaltılık sayısı, <emphasis>AF 1C 42</emphasis> olarak, ikişer basamaklarla gösterilebilir. Gruplandırma kapatılabilir veya ayarlanabilir. Yapılandırma iletişim kutusunu getirmek ve <guilabel>Genel</guilabel> sayfasından bu ayarı değiştirmek için <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>&kcalc; Uygulamasını Yapılandır…</guimenuitem></menuchoice> yolunu izleyin.

source: You may want to select <guimenu>Show Bit Edit</guimenu> from the <guimenu>Settings</guimenu> menu to see selected bits.
tr: Seçili bitleri görmek için <guimenu>Ayarlar</guimenu> menüsünden <guimenu>Bit Düzenini Göster</guimenu>’i seçmek isteyebilirsiniz.

source: There are logic operators available in this mode. These operators are:
tr: Bu kipte mantık işleçleri kullanılabilirdir. Bu işleçler şunlardır:

source: Two numbers are logically anded
tr: İki sayı mantıksal AND’lenmiştir

source: Two numbers are logically ored
tr: İki sayı mantıksal or’lanmıştır

source: Two numbers are logically exclusive ored
tr: İki sayı mantıksal XOR’lanmıştır

source: Left shift the value
tr: Değeri sola kaydır

source: Right shift the value
tr: Değeri sağa kaydır

source: Perform a 1's complement
tr: 1’in tamamlayıcısını uygula

source: The second column holds the buttons with algebraic functions described in the <link linkend="science-mode">Science</link> mode section.
tr: İkinci sütun, <link linkend="science-mode">Bilim</link> kipi bölümünde açıklanan cebirsel işlevler düğmelerini barındırır.

source: The third column with the buttons <guibutton>A</guibutton> to <guibutton>F</guibutton> is enabled only in <guilabel>Hex</guilabel> mode.
tr: <guibutton>A</guibutton> to <guibutton>F</guibutton> düğmelerini içeren üçüncü sütun yalnızca <guilabel>Hex</guilabel> kipinde kullanılabilirdir.

source: Memory Operations
tr: Bellek İşlemleri

source: &kcalc; supports the memory operations given by standard calculators plus six slots to hold constants.
tr: &kcalc; standart hesap makinelerinin verdiği bellek işlemlerine ek olarak sabitleri tutmak için altı yuvayı destekler.

source: Standard Memory Operations
tr: Standart Bellek İşlemleri

source: &kcalc; can remember results of operations for you, and re-use them in later calculations. You can access these functions via several buttons labeled <guibutton>MR</guibutton>, <guibutton>MS</guibutton>, <guibutton>M+</guibutton> and <guibutton>MC</guibutton>.
tr: &kcalc; sizin için işlem sonuçlarını hatırlayabilir ve daha sonraki hesaplamalarda yeniden kullanabilirsiniz. Bu işlevlere, <guibutton>MR</guibutton>, <guibutton>MS</guibutton>, <guibutton>M+</guibutton> ve <guibutton> MC </guibutton> etiketli etiketlerle erişebilirsiniz.

source: The <guibutton>MS</guibutton> button stores the currently displayed result in memory.
tr: <guibutton>MS</guibutton> düğmesi, geçerli görüntüdeki sonucu belleğe kaydeder.

source: The <guibutton>M+</guibutton> button adds the current result to the one in memory. So, if you had stored a 20, and the current result is a 5, your memory would contain 25 when you press it. If the memory is empty, it acts like <guibutton>MS</guibutton> and simply stores the result.
tr: <guibutton>M+</guibutton> düğmesi, geçerli sonucu bellektekine ekler. Yani 20 varsa ve geçerli sonuç 5 ise bastığınızda bellekte 25 olacaktır. Eğer bellek boş ise <guibutton>MS</guibutton> gibi davranır ve sonucu kaydeder.

source: The <guibutton>MR</guibutton> button gets the value stored in memory and puts it in the display.
tr: <guibutton>MR</guibutton> düğmesi bellekte saklanmış değeri getirir ve görüntüde gösterir.

source: The <guibutton>MC</guibutton> button clears the memory.
tr: <guibutton>MC</guibutton> düğmesi belleği temizler.

source: If a value is stored in memory a <guilabel>M</guilabel> will appear in the status bar, next to the calculator mode indicator
tr: Eğer bir değer bellekte saklandıysa hesap makinesi kipi belirtecinin yanındaki durum çubuğunda <guilabel>M</guilabel> belirir

source: Constants
tr: Sabitler
