Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcharselect.po
Languages: tr

source: KCharSelect
tr: K Karakterci

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: 1.12 (Applications 16.04)
tr: 1.12 (Uygulamalar 16.04)

source: character
tr: karakter

source: font
tr: yazıtipi

source: &kcharselect; is a tool to select special characters from all installed fonts and copy them in different format (Plain text, Unicode or &HTML;) into the clipboard.
tr: &kcharselect;, kurulu tüm yazıtiplerinden özel karakterler seçmek ve bunları farklı biçimlerde (düz metin, Unicode veya &HTML;) panoya kopyalamak için kullanılan bir araçtır.

source: Double clicking on a character in the preview or pressing &Enter; adds it to the bar below the font preview. This feature allows to collect a word or a group of several characters and copy them together to the clipboard.
tr: Önizlemede bir karaktere çift tıklamak veya &Enter;’e basmak, onu yazıtipi önizlemesinin altındaki çubuğa ekler. Bu özellik, bir sözcüğü veya birkaç karakterden oluşan bir grubu toplamaya ve bunları birlikte panoya kopyalamaya izin verir.

source: Use <guimenuitem>Flip Text</guimenuitem> to reverse the order of the chosen characters.
tr: Seçilen karakterlerin sırasını tersine çevirmek için <guimenuitem>Metni Çevir</guimenuitem>’i kullanın.

source: By default characters are added to the right end of the group or cursor position. With <guimenuitem>Reverse Direction</guimenuitem> you can change this behavior and add characters in the left direction.
tr: Karakterler öntanımlı olarak grubun sağ ucuna veya imleç konumuna eklenir. <guimenuitem>Yönü Tersine Çevir</guimenuitem> ile bu davranışı değiştirebilir ve sol yönde karakter ekleyebilirsiniz.

source: You can browse characters by their category or quickly find a certain character by searching for its name. &kcharselect; displays various information about the selected character. This includes not only the Unicode character name, but also aliases, general notes and cross references to similar characters.
tr: Karakterlere kategorilerine göre göz atabilir veya belirli bir karakteri adını arayarak tez bulabilirsiniz. &kcharselect;, seçili karakter hakkında çeşitli bilgiyi görüntüler. Bu, yalnızca Unicode karakter adını değil, aynı zamanda diğer adları, genel notları ve benzer karakterlere yapılan çapraz başvuruları da içerir.

source: For technical use, different representations of the character are shown. &kcharselect; also contains Unihan data for East Asian characters to display English definitions and different pronunciations.
tr: Teknik kullanım için karakterin farklı temsilleri gösterilir. &kcharselect; ayrıca İngilizce tanımları ve farklı telaffuzları görüntülemek için Doğu Asya karakterleri için Unihan verisini içerir.
