Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_splashscreen.po
Languages: tr

source: Splash Screen
tr: Açılış Ekranı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Mesutcan</firstname><surname>Kurt</surname><affiliation><address><email>mesutcank@gmail.com</email></address></affiliation><contrib>-</contrib></othercredit>

source: System Settings
tr: sistem ayarları

source: splash screen
tr: açılış ekranı

source: theme
tr: tema

source: This module provides an interface to view and select splash screen themes.
tr: Bu modül, açılış ekranı temaları seçmek ve görüntülemek için bir arabirim sağlar.

source: Here's a screenshot of the splash screen manager
tr: İşte açılış ekranı yöneticisinin bir ekran görüntüsü

source: The splash screen manager module
tr: Açılış ekranı yöneticisi modülü

source: On this page you can see previews of already installed splash screens. The preview of the current splash screen is highlighted.
tr: Bu sayfada, halihazırda kurulu açılış ekranlarının önizlemelerini görebilirsiniz. Geçerli açılış ekranı önizlemesi vurgulanır.

source: Hover a preview image with the mouse cursor then the button <guilabel>Preview Splash Screen</guilabel> appears at the bottom right of the image. Press this button to view the splashscreen in action.
tr: Önizleme görselinin üzerine fare imleci ile geldiğinizde <guilabel>Açılış Ekranını Önizle</guilabel> görselin sağ alt kısmında görünür. Açıllış ekranının nasıl görüneceğini önizlemek için bu düğmeye tıklayın.

source: Get New Splash Screens...
tr: Yeni Al…

source: You need to be connected to the Internet to use this action. A dialog will display a list of themes from the <ulink url="https://store.kde.org">https://store.kde.org</ulink> website. Clicking the <guibutton>Install</guibutton> button associated with a theme will install this theme locally.
tr: Bu eylemi kullanabilmek için internete bağlı olmanız gerekir. Bir iletişim kutusu, <ulink url="https://store.kde.org">https://store.kde.org</ulink> web sayfasından temaları listeler. Tema ile ilişkilendirilen <guibutton>Kur</guibutton> düğmesine tıklamak, bu temayı yerel olarak kurar.

source: <screeninfo>Installing a new theme</screeninfo>
tr: <screeninfo>Yeni bir tema kurmak</screeninfo>

source: <phrase>Installing a new theme</phrase>
tr: <phrase>Yeni bir tema kurmak</phrase>

source: This new theme is immediately available after you close the &systemsettings; Download New Splash Screens dialog and is highlighted. The preview displays the picture. You need to click the <guibutton>Apply</guibutton> button to make this theme your current splash-screen theme.
tr: Bu yeni tema, &systemsettings; Yeni Açılış Ekranları İndir iletişim kutusunu kapattıktan hemen sonra kullanılabilir. Önizleme, resmi görüntler. Bu temayı geçerli açılış ekranı temanız yapmak için <guibutton>Uygula</guibutton> düğmesine tıklamalısınız.
