Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol6_filetypes.po
Languages: tr

source: Below this is a listbox labeled <guilabel>Services Preference Order</guilabel>.
tr: Bunun altında, <guilabel>Hizmetler Tercih Sırası</guilabel> ile etiketli bir liste kutusu vardır.

source: When you use a filemanager like &dolphin; or &konqueror;, you can <mousebutton>right</mousebutton> mouse click, and a menu will with an entry labeled <guimenuitem>Open with...</guimenuitem> will appear. This box lists the applications that will appear, in the order they will appear, under this menu.
tr: &dolphin; veya &konqueror; gibi bir dosya yöneticisi kullanıyorsanız <mousebutton>sağ</mousebutton> tıklamanızda <guimenuitem>Birlikte Aç…</guimenuitem> menü ögesi bulunur. Bu kutu, görünecek uygulamaları listeler ve görünecekleri sıra bu liste kutusundakiyle aynıdır.

source: You can use the <guibutton>Move Up</guibutton> and <guibutton>Move Down</guibutton> buttons to change the order.
tr: <guibutton>Yukarı Taşı</guibutton> ve <guibutton>Aşağı Taşı</guibutton> düğmelerini kullanarak sıralamayı değiştirebilirsiniz.

source: Making changes permanent
tr: Değişiklikleri kalıcı yapmak

source: When you are done making any changes to &MIME; types, you can click <guibutton>Apply</guibutton> to make your changes permanent, but keep you in this module.
tr: &MIME; türlerinize yaptığınız değişiklikleri bitirdiğinizde <guibutton>Uygula</guibutton> düğmesine tıklayarak değişikliklerinizi kalıcı yapabilir ve hâlâ bu modülde kalabilirsiniz.
