Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_khtml-behavior.po
Languages: tr

source: Web Browsing
tr: Web Tarama

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Applications 19.12
tr: Uygulamalar 19.12

source: Systemsettings
tr: Sistem Ayarları

source: browsing
tr: web tarama

source: The &konqueror; Browser module of &systemsettings; allows you to select various options for the behavior of &konqueror;, the integrated web browser of &kde;.
tr: &systemsettings;’nın &konqueror; tarayıcısı modülü, &kde;’nin tümleşik web tarayıcısı olan &konqueror;’un davranışları için çeşitli seçenekleri yapılandırmanıza olanak tanır.

source: If <guilabel>Ask for name and folder when adding bookmarks</guilabel> is checked, &konqueror; will allow you to change the title of the bookmark and choose a folder in which to store it when you add a new bookmark.
tr: <guilabel>Yer imleri koyarken ad ve klasör seç</guilabel> işaretliyse &konqueror;, yer iminin başlığını değiştirebilmenize ve yeni bir im koyarken hangi klasörde depolamak istediğinize karar verebilmenize olanak tanır.

source: Enable <guilabel>Show only marked bookmarks in bookmark toolbar</guilabel> and &konqueror; will show only those bookmarks in the bookmark toolbar which you have marked to do so in the bookmark editor.
tr: <guilabel>Yer imleri araç çubuğunda yalnızca imli yer imlerini göster</guilabel> seçeneğini etkinleştirdiğinizde &konqueror;, size yalnızca yer imleri düzenleyicisinde bunun için imlediğiniz yer imlerini araç çubuğunda göstermenize olanak tanır.

source: The next option you can enable on this page is <guilabel>Form Completion</guilabel>. If you check this box, &konqueror; will try to remember what you answer to form questions, and will try to fill in forms for you with the answers you previously used.
tr: Bu sayfada etkinleştirebileceğiniz bir sonraki seçenek ise <guilabel>Form Tamamlama</guilabel>’dır. Bu kutuyu işaretlerseniz &konqueror;, form alanlarına hangi yanıtları girdiğinizi anımsamaya çalışır ve bundan sonra bu yanıtlarla kendiliğinden formları doldurur.

source: You can configure the number of form items &konqueror; remembers with the spin box labelled <guilabel>Maximum completions</guilabel>
tr: <guilabel>En çok tamamlamalar</guilabel> şeklinde etiketli döndürme kutusu ile &konqueror;’ın en çok anımsayacağı form ögesi sayısını yapılandırabilirsiniz.

source: Of course, anything &konqueror; fills in a form with, you can still edit before submitting the form!
tr: Bu arada, &konqueror;’un kendiliğinden doldurduğu her şeyi siz daha sonra formu göndermeden önce elle düzenleyebileceksiniz!

source: The next option is <guilabel>Change cursor over links</guilabel>. If this option is selected, the shape of the cursor will change (usually to a hand) whenever it moves over a hyperlink. This makes it easy to identify links, especially when they are in the form of images.
tr: Bir sonraki seçenek ise <guilabel>Bağlantı üzerindeyken imleci değiştir</guilabel> seçeneğidir. Bu seçenek seçiliyse imlecin şekli her ne zaman bir köprünün üzerine gelirse değişir (genellikle bir el imlecine). Bu, bağlantıları ayırt etmeyi kolaylaştırır; özellikle bir görselin içine yerleştirilmişlerse.

source: If <guilabel>Middle click opens URL in selection</guilabel> is checked, you can open the &URL; in the selection by middle clicking on a &konqueror; view.
tr: <guilabel>Orta tık seçili URL’yi açar</guilabel> işaretliyse seçili &URL;’yi bir &konqueror; görünümünde orta tıklayarak açabilirsiniz.

source: As a convenience feature, if you enable <guilabel>Right click goes back in history</guilabel>, then clicking an empty area (&ie; not a link) in the &konqueror; window will act as if you pressed the <guiicon>Back</guiicon> button on the toolbar.
tr: Bir kolaylık olarak <guilabel>Sağ tık geçmişte geri gider</guilabel> özelliğini etkinleştirirseniz &konqueror; penceresinde boş bir alanda sağ tıklamak (&ie; bir bağlantı yokken), sanki araç çubuğundaki <guiicon>Geri</guiicon> düğmesine basmışsınızcasına davranır.

source: Enabling <guilabel>Allow automatic delayed reloading/redirecting</guilabel> allows websites to send you to another page without your interaction. In many cases, this is a convenience. For example, the website has moved to a new &URL;. Many webmasters in this situation will put up a page on the old site, telling you that it has moved and you may like to change your bookmark, and then automatically move you along to the new website. However, such features can be confusing, or annoying, when misused, and so you may wish to disable it.
tr: <guilabel>Kendiliğinden gecikmeli yeniden yüklemeye/yönlendirmeye izin ver</guilabel> seçeneğini etkinleştirmek, web sitelerinin sizin etkileşiminiz olmadan sizi başka bir sayfaya göndermesine olanak tanır. Birçok durumda bu bir kolaylıktır. Örneğin, web sitesi yeni bir &URL; adresine taşınmıştır. Bu durumdaki birçok web yöneticisi, eski siteye bir sayfa koyarak taşındığını ve yer imlerinizi değiştirmek isteyebileceğinizi söyler ve ardından sizi kendiliğinden yeni web sitesine yönlendirir. Ancak, bu tür özellikler kötüye kullanıldığında kafa karıştırıcı veya can sıkıcı olabilir ve bu nedenle devre dışı bırakmak isteyebilirsiniz.

source: <guilabel>Enable Access Key activation with &Ctrl; key</guilabel>: Pressing the &Ctrl; key when viewing web pages activates Access Keys. Unchecking this box will disable this accessibility feature. &konqueror; needs to be restarted for this change to take effect.
tr: <guilabel>&Ctrl; düğmesiyle erişim anahtarı etkinleştirmesine izin ver</guilabel>: Web sayfalarını görüntülerken &Ctrl; düğmesine basmak erişim düğmelerini etkinleştirir. Bu kutunun işaretini kaldırmak bu erişilebilirlik özelliğini devre dışı bırakır. Bu değişikliğin etkili olabilmesi için &konqueror;’ın yeniden başlatılması gerekir.

source: <guilabel>Send the DNT header to tell web sites you do not want to be tracked</guilabel>. Check this box if you want to inform a web site that you do not want to your web browsing habits tracked.
tr: <guilabel>İzlenmek istemediğinizi web sitelerine bildirmek için DNT başlığını gönder</guilabel>. Bir web sitesine web tarama alışkanlıklarınızın izlenmesini istemediğinizi bildirmek istiyorsanız bu kutuyu işaretleyin.

source: <guilabel>Offer to save website passwords</guilabel>. Uncheck this box from being prompted to save website passwords
tr: <guilabel>Web sitesi parolalarını kaydetmeyi teklif et</guilabel>. Web sitesi parolalarını kaydetmeyi sormayı durdurmak için bu kutunun işaretini kaldırın.

source: <guilabel>Display online &PDF; files using WebEngine</guilabel>. Uncheck this box to display online &PDF; files as configured in the <guilabel>File Associations</guilabel> module of &systemsettings;.
tr: <guilabel>Çevrimiçi &PDF; dosyalarını WebEngine kullanarak görüntüle</guilabel>. Çevrimiçi &PDF; dosyalarını &systemsettings;’nın <guilabel>Dosya İlişkilendirmeleri</guilabel> modülünde yapılandırıldığı üzere görüntülemek için bu kutunun işaretini kaldırın.
