Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_bookmarks.po
Languages: tr

source: Bookmarks
tr: Yer İmleri

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit> <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Applications 16.12
tr: Uygulamalar 16.12

source: Systemsettings
tr: sistem ayarları

source: bookmarks
tr: yer imleri

source: Bookmarks home page
tr: Yer imleri ana sayfası

source: This module lets you configure the bookmarks home page.
tr: Bu modül, yer imleri ana sayfasını yapılandırmanıza olanak tanır.

source: To view the bookmarks home page enter <userinput>bookmarks:/</userinput> in the location bar.
tr: Yer imleri ana sayfasını görüntülemek için konum çubuğuna <userinput>bookmarks:/</userinput> yazın.

source: The settings in this module are also accessible by entering <userinput>bookmarks:/config</userinput> in the location bar.
tr: Bu modüldeki ayarlara, konum çubuğuna <userinput>bookmarks:/config</userinput> yazarak da ulaşılabilirsiniz.

source: General settings
tr: Genel ayarlar

source: Number of columns to show
tr: Gösterilecek sütunların sayısı

source: Folders are automatically distributed in several columns. The optimal number of columns depends on the width of the &konqueror; window and the number of bookmarks you have.
tr: Klasörler kendiliğinden birkaç sütuna dağıtılır. Olabilecek en iyi sütun sayısı, &konqueror; penceresinin genişliğine ve sahip olduğunuz yer imlerinin sayısına bağlıdır.

source: Show folder backgrounds
tr: Klasör arka planlarını göster

source: Disable it on slow system to disable background images.
tr: Arka plan görsellerini yavaş sistemlerde devre dışı bırakmak isteyebilirsiniz.

source: Show bookmarks without folder
tr: Yer imlerini klasör olmadan göster

source: If this option is unchecked, bookmarks at the root of the hierarchy (not in a folder) are not displayed. If checked, they are gathered in a “root” folder.
tr: Bu seçenek işaretlenmemişse hiyerarşinin kökündeki yer imleri (klasörde olmayan) görüntülenmez. İşaretlenmişse bir “kök” klasörde toplanırlar.

source: Flatten bookmarks tree
tr: Yer imleri ağacını düzleştir

source: Sub-folders are shown within their parent by default. If you activate this option, sub-folders are displayed on their own. It looks less nice but it may help if you have a very big folder you want to spread in two columns.
tr: Alt klasörler öntanımlı olarak üst ögelerinde gösterilir. Bu seçeneği etkinleştirirseniz alt klasörler kendi başlarına görüntülenir. Daha az güzel görünürler; ancak iki sütuna yayılmak istediğiniz çok büyük bir klasörünüz varsa yardımcı olabilir.

source: Show system places
tr: Sistem konumlarını göster

source: Show a box with common places (Home, Network, …). Useful if you use &konqueror; as a file manager.
tr: Ortak konumları gösteren bir ortak kutu göster (Ana Klasör, Ağ, …). &konqueror;’ı dosya yöneticisi olarak kullanıyorsanız yararlıdır.

source: Pixmap cache
tr: Piksel eşlemi önbelleği

source: Disk cache size
tr: Disk önbelleği boyutu

source: Specify how much disk space is used to cache the pixmaps.
tr: Piksel eşlemlerini önbellemek için ne kadar alan gerekeceğini belirtin.

source: Clear Cache
tr: Önbelleği Temizle

source: Remove all cached images. This may be necessary if some favicons become corrupt and don’t refresh automatically.
tr: Önbelleğe alınan tüm görselleri kaldırın. Bazı site simgeleri çürürse ve kendiliğinden yenilenmezse bu gerekli olabilir.
