Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_kcmcss.po
Languages: tr

source: <title>Appearance</title>
tr: <title>Görünüş</title>

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Applications 16.12
tr: Uygulamalar 16.12

source: <keyword>Appearance</keyword>
tr: <keyword>Görünüş</keyword>

source: Font
tr: Yazıtipi

source: <keyword>Stylesheets</keyword>
tr: <keyword>Biçem Sayfaları</keyword>

source: Accessibility
tr: Erişilebilirlik

source: This module consists of three tabs with configure options how to display web pages.
tr: Bu modül, web sayfalarının nasıl görüntüleneceğini yapılandırma seçeneklerinin bulunduğu üç sekmeden oluşur.

source: General
tr: Genel

source: The check box labeled <guilabel>Automatically load images</guilabel> allows you to control whether images on web pages are loaded by default. Unless you have a very slow connection, you will probably want to leave this option selected, as there are many web pages that are difficult to use without images. If you don’t select the option to automatically load images, you can still view the text on the page, and then load the images if you need them.
tr: <guilabel>Görselleri kendiliğinden yükle</guilabel> etiketli onay kutusu, web sayfalarındaki görsellerin öntanımlı olarak yüklenip yüklenmeyeceğini denetlemenizi sağlar. Çok yavaş bir bağlantınız yoksa görseller olmadan kullanımı zor olan birçok web sayfası olduğu için büyük olasılıkla bu seçeneği işaretli bırakmak isteyeceksiniz. Görselleri kendiliğinden yükleme seçeneğini seçmezseniz sayfadaki metni görüntüleyebilir ve ardından gereksiniminiz varsa görselleri yükleyebilirsiniz.

source: If <guilabel>Draw frame around not completely loaded images</guilabel> is checked, &konqueror; will draw a frame as a placeholder around images embedded in a web page that are not yet fully loaded. You will probably want to check this box to enhance your browsing experience, especially if have a slow network connection.
tr: <guilabel>Tümüyle yüklenmemiş görsellerin etrafına çerçeve çiz</guilabel> işaretliyse &konqueror;, henüz tam olarak yüklenmemiş bir web sayfasına yerleştirilmiş görsellerin etrafına yer tutucu olarak bir çerçeve çizer. Özellikle yavaş bir ağ bağlantınız varsa tarama deneyiminizi geliştirmek için büyük olasılıkla bu kutuyu işaretlemek isteyeceksiniz.

source: Many web pages use animated gif images, and these can be very annoying, and in some cases, quite a drain on your system resources. The <guilabel>Animations</guilabel> option lets you choose when animations are enabled. The default is enabled, but you can set this to disabled, or to run the animation only once, even if the file itself contains instructions that the animation should run more times, or continuously.
tr: Birçok web sayfası hareketli GIF görselleri kullanır ve bunlar çok can sıkıcı olabilir ve bazı durumlarda sistem özkaynaklarınızı büyük oranda tüketebilir. <guilabel>Canlandırmalar</guilabel> seçeneği, canlandırmaların ne zaman etkinleştirileceğini seçmenize olanak tanır. Öntanımlı olarak etkindir; ancak bunu devre dışı olarak ayarlayabilir veya dosyanın kendisi canlandırmanın daha fazla kez veya sürekli olarak çalışması gerektiğine dair yönergeler içerse bile canlandırmayı yalnızca bir kez çalıştırabilirsiniz.

source: The next setting is <guilabel>Underline links:</guilabel>. You can choose to underline links <guilabel>Enabled</guilabel>. If this option is selected, any text on web pages that acts as a link will be shown in an underlined font. While many web pages do use color to distinguish text that acts as a link, underlining makes it very easy to spot links.
tr: Sonraki ayar <guilabel>Bağlantıların altını çiz:</guilabel> ayarıdır. Bağlantıların altını çizmeyi <guilabel>Etkin</guilabel> yapabilirsiniz . Bu seçenek seçilirse web sayfalarında bağlantı işlevi gören tüm metinler altı çizili bir yazıtipinde gösterilir. Birçok web sayfası bağlantı işlevi gören metni ayırt etmek için renk kullanırken, altını çizmek bağlantıları fark etmeyi çok daha kolaylaştırır.

source: If you don’t like underlined links, you can choose <guilabel>Disabled</guilabel>, so that no links are underlined. Or you can choose a middle ground, <guilabel>Only on Hover</guilabel>, so that links are underlined when the mouse cursor is resting over them, and not underlined the rest of the time.
tr: Altı çizili bağlantıları sevmiyorsanız <guilabel>Devre dışı</guilabel> olarak seçebilirsiniz, böylece hiçbir bağlantının altı çizili olmaz. Alternatif olarak <guilabel>Yalnızca fare ile üzerine gelindiğinde</guilabel> seçeneğini orta yol olarak seçebilirsiniz, böylece bağlantılar fare imleci üzerilerindeyken altı çizili olur ve geri kalan zamanlarda altı çizili olmaz.

source: The site’s CSS definitions can override this value.
tr: Sitenin CSS tanımlamaları bu değerin üzerine yazabilir.

source: <guilabel>Smooth scrolling</guilabel> determines whether &konqueror; should use smooth steps to scroll &HTML; pages, or whole steps:
tr: <guilabel>Pürüzsüz sarma</guilabel>, &konqueror;’ın &HTML; sayfalarını sarmak için pürüzsüz adımlar mı yoksa tam adımlar mı kullanacağını belirler.

source: <guilabel>Always</guilabel>: Always use smooth steps when scrolling.
tr: <guilabel>Her zaman</guilabel>: Sararken her zaman pürüzsüz adımlar kullanın.

source: <guilabel>Never</guilabel>: Never use smooth scrolling, scroll with whole steps instead.
tr: <guilabel>Asla</guilabel>: Pürüzsüz sarmayı hiçbir zaman kullanmayın, bunun yerine tam adımlarla sarın.

source: <guilabel>When Efficient</guilabel>: Only use smooth scrolling on pages where it can be achieved with moderate usage of system resources.
tr: <guilabel>Verimli olduğunda</guilabel>: Pürüzsüz sarmayı yalnızca sistem özkaynaklarının orta düzeyde kullanılmasıyla elde edilebilen sayfalarda kullanın.

source: Fonts
tr: Yazıtipleri

source: Under this tab, you can select various options related to the use of fonts. Although the shapes and sizes of fonts are often part of the design of a web page, you can select some default settings for &konqueror; to use.
tr: Bu sekme altında, yazıtiplerinin kullanımıyla ilgili çeşitli seçenekleri seçebilirsiniz. Yazıtiplerinin şekilleri ve boyutları genellikle bir web sayfasının tasarımının bir parçası olsa da, &konqueror; için kullanılacak bazı öntanımlı ayarlar seçilebilir.

source: The first thing you can set here is the font size. There are two settings which work together to allow you a comfortable browsing experience.
tr: Burada ayarlayabileceğiniz ilk şey yazıtipi puntosudur. Rahat bir tarama deneyimi yaşamanızı sağlamak için birlikte çalışan iki ayar vardır.

source: Firstly, you can set a <guilabel>Minimum font size</guilabel>. This means, even if the font size is set specifically in the page you are viewing, &konqueror; will ignore that instruction and never show smaller fonts than you set here.
tr: Öncelikle, <guilabel>En küçük yazıtipi puntosu</guilabel> seçeneğini ayarlayabilirsiniz. Bu, yazıtipi puntosu görüntülediğiniz sayfada özel olarak ayarlanmış olsa bile, &konqueror; bu yönergeleri görmezden gelecek ve burada ayarladığınızdan daha küçük yazıtiplerini asla göstermeyecektir.

source: Next you can set a <guilabel>Medium font size</guilabel>. This is not only the default size of text, used when the page does not specify sizes, but it is also used as the base size that relative font sizes are calculated against. That is, the &HTML; instruction <quote>smaller</quote>, it means smaller than the size you set for this option.
tr: Sonra <guilabel>Orta yazıtipi puntosu</guilabel> seçeneğini ayarlayabilirsiniz. Bu yalnızca sayfanın ölçüleri belirtmediğinde kullanılan öntanımlı metin büyüklüğü değil, aynı zamanda göreceli yazıtipi puntosunun hesaplandığı temel ölçü olarak da kullanılır. Yani, &HTML; yönergesi <quote>daha küçük</quote>, bu seçenek için ayarladığınız boyuttan daha küçük anlamına gelir.

source: For either option, you can select the exact font size in points by using the up/down spin control (or just typing) next to the option label.
tr: Her iki seçenek için de, seçenek etiketinin yanındaki yukarı/aşağı döndürme denetimini kullanarak (veya yazarak) tam yazıtipi boyutunu punto olarak seçebilirsiniz.

source: These options are independent of each other. Pages that do not set a font size, or ask for the default, will display with the size you set from <guilabel>Medium font size</guilabel>, while any pages that ask for a size smaller than your <guilabel>Minimum font size</guilabel> setting will instead show that size. The one does not affect the other.
tr: Bu seçenekler birbirinden bağımsızdır. Yazıtipi puntosu ayarlamayan veya öntanımlıyı isteyen sayfalar, <guilabel>Orta yazıtipi puntosu</guilabel> ayarınızdan ayarladığınız büyüklükte görüntülenirken, <guilabel>En küçük yazıtipi puntosu</guilabel> ayarınızdan daha küçük bir ölçü isteyen sayfalar bunun yerine o büyüklüğü gösterecektir. Biri diğerini etkilemez.

source: The remaining options are for the fonts to be associated with different types of markup used in &HTML; pages. Note that many web pages may override these settings. For any type of font (Standard, Fixed, Serif, &etc;) you can select a different font if you like.
tr: Geriye kalan seçenekler, yazıtiplerinin &HTML; sayfalarında kullanılan farklı işaretleme türleriyle ilişkilendirilmesine yöneliktir. Birçok web sayfasının bu ayarları geçersiz kılabileceğini unutmayın. Herhangi bir yazıtipi türü için (Standart, Sabit, Serif, &etc;) isterseniz farklı bir yazıtipi seçebilirsiniz.

source: Below this, you can set a <guilabel>Font size adjustment for this encoding</guilabel>. Sometimes the fonts you want to use for a particular encoding or language are much larger or smaller than average, so you can use this setting to bring them into line.
tr: Bunun altında, <guilabel>Bu kodlama için yazıtipi puntosu ayarlaması</guilabel> seçeneğini kullanabilirsiniz. Bazen belirli bir kodlama veya dil için kullanmak istediğiniz yazıtipleri ortalamadan çok daha büyük veya küçüktür, bu yüzden onları hizaya getirmek için bu ayar kullanılabilir.

source: You can set a default encoding that &konqueror; should assume pages are when rendering them. The default setting is <guilabel>Use Language Encoding</guilabel>, but you can change it to any encoding available in the list.
tr: Sayfalar sunulurken &konqueror; tarafından varsayılması gereken öntanımlı bir kodlama ayarlayabilirsiniz. Öntanımlı ayar, <guilabel>Dil Kodlamasını Kullan</guilabel>’dır; ancak bunu listede bulunan herhangi bir kodlamayla değiştirebilirsiniz.

source: <title>Stylesheets</title>
tr: <title>Biçem Sayfaları</title>

source: Introduction
tr: Giriş

source: <acronym>CSS</acronym> style sheets affect the way web pages appear. <acronym>CSS</acronym> stands for <emphasis>C</emphasis>ascading <emphasis>S</emphasis>tyle <emphasis>S</emphasis>heets.
tr: <acronym>CSS</acronym> biçem sayfaları, web sayfalarının nasıl görüntüleneceğini belirler. <acronym>CSS</acronym>, İngilizce <emphasis>C</emphasis>ascading <emphasis>S</emphasis>tyle <emphasis>S</emphasis>heets kalıbının kısaltılmış halidir.

source: &konqueror; can use its own stylesheet, based on simple defaults and the color scheme you are using for your desktop. &konqueror; can also use a stylesheet that you have written yourself. Finally, you can specify a stylesheet in this module. The options presented in this module are tuned for accessibility purposes, especially for people with reduced vision.
tr: &konqueror; masaüstünüz için kullandığınız basit öntanımlılara ve renk şemasına dayalı kendi biçem sayfasını kullanabilir. &konqueror; ayrıca kendiniz yazdığınız bir biçem sayfasını da kullanabilir. Son olarak, bu modülde bir biçem sayfası belirtebilirsiniz. Bu modülde sunulan seçenekler, özellikle görme engelli kişiler için erişilebilirlik amaçlarına göre ayarlanmıştır.

source: Your choices here affect every &kde; application that renders HTML with &kde;’s own renderer, which is called khtml. These include &kmail;, &khelpcenter; and of course &konqueror;. Choices here do not affect other browsers such as &firefox;.
tr: Burada yaptığınız tüm seçimler, HTML sayfalarını &kde;’nin kendi sunucusuyla sunan her bir &kde; uygulamasını etkiler. Bunlar arasında &kmail;, &khelpcenter; ve elbette &konqueror; vardır. Buradaki seçimler; örneğin, &firefox; gibi başka tarayıcıları etkilemez.

source: This section contains the following options:
tr: Bu bölüm aşağıdaki seçenekleri içerir:

source: Use default stylesheet
tr: Öntanımlı biçem sayfasını kullan

source: &kde; will use the default stylesheet. Some of the colors will default to those defined in your chosen color scheme. Most settings are easily overridden by the page you are viewing.
tr: &kde;, öntanımlı biçem sayfasını kullanacaktır. Bazı renkler seçtiğiniz renk şemasında tanımlananlara öntanımlı olarak ayarlanır. Çoğu ayar, görüntülediğiniz sayfa tarafından kolayca geçersiz kılınabilir.

source: Use user-defined stylesheet
tr: Kullanıcı tanımlı biçem sayfası kullan

source: &kde; will use a stylesheet that you have written yourself. You can use the browse button to locate the stylesheet on your system. <acronym>CSS</acronym> files traditionally have a <literal role="extension">.css</literal> extension, but this is not required.
tr: &kde; kendinizin yazdığı bir biçem sayfasını kullanacaktır. Biçem sayfasını sisteminizde bulmak için Göz At düğmesini kullanabilirsiniz. <acronym>CSS</acronym> dosyaları geleneksel olarak <literal role="extension">.css</literal> uzantısına sahiptir; ancak bu gerekli değildir.

source: Use accessibility stylesheet
tr: Erişilebilirlik biçem sayfasını kullan

source: Use the settings defined in the <guilabel>Customize</guilabel> dialog. Enabling this option will enable the <guibutton>Customize</guibutton> button lo launch a dialog to define stylesheet settings.
tr: <guilabel>Özelleştir</guilabel> iletişim kutusunda tanımlanan ayarları kullanın. Bu seçeneği etkinleştirmek, biçem sayfası ayarlarını tanımlamak için bir iletişim kutusu başlatmak üzere <guibutton>Özelleştir</guibutton> düğmesini etkinleştirecektir.

source: Customize
tr: Özelleştir

source: In this dialog you can set up a user stylesheet. The options available are only a subset of the instructions you can add in a stylesheet, and they are geared towards people with reduced vision, to allow users to create a stylesheet that makes web pages and the &kde; help files more readable.
tr: Bu iletişim kutusunda bir kullanıcı biçem sayfası ayarlayabilirsiniz. Kullanılabilir seçenekler, bir biçem sayfasına ekleyebileceğiniz yönergelerin yalnızca bir alt kümesidir ve görme engelli kişilere yöneliktir, kullanıcıların web sayfalarını ve &kde; yardım dosyalarını daha okunabilir hale getiren bir biçem sayfası oluşturmasına olanak tanır.

source: The options in this dialog are disabled unless you chose <guilabel>Use accessibility stylesheet</guilabel>.
tr: <guilabel>Erişilebilirlik biçem sayfasını kullan</guilabel>’ı seçmediğiniz sürece bu iletişim kutusundaki seçenekler devre dışıdır.

source: Font Family
tr: Yazıtipi Ailesi

source: Base family
tr: Temel aile

source: Choose a font family to use for body text.
tr: Gövde metni için kullanılacak olan yazıtipi ailesini seçin.

source: Use same family for all text
tr: Tüm metinler için aynı aileyi kullan

source: If you enable this, then the same font family will be used for all text, regardless of the settings on the page you are viewing. This is useful for pages which have used a decorative or hard to read font for headlines.
tr: Bunu etkinleştirirseniz görüntülediğiniz sayfadaki ayarlardan bağımsız olarak tüm metinler için aynı yazıtipi ailesi kullanılacaktır. Bu, başlıklar için dekoratif veya okunması zor bir yazıtipi kullanan sayfalar için yararlıdır.

source: Font Size
tr: Yazıtipi Puntosu

source: Base font size
tr: Taban yazıtipi puntosu

source: This is the default size for text on the page. Many web sites set their font sizes relative to this default, using <quote>larger</quote> or <quote>+1</quote> to make the text bigger, and <quote>smaller</quote> or <quote>-1</quote> to make the text smaller.
tr: Bu, sayfadaki metin için öntanımlı boyuttur. Birçok web sitesi, yazıtipi boyutlarını bu öntanımlıya göre ayarlar ve metni büyütmek için <quote>daha büyük</quote> veya <quote>+1</quote> ve metni küçültmek için <quote>daha küçük</quote> veya <quote>−1</quote> kullanır.

source: Many people design their web pages on platforms where the ordinary default text size is too large for the average user to read, so it is very common to come across web pages that have forced the font smaller in this way.
tr: Pek çok kişi web sayfalarını, ortalama bir kullanıcının okuyabileceği boyuttan çok daha büyük olan platformlarda tasarlıyor; dolayısıyla, yazıtipinin bu şekilde küçültüldüğü web sayfalarıyla karşılaşmak çok yaygındır.

source: This setting will allow you to set the default font to a comfortable size, so that the relative sizes are also enlarged enough to be comfortable.
tr: Bu ayar, öntanımlı yazıtipini rahat bir boyuta ayarlamanıza olanak tanır; böylece, göreceli boyutlar da rahat olacak şekilde büyütülür.

source: Do not forget you can also have &konqueror; enforce a minimum size, so that text is <emphasis>never</emphasis> too small to read.
tr: Ayrıca, metnin okunamayacak kadar küçük olmaması için &konqueror;’da en küçük bir boyut belirleyebileceğinizi de unutmayın.

source: Use same size for all elements
tr: Tüm ögeler için aynı boyutu kullan

source: If you enable this option, then all text will be rendered at your specified font size, regardless of the instructions the page contains. Relative font sizes as discussed earlier, and even specific instructions that text should be rendered at a certain size will be overridden here.
tr: Bu seçeneği etkinleştirirseniz sayfanın içerdiği yönergelerden bağımsız olarak tüm metinler belirttiğiniz yazıtipi puntosunda işlenir. Daha önce tartışılan göreceli yazıtipi puntoları ve hatta metnin belirli bir büyüklükte işlenmesi gerektiğine dair belirli yönergeler burada geçersiz kılınır.

source: Images
tr: Görseller

source: Suppress images
tr: Görselleri sustur

source: If you do not want to view images, you can turn this off here.
tr: Eğer görselleri görüntülemek istemiyorsanız buradan kapatabilirsiniz.

source: Suppress background images
tr: Arka plan görsellerini sustur

source: One major problem for reduced vision users is that background images do not give sufficient contrast to allow them to read the text. You can disable background images here, independently of your choice above to view all images.
tr: Görme engelli kullanıcılar için büyük bir sorun, arka plan görsellerinin metni okumalarına yetecek kadar karşıtlık sağlamamasıdır. Yukarıdaki seçiminize bağlı olmaksızın, tüm görselleri görüntülemek için arka plan görsellerini burada devre dışı bırakabilirsiniz.

source: Colors
tr: Renkler

source: Black on white
tr: Beyaz üzerine siyah

source: Many people with reduced vision find black text on a white screen gives the most contrast, and is easiest to read. If this applies to you, you can set this here.
tr: Görme engelli birçok kişi, beyaz ekranda siyah metnin en fazla karşıtlığı verdiğini ve okunmasının en kolay olduğunu düşünür. Bu sizin için geçerliyse bunu burada ayarlayabilirsiniz.

source: White on black
tr: Siyah üzerine beyaz

source: Many other people with reduced vision find the opposite to be true, that white text on a black screen is easier to read.
tr: Görme engelli birçok kişi ise bunun tam tersini, yani siyah ekrandaki beyaz yazıların daha kolay okunduğunu düşünüyor.

source: Custom
tr: Özel

source: Still other people find that pure black and white, in either order, is difficult to read. You can set custom colors here for both the <guilabel>Background</guilabel> and the <guilabel>Foreground</guilabel>.
tr: Diğer insanlar ise saf siyah ve beyazın, her iki sırada da okunmasının zor olduğunu düşünüyor. Burada hem <guilabel>Arka Plan</guilabel> hem de <guilabel>Ön Plan</guilabel> için özel renkler ayarlayabilirsiniz.

source: Use same color for all text
tr: Tüm metin için aynı rengi kullan

source: Many web sites use a different, often contrasting color for headings or other flourishes. If this interferes with your ability to read the content, you can enable this check box to have &kde; use the colors you have set above for all text.
tr: Birçok web sitesi başlıklar veya diğer süslemeler için farklı, genellikle karşıt bir renk kullanır. Bu, içeriği okuma yeteneğinizi engelliyorsa &kde;’nin tüm metin için yukarıda ayarladığınız renkleri kullanmasını sağlamak üzere bu onay kutusunu etkinleştirebilirsiniz.

source: Preview
tr: Önizleme

source: The <guilabel>Preview</guilabel> section allows you to see the effect of your changes. Several types of headings are displayed with your stylesheet, and a sentence in the default body text.
tr: <guilabel>Önizleme</guilabel> bölümü, değişikliklerinizin etkisini görmenizi sağlar. Biçem sayfanızla birlikte çeşitli başlık türleri ve öntanımlı gövde metninde bir tümce görüntülenir.

source: This should allow you to fine-tune your stylesheet until you have something that you can comfortably read.
tr: Bu, rahatça okuyabileceğiniz duruma gelinceye kadar biçim dosyasınıza ince ayar yapmanıza izin vermelidir.

source: Happy surfing!
tr: İyi gezinmeler!
