Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_mouse.po
Languages: tr

source: Mouse
tr: Fare

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: This is the documentation for the &systemsettings; module that configures mice and other pointing devices.
tr: Bu, fareyi ve diğer işaretleme aygıtlarını yapılandıran &systemsettings; modülünün belgelendirmesidir.

source: Systemsettings
tr: sistem ayarları

source: mouse
tr: fare

source: This module allows you to configure your pointing device. Your pointing device may be a mouse, a trackball, a touchpad, or another piece of hardware that performs a similar function.
tr: Bu modül, işaretleme aygıtınızı yapılandırmanıza izin verir. İşaretleme aygıtınız bir fare, hareket topu, dokunmatik yüzey veya benzer işlevi gerçekleştiren başka bir donanım parçası olabilir.

source: General
tr: Genel

source: Left handed mouse
tr: Sol el kipi

source: If you are left-handed, you may prefer to swap the functions of the <mousebutton>left</mousebutton> and <mousebutton>right</mousebutton> buttons on your pointing device by checking this option. If your pointing device has more than two buttons, only those that function as the <mousebutton>left</mousebutton> and <mousebutton>right</mousebutton> buttons are affected. For example, if you have a three-button mouse, the <mousebutton>middle</mousebutton> button is unaffected.
tr: Sol elinizi kullanıyorsanız bu seçeneği işaretleyerek işaretleme aygıtınızın <mousebutton>sol</mousebutton> ve <mousebutton>sağ</mousebutton> düğmelerinin işlevlerini birbirleriyle değiştirmek isteyebilirsiniz. İşaretleme aygıtınızın ikiden çok düğmesi varsa yalnızca <mousebutton>sol</mousebutton> ve <mousebutton>sağ</mousebutton> işlevlerini yerine getiren düğmeler etkilenir. Örneğin, üç düğmeli bir fareniz varsa <mousebutton>orta</mousebutton> düğme etkilenmez.

source: Press left and right buttons for middle-click
tr: Orta tık için sağ ve sol düğmelere bas

source: Check this item if you don't have a &MMB;. You can press the left and right mouse buttons at the same time to emulate middle-click.
tr: Farenizde bir &MMB; yoksa bu ögeyi işaretleyin. Orta tıklamaya öykünmek için sağ ve sol düğmelere birlikte aynı anda basabilirsiniz.

source: Pointer speed
tr: İşaretçi hızı

source: This option allows you to change the relationship between the distance that the mouse pointer moves on the screen and the relative movement of the physical device itself (which may be a mouse, trackball, or some other pointing device.)
tr: Bu seçenek, fare işaretçisinin ekranda hareket ettiği uzaklık ile fiziksel aygıtın (fare, iztopu veya başka bir işaretleme aygıtı olabilir) göreli hareketi arasındaki ilişkiyi değiştirmenize olanak tanır.

source: Pointer acceleration
tr: İşaretçi ivmelendirmesi

source: The <guilabel>Standard</guilabel> mode adjusts the amount of pointer acceleration according to how fast you move the mouse. If you set it to <guilabel>None</guilabel>, the acceleration remains constant regardless of speed.
tr: <guilabel>Standart</guilabel> kip, fareyi ne kadar hızlı hareket ettirdiğinize göre işaretçi ivmelendirmesinin miktarını ayarlar. <guilabel>Yok</guilabel> olarak ayarlarsanız ivmelendirme, hızdan bağımsız olarak sabit kalır.

source: Scrolling: Invert scroll direction
tr: Sarma: Sarma yönünü tersine çevir

source: With this check box selected, the scroll wheel (if any) will work in the opposite direction (so that if rolling the top of the scroll wheel towards you previously causes a scroll down, then it will now cause a scroll up).
tr: Bu onay kutusu seçildiğinde, sarma tekerleği (varsa) ters yönde çalışır (böylece, sarma tekerleğinin üst tarafını kendinize doğru döndürmek önceden aşağı sarmaya neden oluyorsa şimdi yukarı sarmaya neden olacaktır).

source: In &plasma; 5.13 you find the setting to use single or double mouse clicks to open files and folders in the module <ulink url="help:/kcontrol/workspaceoptions/index.html">Workspace</ulink>.
tr: &plasma; 5.13 sürümünde, dosya ve klasörleri açmak için tek veya çift tık kullanma ayarını <ulink url="help:/kcontrol/workspaceoptions/index.html">Çalışma Alanı</ulink> modülünde bulacaksınız.
