Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_kcmsmserver.po
Languages: tr

source: Session Management
tr: Oturum Yönetimi

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: session
tr: oturum

source: System Settings
tr: sistem ayarları

source: logout
tr: oturumu kapat

source: Desktop Session
tr: Masaüstü Oturumu

source: In this &systemsettings; module you can configure &plasma;'s session manager and logout settings.
tr: Bu &systemsettings; modülünde, &plasma;’nın oturum yöneticisini ve oturumu kapatma ayarlarını yapılandırabilirsiniz.

source: Session management refers to &plasma;'s ability to save the state of applications and windows when you log out of &plasma; and restore them when you log back in.
tr: Oturum yönetimi, &plasma;’nın uygulamaların ve pencerelerin durumunu &plasma; oturumunu kapattığınızda kaydetme ve yeniden oturum açtığınızda geri yükleme yeteneği ile ilgilidir.

source: General
tr: Genel

source: Ask for confirmation: on shutdown, restart, and logout
tr: Onay iste: Kapanışta, yeniden başlatmada ve oturumu kapatırken

source: If this setting is turned on, the logout confirmation screen will be shown when you log out, shut down, or restart. When the setting is turned off, your computer will log out, shut down, etc. immediately after clicking the respective button.
tr: Bu ayar açıksa oturumu ve bilgisayarı kapattığınızda veya yeniden başlattığınızda oturum kapatma onay ekranı gösterilir. Ayar kapatıldığında, ilgili düğmeyi tıkladıktan hemen sonra bilgisayarınız oturumu kapatır, gücü kapanır vb.

source: On login, launch apps that were open
tr: Oturum açılışında, açık olan uygulamaları başiat

source: You may choose one of three options on what should happen when you log into &plasma;:
tr: &plasma; oturumunu açtığınızda olmasını istediğiniz üç seçenekten birini seçebilirsiniz:

source: On last logout
tr: Son oturum kapanışında

source: If this option is checked, &plasma; will save your current session's state when you logout. &plasma; will restore your session on the next login, so you can continue to work with a desktop just like you left it.
tr: Bu seçenek işaretliyse &plasma; oturumunuzu kapatırken geçerli oturumunuzun durumunu kaydeder ve sonraki oturum açışınızda geri yükler; böylelikle masaüstünüzü nasıl bıraktıysanız öylece çalışmayı sürdürebilirsiniz.

source: When session was manually saved
tr: Oturum elle kaydedildiğinde

source: Instead of restoring &plasma; to the state it was when you logged out last, it will be restored to a specific state that you have saved manually.
tr: &plasma;’yı oturum kapatılırken olan durum yerine elle kaydettiğiniz belirli bir duruma geri yükler.

source: A <guilabel>Save Session</guilabel> button will appear in the <guilabel>Application Launcher</guilabel> menu and &plasma; search. When you click it, &plasma; will remember the apps that are open and restore them on the next login. Click it again to replace the set of remembered apps.
tr: <guilabel>Application Launcher</guilabel> menüsünde ve &plasma; aramada bir <guilabel>Oturumu Kaydet</guilabel> düğmesi ortaya çıkar. Tıkladığınızda, &plasma; açık olan uygulamaları anımsar ve onları bir sonraki oturum açışınızda geri yükler. Anımsanan uygulamalar kümesini değiştirmek için bir kez daha tıklayın.

source: Start with an empty session
tr: Boş bir oturum ile başlat

source: If you choose this option, &plasma; will never restore sessions that it has saved.
tr: Bu seçeneği seçerseniz &plasma; kaydettiği hiçbir oturumu geri yüklemez.

source: Finally, you can enter a colon (<literal>:</literal>) or comma (<literal>,</literal>) separated list of applications that should be excluded from sessions, and therefore will not be started when restoring a session. For example <userinput>xterm:konsole</userinput> or <userinput>xterm,konsole</userinput>.
tr: Son olarak, bir iki nokta (<literal>:</literal>) veya virgül (<literal>,</literal>) ile ayrılmış uygulamalar listesi ile bu uygulamaların yok sayılmasını ve bir oturum geri yüklenirken geri yüklenmemesini sağlayabilirsiniz. Örneğin, <userinput>xterm:konsole</userinput> veya <userinput>xterm,konsole</userinput>.

source: Firmware
tr: Donanım Yazılımı

source: After next restart: Enter UEFI setup screen
tr: Bir sonraki yeniden başlatma sonrası: UEFI ayar ekranına gir

source: If this option is enabled, the next time you restart your computer, it will enter the firmware setup mode (BIOS/UEFI). This may be easier than trying to enter the firmware setup by quickly pressing special keys during boot.
tr: Bu seçenek etkinleştirilirse bilgisayarınızı bir sonraki yeniden başlatışınızda donanım yazılımı ayar kipine (BIOS/UEFI) girecektir. Bu, önyükleme sırasında özel düğmelere tez basarak donanım yazılım ayarlarına girmeye çalışmaktan daha kolay olabilir.
