Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_kwineffects-x11.po
Languages: tr

source: Desktop Effects
tr: Masaüstü Efektleri

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: desktop
tr: masaüstü

source: effects
tr: efektler

source: This module is used to enable and configure desktop effects for Plasma.
tr: Bu modül, Plasma için masaüstü efektlerini etkinleştirmek ve yapılandırmak için kullanılır.

source: The main part of this page is a list of all available effects grouped by <guilabel>Accessibility</guilabel>, <guilabel>Appearance</guilabel>, <guilabel>Focus</guilabel>, <guilabel>Peek at Desktop Animation</guilabel>, <guilabel>Tools</guilabel>, <guilabel>Virtual Desktop Switching Animation</guilabel>, <guilabel>Window Management</guilabel>, and <guilabel>Window Open/Close Animation</guilabel>.
tr: Bu sayfanın ana kısmı, <guilabel>Erişilebilirlik</guilabel>, <guilabel>Görünüş</guilabel>, <guilabel>Odak</guilabel>, <guilabel>Masaüstüne Bak Canlandırması</guilabel>, <guilabel>Araçlar</guilabel>, <guilabel>Sanal Masaüstü Geçişi Canlandırması</guilabel>, <guilabel>Pencere Yönetimi</guilabel> ve <guilabel>Pencere Aç/Kapat Canlandırması</guilabel> olarak gruplanan kullanılabilir efektlerin bir listesidir.

source: Use the incremental search bar above the list window to find items in the list.
tr: Listedeki ögeleri bulmak için liste penceresinin üzerindeki artımlı arama çubuğunu kullanın.

source: Normally there is no reason for users to change that, but there is a <inlinemediaobject><imageobject><imagedata fileref="configure-effects.png" format="PNG"/> </imageobject></inlinemediaobject> configuration button to modify the filtering of the list to show also those effects.
tr: Kullanıcıların onu değiştirmesi için pek bir neden yoktur; ancak <inlinemediaobject><imageobject><imagedata fileref="configure-effects.png" format="PNG"/> </imageobject></inlinemediaobject> yapılandırma düğmesiyle o efektlerin gösterimi için listeyi süzebilirsiniz.

source: The easiest way of installing new effects is by using the built-in KNewStuff support in &kwin;. Press the <guibutton>Get New Desktop Effects</guibutton> button to open a dialog with a list of available effects from the Internet and to install and uninstall effects.
tr: Yeni efektler kurmanın en kolay yolu, &kwin; içindeki yerleşik KNewStuff desteğini kullanmaktır. İnternetten kullanılabilir efektlerin bir listesini almak ve efektleri kurmak/kaldırmak için <guibutton>Yeni Masaüstü Efektleri Al</guibutton> düğmesine tıklayın.

source: Please keep in mind that changing these sensible defaults can break your system.
tr: Lütfen bu makul öntanımlıları değiştirmenin sisteminizi bozabileceğini unutmayın.

source: Check an effect in the list to enable it. Display information about Author and License by clicking the <inlinemediaobject><imageobject><imagedata fileref="dialog-information.png" format="PNG"/> </imageobject> </inlinemediaobject> info button at the right side of the list item.
tr: Listedeki bir efekti etkinleştirmek için onu işaretleyin. Liste ögesinin sağ tarafındaki <inlinemediaobject><imageobject><imagedata fileref="dialog-information.png" format="PNG"/> </imageobject> </inlinemediaobject> bilgi düğmesini tıklayarak Yazar ve Lisans bilgisini görüntüleyebilirsiniz.

source: Some effects have settings options, in this case there is a <inlinemediaobject><imageobject> <imagedata fileref="configure-effects.png" format="PNG"/></imageobject></inlinemediaobject> configure button at the left of the info button. Click it to open a configuration dialog.
tr: Bazı efektlerin ayar seçenekleri olabilir; böyle bir durumda bilgi düğmesinin sol tarafında bir <inlinemediaobject><imageobject> <imagedata fileref="configure-effects.png" format="PNG"/></imageobject></inlinemediaobject> yapılandırma düğmesi bulunur. Bir yapılandırma iletişim kutusu açmak için ona tıklayın.

source: To see a video preview of an effect click on the <inlinemediaobject><imageobject><imagedata fileref="video.png" format="PNG"/> </imageobject></inlinemediaobject> button.
tr: Efektin bir video önizlemesini görmek için <inlinemediaobject><imageobject><imagedata fileref="video.png" format="PNG"/> </imageobject></inlinemediaobject> düğmesine tıklayın.

source: Some effects are mutual exclusive to other effects. For example one would only want to activate the <guilabel>Maximize</guilabel> or the <guilabel>Magic Lamp</guilabel> effect. Both activated at the same time result in broken animations.
tr: Bazı efektler birlikte kullanılamaz. Örneğin <guilabel>Ekranı Kapla</guilabel> veya <guilabel>Sihirli Lamba</guilabel> efektlerinden yalnızca biri aynı anda kullanılabilir. İkisini de aynı anda etkinleştirmek efektleri bozar.

source: For effects in a mutual exclusive group the &GUI; uses radio buttons and manages that only one of these effects can be activated.
tr: Bu tür efektler olduğunda, grafik arayüz radyo düğmeleri kullanır ve yalnızca bir tanesinin etkin olduğundan emin olur.

source: All effects which are not supported by the currently used compositing backend are hidden by default (&eg; OpenGL effects when using software renderer).
tr: Halihazırda kullanılan bileşikleştirme arka ucu tarafından desteklenmeyen tüm efektler öntanımlı olarak gizlenir (&eg;, yazılım sunucusu kullanılırken OpenGL efektleri).

source: Also all internal or helper effects are hidden by default. These are effects which replace functionality from KWin Core or provide interaction with other elements of the desktop shell.
tr: Ayrıca tüm iç veya yardımcı efektler öntanımlı olarak gizlidir. Bunlar, KWin çekirdeğinin işlevselliğini değiştiren veya masaüstü kabuğunun diğer ögeleriyle etkileşim sağlayan efektlerdir.
