Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_performance.po
Languages: tr

source: Performance
tr: Başarım

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Applications 16.12
tr: Uygulamalar 16.12

source: Systemsettings
tr: Sistem Ayarları

source: performance
tr: başarım

source: preload
tr: önden yükle

source: Performance Settings
tr: Başarım Ayarları

source: &konqueror; is used on a wide variety of computers by a wide variety of users. Under the category of performance, this dialog allows each user to adjust options which may make the computer that &konqueror; is installed on feel more responsive.
tr: &konqueror;, çok çeşitli kullanıcılar tarafından çok çeşitli bilgisayarlarda kullanılır. Başarım kategorisi altında, bu iletişim kutusu her kullanıcının &konqueror;’un kurulu olduğu bilgisayarı daha duyarlı hale getirebilecek seçenekleri ayarlamasına olanak tanır.

source: Preloading
tr: Önden Yükleme

source: The subsection labeled <guilabel>Preloading</guilabel> makes a tradeoff between memory and performance.
tr: <guilabel>Önden Yükleme</guilabel> başlıklı alt bölüm, bellek ve başarım arasında bir takas yapar.

source: <emphasis>Preloading</emphasis> refers to loading an instance of &konqueror; into memory before a user asks to start &konqueror;. The positive effect of this is that when a user asks to load &konqueror; the window appears instantly because most of the application has been preloaded. The negative effect is that this instance of &konqueror; uses memory that could be used by other programs. By default, when a user closes &konqueror;, the instance is not closed. This means that the next time a user wants &konqueror; loaded, it is nearly instantaneous again.
tr: <emphasis>Önden Yükleme</emphasis>, bir kullanıcı &konqueror;’ı başlatmayı istemeden önce &konqueror; örneğinin belleğe yüklenmesi anlamına gelir. Bunun olumlu etkisi, bir kullanıcı &konqueror; yüklemeyi istediğinde uygulamanın çoğu önceden yüklenmiş olduğundan pencerenin anında görünmesidir. Olumsuz etkisi ise bu &konqueror; örneğinin diğer programlar tarafından kullanılabilecek belleği kullanmasıdır. Öntanımlı olarak, bir kullanıcı &konqueror; kapattığında, örnek kapatılmaz. Bu, bir kullanıcı bir sonraki sefer &konqueror; yüklenmesini istediğinde, bunun yine neredeyse anında gerçekleşeceği anlamına gelir.

source: The final check box labeled <guilabel>Always try to have at least one preloaded instance</guilabel> signals that you always want to have one preloaded, but not used, instance of &konqueror; available. This option will actually decrease performance on some machines (especially those with limited physical memory).
tr: <guilabel>Her zaman en az bir önceden yüklenmiş örneğe sahip olmaya çalış</guilabel> etiketli son onay kutusu, &konqueror; örneğinin her zaman önceden yüklenmiş; ancak kullanılmamış bir örneğinin var olmasını istediğinizi belirtir. Bu seçenek aslında bazı makinelerde (özellikle sınırlı fiziksel belleğe sahip olanlarda) başarımı düşürecektir.
