Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol6_proxy.po
Languages: tr

source: Proxy
tr: Vekil

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Systemsettings
tr: sistem ayarları

source: proxy
tr: vekil

source: proxies
tr: vekiller

source: Proxies
tr: Vekiller

source: Introduction
tr: Giriş

source: Proxies are programs running on a computer that acts a server on the network you are connected to (whether by modem or other means). These programs receive &HTTP; and &FTP; requests, retrieve the relevant files from the internet, and pass them on to the client computer that made the requests.
tr: Vekiller, (modem veya başka yollarla) bağlı olduğunuz ağda bir sunucu görevi gören bir bilgisayarda çalışan programlardır. Bu programlar &HTTP; ve &FTP; istekleri alırlar, ilgili dosyaları internetten alıp isteği yapan istemci bilgisayara iletirler.

source: When you have configured a proxy, &HTTP; and/or &FTP; requests are re-routed through the computer that is acting as a proxy server. However, you can also select specific hosts which should be contacted directly, rather than through the proxy server. If you are on a local network, for example, access to local hosts probably doesn't need to go through a proxy server.
tr: Bir vekil yapılandırdığınızda, &HTTP; ve/veya &FTP; istekleri, vekil sunucu görevi gören bilgisayar aracılığıyla yeniden yönlendirilir. Ancak, vekil sunucusu yerine doğrudan iletişime geçilmesi gereken belirli ana bilgisayarları da seçebilirsiniz. Örneğin, yerel bir ağdaysanız yerel ana bilgisayarlara erişimin büyük olasılıkla bir vekil sunucu üzerinden geçmesi gerekmez.

source: You should only need to configure a proxy server if your network administrator requires it (if you are a dial-up user, that would be your internet service provider or <acronym>ISP</acronym>). Otherwise, especially if you are feeling a bit confused about this proxy business, but everything seems to be fine with your internet connection, you don't need to change anything.
tr: Yalnızca ağ yöneticiniz gerektiriyorsa bir vekil sunucu yapılandırmanız gerekir (çevirmeli ağ kullanıcısıysanız bu, internet hizmet sağlayıcınız veya <acronym>İSS</acronym> olacaktır). Aksi takdirde, özellikle bu vekil olayları hakkında biraz kafanız karışıyorsa; ancak internet bağlantınızda her şey yolunda görünüyorsa hiçbir şeyi değiştirmenize gerek yoktur.

source: Please note that using proxy servers is optional, but has the benefit or advantage of giving you faster access to data on the internet.
tr: Lütfen proxy sunucularını kullanmanın isteğe bağlı olduğunu; ancak internetteki veriye daha hızlı erişmenizi sağlama avantajına sahip olduğunu unutmayın.

source: If you are uncertain whether or not you need to use a proxy server to connect to the internet, please consult with your internet service provider's setup guide or your system administrator.
tr: İnternete bağlanmak için bir vekil sunucu kullanmanız gerekip gerekmediğinden emin değilseniz lütfen internet hizmet sağlayıcınızın kurulum kılavuzuna veya sistem yöneticinize danışın.

source: <title>Use</title>
tr: <title>Kullanım</title>

source: No Proxy
tr: Vekil yok

source: Select this option if you do <emphasis>not</emphasis> want to use a proxy server and connect to the Internet directly.
tr: Bir vekil sunucu kullanmak <emphasis>istemiyor</emphasis> ve internete doğrudan bağlanmayı tercih ediyorsanız bu seçeneği kullanın.

source: If you have decided to use a proxy, you have several methods to configure the settings for it.
tr: Bir vekil kullanmaya karar verdiyseniz ayarlarını yapılandırmak için birkaç yönteminiz vardır.

source: Detect proxy configuration automatically
tr: Vekil yapılandırmasını kendiliğinden algıla

source: Select this option if you want the proxy setup configuration script file to be automatically detected and downloaded.
tr: Vekil kurulumu yapılandırma betik dosyasının kendiliğinden algılanmasını ve indirilmesini istiyorsanız bu seçeneği seçin.

source: This option only differs from the next choice in that it <emphasis>does not</emphasis> require you to supply the location of the configuration script file. Instead, it will be automatically downloaded using <quote>Web Proxy Auto-Discovery</quote> (<acronym>WPAD</acronym>) protocol.
tr: Bu seçenek, sonraki seçenekten yalnızca yapılandırma betik dosyasının konumıunu vermenizi <emphasis>istememesiyle</emphasis> ayrılır. Bunun yerine, <quote>Web Vekil Otomatik Keşif</quote> (<acronym>WPAD</acronym>) protokolüyle kendililğinden indirilir.

source: Use proxy auto configuration URL:
tr: Vekil otomatik yapılandırma URL’si kullan:

source: Select this option if your proxy support is provided through a script file located at a specific address. You can then enter the address in the location text box, or use the <guiicon>folder</guiicon> icon to browse to it.
tr: Vekil desteğiniz belirli bir adreste bulunan bir betik aracılığıyla sağlanıyorsa bu seçeneği seçin. Daha sonra adresi konum metin kutusuna girebilir veya adrese göz atmak için <guiicon>klasör</guiicon> simgesini kullanabilirsiniz.

source: Use system proxy configuration:
tr: Sistem vekil yapılandırmasını kullan:

source: Some systems are setup with $<envar>HTTP_PROXY</envar> to allow graphical as well as non-graphical applications to share the same proxy configuration information.
tr: Bazı sistemler, grafiksel ve grafiksel olmayan uygulamaların aynı vekil yapılandırması bilgilerini paylaşmasına izin vermek için $<envar>HTTP_PROXY</envar> ile kurulur.

source: If you know this applies to you, select this option and click on the <guibutton>Auto Detect</guibutton> button to provide the environment variable names used to set the address of the proxy server(s).
tr: Bunun sizin için geçerli olduğunu biliyorsanız bu seçeneği seçin ve vekil sunucu(lar)ının adresini ayarlamak için kullanılan çevre değişkeni adlarını sağlamak için <guibutton>Otomatik Algıla</guibutton> düğmesine tıklayın.

source: In the <guilabel>Exceptions:</guilabel> field enter the environment variable, &eg; $<envar>NO_PROXY</envar>, used to store the addresses of sites for which the proxy server should not be used.
tr: <guilabel>İstisnalar:</guilabel> alanına çevre değişkenini girin; örn. $<envar>NO_PROXY</envar>, proxy sunucusunun kullanılmaması gereken sitelerin adreslerini depolamak için kullanılır.

source: Use <guilabel>Show the value of the environment variables</guilabel> to show the value of an environment variable instead of its name. However it is not possible to edit the values of environment variables in this module.
tr: Bir çevre değişkeninin adı yerine değerini göstermek için <guilabel>Çevre değişkenlerinin değerini göster</guilabel>’i kullanın. Ancak bu modülde çevre değişkenlerinin değerlerini düzenlemek olanaklı değildir.

source: Use manually specified proxy configuration:
tr: Elle belirtilmiş vekil sunucu yapılandırması kullan:

source: The complete addressing information for the proxy includes both the Internet address and a port number. You should enter these into the relevant text boxes. Check <guilabel>Use this proxy server for all protocols</guilabel> to copy the addresses and port of the &HTTP; proxy server into all other proxy fields, in order to help save some typing.
tr: Tam vekil adresleme bilgileri, hem İnternet adresini hem de bir kapı numarasını içerir. Bunları ilgili metin kutularına girmelisiniz. &HTTP;’nin adreslerini ve kapısını diğer tüm vekil alanlarına kopyalamak ve biraz yazmadan tasarruf etmek için <guilabel>Tüm protokoller için bu vekil sunucuyu kullan</guilabel> seçeneğini işaretleyin.

source: Exceptions:
tr: İstisnalar:

source: Enter a comma separated list of hostnames or ip addresses that should be excluded from using the above proxy settings. If you want to exclude all hosts for a given domain, then simply enter the domain name preceded by a dot. For example, to exclude all hostnames for kde.org, enter <userinput>.kde.org</userinput>. Wildcard characters such as <userinput>*</userinput> or <userinput>?</userinput> are not supported and will have no effect. Additionally, you can also enter IP addresses, &eg; 127.0.0.1 and IP addresses with a subnet, &eg; 192.168.0.1/24.
tr: Yukarıdaki vekil ayarlarından dışlanması gereken makine adlarının veya IP adreslerinin virgülle ayrılmış bir listesini girin. Belirli bir alan adı için olan tüm makine adlarını dışlamak istiyorsanız yalnızca alan adını önünde bir nokta ile girin. Örneğin, kde.org için olan tüm makine adlarını dışlamak için <userinput>.kde.org</userinput> girin. <userinput>*</userinput> veya <userinput>?</userinput> gibi joker karakterler desteklenmez ve bir etkisi olmayacaktır. Ek olarak, IP adresleri de girebilirsiniz; örneğin; 127.0.0.1 veya alt ağ içeren IP adresleri; örneğin, 192.168.0.1/24.

source: You can also choose <guilabel>Use proxy settings only for addresses in the Exceptions list</guilabel>.
tr: Ayrıca, <guilabel>Yalnızca istisnalar listesindeki girdiler için vekil sunucu ayarları kullan</guilabel>’ı da seçebilirsiniz.

source: Check this box to reverse the use of the exception list, &ie; the proxy servers will only be used when the requested &URL; matches one of the addresses listed here.
tr: İstisna listesinin kullanımını tersine çevirmek için bu kutuyu işaretleyin; örneğin, vekil sunucular yalnızca bu listedeki &URL;’lerden biri ile eşleştiğinde kullanılırlar.

source: This feature is useful if all you need is a proxy to access a few specific sites, for example, an internal intranet. If you have more complex requirements you might want to use a configuration script.
tr: Bu özellik, bir iç ağdaki gibi birkaç belirli siteye erişmek için gereksiniminiz olan tek şey bir vekil sunucu ise kullanışlıdır. Daha karmaşık gereksinimleriniz varsa bir yapılandırma betiği kullanmak isteyebilirsiniz.
