Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_khtml-general.po
Languages: tr

source: General &konqueror; Behavior
tr: Genel &konqueror; Davranışı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Applications 16.12
tr: Uygulamalar 16.12

source: On this page you find settings for home and start page and the behavior of tabbed browsing both for &konqueror;’s file manager and browser mode.
tr: Bu sayfada, ana sayfa ve başlangıç ​​sayfası ayarlarını ve hem &konqueror;’un dosya yöneticisi hem de tarayıcı kipi için sekmeli tarama davranışı seçeneklerini bulabilirsiniz.

source: When Konqueror starts
tr: Konqueror başlatıldığında

source: This option determines which page is displayed when &konqueror; starts, the introduction page, your home page, a blank page or your bookmarks page.
tr: Bu seçenek, &konqueror; başlatıldığında hangi sayfanın görüntüleneceğini belirler: Giriş sayfası, ana sayfa, boş sayfa veya yer imleri sayfası.

source: Home page
tr: Ana sayfa

source: This is the &URL; (&eg; a folder or a web page) where &konqueror; in browser mode will jump to when the <guibutton>Home Page</guibutton> button in the toolbar is pressed. You can set a path that is your <guilabel>Home page</guilabel> by typing into the text field, or using the <guiicon>browse</guiicon> icon to select a local folder. &konqueror; needs to be restarted for changes to take effect.
tr: Bu, araç çubuğundaki <guibutton>Ana Sayfa</guibutton> düğmesine basıldığında, tarayıcı kipindeki &konqueror;’un gideceği &URL;’dir (&eg; bir klasör veya bir web sayfası). Metin alanına yazarak bir yol girebilir veya <guiicon>Göz At</guiicon> düğmesine tıklayarak yerel bir klasör seçerek <guilabel>Ana Sayfa</guilabel>’nızı ayarlayabilirsiniz. Değişikliklerin etkin olabilmesi için &konqueror;’un yeniden başlatılması gerekir.

source: When &konqueror; is used in file manager mode, the <guilabel>Home Page</guilabel> button in the toolbar is replaced by a <guilabel>Home Folder</guilabel> button which makes it jump to your local home folder instead.
tr: &konqueror; dosya yöneticisi kipinde kullanıldığında, araç çubuğundaki <guilabel>Ana Sayfa</guilabel> düğmesi bir <guilabel>Ana Klasör</guilabel> düğmesiyle değiştirilir; böylece buradan yerel ana klasörünüze gidebilirsiniz.

source: Open links in new tab instead of in new window
tr: Bağlantıları yeni pencere yerine yeni sekmede aç

source: &konqueror; defaults to a single window per page, but has the capability to open multiple <firstterm>tabs</firstterm> inside a single window. &konqueror; also, by default, has a &MMB; shortcut to open any link in a new window. If you enable <guilabel>Open links in new tab instead of in new window</guilabel> you can &MMB; click on a link to have it open in a new tab.
tr: &konqueror; öntanımlı olarak sayfa başına tek bir pencereye sahiptir; ancak tek bir pencere içinde birden çok <firstterm>sekme</firstterm> açma yeteneğine sahiptir. &konqueror;’da ayrıca öntanımlı olarak herhangi bir bağlantıyı yeni bir pencerede açmak için bir &MMB; kısayolu bulunur. <guilabel>Bağlantıları yeni pencere yerine yeni sekmede aç</guilabel> seçeneğini etkinleştirirseniz bir bağlantıyı yeni bir sekmede açmak için ona &MMB; ile tıklayın.

source: Open popups in new tab instead of in new window
tr: Açılır pencereleri yeni pencere yerine yeni sekmede aç

source: Whether or not JavaScript popups if allowed shall open in a new tab or in a new window.
tr: JavaScript açılır pencerelerinin izin verilirse yeni sekmede veya yeni pencerede açılıp açılmayacağı.

source: Open as tab in existing Konqueror when URL is called externally
tr: URL dışarıdan çağrıldığında var olan Konqueror’da sekme olarak aç

source: When you click a &URL; in another &kde; program or call kfmclient to open a &URL;, the current desktop will be searched for a nonminimized &konqueror; and, if found, the &URL; opened as a new tab within it. Otherwise a new &konqueror; window will be opened with the required &URL;.
tr: Başka bir &kde; programında bir &URL;’ye tıkladığınızda veya bir &URL; açmak için kfmclient’ı çağırdığınızda, geçerli masaüstünde simge durumuna küçültülmemiş bir &konqueror; aranacak ve bulunursa, &URL; içinde yeni bir sekme olarak açılacaktır. Aksi takdirde, gerekli &URL; ile yeni bir &konqueror; penceresi açılacaktır.

source: Open new tabs in the background
tr: Yeni sekmeleri arka planda aç

source: If you are using tabbed browsing, you can choose if a newly opened tab becomes the active (<quote>front</quote>) tab, or goes to the back. On a slow Internet connection, or while browsing a page that has a list of headlines or other links in a list, you may like to have the new tabs load in the background while you continue reading. In this case, enable this setting. If you prefer to go straight to the new page, leaving the old one in the background to return to later, disable it.
tr: Sekmeli tarama kullanıyorsanız yeni açılan bir sekmenin etkin (<quote>ön</quote>) sekme olup olmayacağını veya arkaya geçip geçmeyeceğini seçebilirsiniz. Yavaş bir internet bağlantısında veya listede başlıkların veya diğer bağlantıların bulunduğu bir sayfada gezinirken, okumayı sürdürürken yeni sekmelerin arka planda yüklenmesini isteyebilirsiniz. Bu durumda, bu ayarı etkinleştirin. Doğrudan yeni sayfaya gitmeyi ve eskisini daha sonra geri dönmek üzere arka planda bırakmayı tercih ediyorsanız devre dışı bırakın.

source: Open new tab after current tab
tr: Yeni sekmeyi geçerli sekmeden sonra aç

source: This will open a new tab opened from a page after the current tab, instead of after the last tab.
tr: Bu, son sekmeden sonra değil, geçerli sekmeden sonraki bir sayfadan açılan yeni bir sekmeyi açacaktır.

source: Hide the tab bar when only one tab is open
tr: Yalnızca bir sekme açıkken sekme çubuğunu gizle

source: This will display the tab bar only if there are two or more tabs. Otherwise it will always be displayed.
tr: Bu, yalnızca iki veya daha fazla sekme varsa sekme çubuğunu görüntüler. Aksi takdirde her zaman görüntülenir.

source: Show close button on tabs
tr: Sekmelerde kapat düğmesini göster

source: This will display close buttons inside each tab instead of websites’ icons.
tr: Bu, web sitelerinin simgeleri yerine her sekmenin içinde kapatma düğmelerinin görüntülenmesini sağlayacaktır.

source: Middleclick on a tab to close it
tr: Bir sekmeyi kapatmak için üzerine orta tıkla

source: When you click on a tab using the middle mouse button or mouse wheel, it will close that tab. &konqueror; needs to be restarted for changes to take effect.
tr: Orta fare düğmesini veya fare tekerleğini kullanarak bir sekmeye tıkladığınızda, o sekme kapanır. Değişikliklerin etkili olması için &konqueror;’ın yeniden başlatılması gerekir.

source: Confirm when closing windows with multiple tabs
tr: Birden fazla sekmesi olan pencereleri kapatırken onayla

source: If you close a window in &konqueror; that has multiple tabs open, &konqueror; will ask you if you’re sure that you meant to close it. You can toggle on and off this behavior with this check box.
tr: &konqueror;’da birden fazla sekmesi açık olan bir pencereyi kapatırsanız &konqueror; onu kapatmak istediğinizden emin olup olmadığınızı soracaktır. Bu davranışı bu onay kutusuyla açıp kapatabilirsiniz.

source: Activate previously used tab when closing the current tab
tr: Geçerli sekmeyi kapatırken daha önce kullanılan sekmeyi etkinleştir

source: When checking this the previous used or opened tab will be activated when you close the current active tab instead of the one right to the current tab.
tr: Bunu işaretlediğinizde, geçerli etkin sekmeyi kapattığınızda, geçerli sekmenin hemen sağındaki sekme yerine, daha önce kullandığınız veya açtığınız sekme etkinleştirilecektir.
