Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_filemanager.po
Languages: tr

source: File Management
tr: Dosya Yönetimi

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Turgay</firstname><surname>GÜLMEZ</surname><affiliation><address><email>turgaygulmez@windowslive.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Applications 16.12
tr: Uygulamalar 16.12

source: Systemsettings
tr: Sistem Ayarları

source: file manager
tr: dosya yöneticisi

source: In these modules, you can configure various aspects of &konqueror;’s file manager functionality.
tr: Bu modüllerde, &konqueror;’un dosya yöneticisi işlevselliğinin çeşitli yönlerini yapılandırabilirsiniz.

source: &konqueror;’s web browser functionality has its <ulink url="help:/kcontrol/khtml-behavior/index.html">own configuration modules</ulink>.
tr: &konqueror;’ın web tarayıcısı işlevselliğinin kendi <ulink url="help:/kcontrol/khtml-behavior/index.html">yapılandırma modülleri</ulink> vardır.

source: Misc Options
tr: Çeşitli Seçenekler

source: Open folders in separate windows
tr: Pencereleri ayrı klasörlerde aç

source: If this option is checked, a new &konqueror; window will be created when you open a folder, rather than simply showing that folder’s contents in the current window.
tr: Bu seçenek işaretlenmişse bir klasörü açtığınızda klasörün içeriği geçerli pencerede gösterilmek yerine, yeni bir &konqueror; penceresi oluşturulur.

source: Show “Delete” menu entries which bypass the trashcan
tr: Çöp kutusuna göndermeden silmek için “Sil” menü girdisini göster

source: Check this if you want <quote>Delete</quote> menu commands to be displayed on the desktop and in the file manager’s context menus. You can always delete files by holding the &Shift; key while calling <guimenuitem>Move to Trash</guimenuitem>.
tr: <quote>Sil</quote> menü komutlarının masaüstünde ve dosya yöneticisinin bağlam menülerinde görüntülenmesini istiyorsanız bunu işaretleyin. Dosyaları her zaman <guimenuitem>Çöp Kutusuna Taşı</guimenuitem> ögesini çağırırken &Shift; düğmesini basılı tutarak silebilirsiniz.

source: The settings for &konqueror;’s file manager mode on the <guilabel>View Modes</guilabel>, <guilabel>Navigation</guilabel>, <guilabel>Services</guilabel>, <guilabel>General</guilabel> and <guilabel>Trash</guilabel> pages are used by &dolphin; as well.
tr: &konqueror;’un dosya yöneticisi kipindeki <guilabel>Görünüm Kipleri</guilabel>, <guilabel>Dolaşım</guilabel>, <guilabel>Hizmetler</guilabel>, <guilabel>Genel</guilabel> ve <guilabel>Çöp Sepeti</guilabel> sayfaları için olan ayarlar &dolphin; tarafından da kullanılır.
