Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_baloo.po
Languages: tr

source: File Search
tr: Dosya Arama

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Hasan</firstname><surname>Kiran</surname><affiliation><address><email>sunder67@hotmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Systemsettings
tr: sistem ayarları

source: search
tr: arama

source: file
tr: dosya

source: This &systemsettings; module allows you to configure which files should be indexed for fast searching. It internally uses a technology called Baloo to efficiently search through the files.
tr: Bu &systemsettings; modülü, hızlı arama için hangi dosyaların indeksleneceğini yapılandırmanızı sağlar. Dosyalar arasında hızlı arama yapmak için içerilen Baloo adı verilen teknolojiyi kullanır.

source: Add the widget <guilabel>Search</guilabel> to your panel or enable the search in &krunner; to use the indexing results for faster access to your documents.
tr: Belgelerinize daha hızlı erişim için indekslenmiş sonuçları kullanmak üzere <guilabel>Arama</guilabel> araç takımını ekleyin veya &krunner; içinde aramayı etkinleştirin.

source: Activate the <guilabel>Enable File Search</guilabel> item if you want to use desktop search capabilities in &dolphin; and other &kde; applications. Uncheck the item if you do not want to use the file search with Baloo (it is possible to use other search technologies, &eg; &kfind;).
tr: &dolphin; ve diğer &kde; uygulamalarında masaüstü arama yeteneklerini etkinleştirmek için <guilabel>Dosya Arama’yı etkinleştir</guilabel> seçeneğini kullanın. Baloo ile dosya aramayı kullanmak istemiyorsanız bunu işaretlemeyin (&eg; &kfind; gibi başka arama teknolojilerini kullanmak olanaklıdır).

source: Use <guilabel>Also index file content</guilabel> to also index the file contents additional to the file names.
tr: Dosya adlarına ek olarak dosya içeriğini de indekslemek için <guilabel>Ayrıca dosya içeriğini indeksle</guilabel> seçeneğini kullanın.

source: Check the <guilabel>Index hidden files and folders</guilabel> item to make Baloo index the hidden files and folders.
tr: Baloo’nun gizli dosyaları ve klasörleri de indekslemesi için <guilabel>Gizli dosyaları ve klasörleri indeksle</guilabel> seçeneğini kullanın.

source: Any file or folder name that starts with a period (<literal>.</literal>) is hidden by default.
tr: Bir nokta (<literal>.</literal>) ile başlayan her dosya veya klasör öntanımlı olarak gizlidir.

source: Folder specific configuration
tr: Klasöre özgü yapılandırma

source: You are presented with a list of folders that can be indexed. By default only your entire <filename class="directory"><envar>$HOME</envar></filename> folder is indexed, and no other folders or drives are indexed.
tr: İndekslenebilecek bir klasör listesi size sunuldu. Öntanımlı olarak, yalnızca tüm <filename class="directory"><envar>$HOME</envar></filename> klasörünüz indekslenir ve başka klasörlere veya sürüclere dokunulmaz.

source: Removable media is never indexed by default. It can be explicitly removed from the list of excluded folders and it will then be indexed.
tr: Kaldırılabilir ortamlar, öntanımlı olarak hiçbir zaman indekslenmez. İndekslemeden dışlanan klasörler listesinden kaldırıldığında indekslenir.

source: It is possible to use the combo box next to each item in the list to configure if it is <guimenuitem>Indexed</guimenuitem> or <guimenuitem>Not indexed</guimenuitem>.
tr: Listedeki her bir ögenin yanındaki çoklu kutuyu kullanarak bir ögenin <guimenuitem>İndekslenmiş</guimenuitem> veya <guimenuitem>İndekslenmemiş</guimenuitem> olduğunu yapılandırmak olanaklıdır.

source: Use the trash button to remove an item from the list.
tr: Listeden bir ögeyi kaldırmak için çöp kutusu simgesini kullanın.

source: <guibutton>Start indexing a folder...</guibutton>/<guibutton>Stop indexing a folder...</guibutton>
tr: <guibutton>İndekslenecek Klasör Ekle…</guibutton>/<guibutton>Klasör İndekslemeyi Kaldır…</guibutton>

source: Clicking any of the above-mentioned options displays the standard &plasma; <guilabel>Select a folder to filter</guilabel> dialog and allows you to choose the folder to be treated accordingly.
tr: Yukarıda belirtilen seçeneklere tıklamak standart &plasma; <guilabel>İçerilecek bir klasör seç</guilabel> iletişim kutusunu açar ve seçeceğiniz klasörü öyle işler.

source: For more info about additional configuration options &eg; how to add a drive mounted outside your <filename class="directory"><envar>$HOME</envar></filename> folder please read <ulink url="https://community.kde.org/Baloo/Configuration">Baloo/Configuration</ulink>.
tr: <filename class="directory"><envar>$HOME</envar></filename> klasörünüz dışında bağlanmış konumları; &eg;, klasörleri veya sürücüleri yapılandırma seçenekleri için lütfen <ulink url="https://community.kde.org/Baloo/Configuration">Baloo/Yapılandırma</ulink> sayfasına bakın.
