Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_fonts.po
Languages: tr

source: Fonts
tr: Yazıtipleri

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: fonts
tr: yazıtipleri

source: This module is designed to allow you to easily select different fonts for different parts of the &kde; Desktop.
tr: Bu modül, &kde; masaüstünün farklı bölümleri için farklı yazıtiplerini kolaylıkla seçebilmeniz için tasarlanmıştır.

source: Here's a screenshot of the fonts settings module
tr: İşte yazıtipi ayarları modülünün bir ekran görüntüsü

source: The fonts settings module
tr: Yazıtipi ayarları modülü

source: The panel consists of different font groups to give you a lot of flexibility in configuring your fonts:
tr: Panel, yazıtiplerinizi yapılandırmada size çok fazla esneklik sağlamak için farklı yazıtipi gruplarından oluşur:

source: <guilabel>General:</guilabel> Used everywhere when the other font groups do not apply
tr: <guilabel>Genel:</guilabel> Diğer yazıtipi gruplarının geçerli olmadığı her yerde kullanılır

source: <guilabel>Fixed width:</guilabel> Anywhere a non-proportional font is specified
tr: <guilabel>Eş aralıklı:</guilabel> Orantısız bir yazıtipinin belirtildiği her yerde

source: <guilabel>Small:</guilabel> When small fonts are used
tr: <guilabel>Küçük:</guilabel> Küçük yazıtipleri kullanıldığında

source: <guilabel>Toolbar:</guilabel> Font used in &kde; application toolbars
tr: <guilabel>Araç çubuğu:</guilabel> &kde; uygulamalarının araç çubuklarında kullanılan yazıtipi

source: <guilabel>Menu:</guilabel> Font used in &kde; application menus
tr: <guilabel>Menü:</guilabel> &kde; uygulamaları menülerinde kullanılan yazıtipi

source: <guilabel>Window title:</guilabel> Font used in the window title
tr: <guilabel>Pencere başlığı:</guilabel> Pencere başlığında kullanılan yazıtipi

source: <guilabel>Taskbar:</guilabel> Font used in the taskbar panel applet
tr: <guilabel>Görev çubuğu:</guilabel> Görev çubuğu panel uygulamacığında kullanılan yazıtipi

source: <guilabel>Desktop:</guilabel> Font used on the desktop to label icons
tr: <guilabel>Masaüstü:</guilabel> Masaüstünde ve etiketlerde kullanılan yazıtipi

source: Each font has a corresponding <guibutton>Choose...</guibutton> button. By clicking on this button, a dialog box appears. You can use this dialog box to choose a new font, a font style and size. Then press <guibutton>OK</guibutton>.
tr: Her yazıtipinin karşılık gelen bir <guibutton>Seç…</guibutton> düğmesi vardır. Bu düğmeye tıkladığınızda bir iletişim kutusu görünür. Yeni bir yazıtipi, yazıtipi biçemini ve boyutunu seçmek için bu iletişim kutusunu kullanabilirsiniz. Ardından <guibutton>Tamam</guibutton>’a basın.

source: Check the <guilabel>Show only monospaced fonts</guilabel> to filter out all non-monospaced fonts from the list.
tr: Eş aralıklı olmayan tüm yazıtiplerini listeden süzmek için <guilabel>Yalnızca eş aralıklı yazıtiplerini göster</guilabel> seçeneğini işaretleyin.

source: An example of the font you have chosen will be displayed in the space between the font group name and the <guibutton>Choose...</guibutton> button.
tr: Seçtiğiniz yazıtipinin bir örneği, yazıtipi grubu adı ve <guibutton>Seç…</guibutton> düğmesi arasında görüntülenir.

source: When you are done, simply click <guibutton>OK</guibutton> and all the necessary components of &kde; will be restarted so your changes can take affect immediately.
tr: İşiniz bittiğinde <guibutton>Tamam</guibutton>’a tıklayın ve değişikliklerinizin hemen etkili olması için &kde;’nin ilgili bileşenleri yeniden başlatılacaktır.

source: The <guibutton>Adjust All Fonts...</guibutton> button allows you to quickly set properties for all the fonts selected above. A font selection dialog similar to the standard one will appear, but you will notice checkboxes that allow you to change the <guilabel>Font</guilabel>, <guilabel>Font style</guilabel> or <guilabel>Size</guilabel> independently of each other. You can choose any one, two, or three of these options, and they will be applied to all the font groups.
tr: <guibutton>Tüm Yazıtiplerini Ayarla…</guibutton> düğmesi, yukarıda seçili tüm yazıtiplerinin özelliklerini tez ayarlamanıza olanak tanır. Standart olana benzer bir yazıtipi seçme iletişim kutusu açılır; ancak <guilabel>Yazıtipi</guilabel>, <guilabel>Yazıtipi biçemi</guilabel> veya <guilabel>Boyut</guilabel> alanlarını birbirinden bağımsız olarak değiştirmenize izin veren onay kutuları bulunur. Bu seçeneklerden herhangi birini, ikisini veya üçünü seçebilirsiniz ve bunlar tüm yazıtipi gruplarına uygulanacaktır.

source: Adjusting all fonts
tr: Tüm yazıtiplerini ayarlamak

source: The Adjust All Fonts... dialog
tr: Tüm Yazıtiplerini Ayarla… iletişim kutusu

source: For example, if you have selected several different font faces above, and realize they are all a size too big (this often happens when you change screen resolution, for instance), you can apply a new font size to all the fonts, without affecting your customized font faces and styles.
tr: Örneğin, yukarıda birkaç farklı yazıyüzü seçtiyseniz ve hepsinin puntosunun çok büyük olduğunu fark ettiyseniz (bu, örneğin ekran çözünürlüğünü değiştirdiğinizde sıklıkla olur), tüm özelleştirilmiş yazıyüzlerinizi ve biçemlerinizi etkilemeden yeni bir yazıtipi boyutu uygulayabilirsiniz.

source: Anti-aliasing text
tr: Metin kenarı yumuşatma

source: To use anti-aliasing setting, simply check the <guilabel>Enabled</guilabel> item and select the custom settings.
tr: Kenar yumuşatma ayarlarını kullanmak için yalnızca <guilabel>Etkin</guilabel> onay kutusunu işaretleyin ve özel ayarlarınızı seçin.

source: Placing a mark in the <guilabel>Exclude range from anti-aliasing</guilabel> checkbox will allow you to specify which range of fonts will <emphasis>not</emphasis> be anti-aliased. This range is specified with the two combo boxes below.
tr: <guilabel>Erimi kenar yumuşatmadan dışla</guilabel> onay kutusuna bir işaret koymak, hangi yazıtipi aralığının kenar yumuşatma <emphasis>yapmayacağını</emphasis> belirtmenize olanak tanır. Bu aralık, aşağıdaki iki çoklu kutu ile belirtilir.

source: You can also choose the method used to create an anti-alias look to your fonts, and how strongly it should be applied changing the <ulink url="https://en.wikipedia.org/wiki/Subpixel_rendering"> Sub-pixel rendering</ulink> and <ulink url="https://en.wikipedia.org/wiki/Font_hinting"> font hinting</ulink>. It is also possible to <guilabel>Force font DPI</guilabel> for the <ulink url="https://en.wikipedia.org/wiki/Dots_per_inch">screen rendering</ulink>. If you are not familiar with the individual methods, you should leave these options alone.
tr: Ayrıca yazıtipleriniz için bir kenar yumuşatma görünümü oluşturma yöntemini ve ne kadar güçlü görünmesi gerektiğini <ulink url="https://en.wikipedia.org/wiki/Subpixel_rendering"> Alt piksel sunumu</ulink> ve <ulink url="https://en.wikipedia.org/wiki/Font_hinting"> yazıtipi gölgelendirmesini</ulink> değiştirerek ayarlayabilirsiniz. <ulink url="https://en.wikipedia.org/wiki/Dots_per_inch">Ekran sunumu</ulink> için <guilabel>Yazıtipi DPI’sini zorla</guilabel>’mak da olanaklıdır. Bu ayarların ne anlama geldiğini bilmiyorsanız değiştirmemeniz en iyisidir.

source: The ability to use anti-aliased fonts and icons requires that you have support in both the display server and the &Qt; toolkit, that you have suitable fonts installed, and that you are using the built-in font serving capabilities of the display server. If you still are having problems, please contact the appropriate &kde; mailing list.
tr: Kenar yumuşatılmış yazıtiplerini ve simgeleri kullanabilmek için hem ekran sunucusunda hem de &Qt; araç kitinde destek olduğundan, uygun yazı tiplerinin kurulu olduğundan ve ekran sunucusunun yerleşik yazıtipi sunma özelliklerini kullandığınızdan emin olun. Hâlâ sorun yaşıyorsanız lütfen ilgili &kde; posta listesine yazın.

source: Fonts DPI
tr: Yazıtipi DPI’si

source: <guilabel>Force fonts DPI:</guilabel> proposes you an alternate DPI other than your system one which is used as default when this setting is on <guilabel>Disabled</guilabel>. You can check what DPI your X server is set to by running <userinput>xdpyinfo | grep resolution</userinput> in a terminal window and then change the DPI using the drop down box. This will be applied to newly started applications only.
tr: <guilabel>Force fonts DPI:</guilabel> ayarı, size bu ayar <guilabel>Devre Dışı</guilabel> olduğunda öntanımlı olarak kullanılandan farklı bir DPI önerir. X sunucunuzun hangi DPI’ye ayarlı olduğunu bir uçbirim penceresinde <userinput>xdpyinfo | grep resolution</userinput> yazarak denetleyebilir ve ardından açılır kutuyu kullanarak DPI’yı değiştirebilirsiniz. Bu yalnızca yeni başlatılan uygulamalara uygulanır.
