Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_windowspecific.po
Languages: tr

source: Pin <application>Thunderbird</application>'s main window on <emphasis>Virtual Desktop 1</emphasis> with a specific size and location on the desktop.
tr: <application>Thunderbird</application>’ün ana penceresini <emphasis>Sanal Masaüstü 1</emphasis>’e masaüstünde belirli bir boyut ve konumla sabitleyin.

source: Allow the <application>Thunderbird</application> composer window to reside on any desktop and when activated, force focus and pop it to the top of all windows.
tr: <application>Thunderbird</application> oluşturucu penceresinin herhangi bir masaüstünde kalmasına izin verin ve etkinleştirildiğinde, odaklanmaya zorlayın ve onu tüm pencerelerin üzerine yerleştirin.

source: Pop the <application>Thunderbird</application> reminder to the top and do not give it focus so it isn't inadvertently dismissed.
tr: <application>Thunderbird</application> anımsatıcısını en üste getirin ve istemeden yok sayılmaması için ona odaklanmayın.

source: Each rule's matching criteria is sufficiently restrictive so their order within the main &kwin; window is not important to affect <link linkend="rule-evaluation">rule evaluation</link>.
tr: Her bir kuralın eşleştirme kriterleri yeterince kısıtlayıcıdır; bu nedenle onların ana &kwin; penceresi içindeki sıraları <link linkend="rule-evaluation">kural değerlendirmesini</link> etkileyecek kadar önemli değildir.

source: Thunderbird - Main
tr: Thunderbird — Ana

source: Assuming the <guilabel>Thunderbird Main</guilabel> window is open, sized and position to suit:
tr: <guilabel>Thunderbird Ana</guilabel> penceresinin açık, boyutlandırılmış ve uygun konumda olduğunu varsayarsak:

source: Use <guilabel>Detect Window Properties</guilabel> and select the <guilabel>Thunderbird Main</guilabel> window. Check the <guilabel>Window role</guilabel> box to restrict the criteria to the main window - for additional information see <link linkend="window-matching">window matching</link>:
tr: <guilabel>Pencere Özelliklerini Algıla</guilabel>’yı kullanın ve <guilabel>Thunderbird Ana</guilabel> penceresini seçin. Kriterleri ana pencereyle sınırlamak için <guilabel>Pencere rolü</guilabel> kutusunu işaretleyin — ek bilgi için <link linkend="window-matching">pencere eşleştirme</link> bölümüne bakın:

source: Thunderbird - Composer
tr: Thunderbird — Oluşturucu

source: Assuming a <guilabel>Thunderbird Composer</guilabel> window is open:
tr: Bir <guilabel>Thunderbird Oluşturucu</guilabel> penceresinin açık olduğunu varsayarsak:

source: Use <guilabel>Detect Window Properties</guilabel> and select the <guilabel>Thunderbird Compose</guilabel> window. Check the <guilabel>Window role</guilabel> and <guilabel>Window type</guilabel> boxes to restrict the criteria to composition windows - for additional information see <link linkend="window-matching">window matching</link>:
tr: <guilabel>Pencere Özelliklerini Algıla</guilabel>’yı kullanın ve <guilabel>Thunderbird Oluşturucu</guilabel> penceresini seçin. Kriterleri oluşturucu pencereleriyle sınırlamak için <guilabel>Pencere rolü</guilabel> ve <guilabel>Pencere türü</guilabel> kutularını işaretleyin — ek bilgi için <link linkend="window-matching">pencere eşleştirme</link> bölümüne bakın:

source: Thunderbird - Reminder
tr: Thunderbird — Anımsatıcı

source: Assuming a <guilabel>Thunderbird Reminder</guilabel> window is open:
tr: Bir <guilabel>Thunderbird Anımsatıcı</guilabel> penceresinin açık olduğunu varsayarsak:

source: Use <guilabel>Detect Window Properties</guilabel> and select the <guilabel>Thunderbird Reminder</guilabel> window. Check the <guilabel>Secondary class name</guilabel> and <guilabel>Window Type</guilabel> boxes to restrict the criteria to reminder windows - for additional information see <link linkend="window-matching">window matching</link>:
tr: <guilabel>Pencere Özelliklerini Algıla</guilabel>’yı kullanın ve <guilabel>Thunderbird Anımsatıcı</guilabel> penceresini seçin. Kriterleri anımsatma pencereleriyle sınırlamak için <guilabel>İkincil sınıf adı</guilabel> ve <guilabel>Pencere Türü</guilabel> kutularını işaretleyin — ek bilgi için <link linkend="window-matching">pencere eşleştirme</link > bölümüne bakın:

source: Application Workarounds
tr: Uygulama Geçici Çözümleri

source: Below are Workarounds for misbehaving applications.
tr: Yanlış davranan uygulamalar için geçici çözümleri aşağıda bulabilirsiniz.

source: If you are unfamiliar with creating &kwin; Rules, see this <link linkend="pin-a-window-to-a-desktop-and-set-other-attributes">detailed example</link> to base your new rule.
tr: &kwin; Kuralları oluşturma konusunda bilginiz yoksa yeni kuralınızı temellendirmek için bu <link linkend="pin-a-window-to-a-desktop-and-set-other-attributes">ayrıntılı örneğe</link> bakın.

source: Full-screen Re-size Error
tr: Tam Ekran Yeniden Boyutlandırma Hatası

source: &Emacs; and <guilabel>gVim</guilabel>, when maximized (full-screen mode) and under certain conditions may encounter window re-sizing issues - see <ulink url="https://bugs.kde.org/show_bug.cgi?id=252314">Emacs window resizes ...</ulink> A &kwin; Rule will work-around the issue.
tr: &Emacs; ve <guilabel>gVim</guilabel>, büyütüldüğünde (tam ekran kipi) ve belirli koşullar altında pencere yeniden boyutlandırma sorunlarıyla karşılaşabilir — bkz. <ulink url="https://bugs.kde.org/show_bug.cgi? id=252314">Emacs window resizes…</ulink>. Bir &kwin; Kuralı, soruna geçici bir çözüm getiriyor.

source: Assuming an &Emacs; window is open:
tr: Bir &Emacs; penceresinin açık olduğunu varsayarsak:

source: Use <guilabel>Detect Window Properties</guilabel> and select the &Emacs; window. Match only by <guilabel>primary class name</guilabel> so leave the check boxes unchecked - for additional information see <link linkend="window-matching">window matching</link>
tr: <guilabel>Pencere Özelliklerini Algıla</guilabel>’yı kullanın ve &Emacs; penceresini seçin. Yalnızca <guilabel>birincil sınıf adına</guilabel> göre eşleştirin, bu nedenle onay kutularını işaretlemeyin — ek bilgi için <link linkend="window-matching">pencere eşleştirme</link> bölümüne bakın.

source: Clicking <guilabel>OK</guilabel> in the previous window back-fills the results in the <guilabel>Window Matching</guilabel> tab. Enter a meaningful text in the <guilabel>Description</guilabel> text box:
tr: Önceki pencerede <guilabel>Tamam</guilabel>’a tıklandığında <guilabel>Pencere Eşleştirme</guilabel> sekmesindeki sonuçlar geri doldurulur. <guilabel>Açıklama</guilabel> metin kutusuna anlamlı bir metin girin:

source: Ignore &Emacs;'s full-screen request by enabling the <guilabel>Obey geometry restrictions</guilabel> attribute, toggling it to off (<guilabel>No</guilabel>) to ignore and selecting the <guilabel>Force</guilabel> <link linkend="parameters">parameter</link>:
tr: <guilabel>Geometry kısıtlamalarına uy</guilabel> özniteliğini, yok saymak için onu kapalı yaparak (<guilabel>Hayır</guilabel>) ve <guilabel>Zorla</guilabel> <link linkend="parameters">parametresini</link> seçerek etkinleştirin:

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Documentation Copyright see the UserBase <ulink url="https://userbase.kde.org/index.php?title=KWin Rules&amp;action=history">KWin Rules page history</ulink>
tr: Belgelendirme telif hakkı için Kullanıcı Tabanı <ulink url="https://userbase.kde.org/index.php?title=KWin Rules&amp;action=history">KWin Kuralları sayfa geçmişine</ulink> bakın

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
