Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_khtml-adblock.po
Languages: tr

source: AdBlocK Filters
tr: AdBlock Süzgeçleri

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Turgay</firstname><surname>GÜLMEZ</surname><affiliation><address><email>turgaygulmez@windowslive.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Applications 16.12
tr: Uygulamalar 16.12

source: &konqueror; AdBlocK can be configured to replace or remove images or frames from web pages that match a series of filters.
tr: &konqueror; AdBlock, bir dizi süzgeçle eşleşen web sayfalarındaki görselleri veya kareleri değiştirmek/kaldırmak üzere yapılandırılabilir.

source: The setting <guilabel>Enable filters</guilabel> enables or disables the use of list of URL filters.
tr: <guilabel>Süzgeçleri etkinleştir</guilabel> ayarı, URL süzgeçleri listesinin kullanımını etkinleştirir veya devre dışı bırakır.

source: If <guilabel>Hide filtered images</guilabel> is enabled then blocked images are completely removed from the page and the space they occupied is reclaimed. If the option is disabled then a placeholder image is used in place of filtered images.
tr: <guilabel>Süzülen görselleri gizle</guilabel> etkinleştirilirse engellenen görseller sayfadan tümüyle kaldırılır ve kapladıkları alan geri alınır. Seçenek devre dışı bırakılırsa süzülmüş görsellerin yerine bir yer tutucu görsel kullanılır.

source: Manual Filter
tr: Elle Süzgeç

source: The main part of this tab is a list of URLs that will be compared against image and frame names to decide on fitlering actions. The wildcards can be given as filename style regular expressions.
tr: Bu sekmenin ana kısmı, süzme eylemlerine karar vermek için görsel ve çerçeve adlarıyla karşılaştırılacak URL’lerin bir listesidir. Joker karakterler, dosya adı biçemli düzenli ifadeler olarak verilebilir.

source: Each filter can either be expressed as a file style wildcard string (e.g. http://www.site.com/ads/*) or as a full regular expression by enclosing the filter with forward slashes (e.g. //(ads|dclk)\./).
tr: Her süzme, dosya biçemi joker karakter dizisi olarak (örneğin, http://www.site.com/ads/*)veya süzgeci eğik çizgilerle çevreleyerek tam bir düzenli ifade (örneğin, //(ads|dclk)\./) olarak ifade edilebilir.

source: Any filter string can be preceded by <literal>@@</literal> to whitelist (allow) any matching &URL;, which takes priority over any blacklist (blocking) filter.
tr: Herhangi bir süzgeç dizisinin önüne <literal>@@</literal> eklenerek eşleşen herhangi bir &URL;’nin beyaz listeye alınması (izin verilmesi) sağlanabilir; bu, herhangi bir kara liste (engelleme) süzgecine göre önceliklidir.

source: <guilabel>Import</guilabel> and <guilabel>Export</guilabel> will save or read the current filter list to a plain text file. The file begins with a header line <userinput>[AdBlock]</userinput>, then all of the filters follow each on a separate line. Lines prefixed with an exclamation mark (<userinput>!</userinput>) and the header line are treated as comments and can be used to clarify or label a set of filters.
tr: <guilabel>İçe Aktar</guilabel> ve <guilabel>Dışa Aktar</guilabel>, geçerli süzgeç listesini düz metin dosyasına kaydeder veya okur. Dosya bir başlık satırı <userinput>[AdBlock]</userinput> ile başlar, ardından tüm süzgeçler her birini ayrı bir satırda takip eder. Ünlem işareti (<userinput>!</userinput>) öneki olan satırlar ve başlık satırı yorum olarak ele alınır ve bir süzgeç kümesini açıklamak veya etiketlemek için kullanılabilir.

source: Highlight an entry from the list to change it in the edit box or remove this item. Enter a new filter string here and add it to the list using the <guibutton> Insert</guibutton> button.
tr: Düzenleme kutusunda değiştirmek veya bu ögeyi kaldırmak için listeden bir girdiyi vurgulayın. Buraya yeni bir süzgeç dizisi girin ve <guibutton> Ekle</guibutton> düğmesini kullanarak listeye ekleyin.

source: Automatic Filter
tr: Kendiliğinden Süzgeç

source: This tab shows a list of names and &URL;’s with predefined AdBlock filter entries. To enable an entry tick the checkbox beside the filter name and adjust the <guilabel>Automatic update interval</guilabel> (default 7 days).
tr: Bu sekme, önceden tanımlanmış AdBlock süzgeç girişlerine sahip adların ve &URL;’lerin bir listesini gösterir. Bir girişi etkinleştirmek için süzgeç adının yanındaki onay kutusunu işaretleyin ve <guilabel>Kendiliğinden güncelleme aralığı</guilabel>’nı ayarlayın (öntanımlı olarak 7 gün).

source: If AdBlock filters are enabled, an icon at the right side of status bar is shown. Use a &RMB; click on this icon to open the context menu with actions to show all blockable elements on a web page, open this &systemsettings; module and disable blocking for a site or page temporarily.
tr: AdBlock süzgeçleri etkinleştirilirse durum çubuğunun sağ tarafında bir simge gösterilir. Bu simgeye &RMB; ile tıklayarak, bir web sayfasındaki tüm engellenebilir ögeleri göstermek için eylemler içeren bağlam menüsünü kullanıp &systemsettings; modülünü açın ve bir site veya sayfa için engellemeyi geçici olarak devre dışı bırakın.

source: A click with the &LMB; shows the dialog with all blockable elements on the opened web page as well. From this dialog you can add new filters directly without opening this &systemsettings; module.
tr: &LMB; ile tıklamak, açılan web sayfasındaki tüm engellenebilir ögelerin bulunduğu iletişim kutusunu da gösterir. Bu iletişim kutusundan, bu &systemsettings; modülünü açmadan doğrudan yeni süzgeçler ekleyebilirsiniz.
