Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_kamera.po
Languages: tr

source: &kamera; : Digital Camera
tr: &kamera;: Sayısal Kamera

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@îcloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Applications 18.04
tr: Uygulamalar 18.04

source: camera
tr: kamera

source: photo
tr: fotoğraf

source: This module allows you to configure support for your digital camera.
tr: Bu modül, sayısal kameranız için desteği yapılandırmanıza olanak tanır.

source: <guibutton>Add</guibutton>
tr: <guibutton>Ekle</guibutton>

source: Click this button to select the camera's model and the port it is connected to on your computer (&eg; USB, Serial). If your camera does not appear in the list of <guilabel>Supported Cameras</guilabel>, go to the <ulink url="http://www.gphoto.org">GPhoto web site</ulink> for a possible update.
tr: Kameranın modelini ve bilgisayarınızda bağlı olduğu kapıyı (örn. USB, Seri) seçmek için bu düğmeye tıklayın. Kameranız <guilabel>Desteklenen Kameralar</guilabel> listesinde görünmüyorsa olası bir güncelleme için <ulink url="http://www.gphoto.org">GPhoto web sitesine</ulink> gidin.

source: Test
tr: Sına

source: Click this button to test the connection to the selected camera.
tr: Seçili kamerayla bağlantıyı sınamak için bu düğmeye tıklayın.

source: Remove
tr: Kaldır

source: Removes the selected camera from the list.
tr: Seçili kamerayı listeden kaldırır.

source: Configure
tr: Yapılandır

source: Click this button to change the configuration of the selected camera. The availability of this feature and the contents of the Configuration dialog depend on the camera model.
tr: Seçili kameranın yapılandırmasını değiştirmek için bu düğmeye tıklayın. Bu özelliğin kullanılabilirliği ve Yapılandırma iletişim kutusunun içeriği kamera modeline bağlıdır.

source: Information
tr: Bilgi

source: Click this button to view a summary of the current status of the selected camera. The availability of this feature and the contents of the Information dialog depend on the camera model.
tr: Seçili kameranın geçerli durumunun bir özetini görüntülemek için bu düğmeye tıklayın. Bu özelliğin kullanılabilirliği ve Bilgi iletişim kutusunun içeriği kamera modeline bağlıdır.

source: Cancel
tr: İptal

source: Click this button to cancel the current camera operation.
tr: Geçerli kamera işlemini iptal etmek için bu düğmeye tıklayın.

source: To view and download images from the digital camera, enter <userinput>camera:/</userinput> in &konqueror;&apos;s or &dolphin;&apos;s location bar.
tr: Sayısal kameradaki görsellere bakmak ve onları indirmek için &konqueror;&apos; veya &dolphin;&apos; uygulamalarının konum çubuğuna <userinput>camera:/</userinput> girin.
