Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_spellchecking.po
Languages: tr

source: Spell Checker
tr: Yazım Denetimi

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Spelling
tr: Yazım Denetimi

source: dictionary
tr: sözlük

source: The configuration options available here are used as default by all &kde; applications that use &sonnet;, which is a frontend to various free spell checkers.
tr: Burada bulunan yapılandırma seçenekleri, çeşitli ücretsiz yazım denetleyicilerin bir ön yüzü olan &sonnet; kullanan tüm &kde; uygulamaları tarafından öntanımlı olarak kullanılır.

source: To use &sonnet; you need to install spell checkers like &eg; <ulink url="http://aspell.net/">&GNU; Aspell</ulink>, <ulink url="http://hspell.ivrix.org.il/">Hspell</ulink> or <ulink url="https://hunspell.github.io/">Hunspell</ulink> and additionally the corresponding dictionaries for your language.
tr: &sonnet;’i kullanmak için; &eg;, <ulink url="http://aspell.net/">&GNU; Aspell</ulink>, <ulink url="http://hspell.ivrix.org.il/">Hspell</ulink> veya <ulink url="https://hunspell.github.io/">Hunspell</ulink> gibi yazım denetleyicilerini ve diliniz için ilgili sözlükleri kurmanız gerekir.

source: The configuration options selected here can be overridden by each application.
tr: Buradaki yapılandırma seçenekleri her uygulama tarafından geçersiz kılınabilir.

source: In the drop down box <guilabel>Default language</guilabel> choose from the available dictionaries, which one to use for &sonnet;.
tr: <guilabel>Öntanımlı dil</guilabel> açılır kutusunda kullanılabilir sözlükler arasından &sonnet; için hangisini kullanacağınızı seçin.

source: Options
tr: Seçenekler

source: Enable autodetection of language
tr: Dili otomatik algılamayı etkinleştir

source: This feature is based on several heuristics (script used, trigram matching and language ranking on available languages in the spell-checking backend). This allows it to automatically switch language in a multi-language document.
tr: Bu özellik, çeşitli buluşsal yöntemlere (kullanılan betik, trigram eşleştirme ve yazım denetimi arka ucundaki kullanılabilir dillerdeki dil sıralaması) dayalıdır. Bu, çok dilli bir belgede dilin kendiliğinden değiştirilebilmesine olanak tanır.

source: Automatic spell checking enabled by default
tr: Kendiliğinden yazım denetimi öntanımlı olarak etkin

source: If a mark is placed in this checkbox, the spelling of words will be check in your document as you type them. Misspelled will have a red line drawn under them.
tr: Bu onay kutusuna bir işaret konulursa siz yazarken sözcüklerin yazılışı belgenizde denetlenecektir. Yanlış yazılanların altlarına kırmızı bir çizgi çizilir.

source: Skip all uppercase words
tr: Tümü BÜYÜK harfli sözcükleri atla

source: If a mark is placed in this checkbox, the spelling of any word which consists of all capital letters will not be checked.
tr: Bu onay kutusu işaretlenirse tamamı BÜYÜK harflerden oluşan sözcüklerin yazım denetimi yapılmaz.

source: This is useful for document using a large number of acronyms. If this box is left unchecked, most of those acronyms will be incorrectly marked. By placing a mark in this checkbox, the acronyms will not be marked as misspelled.
tr: Bu, çok sayıda kısaltma kullanan belgeler için kullanışlıdır. Bu kutu işaretlenmezse bu kısaltmaların çoğu yanlış işaretlenecektir. Bu onay kutusu işaretlendiğinde, kısaltmalar yanlış yazılmış olarak işaretlenmez.

source: Skip run-together words
tr: Bitişik sözcükleria atla

source: If this box is not checked, then words that appear in the dictionary separately, but have been run together, are considered to be spelling errors. Examples of such words are shutout, cannot, and blackout.
tr: Bu kutu işaretlenmemişse sözlükte ayrı olarak görünen ancak bitişik kullanılan sözcükler yazım hatası olarak kabul edilir.

source: Checking this box will help prevent applications from flagging website and email addresses for spelling errors. These addresses often contain words run together.
tr: Bu kutunun işaretlenmesi, uygulamaların web sitesi ve e-posta adreslerini yazım hataları nedeniyle işaretlemesini önlemeye yardımcı olacaktır. Bu adresler genellikle bitişik yazılan sözcükler içerir.

source: Ignored words
tr: Yok sayılan sözcükler

source: The bottom half of the dialog box allows you to designate specific words (they may be specialized terminology, proper names, &etc;) which should be ignored by the spelling program.
tr: İletişim kutusunun alt yarısı, yazım denetleme programı tarafından yok sayılması gereken belirli sözcükleri (özel terminoloji, özel adlar vb. olabilir) belirlemenize olanak tanır.

source: Adding a word to the ignore list
tr: Yok sayılanlar listesine sözcük eklemek

source: To add a word, type the word in the text box and click the <guibutton>Add</guibutton> button.
tr: Bir sözcük eklemek için metin kutusuna sözcüğü girin ve <guibutton>Ekle</guibutton> düğmesine tıklayın.

source: Deleting a word from the ignore list
tr: Yok sayılanlar listesinden bir sözcük silmek

source: To remove a word, select the word in the listbox containing all the currently ignored words by clicking on it with the &LMB;. Now click the <guibutton>Remove</guibutton> button.
tr: Bir sözcüğü silmek için yok sayılan sözcükleri içeren listeden sözcüğü seçin ve üzerine &LMB; ile tıklayın. Sonrasında <guibutton>Kaldır</guibutton> düğmesini kullanın.

source: When you are happy with the changes, simply click <guibutton>Apply</guibutton>.
tr: İstediğiniz değişiklikleri yaptığınızda <guibutton>Uygula</guibutton> düğmesine tıklayın.

source: Clicking on the <guibutton>Defaults</guibutton> button restores all values to their default values.
tr: <guibutton>Öntanımlılar</guibutton> düğmesine tıklamak, tüm değerleri öntanımlı değerlerine geri yükler.
