Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_paths.po
Languages: tr

source: Locations
tr: Konumlar

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: desktop
tr: masaüstü

source: paths
tr: yollar

source: location
tr: konum

source: systemsetting
tr: sistem ayarları

source: This is a module to configure essential paths for the &plasma; desktop.
tr: Bu, &plasma; masaüstü için gerekli olan yolları yapılandırmak için bir modüldür.

source: <screeninfo>Configure some &kde; paths</screeninfo>
tr: <screeninfo>Bazı &kde; yollarını yapılandır</screeninfo>

source: <phrase>Configure some &kde; paths</phrase>
tr: <phrase>Bazı &kde; yollarını yapılandır</phrase>

source: Drives that are automounted at login cannot be used as paths. Such drives will be reverted to defaults during restart of &plasma;.
tr: Kendiliğinden bağlanan sürücüler, bu yollar için kullanılamazlar. Böyle sürücüler, &plasma;’nın yeniden başlatılması sonrası öntanımlı değerlere döndürülürler.

source: Desktop path:
tr: Masaüstü yolu:

source: The Desktop folder contains all the files which you see in a <guilabel>Folder View</guilabel> widget on your desktop. The default path is usually <filename class="directory">~/Desktop</filename> but you can change here the location of this folder.
tr: Masaüstü klasörü, masaüstünüzdeki bir <guilabel>Klasör Görünümü</guilabel> araç takımında gördüğünüz tüm dosyaları içerir. Öntanımlı yol genellikle <filename class="directory">~/Desktop</filename> biçimindedir; ancak bu klasörün konumunu buradan değiştirebilirsiniz.

source: Documents path:
tr: Belgeler yolu:

source: This folder will be used by default to load or save documents from or to.
tr: Bu klasör, belgeleri yüklemek veya kaydetmek için öntanımlı olarak kullanılacaktır.

source: Downloads path:
tr: İndirilenler yolu:

source: This folder will be used by default to save your downloaded items.
tr: Bu klasör, indirdiğiniz ögeleri kaydetmek için öntanımlı olarak kullanılacaktır.

source: Videos path:
tr: Videolar yolu:

source: This folder will be used by default to load or save movies from or to.
tr: Bu klasör öntanımlı olarak filmlerin yüklenmesi veya kaydedilmesi için kullanılacaktır.

source: Pictures path:
tr: Resimler yolu:

source: This folder will be used by default to load or save pictures from or to.
tr: Bu klasör öntanımlı olarak resimlerin yüklenmesi veya kaydedilmesi için kullanılacaktır.

source: Music path:
tr: Müzik yolu:

source: This folder will be used by default to load or save music from or to.
tr: Bu klasör öntanımlı olarak müziklerin yüklenmesi veya kaydedilmesi için kullanılacaktır.

source: If you change a path and click <guibutton>Apply</guibutton> a dialog appears where you can choose to move the content to the new folder or use the new folder without moving the files.
tr: Bir yolu değiştirir ve <guibutton>Uygula</guibutton>’ya tıklarsanız içeriği yeni klasöre taşımayı veya dosyaları taşımadan yeni klasörü kullanmayı seçebileceğiniz bir iletişim kutusu görüntülenir.
