Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol6_filetypes.po
Languages: tr

source: File Associations
tr: Dosya İlişkilendirmeleri

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Systemsettings
tr: sistem ayarları

source: files association
tr: dosya ilişkilendirmesi

source: association
tr: ilişkilendirme

source: Introduction
tr: Giriş

source: One of the most convenient aspects of &kde;, is its ability to automatically match a data file with its application. As an example, when you click on your favorite &calligrawords; document in the filemanager, &kde; automatically starts &calligrawords;, and automatically loads that file into &calligrawords; so you can begin working on it.
tr: &kde;’nin en kullanışlı özelliklerinden bir tanesi de, bir veri dosyasını uygulaması ile eşleştirebilmesidir. Bir örnek olarak, sıkça kullandığınız bir &calligrawords; belgesine tıkladığınızda, &kde;, &calligrawords; yazılımını kendiliğinden başlatır ve o dosyayı hemen üzerinde çalışmaya başlayabilmeniz için &calligrawords;’e yükler.

source: In the example above, the &calligrawords; Data file is <emphasis>associated</emphasis> with &calligrawords; (the application). These file associations are crucial to the functioning of &kde;.
tr: Yukarıdaki örnekte, &calligrawords; veri dosyası &calligrawords; (uygulama) ile <emphasis>ilişkilendirilmiştir</emphasis>. Bu dosya ilişkilendirmeleri, &kde;’nin işlevselliği için elzemdir.

source: When &kde; is installed, it automatically creates hundreds of file associations to many of the most common data types. These initial associations are based on the most commonly included software, and the most common user preferences.
tr: &kde; kurulduğunda, yaygın olarak kullanılan veri türleri için yüzlerce ilişkilendirmeyi kendiliğinden oluşturur. Bu ilişkilendirmeler, sık kullanılan uygulamalar ve kullanıcı tercihleri temel alınarak oluşturulmuştur.

source: Unfortunately, &kde; can not:
tr: &kde;, ne yazık ki şunları yapamaz:

source: predict every possible combination of software and data files
tr: her bir yazılım ve veri dosyasının olası kombinasyonlarını tahmin edemez

source: prepare for file formats not yet invented
tr: henüz bulunmamış dosya biçimlerini bilemez

source: or predict everyone's favorite application for certain file formats
tr: veya belirli dosya türleri için herkesin favori uygulamasını tahmin edemen

source: You can change your current file associations or add new file associations using this module.
tr: Bu modülü kullanarak geçerli dosya ilişkilendirmelerinizi değiştirebilir veya yeni ilişkilendirmeler ekleyebilirsiniz.

source: Each file association is recorded as a &MIME; type. &MIME; stands for <quote>Multipurpose Internet Mail Extensions</quote>. It allows a computer to determine the type of file, without opening and analyzing the format of each and every file.
tr: Her bir dosya ilişkilendirmesi, bir &MIME; türü olarak kaydedilir. &MIME;, <quote>Multipurpose Internet Mail Extensions</quote> (Çok Amaçlı İnternet Posta Uzantısı) kalıbına karşılık gelir. Bilgisayarın, dosyanın türünü onu açmadan algılamasına ve her bir dosyanın biçimini çözümlemesine izin verir.

source: How to use this module
tr: Bu modül nasıl kullanılır

source: You can start this module by opening &systemsettings; and selecting <menuchoice><guimenu>Applications</guimenu> <guimenuitem>File Associations</guimenuitem></menuchoice> in the <guilabel>Personalization</guilabel> category. Alternatively, you can start it by typing <command>kcmshell5 filetypes</command> from the terminal or &krunner;.
tr: Bu modülü, &systemsettings; uygulamasını açıp <guilabel>Kişiselleştirme</guilabel> kategorisinden <menuchoice><guimenu>Uygulamalar</guimenu> <guimenuitem>Dosya İlişkilendirmeleri</guimenuitem></menuchoice>’ni seçebilirsiniz. Alternatif olarak, uçbirimden veya &krunner; uygulamacığından <command>kcmshell5 filetypes</command> yazarak da çalıştırılabilir.

source: The file associations are organized into several categories, and at a minimum you will have:
tr: Dosya ilişkilendirmeleri birden çok kategoriye ayrılmıştır ve en azından şu kategoriler olacaktır:

source: Application
tr: Uygulama (application)

source: Audio
tr: Ses (audio)

source: Image
tr: Görsel (image)

source: Inode
tr: Dosya İndeksi (inode)

source: Message
tr: İleti (message)

source: Multipart
tr: Çoklu Kısım (multipart)

source: Text
tr: Metin (text)

source: Video
tr: Video (video)

source: All of the file associations are sorted into one of these categories.
tr: Dosya ilişkilendirmelerinin hepsi bu kategorilerden birinde bulunur.

source: There is no functional difference between any of the categories. These categories are designed to help organize your file associations, but they do not alter the associations in any way.
tr: Bu kategoriler arasında işlevsellik bakımından bir ayrım yoktur. Dosya ilişkilendirmelerinizi organize etmenize yardımcı olurlar; ancak onları hiçbir şekilde değiştirmezler.

source: The categories are listed in the box labeled <guilabel>Known Types</guilabel>.
tr: Bu kategoriler, <guilabel>Bilinen Türler</guilabel> ile etiketli kutuda listelenirler.

source: You can explore each of these categories, and see the file associations contained within each one, by simply double-clicking on the category name. You will be presented with a list of the associated &MIME; types under that category.
tr: Kategori adına çift tıklayarak bu kategorilerin her birini keşfedebilir ve her birinde bulunan dosya ilişkilendirmelerini görebilirsiniz. O kategorinin altındaki ilişkilendirilmiş &MIME; türlerinin bir listesiyle karşılaşacaksınız.

source: You can also search for a particular &MIME; type by using the search box. The search box is labeled <guilabel>Search for file type or filename pattern...</guilabel> and is located above the category list.
tr: Ayrıca arama kutusunu kullanarak belirli bir &MIME; türünü de arayabilirsiniz. Arama kutusu, <guilabel>Dosya türü veya dosya adı dizgisi ara…</guilabel> ile etiketlidir ve kategori listesinin üzerinde bulunur.

source: Simply type the first letter of the &MIME; type you are interested in. The categories are automatically expanded, and only the &MIME; types that include that letter are displayed.
tr: Yalnızca ilgilendiğiniz &MIME; türünün ilk harfini yazın. Kategoriler kendiliğinden genişletilir ve yalnızca o harfi içeren &MIME; türleri görüntülenir.

source: You can then enter a second character and the &MIME; types will be further limited to &MIME; types containing those two characters.
tr: İkinci bir harfi daha girdiğinizde, &MIME; türleri, yalnızca o harfi içeren &MIME; türlerine sınırlandırılmayı sürdürecektir.

source: Adding a new MIME type
tr: Yeni bir MIME türü eklemek

source: If you want to add a new &MIME; type to your file associations, you can click on the <guibutton>Add...</guibutton> button. A small dialog box will appear. You select the category from the drop down box labeled <guilabel>Group:</guilabel>, and type the &MIME; name in the blank labeled <guilabel>Type name:</guilabel>. Click <guibutton>OK</guibutton> to add the new &MIME; type, or click <guibutton>Cancel</guibutton> to not add any new &MIME; types.
tr: Dosya ilişkilendirmelerinize yeni bir &MIME; türü eklemek istiyorsanız <guibutton>Ekle…</guibutton> düğmesine tıklayabilirsiniz. Küçük bir iletişim kutusu açılacaktır. <guilabel>Grup:</guilabel> ile etiketli açılır menüden kategoriyi seçin ve &MIME; adını <guilabel>Tür adı:</guilabel> yazan boş kutuya girin. Yeni &MIME; türünü eklemeyi bitirmek için <guibutton>Tamam</guibutton>’a, veya &MIME; türü eklemeyi iptal etmek için <guibutton>İptal</guibutton>’e tıklayın.

source: Removing a MIME type
tr: Bir MIME türünü kaldırmak

source: If you want to remove a &MIME; type, simply select the &MIME; type you want to delete by clicking once with the mouse on the &MIME; type name. Then click the button labeled <guibutton>Remove</guibutton>. The &MIME; type will be deleted immediately.
tr: Bir &MIME; türünü kaldırmak için yalnızca &MIME; türü adına bir kez tıklayarak kaldırmak istediğiniz &MIME; türünü seçin. Sonrasında <guibutton>Kaldır</guibutton> yazan düğmeye tıklayın.&MIME; türü anında silinecektir.

source: You can remove only your own &MIME; types.
tr: Yalnızca kendi oluşturduğunuz &MIME; türlerini kaldırabilirsiniz.

source: Editing a MIME types properties
tr: Bir MIME türünün özelliklerini düzenlemek

source: Before you can edit a &MIME; types property, you must first specify which &MIME; type. Simply browse through the categories until you find the &MIME; type you want to edit, then click once on it with the mouse.
tr: Bir &MIME; türü özelliğini düzenlemeden önce, hangi &MIME; türü olduğunu belirtmelisiniz. Düzenlemek istediğiniz &MIME; türünü bulana dek kategorilerde dolanın ve bulunca fareyle üzerine tıklayın.

source: As soon as you have selected the &MIME; type, the current values of the &MIME; type will appear in the module window.
tr: &MIME; türünü seçer seçmez, &MIME; türünün geçerli değeri modül penceresinde görünecektir.

source: You will notice the current values are split into two tabs: <guilabel>General</guilabel> and <guilabel>Embedding</guilabel>
tr: Geçerli değerlerin iki sekmeye ayrıldığını göreceksiniz: <guilabel>Genel</guilabel> ve <guilabel>Gömülüm</guilabel>

source: General
tr: Genel

source: There are 4 properties for each &MIME; type in this tab:
tr: Bu sekmede her bir &MIME; türü için dört adet özellik vardır:

source: <guilabel>Mime Type Icon</guilabel> is the icon that will be visible when using &dolphin; or &konqueror; as a file manager.
tr: <guilabel>MIME Türü Simgesi</guilabel>, dosya yöneticisi olarak &dolphin; veya &konqueror; kullandığınızda görünür olacak simgedir.

source: <guilabel>Filename Patterns</guilabel> is a search pattern which &kde; will use to determine the &MIME; type.
tr: <guilabel>Dosya Adı Dizgileri</guilabel>, &kde;’nin &MIME; türünü belirlemek için kullanacağı bir arama dizgisidir.

source: <guilabel>Description:</guilabel> is a short description of the file type. This is for your benefit only.
tr: <guilabel>Açıklama:</guilabel>, dosya türünün kısa bir açıklamasıdır. Yalnızca sizin işinize yarar.

source: <guilabel>Application Preference Order</guilabel> determines which applications will be associated with the specified &MIME; type.
tr: <guilabel>Uygulama Tercih Sırası</guilabel>, bu belirli &MIME; türüyle hangi uygulamaların ilişkilendirileceğini belirler.

source: Embedding Tab
tr: Gömülüm Sekmesi

source: The Embedding tab allows you to determine if a file will be viewed within a filemanager window, or by starting the application.
tr: Gömülüm sekmesi, bir dosyanın dosya yöneticisi penceresinde görüntülenip görüntülenmeyeceğini veya uygulamanın hemen başlatılıp başlatılmayacağını belirlemenize izin verir.

source: Changing the Icon
tr: Simgeyi Değiştirmek

source: To change the icon, simply click on the Icon button. A dialog box will appear, which will show you all available icons. Simply click once with the mouse on the icon of your choice, and click <guibutton>OK</guibutton>.
tr: Simgeyi değiştirmek için yalnızca Simge düğmesine tıklayın. Tüm kullanılabilir simgelerinizi gösteren bir iletişim kutusu açılacaktır. Seçiminizin üzerine fareyle bir kez tıklayın ve <guibutton>Tamam</guibutton> düğmesine basın.

source: Editing the MIME type patterns
tr: MIME türü dizgilerini düzenlemek

source: The box labeled <guilabel>Filename Patterns</guilabel>, determines what files will be included within this &MIME; type.
tr: <guilabel>Dosya Adı Dizgileri</guilabel> ile etiketli kutu, bu &MIME; türüyle hangi dosyaların içerileceğini belirler.

source: Usually, files are selected based on their suffix. (Examples: Files that end with <literal role="extension">.wav</literal> are sound files, using the WAV format and files that end in <literal role="extension">.c</literal> are program files written in C).
tr: Dosyalar, genellikle uzantılarına bakılarak seçilirler. (Örnekler: <literal role="extension">.wav</literal> uzantısıyla biten dosyalar ses dosyalarıdır, WAV biçimini kullanırlar; <literal role="extension">.c</literal> ile biten dosyalar ise C dili ile yazılmış program dosyalarıdır).

source: You should enter your filename mask in this combo box.
tr: Dosya adı maskenizi bu çoklu kutuya girmelisiniz.

source: The asterisk (<literal>*</literal>) is a wildcard character that will be used with nearly every &MIME; type mask. A complete discussion of wildcards is beyond the scope of this manual, but it is important to understand that the asterisk (in this context), <quote>matches</quote> any number of characters. As an example: <userinput>*.pdf</userinput> will match <filename>Datafile.pdf</filename>, <filename>Graphics.pdf</filename> and <filename>User.pdf</filename>, but not <filename>PDF</filename>, <filename>Datafile.PDF</filename>, or <filename>.pdf</filename>.
tr: Yıldız (<literal>*</literal>), neredeyse her bir &MIME; türü maskesiyle kullanılacak bir joker karakterdir. Joker karakterlerin genel tanımı bu kılavuzun kapsamının dışındadır; ancak bu bağlamda yıldız karakterinin görevini anlamak önemlidir; bu karakter, herhangi bir sayıdaki karakterle <quote>eşleşir</quote>. Örneğin: <userinput>*.pdf</userinput>; <filename>Datafile.pdf</filename>, <filename>Graphics.pdf</filename> ve <filename>User.pdf</filename> dosyalarıyla eşleşir; ancak <filename>PDF</filename>, <filename>Datafile.PDF</filename> veya <filename>.pdf</filename> dosyasıyla eşleşmez.

source: It is very beneficial to have multiple masks. One for lower case, one for upper case, &etc; This will help ensure that &kde; can determine the file type more accurately.
tr: Birden çok maskeye sahip olmak yararlıdır; biri BÜYÜK biri de küçük harfler için. Bu, &kde;’nin dosya türünü daha kesin belirlemesine yardımcı olur.

source: Editing a MIME types description
tr: Bir MIME türü açıklamasını düzenlemek

source: You can type a short description of the &MIME; type in the text box labeled <guilabel>Description:</guilabel>. This label is to help you, it does not affect the function of the &MIME; type.
tr: <guilabel>Açıklama:</guilabel> metin kutusuna &MIME; türünün kısa bir açıklamasını yazabilirsiniz. Bu etiket, size yardımcı olması içindir; &MIME; türünün işleyişine herhangi bir biçimde etki etmez.

source: Editing the application associations
tr: Uygulama ilişkilendirmelerini düzenlemek

source: There are five buttons (<guibutton>Move Up</guibutton>, <guibutton>Move Down</guibutton>, <guibutton>Add...</guibutton>, <guibutton>Edit...</guibutton> and <guibutton>Remove</guibutton>) and a list box (which lists the applications) which are used to configure the applications.
tr: Uygulamaları yapılandırmak için kullanılan beş adet düğme (<guibutton>Yukarı Taşı</guibutton>, <guibutton>Aşağı Taşı</guibutton>, <guibutton>Ekle…</guibutton>, <guibutton>Düzenle…</guibutton> ve <guibutton>Kaldır</guibutton>) ve bir liste kutusu (uygulamaları listeleyen) bulunur.

source: The list box lists all of the applications associated with a specific &MIME; type. The list is in a specific order. The top application is the first application tried. The next application down the list is the second, &etc;
tr: Liste kutusu, belirli bir &MIME; türü ile ilişkilendirilen tüm uygulamaları lsiteler. Liste, belirli bir sıradadır. En üstteki uygulama, ilk denenen uygulamadır, ikinci ve sonrakiler de o sırayla denenirler.

source: What do you mean there is more than one application per &MIME; type? Why is this necessary?
tr: &MIME; türü başına neden birden çok uygulama var? Buna niye gerek var?

source: We started out by saying that &kde; comes preconfigured with hundreds of file associations. The reality is, each system that &kde; is installed on has a different selection of applications. By allowing multiple associations per &MIME; type, &kde; can continue to operate when a certain application is not installed on the system.
tr: &kde;’nin yüzlerce dosya ilişkilendirmesi ile önceden yapılandırılmış olduğunu söyleyerek başlamıştık. Gerçekte, &kde;’nin kurulu olduğu her sistemde farklı bir uygulama seçkisi vardır. &MIME; türü başına birden çok ilişkilendirmeye izin vererek, &kde;, belirli bir uygulama sistemde kurulu değilse çalışmayı sürdürebilir.

source: As an example:
tr: Örneğin:

source: For the &MIME; type <literal>pdf</literal>, there are two applications associated with this file type. The first program is called &okular;. If your system does not have &okular; installed, then &kde; automatically starts the second application &krita;. As you can see, this will help keep &kde; running strong as you add and subtract applications.
tr: <literal>pdf</literal> &MIME; türü için bu dosya türüyle ilişkilendirilmiş iki adet uygulama vardır. İlkinin adı &okular;. Sisteminizde &okular; kurulu değilse &kde; kendiliğinden ikinci uygulama olan &krita; uygulamasını başlatır. Gördüğünüz gibi, bu, &kde;’nin arka planda siz uygulamaları kurup kaldırsanız bile pürüzsüz bir deneyim yaşatmasını sağlar.

source: We have established that the order is important. You can change the order of the applications by clicking once with the mouse on the application you want to move, and then clicking either <guibutton>Move Up</guibutton> or <guibutton>Move Down</guibutton>. This will shift the currently selected application up or down the list of applications.
tr: Sıranın önemli olduğunu anladık. Uygulamaların sırasını, taşımak istediğiniz uygulamanın üzerine bir kez tıklayarak ve sonrasında ya <guibutton>Yukarı Taşı</guibutton> veya <guibutton>Aşağı Taşı</guibutton> düğmelerini kullanarak değiştirebilirsiniz. Bu, şu anda seçili olan uygulamayı uygulama listesinde aşağı veya yukarı kaydırır.

source: You can add new applications to the list by clicking the button labeled <guibutton>Add...</guibutton>. A dialog box will appear. Using the dialog box, you can select the application you want to use for this &MIME; type. Click <guibutton>OK</guibutton> when you are done, and the application will be added to the current list.
tr: <guibutton>Ekle…</guibutton> ile etiketli düğmeye tıklayarak listeye yeni uygulamalar ekleyebilirsiniz. Bir iletişim kutusu açılır. Bu kutuyu kullanarak, bu &MIME; türü için kullanmak istediğiniz uygulamayı seçebilirsiniz. İşiniz bittiğinde <guibutton>Tamam</guibutton> düğmesine tıklayın ve uygulama geçerli listeye eklenir.

source: To change the options of an application for a particular &MIME; type select it in the list and then press the <guibutton>Edit...</guibutton> button. This opens a new dialog with <guilabel>General</guilabel>, <guilabel>Permissions</guilabel>, <guilabel>Application</guilabel> and <guilabel>Details</guilabel> tabs. On the <guilabel>Application</guilabel> tab you can edit <guilabel>Name:</guilabel>, <guilabel>Description:</guilabel> and <guilabel>Comment:</guilabel>. In the <guilabel>Command:</guilabel> field you can have several place holders following the command, which will be replaced with the actual values when the actual program is run:
tr: Belirli bir &MIME; türü için uygulama seçeneklerini değiştirmek için onu listede seçin ve <guibutton>Düzenle…</guibutton> düğmesine tıklayın. Bu, içinde <guilabel>Genel</guilabel>, <guilabel>İzinler</guilabel>, <guilabel>Uygulama</guilabel> ve <guilabel>Ayrıntılar</guilabel> sekmelerini içeren yeni bir iletişim kutusu açar. <guilabel>Uygulama</guilabel> sekmesinde; <guilabel>Ad:</guilabel>, <guilabel>Açıklama:</guilabel> ve <guilabel>Yorum:</guilabel> alanlarını düzenleyebilirsiniz. <guilabel>Komut:</guilabel> alanında, programın kendisi çalışırken gerçek değerlerle değiştirilecek birden çok yer tutucu eklemeniz olanaklıdır:

source: %f - a single file name
tr: %f — tek bir dosya adı

source: %F - a list of files; use for applications that can open several local files at once
tr: %F — bir dosyalar listesi; birden çok dosyayı aynı anda açabilen uygulamalarda kullanın

source: %u - a single &URL;
tr: %u — tek bir &URL;

source: %U - a list of &URL;s
tr: %U — bir &URL;’ler listesi

source: %d - the folder of the file to open
tr: %d — açılacak dosyanın bulunduğu klasör

source: %D - a list of folders
tr: %D — bir klasörler listesi

source: %i - the icon
tr: %i — simge

source: %m - the mini-icon
tr: %m — ufak simge

source: %c - the caption
tr: %c — başlık

source: You can remove an application (thereby ensuring that the application will never run with this &MIME; type by clicking once on the name of the application, and clicking the <guibutton>Remove</guibutton> button.
tr: <guibutton>Remove</guibutton> düğmesine tıklayarak bir uygulamayı listeden kaldırabilir ve böylelikle bu &MIME; türü ile hiçbir zaman çalışmamasını sağlayabilirsiniz.

source: It is a good idea to use the <guibutton>Move Up</guibutton> and <guibutton>Move Down</guibutton> buttons to adjust the unwanted application to a lower position in the list, rather than deleting the application from the list entirely. Once you have deleted an application, if your preferred application should become compromised, there will not be an application to view the data document.
tr: İstenmeyen uygulamaları listeden kaldırmak yerine <guibutton>Yukarı Taşı</guibutton> ve <guibutton>Aşağı Taşı</guibutton> düğmelerini kullanarak konumlarını düşürmek her zaman daha iyi bir fikirdir. Bir uygulamayı listeden kaldırdıktan sonra yeğlediğiniz uygulama ileride bozulursa dosyanızı görüntülemek için bir uygulama olmayacaktır.

source: Embedding
tr: Gömülüm

source: These settings are valid only for &konqueror; used as file manager, &dolphin; is not able to use embedded views and opens a file always in the associated application.
tr: Bu seçenekler yalnızca &konqueror; dosya yöneticisi olarak kullanılırsa geçerlidir; &dolphin; gömülü görünümleri kullanamaz ve dosyaları her zaman ilişkilendirilen uygulama ile açar.

source: By clicking on the <guilabel>Embedding</guilabel> tab, you are presented with four radio buttons in the <guilabel>Left Click Action in Konqueror</guilabel> group. These determine how the filemanager views the selected &MIME; type:
tr: <guilabel>Gömülüm</guilabel> sekmesine tıklayarak <guilabel>Konqueror’da Sol Tık Eylemi</guilabel> grubunda dört adet radyo düğmesi ile karşılaşırsınız. Bunlar, dosya yöneticisinin seçili &MIME; türünü nasıl görüntülediğini belirler:

source: Show file in embedded viewer
tr: Dosyayı gömülü görüntüleyicide göster

source: If this is selected, the file will be shown <emphasis>within</emphasis> the filemanager window.
tr: Bu seçiliyse dosya, dosya yöneticisi penceresinin <emphasis>içinde</emphasis> gösterilir.

source: Show file in separate viewer
tr: Dosyayı ayrı izleyicide göster

source: This will cause a separate window to be created when showing this &MIME; type.
tr: Bu, geçerli &MIME; türünü gösterirken ayrı bir pencerenin açılmasına neden olur.

source: Use settings for 'application' group
tr: “application” grubu için ayarları kullan

source: This will cause the &MIME; type to use the settings for the &MIME; type group. (if you are editing an audio &MIME; type, then the settings for the audio group are used).
tr: Bu, &MIME; türünün, &MIME; türü için olan ayarları kullanmasını sağlar. (Eğer bir ses &MIME; türünü düzenliyorsanız ses (audio) grubu için olan ayarlar kullanılır).

source: Ask whether to save to disk instead
tr: Diske kaydedilip kaydedilmeyeceğini sor

source: This setting applies only to &konqueror; in browser mode and determines if the file is shown in an embedded viewer or if you are asked to save the file to disk instead.
tr: Bu ayar yalnızca &konqueror; tarayıcı kipinde ve dosyanın gömülü bir görüntüleyicide gösterilip gösterilmeyeceğini veya bunun yerine dosyayı diske kaydetmenizin istenip istenmediğini belirler.
