Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_windowbehaviour.po
Languages: tr

source: Activate
tr: Etkinleştir

source: This simply makes the clicked window active. The mouse click is not passed on to the application within the window.
tr: Bu yalnızca tıklanan pencereyi etkin duruma getirir. Fare tıklaması, pencere içindeki uygulamaya aktarılmaz.

source: Activate and raise
tr: Etkinleştir ve yükselt

source: This makes the clicked window active and raises the window to the top of the display. The mouse click is not passed on to the application within the window.
tr: Bu, tıklanan pencereyi etkin duruma getirir ve pencereyi ekranın üst kısmına yükseltir. Fare tıklaması, pencere içindeki uygulamaya aktarılmaz.

source: Your choices for <guilabel>Mouse wheel</guilabel> are as follows:
tr: <guilabel>Fare tekerleği</guilabel> için seçenekleriniz aşağıdaki gibidir:

source: Scroll
tr: Sar

source: Just scrolls the content within the window.
tr: Yalnızca pencere içindeki içeriği sarar.

source: Activate and scroll
tr: Etkinleştir ve sar

source: This makes the clicked window active and scrolls the content.
tr: Bu, tıklanan pencereyi etkin duruma getirir ve içeriği sarar.

source: Activate, raise and scroll
tr: Etkinleştir, yükselt ve sar

source: This makes the clicked window active, raises the window to the top of the display, and scrolls the content.
tr: Bu, tıklanan pencereyi etkin duruma getirir, pencereyi görüntünün en üstüne yükseltir ve içeriği sarar.

source: Inner Window, Titlebar and Frame
tr: İç Pencere, Başlık Çubuğu ve Çerçeve

source: This bottom section allows you to configure additional actions when clicking on a window with a modifier key pressed.
tr: Bu alt bölüm, bir niteleyici düğmeye basılırken bir pencereye tıklandığında gerçekleştirilen ek eylemleri yapılandırmanıza izin verir.

source: As a <guilabel>Modifier key</guilabel>, you can select between <guilabel>Meta</guilabel> (default) or <guilabel>Alt</guilabel>.
tr: Bir <guilabel>Niteleyici düğme</guilabel> olarak, <guilabel>Meta</guilabel> (öntanımlı) veya <guilabel>Seçenek</guilabel> arasında seçim yapabilirsiniz.

source: Once again, you can select different actions for <mousebutton>Left</mousebutton>, <mousebutton>Middle</mousebutton> and <mousebutton>Right</mousebutton> button clicks and the <guilabel>Mouse wheel</guilabel>.
tr: Bir kez daha; <mousebutton>Sol</mousebutton>, <mousebutton>Orta</mousebutton> ve <mousebutton>Sağ</mousebutton> düğme tıklamaları ve <guilabel>Fare Tekerleği</guilabel>’ne farklı eylemler atayabilirsiniz.

source: Your choices for the mouse buttons are:
tr: Fare düğmeleri için seçenekleriniz şunlardır:

source: Move
tr: Taşı

source: Allows you to drag the selected window around the workspace.
tr: Seçili pencereyi çalışma alanında sürüklemenizi sağlar.

source: Activate, raise and move
tr: Etkinleştir, yükselt ve taşı

source: This makes the clicked window active, raises it to the top of the window stack, and drags the window around the workspace.
tr: Bu, tıklanan pencereyi etkin duruma getirir, onu pencere yığınının en üstüne yükseltir ve pencereyi çalışma alanının etrafında sürükler.

source: Resize
tr: Yeniden boyutlandır

source: Allows you to change the size of the selected window.
tr: Seçili pencerenin boyutunu değiştirmenizi sağlar.

source: Decrease opacity
tr: Matlığı azalt

source: Makes the window more transparent.
tr: Pencereyi daha saydam yapar.

source: Increase opacity
tr: Matlığı artır

source: Makes the window less transparent.
tr: Pencereyi daha az saydam yapar.

source: Your choices for the mouse wheel are:
tr: Fare tekerleği için seçenekleriniz şunlardır:

source: Nothing happens on when scrolling up or down the window's titlebar.
tr: Pencerenin başlık çubuğunda yukarı veya aşağı sarınca bir şey olmaz.

source: Movement
tr: Hareket

source: This page allows you to configure the <guilabel>Snap Zones</guilabel>. These are like a magnetic field along the side of the screen and each window, which will make windows snap alongside when moved near.
tr: Bu sayfa, <guilabel>Tutturma Bölgeleri</guilabel>’ni yapılandırmanıza izin verir. Bunlar, ekranın ve her pencerenin kenarı boyunca uzanan manyetik bir alan gibidir; bu, yakına taşındığında pencerelerin yan yana oturmasını sağlar.

source: Screen edge snap zone
tr: Ekran kenarı tutturma bölgesi

source: Here you can set the snap zone for screen borders. Moving a window within the configured distance will make it snap to the edge of the screen.
tr: Burada ekran kenarlıkları için tutturma bölgesini ayarlayabilirsiniz. Bir pencereyi yapılandırılan uzaklık içinde hareket ettirmek, onu ekranın kenarına yapıştıracaktır.

source: Window snap zone
tr: Pencere tutturma bölgesi

source: Here you can set the snap zone for windows. As with screen borders, moving a window near to another will make it snap to the edge as if the windows were magnetized.
tr: Burada pencereler için tutturma bölgesini ayarlayabilirsiniz. Ekran kenarlıklarında olduğu gibi, bir pencereyi başka bir pencerenin yanına taşımak, sanki pencereler mıknatıslanmış gibi kenara yapışmasına neden olur.

source: Center snap zone
tr: Merkez tutturma bölgesi

source: Here you can set the snap zone for the screen center, &ie; the <quote>strength</quote> of the magnetic field which will make windows snap to the center of the screen when moved near it.
tr: Burada ekran merkezi için tutturma bölgesini, yani pencerelerin yanına taşındığında ekranın merkezine yapışmasını sağlayacak manyetik alanın “kuvvetini” ayarlayabilirsiniz.

source: Snap windows: Only when overlapping
tr: Pencereleri tuttur: Yalnızca örtüştüğünde

source: If checked, windows will not snap together if they are only near each other, they must be overlapping, by the configured amount or less.
tr: İşaretlenirse, pencereler yalnızca birbirine yakınsa birbirine yapışmaz, yapılandırılan miktarda veya daha az miktarda üst üste gelmeleri gerekir.

source: In the <guilabel>Screen Edges</guilabel> settings module in the <guilabel>Workspace Behavior</guilabel> section of the system settings, you can configure windows to be quick-tiled to the whole, half, or quarter of the screen when dragged near the screen edges.
tr: Sistem ayarlarının <guilabel>Çalışma Alanı Davranışı</guilabel> bölümündeki <guilabel>Ekran Kenarları</guilabel> ayarları modülünde, pencereleri ekran kenarlarına yakın sürüklendiğinde ekranın tamamına, yarısına veya çeyreğine tez döşenecek şekilde yapılandırabilirsiniz.

source: Advanced
tr: Gelişmiş

source: In the <guilabel>Advanced</guilabel> panel you can do more advanced fine tuning to the window behavior.
tr: <guilabel>Gelişmiş</guilabel> panelinde, pencere davranışında daha gelişmiş ince ayar yapabilirsiniz.

source: Window unshading
tr: Pencere panjurunu kapat

source: On titlebar hover after
tr: Başlık çubuğuna geldikten şu kadar sonra

source: If this option is enabled, a shaded window will un-shade automatically when the mouse pointer has been over the titlebar for some time. Use the spinbox to configure the delay un-shading.
tr: Bu seçenek etkinleştirilirse fare işaretçisi bir süre başlık çubuğunun üzerindeyken panjuru kapalı bir pencerenin panjuru kendiliğinden açılır. Panjuru kapatma gecikmesini yapılandırmak için döndürme kutusunu kullanın.

source: Window placement
tr: Pencere yerleşimi

source: The placement policy determines where a new window will appear on the screen.
tr: Yerleştirme politikası, ekranda yeni bir pencerenin nerede görüneceğini belirler.

source: In a multi-monitor setup, the screen for windows to appear on is always the active screen (that is, the screen that has the mouse pointer or the focused window; see <link linkend="focus-multiscreen">Multiscreen behavior</link>), with the exception of windows remembering their previous position (see <link linkend="advanced-remember-positions">below</link>).
tr: Çoklu monitör kurulumunda, pencerelerin görüntüleneceği ekran her zaman etkin ekrandır (yani, fare imlecinin veya odaklanmış pencerenin bulunduğu ekran; bkz. <link linkend="focus-multiscreen">Çoklu ekran davranışı</link>), önceki konumlarını anımsayan pencereler dışında (aşağdaki <link linkend="advanced-remember-positions">bağlantıya</link> bakın).

source: Minimal Overlapping
tr: En az çakışan

source: Will place all new windows in such a manner as to overlap existing windows as little as possible.
tr: Tüm yeni pencereleri, var olan pencerelerle olabildiğince az örtüşecek biçimde yerleştirir.

source: Maximized
tr: Ekranı kaplamış

source: Will try to maximize all new windows to fill the whole screen.
tr: Tüm ekranı doldurmak için tüm yeni pencereleri büyütmeye çalışacaktır.

source: Random
tr: Rastgele

source: Will place all new windows in random locations.
tr: Tüm yeni pencereleri rastgele konumlara yerleştirir.

source: Centered
tr: Ortalanmış

source: Will place all new windows in the center of the screen.
tr: Tüm yeni pencereleri ekranın ortasına yerleştirir.

source: In Top-Left Corner
tr: Sol üst köşede

source: Will place all new windows with their top left corner in the top left corner of the screen.
tr: Tüm yeni pencereleri, sol üst köşeleri ekranın sol üst köşesine gelecek şekilde yerleştirir.

source: Under Mouse
tr: Farenin altında

source: Will place all new windows centered under the mouse pointer.
tr: Tüm yeni pencereleri fare işaretçisinin altına ortalayarak yerleştirir.

source: Check the <guilabel>Allow apps to remember the positions of their own windows</guilabel> item to open windows where they previously were rather than by the placement method chosen above. Note that this remembered position includes the screen assignment, so windows may open on a screen other than the active one if this is where they were last located. Note also that this option is only available on X11, not on Wayland, and is only supported by some KDE applications.
tr: Pencereleri yukarıda seçili yerleştirme yöntemi yerine daha önce bulundukları yerde açmak için <guilabel>Destekliyorlarsa uygulamaların pencere konumlarını anımsamalarına izin ver</guilabel> ögesini işaretleyin. Anımsanan bu konumun ekran atamasını içerdiğine dikkat edin, bu nedenle pencereler, en son bulundukları yer burasıysa etkin ekrandan farklı bir ekranda açılabilir. Ayrıca, bu seçeneğin yalnızca X11’de var olduğunu, Wayland’da bulunmadığını ve yalnızca bazı KDE uygulamaları tarafından desteklendiğini unutmayın.

source: If you would like some windows to appear on specific positions, screens, or Virtual Desktops, you can set up <guilabel>Window Rules</guilabel> to configure special window or application settings. You can find this by right-clicking on the titlebar of a window and choosing <guimenu>More Actions</guimenu>, or in the <guilabel>Window Rules</guilabel> module in the <guilabel>Window Management</guilabel> section of system settings.
tr: Bazı pencerelerin belirli konumlarda, ekranlarda veya Sanal Masaüstlerinde görünmesini istiyorsanız özel pencere veya uygulama ayarlarını yapılandırmak için <guilabel>Pencere Kuralları</guilabel> oluşturabilirsiniz. Bunu, bir pencerenin başlık çubuğuna sağ tıklayıp <guimenu>Diğer Eylemler</guimenu>’i seçerek veya <guilabel>Pencere Yönetimi</guilabel> sistem ayarları bölümündeki <guilabel>Pencere Kuralları</guilabel> modülünde bulabilirsiniz.

source: Special windows
tr: Özel pencereler

source: Hide utility windows for inactive applications
tr: Etkin olmayan uygulamalar için izlence pencerelerini gizle

source: When turned on, utility windows (tool windows, torn-off menus, ...) of inactive applications will be hidden and will be shown only when the application becomes active. Note that applications have to mark the windows with the proper window type for this feature to work.
tr: Etkinleştirildiğinde, etkin olmayan uygulamaların izlence pencereleri (araç pencereleri, parçalanmış menüler, …) gizlenecek ve yalnızca uygulama etkin olduğunda gösterilecektir. Bu özelliğin çalışması için uygulamaların pencereleri uygun pencere türüyle işaretlemesi gerektiğini unutmayın.

source: Virtual Desktop behavior
tr: Sanal Masaüstü davranışı

source: Sometimes calling an application will activate an existing window rather than opening a new window. This setting controls what should happen if that activated window is located on a Virtual Desktop other than the current one.
tr: Bazen bir uygulamayı çağırmak, yeni bir pencere açmak yerine var olan bir pencereyi etkinleştirir. Bu ayar, etkinleştirilen pencere geçerli olandan farklı bir Sanal Masaüstü’nde bulunuyorsa ne olacağını denetler.

source: Switch to that Virtual Desktop
tr: Söz konusu Sanal Masaüstü’ne geç

source: Will switch to the Virtual Desktop where the window is currently located.
tr: Pencerenin şu anda bulunduğu Sanal Masaüstü’ne geçer.

source: Choose this option if you would like the active Virtual Desktop to automatically follow windows to their assigned Virtual Desktop.
tr: Etkin Sanal Masaüstü’nün, atanmış Sanal Masaüstü’ne giden pencereleri kendiliğinden izlemesini istiyorsanız bu seçeneği seçin.

source: Bring window to current Virtual Desktop
tr: Pencereyi geçerli Sanal Masaüstü’ne getir

source: Will cause the window to jump to the active Virtual Desktop.
tr: Pencerenin etkin Sanal Masaüstü’ne atlamasına neden olur.

source: Choose this option if you would like windows to always open on the current Virtual Desktop, and the active Virtual Desktop to only switch when navigating there manually.
tr: Pencerelerin her zaman geçerli Sanal Masaüstü’nde açılmasını ve etkin Sanal Masaüstü’nün yalnızca oraya elle gidildiğinde geçiş yapmasını istiyorsanız bu seçeneği seçin.

source: The window stays on the desktop it currently is and the current desktop doesn't change.
tr: Pencere, şu anda olduğu masaüstünde kalır ve geçerli masaüstü değişmez.

source: Choose this option if you would like to keep the windows and desktops as they are.
tr: Pencereleri ve masaüstlerini oldukları gibi bırakmak isterseniz bu seçeneği seçin.
