Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_powerdevil.po
Languages: tr

source: Power Management
tr: Güç Yönetimi

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: System Settings
tr: sistem ayarları

source: power management
tr: güç yönetimi

source: laptop power
tr: dizüstü güç

source: PowerDevil, a Power Management Daemon
tr: PowerDevil, bir güç yönetimi ardalan süreci

source: This module is a configuration tool for managing Power Management in &plasma;. It is a configurator for the PowerDevil daemon.
tr: Bu modül, &plasma;’da Güç Yönetimini yönetmek için bir yapılandırma aracıdır. PowerDevil ardalan süreci için bir yapılandırıcıdır.

source: Through this module, you can define your computer's behavior in various situations, allowing you to save as much energy as possible.
tr: Bu modül aracılığıyla, bilgisayarınızın çeşitli durumlardaki davranışını tanımlayabilir, olabildiğince çok enerji tasarrufu yapmasını sağlayabilirsiniz.

source: Powerdevil works with Solid only and it's integrated in your desktop. You won't even notice it is running, apart from notifications. Moreover, Powerdevil checks your system capabilities first, so you'll see only options available for your system in this module.
tr: Powerdevil yalnızca Solid ile çalışır ve masaüstünüzle tümleşiktir. Bildirimler dışında çalıştığını bile fark etmezsiniz. Ayrıca, Powerdevil önce sistem yeteneklerinizi denetler, böylece bu modülde yalnızca sisteminiz için kullanılabilir olan seçenekleri görürsünüz.

source: Note that PowerDevil does not poll your system. This means that it will not waste energy while trying to save it, as some other power managers do.
tr: PowerDevil’in sisteminizi sorgulamadığını unutmayın. Bu, diğer bazı güç yöneticilerinin yaptığı gibi enerjiyi kurtarmaya çalışırken israf etmeyeceği anlamına gelir.

source: <title>Energy Saving Settings</title>
tr: <title>Enerji Tasarrufu Ayarları</title>

source: This page shows the actual energy saving settings. If a battery is detected you have three tabs with different settings for <guilabel>On AC Power</guilabel>, <guilabel>On Battery</guilabel> and <guilabel>On Low Battery</guilabel> profiles.
tr: Bu sayfa, asıl enerji tasarrufu ayarlarını gösterir. Bir pil algılanırsa <guilabel>Fişe Takılıyken</guilabel>, <guilabel>Pille Çalışırken</guilabel> ve <guilabel>Düşük Pille Çalışırken</guilabel> olarak üç farklı sekme ve profil ayarı açılır.

source: <screeninfo>Energy Saving Settings</screeninfo>
tr: <screeninfo>Enerji Tasarrufu Ayarları</screeninfo>

source: <phrase>Energy Saving Settings</phrase>
tr: <phrase>Enerji Tasarrufu Ayarları</phrase>

source: <para>Energy Saving Settings</para>
tr: <para>Enerji Tasarrufu Ayarları</para>

source: There are a lot of options you can configure for each profile:
tr: Her bir profil için yapılandırabileceğiniz birçok seçenek vardır:

source: Screen brightness
tr: Ekran parlaklığı

source: Sets the screen's brightness using a slider.
tr: Bir sürgü kullanarak ekranın parlaklığını ayarlar.

source: Dim screen
tr: Ekranı karart

source: If checked, the display will be progressively dimmed, until reaching brightness 0, in the amount of time you specify in the spin box.
tr: İşaretlenirse döndürme kutusunda belirttiğiniz süre boyunca parlaklık 0’a ulaşana kadar görüntü kademeli olarak karartılacaktır.

source: Screen Energy Saving
tr: Ekrandan enerji tasarrufu yap

source: Here you can set the timeout for switch off in the spin box.
tr: Döndürme kutusunda kapatma için zaman aşımını buradan ayarlayabilirsiniz.

source: Suspend session
tr: Oturumu askıya al

source: Suspends the session after the selected time to the status <guilabel>Sleep</guilabel>, <guilabel>Hibernate</guilabel>, <guilabel>Shutdown</guilabel> or <guilabel>Lock screen</guilabel>.
tr: Oturumu seçili zamandan sonra <guilabel>Uyut</guilabel>, <guilabel>Derin uykuya geç</guilabel>, <guilabel>Kapat</guilabel> veya <guilabel>Ekranı kilitle</guilabel> durumlarından birine askıya alır.

source: Button events handling
tr: Düğme işlevleri

source: Select actions to perform whenever the laptop lid is closed or a button is pressed.
tr: Dizüstü bilgisayar kapağı kapatıldığında veya bir düğmeye basıldığında gerçekleştirilecek eylemleri seçin.

source: Run Script
tr: Betik çalıştır

source: Activate this option to run a custom script when a profile is loaded, unloaded or after a given amount of time.
tr: Bir profil yüklendiğinde, kaldırıldığında veya belirli bir süre sonra özel bir betik çalıştırmak için bu seçeneği etkinleştirin.

source: <title>Activity Settings</title>
tr: <title>Etkinlik Ayarları</title>

source: Here you can configure the Power Management settings per activity. The settings for each activity can be configured on its own tab.
tr: Burada, etkinlik başına Güç Yönetimi ayarlarını yapılandırabilirsiniz. Her etkinliğin ayarları kendi sekmesinde yapılandırılabilir.

source: <screeninfo>Activity Settings</screeninfo>
tr: <screeninfo>Etkinlik Ayarları</screeninfo>

source: <phrase>Activity Settings</phrase>
tr: <phrase>Etkinlik Ayarları</phrase>

source: <para>Activity Settings</para>
tr: <para>Etkinlik Ayarları</para>

source: Don't use special settings
tr: Özel ayarlar kullanma

source: Use the settings defined on <guilabel>Energy Saving</guilabel> page.
tr: <guilabel>Enerji Tasarrufu</guilabel> sayfasında tanımlanan ayarları kullanın.

source: Define a special behavior
tr: Özel davranış tanımla

source: If this option is chosen, a special behavior for activity can be chosen. If this is a presentation activity, you can check the <guilabel>Never shutdown the screen</guilabel> and <guilabel>Never shutdown the computer or let it go to sleep</guilabel> boxes.
tr: Bu seçenek seçilirse etkinlik için özel bir davranış seçilebilir. Bu bir sunum etkinliğiyse <guilabel>Ekranı asla kapatma</guilabel> ve <guilabel>Bilgisayarı asla kapatma veya uyumasına izin verme</guilabel> kutularını işaretleyebilirsiniz.

source: <title>Advanced Settings</title>
tr: <title>Gelişmiş Ayarlar</title>

source: <screeninfo>Advanced Settings</screeninfo>
tr: <screeninfo>Gelişmiş Ayarlar</screeninfo>

source: <phrase>Advanced Settings</phrase>
tr: <phrase>Gelişmiş Ayarlar</phrase>

source: <para>Advanced Settings</para>
tr: <para>Gelişmiş Ayarlar</para>

source: Battery levels
tr: Pil Düzeyleri

source: These items are only displayed if a battery is detected.
tr: Bu ögeler yalnızca bir pil algılandığında görüntülenir.

source: Low level
tr: Düşük düzey

source: Here you can set the percentage after which the battery will be considered low.
tr: Burada pilin düşük olarak kabul edileceği yüzdeyi ayarlayabilirsiniz.

source: Critical level
tr: Kritik düzey

source: Here you can set the percentage after which the battery will be considered at critical level.
tr: Burada pil düzeyinin kritik olarak kabul edileceği yüzdeyi ayarlayabilirsiniz.

source: At critical level
tr: Kritik düzeyde

source: Defines the action that will be done when battery reaches the critical level.
tr: Pil kritik düzeye geldiğinde yapılacak eylemi tanımlar.

source: Peripheral devices
tr: Çevresel aygıtlar

source: Defines the low level for peripheral devices &eg; a wireless mouse.
tr: Çevresel aygıtlar için düşük düzeyi tanımlar; &eg;. kablosuz fare.

source: Configure Notifications
tr: Bildirimleri Yapılandır

source: If you want a deeper control over your notifications, you can refine them by clicking this button.
tr: Bildirimleriniz üzerinde daha derin bir denetim istiyorsanız bu düğmeye tıklayarak bildirimlerinizi duyarlılaştırabilirsiniz.

source: PowerDevil Runner
tr: PowerDevil Çalıştırıcısı

source: PowerDevil can be manually controlled through &krunner; (<keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo>). This makes changing profile, brightness, governor and more much easier and faster. The runner has various keywords you can enter to access its functions
tr: PowerDevil, &krunner; aracılığıyla elle denetlenebilir (<keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo>). Bu; profil, parlaklık, regülatör ve daha fazlasını değiştirmeyi çok daha kolay ve hızlı hale getirir. Çalıştırıcı, işlevlerine erişmek için girebileceğiniz çeşitli anahtar sözcüklere sahiptir.

source: Runner Keywords
tr: Çalıştırıcı Anahtar Sözcükleri

source: Here comes a list of keywords you can enter in &krunner; to perform PowerDevil related actions.
tr: İşte PowerDevil ile ilgili eylemleri gerçekleştirmek için &krunner;’a girebileceğiniz anahtar sözcüklerin bir listesi.

source: power profile
tr: güç profili

source: You can manually choose a profile using this keyword. All available profiles will be shown in form of &krunner; matches.
tr: Bu anahtar sözcüğü kullanarak elle bir profil seçebilirsiniz. Kullanılabilir tüm profiller &krunner; eşleşmeleri biçiminde gösterilir.

source: <userinput>screen brightness</userinput> or <userinput>dim screen</userinput>
tr: <userinput>ekran parlaklığı</userinput> veya <userinput>ekranı karart</userinput>

source: You can control screen brightness through this keyword. In this form, some &krunner; matches that let you do some common actions will be shown. If you enter a value after the keyword (&eg;: <userinput>Screen Brightness 50</userinput>), the brightness will be set to that value.
tr: Bu anahtar sözcükle ekran parlaklığını denetleyebilirsiniz. Bu biçimde, bazı genel işlemleri yapmanıza izin veren bazı &krunner; eşleşmeleri gösterilecektir. Anahtar sözcükten sonra bir değer girerseniz (&eg;, <userinput>ekran parlaklığı 50</userinput>) parlaklık bu değere ayarlanır.

source: <userinput>suspend</userinput>, <userinput>sleep</userinput>, <userinput>hibernate</userinput>, <userinput>to ram</userinput> or <userinput>to disk</userinput>
tr: <userinput>askıya al</userinput>, <userinput>uyut</userinput>, <userinput>derin uyku</userinput>, <userinput>belleğe</userinput> veya <userinput>diske</userinput>

source: You can set your computer into a low power mode through these keywords. Available methods will be shown as &krunner; matches.
tr: Bu anahtar sözcükler aracılığıyla bilgisayarınızı düşük güç kipine ayarlayabilirsiniz. Kullanılabilir yöntemler &krunner; eşleşmeleri olarak gösterilecektir.
