Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_autostart.po
Languages: tr

source: Autostart
tr: Otomatik Başlatma

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: System Settings
tr: sistem ayarları

source: autostart
tr: kendiliğinden başlat

source: desktop file
tr: masaüstü dosyası

source: script file
tr: betik dosyası

source: Autostart Manager
tr: Otomatik Başlatma Yöneticisi

source: This module is a configuration tool for managing what programs start up with your personal &plasma;. It allows you to add programs or scripts so they automatically run during startup or shutdown of your &plasma; session and to manage them.
tr: Bu modül, kişisel &plasma;’nız ile hangi programların başlatılacağını yönetmek için bir yapılandırma aracıdır. Programları veya betikleri eklemenize izin verir, böylece &plasma; oturumunuz başlatılırken veya kapatılırken kendiliğinden çalıştırılır ve onları ayrıca yönetebilirsiniz.

source: Please note that in this module all changes are immediately applied.
tr: Lütfen bu modülde tüm değişikliklerin anında uygulandığını unutmayın.

source: The program scans <filename>$HOME/.config/autostart/</filename> for applications and login scripts, <filename class="directory">$HOME/.config/plasma-workspace/env</filename> for pre-startup scripts and <filename class="directory">$HOME/.config/plasma-workspace/shutdown</filename> for logout scripts to check what programs and scripts are already there and displays them. It allows you to manage them easily.
tr: Program; <filename>$HOME/.config/autostart/</filename> dosyasını uygulamalar ve otorum açma betikleri, <filename class="directory">$HOME/.config/plasma-workspace/env</filename> dosyasını başlangıç öncesi betikleri ve <filename class="directory">$HOME/.config/plasma-workspace/shutdown</filename> dosyasını oturumu kapatma betikleri için; hangi programların ve betiklerin halihazırda orada olduğunu denetler ve onları görüntüler. Bu araçla ile, bunları kolayca yönetebilirsiniz.

source: Login scripts are <filename class="extension">.desktop</filename> files with a <literal>X-KDE-AutostartScript=true</literal> key. Pre-startup scripts are run earlier and can be used to set environment variables.
tr: Oturum açma betikleri, bir <literal>X-KDE-AutostartScript=true</literal> anahtarı içeren <filename class="extension">.desktop</filename> dosyalarıdır. Başlangıç öncesi betikleri daha önceden çalıştırılır ve çevre değişkenlerini ayarlamak için kullanılabilir.

source: Note that you can change the location of your <filename class="directory">Autostart</filename> folder in <menuchoice><guimenu>Applications</guimenu> <guimenuitem>Locations</guimenuitem></menuchoice> in the <guilabel>Personalization</guilabel> category of the &systemsettings; and set a different folder than <filename class="directory">$HOME/.config/autostart</filename>.
tr: <filename class="directory">autostart</filename> klasörünüzün konumunu, &systemsettings;’nın <guilabel>Kişiselleştirme</guilabel>kategorisinde <menuchoice><guimenu>Uygulamalar</guimenu> <guimenuitem>Konumlar</guimenuitem></menuchoice> bölümünden değiştirebilir ve <filename class="directory">$HOME/.config/autostart</filename> klasöründen başkasına ayarlayabilirsiniz.

source: Please read also <ulink url="help:/kcontrol/kcmsmserver">Desktop Session</ulink> and <ulink url="help:/kcontrol/kded">Background Services</ulink> for information how to configure the startup behavior of your &plasma; session.
tr: &plasma; oturumunuzun başiangıç davranışını yapılandırma hakkında daha fazla bilgi için lütfen <ulink url="help:/kcontrol/kcmsmserver">Masaüstü Oturumu</ulink> ve <ulink url="help:/kcontrol/kded">Arka Plan Hizmetleri</ulink> bölümlerine bakın.

source: Some &kde; applications handle the autostart behavior on their own, &eg; you can enable or disable autostart of an application in the settings dialog (&kalarm;) or you have to use <menuchoice><guimenu>File</guimenu><guimenuitem>Quit</guimenuitem></menuchoice> (&konversation;, &kopete;), otherwise the application is still running in the systemtray and will be restarted on next login.
tr: Bazı &kde; uygulamaları, kendiliğinden başlatma davranışını kendileri yapılandırırlar; &eg;, bir uygulamanın otomatik başlatmasını onun ayarlar iletişim kutusunda etkinleştirebilir veya devre dışı bırakabilirsiniz (&kalarm;) veya <menuchoice><guimenu>Dosya</guimenu><guimenuitem>Çık</guimenuitem></menuchoice> seçeneğini kullanmalısınız (&konversation;, &kopete;), yoksa uygulama sistem tepsisinde çalışmayı sürdürür ve bir sonraki oturum açmada yeniden başlatılır.

source: Migration from &kde; Workspaces 4
tr: &kde; Çalışma Alanları 4’den göç

source: To migrate your personal autostart setting from &kde; Workspaces 4:
tr: Kişisel otomatik başlatma ayarlarınızı &kde; Çalışma Alanları 4’ten aktarmak için:

source: Copy desktop files from <filename class="directory">$HOME/.kde/Autostart</filename> to <filename class="directory">$HOME/.config/autostart</filename>
tr: Masaüstü dosyalarını <filename class="directory">$HOME/.kde/Autostart</filename> konumundan <filename class="directory">$HOME/.config/autostart</filename> konumuna taşı

source: Copy pre startup script files from <filename class="directory">$HOME/.kde/Autostart</filename> to <filename class="directory">$HOME/.config/plasma-workspace/env</filename>
tr: Başlangıç öncesi betikleri dosyalarını <filename class="directory">$HOME/.kde/Autostart</filename> konumundan <filename class="directory">$HOME/.config/plasma-workspace/env</filename> konumuna taşı

source: Copy shutdown script files from <filename class="directory">$HOME/.kde/Autostart</filename> to <filename class="directory">$HOME/.config/plasma-workspace/shutdown</filename>
tr: Kapatma betikleri dosyalarını <filename class="directory">$HOME/.kde/Autostart</filename> konumundan <filename class="directory">$HOME/.config/plasma-workspace/shutdown</filename> konumuna taşı

source: Disabling Autostart Files Provided by Your Distribution
tr: Dağıtımınız Tarafından Sağlanan Otomatik Başlatma Dosyalarını Devre Dışı Bırakma

source: The correct way to disable an autostart item, for example the printer-applet if you use printer from time to time, is to copy its <filename class="extension">.desktop</filename> file to your personal autostart folder. Anything of the same name in <filename class="directory">$HOME/.config/autostart</filename> overrides the <filename class="extension">.desktop</filename> file in the default package. Add the following line to the copied <filename class="extension">.desktop</filename> file:
tr: Bir otomatik başlatma ögesini; örneğin arada sırada yazıcınızı kullanıyorsanız bir yazıcı uygulamacığını, devre dışı bırakmanın doğru yolu, onun <filename class="extension">.desktop</filename> dosyasını kendi otomatik başlatma klasörünüze taşımaktır. <filename class="directory">$HOME/.config/autostart</filename> konumundaki aynı adlı herhangi bir şey, öntanımlı paketteki <filename class="extension">.desktop</filename> dosyasını geçersiz kılar. Kopyalanan <filename class="extension">.desktop</filename> dosyasına şu satırı ekleyin:

source: Files display
tr: Dosyalar görüntüsü

source: The main part of the module displays the programs that are loaded when &plasma; starts and scripts that are run when &plasma; starts or shutdowns.
tr: Modülün ana kısmı, &plasma; başlatıldığında yüklenen programları ve &plasma; başlatıldığında veya kapatıldığında çalışan betikleri görüntüler.

source: Icon
tr: Simge

source: This column shows the icon of the program or script you want to start with &plasma;. The icon is extracted from the Desktop file from the Icon key for a program and is the default icon for a script.
tr: Bu sütun, &plasma; ile başlatmak istediğiniz programın veya betiğin simgesini gösterir. Simge, bir programın .desktop dosyasının Icon anahtarından çıkarılır ve betiğin öntanımlı simgesidir.

source: Name
tr: Ad

source: This column shows the name of the program or script you want to start with &plasma;. The name is extracted from the <filename class="extension">.desktop</filename> file from the <literal>Name</literal> key for a program and is the filename for a script.
tr: Bu sütun, &plasma; ile başlatmak istediğiniz programın veya betiğin adını gösterir. Ad, bir programın <filename class="extension">.desktop</filename> dosyasının <literal>Name</literal> anahtarından çıkarılır ve betiğin dosya adıdır.

source: Properties
tr: Özellikler

source: This button is only shown when you hover the item with the mouse pointer. The button (only enabled for programs and login scripts &ie; <filename class="extension">.desktop</filename> files) allows you to change the properties of the program or script. You have general properties, permissions properties, a preview when applicable, and properties related to the application or login script. The default command is extracted from the <filename class="extension">.desktop</filename> file from the <literal>Exec</literal> key.
tr: Bu düğme yalnızca ögenin üzerine fare imleciyle geldiğinizde gösterilir. Düğme (yalnızca programlar ve oturum açma betikleri; &ie;, <filename class="extension">.desktop</filename> dosyaları için etkindir), programın veya betiğin özelliklerini değiştirmenize olanak tanır. Genel özelliklere, izin özelliklerine, uygun olduğunda bir önizlemeye ve uygulama veya oturum açma betiğiyle ilgili özelliklere sahipsiniz. Öntanımlı komut, <filename class="extension">.desktop</filename> dosyasının <literal>Exec</literal> anahtarından çıkarılır.

source: For a logout script, the command is the path to the script and can not be modified.
tr: Oturum kapatma betiği için komut, betiğe giden yoldur ve değiştirilemez.

source: Remove
tr: Kaldır

source: This button is only shown when you hover the item with the mouse pointer. Pressing the <guibutton>&minus;</guibutton> button will immediately remove the Desktop file for the program or the script or symbolic link in the <filename class="directory">Autostart</filename> folder.
tr: Bu düğme yalnızca ögenin üzerine fare imleciyle geldiğinizde gösterilir. <guibutton>&minus;</guibutton> düğmesine basmak, programın Desktop dosyasını veya <filename class="directory">Autostart</filename> klasöründeki betiği veya sembolik bağlantıyı hemen kaldıracaktır.

source: Actions
tr: Eylemler

source: On the bottom, you have the combined <guibutton>Add...</guibutton> button to choose the type of item you want to add. You can add programs and login or logout scripts.
tr: Altta, eklemek istediğiniz öge türünü seçmek için birleştirilmiş <guibutton>Ekle…</guibutton> düğmesi vardır. Programlar ve oturum açma veya oturum kapatma betikleri ekleyebilirsiniz.

source: Add Program
tr: Program Ekle

source: Clicking this item displays the standard &plasma; <guilabel>Choose Application</guilabel> dialog and allows you to choose which program you want to start. After choosing the program, clicking <guibutton>OK</guibutton> brings you the properties for this program.
tr: Bu ögeye tıklandığında standart &plasma; <guilabel>Uygulama Seç</guilabel> iletişim kutusu açılır ve hangi programı başlatmak istediğinizi seçmenize olanak tanır. Programı seçtikten sonra, <guibutton>Tamam</guibutton>’a tıklayarak bu programa ait özellikleri görebilirsiniz.

source: This will copy the program <filename class="extension">.desktop</filename> file in your <filename class="directory">Autostart</filename> folder.
tr: Bu, programın <filename class="extension">.desktop</filename> dosyasını <filename class="directory">autostart</filename> klasörünüze kopyalar.

source: Add Login Script...
tr: Oturum Açma Betiği Ekle…

source: This item opens a dialog that asks you for the location of the script you want to add. Scripts set to run on login will have a corresponding <filename class="extension">.desktop</filename> file created in your <filename class="directory">Autostart</filename> folder and will be run during Plasma startup.
tr: Bu, eklemek istediğiniz betiğin konumunu soran bir iletişim kutusu açar. Oturum açılışında çalıştırılmak üzere ayarlanmış betiklerin <filename class="directory">autostart</filename> klasörünüzde oluşturulmuş ilişkili bir <filename class="extension">.desktop</filename> dosyası vardır ve Plasma başlangıcında çalıştırılacaktır.

source: Add Logout Script...
tr: Oturum Kapatma Betiği Ekle…

source: This item opens a dialog that asks you for the location of the script you want to add. Scripts set on to be run on logout are copied or symlinked in the <filename class="directory">$HOME/.config/plasma-workspace/shutdown</filename> directory and will be automatically run during &plasma; shutdown after the user has logged out.
tr: Bu, eklemek istediğiniz betiğin konumunu soran bir iletişim kutusu açar. Oturumu kapanışında çalıştırılmak üzere ayarlanmış betikler <filename class="directory">$HOME/.config/plasma-workspace/shutdown</filename> dizinine kopyalanır veya sembolik bağlantı oluşturulur ve kullanıcı oturumu kapattıktan sonta &plasma; kapanışında kendiliğinden çalıştırılacaktır.
