Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_desktopthemedetails.po
Languages: tr

source: Plasma Style
tr: Plasma Biçemi

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: System Settings
tr: sistem ayarları

source: desktop
tr: masaüstü

source: style
tr: biçem

source: theme
tr: tema

source: &plasma; comes with multiple styles. The &plasma; style defines how the different components of &plasma; are displayed (&eg; Plasmoids, panels, widgets).
tr: &plasma;, birden çok biçemle birlikte gelir. &plasma; biçemi, &plasma;’nın değişik bileşenlerinin (&eg;; Plasmoid’ler, paneller, araç takımları) nasıl görüntülendiğini tanımlar.

source: Here's a screenshot of the &plasma; style manager
tr: İşte &plasma; biçem yöneticisinin bir ekran görüntüsü

source: Customizing &plasma; style
tr: &plasma; biçemini özelleştirmek

source: In this module you can:
tr: Bu modülde şunları yapabilirsiniz:

source: install and choose &plasma; styles
tr: &plasma; biçemleri kurmak ve seçmek

source: edit &plasma; styles
tr: &plasma; biçemlerini düzenlemek

source: remove &plasma; styles
tr: &plasma; biçemlerini kaldırmak

source: It is possible to filter the style list using the <guilabel>Search...</guilabel> field above the grid. Moreover, you can use the combo box next to this field to show only the <guimenuitem>Light Themes</guimenuitem>, the <guimenuitem>Dark Themes</guimenuitem> or the <guimenuitem>Color scheme compatible</guimenuitem> themes.
tr: Biçem listesini, ızgaranın üzerindeki <guilabel>Ara…</guilabel> alanını kullanarak süzebilirsiniz. Dahası, bu alanın yanındaki çoklu kutuyu kullanarak yalnızca <guimenuitem>Açık Temalar</guimenuitem>, <guimenuitem>Koyu Temalar</guimenuitem>’ı veya <guimenuitem>Renk şeması uyumlu</guimenuitem> temaları gösterecek biçimde ayarlayabilirsiniz.

source: If you want to remove a style, use the <inlinemediaobject><imageobject><imagedata fileref="edit-delete.png" format="PNG"/></imageobject></inlinemediaobject> overlay icon at the bottom right of the style icon. To undo this action click on the <inlinemediaobject><imageobject><imagedata fileref="edit-undo.png" format="PNG"/></imageobject></inlinemediaobject> icon. If you hit the <guibutton>Apply</guibutton> button the styles selected for removal are actually deleted, so you cannot undo individual or all deletions.
tr: Bir biçemi kaldırmak istiyorsanız biçem simgesinin sağ alt köşesindeki <inlinemediaobject><imageobject><imagedata fileref="edit-delete.png" format="PNG"/></imageobject></inlinemediaobject> kaplama simgesini kullanın. Bu eylemi geri almak için <inlinemediaobject><imageobject><imagedata fileref="edit-undo.png" format="PNG"/></imageobject></inlinemediaobject> simgesine tıklayın. <guibutton>Uygula</guibutton> düğmesine basarsanız kaldırılmak üzere imlenmiş biçemler gerçekten silinir ve bu işlemi geri alamazsınız.

source: If the plasma-sdk package is installed on your system, a button appears hovering a style preview and lets you start the <application>Plasma Theme Explorer</application>.
tr: Sisteminizde plasma-sdk paketi kuruluysa bir biçem önizlemesinin üzerine geldiğinizde bir düğme görünür ve <application>Plasma Tema Gezgini</application>’ni başlatmanıza izin verir.

source: For more technical information visit <ulink url="https://develop.kde.org/docs/plasma/theme/theme-details/">this page</ulink>.
tr: Ek teknik bilgi için <ulink url="https://develop.kde.org/docs/plasma/theme/theme-details/">bu sayfayı</ulink> ziyaret edin.

source: <guilabel>Get New Plasma Styles...</guilabel>
tr: <guilabel>Yeni Plasma Biçemleri Al…</guilabel>

source: You need to be connected to the Internet to use it. Clicking on this button will display a dialog where you can choose a new plasma style. Clicking on <guibutton>Install</guibutton> in the dialog will install the chosen &plasma; style and after you <guibutton>Close</guibutton> the installer your new style is immediately available.
tr: Kullanmak için internete bağlı olmanız gerekir. Bu düğmeye tıklamak, yeni bir Plasma biçemini seçebileceğiniz bir iletişim kutusu açar. <guibutton>Kur</guibutton> düğmesine tıklamak, seçili &plasma; biçemini kurar ve Kur ekranını <guibutton>Kapat</guibutton>’tığınızda yeni biçemi hemen kullanabilirsiniz.

source: <screeninfo>Get New Plasma Styles...</screeninfo>
tr: <screeninfo>Yeni Plasma Biçemleri Al…</screeninfo>

source: <phrase>Get New Plasma Styles...</phrase>
tr: <phrase>Yeni Plasma Biçemleri Al…</phrase>

source: Install from File...
tr: Dosyadan Kur…

source: If you downloaded new styles from the internet, you can use this to browse to the location of those newly downloaded styles. Clicking on this button will bring you the file dialog to point to the &plasma; style tarball you have on your disk.
tr: İnternetten yeni biçemler indirdiyseniz bu yeni indirilen biçemlerin konumuna göz atmak için bunu kullanabilirsiniz. Bu düğmeye tıklamak, size diskinizde bulunan &plasma; biçemi arşiv paketini seçmenizi sağlayacak dosya iletişim kutusunu açar.

source: Clicking <guibutton>Open</guibutton> in this dialog will install the style you pointed to and make it available in the style list.
tr: Bu iletişim kutusunda işaret ettiğiniz dosya için <guibutton>Aç</guibutton> düğmesine tıklamak biçemi kurar ve biçem listesinde kullanılabilir yapar.
