Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_history.po
Languages: tr

source: History Sidebar
tr: Geçmiş Kenar Çubuğu

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Systemsettings
tr: Sistem Ayarları

source: history
tr: geçmiş

source: This dialog allows you to configure the history sidebar.
tr: Bu iletişim kutusu, geçmiş kenar çubuğunu yapılandırmanıza izin verir.

source: Limits
tr: Sınırlar

source: The options in this section can be used to set the maximum size of your history and set a time after which items are automatically removed.
tr: Bu bölümdeki seçenekler, geçmişinizin en büyük boyutunu ayarlamak ve ögelerin kendiliğinden kaldırılacağı süreyi belirlemek için kullanılabilir.

source: Custom Font
tr: Özel Yazıtipi

source: Here you can also set different fonts for new and old &URL;s by selecting the <guibutton>Choose Font</guibutton> button.
tr: Burada ayrıca <guibutton>Yazıtipi Seç</guibutton> düğmesini seçerek yeni ve eski &URL;’ler için farklı yazıtipleri ayarlayabilirsiniz.

source: Details
tr: Ayrıntılar

source: The <guilabel>Detailed tooltips</guilabel> check box controls how much information is displayed when you hover the mouse pointer over an item in the history page.
tr: <guilabel>Ayrıntılı araç ipuçları</guilabel> onay kutusu, geçmiş sayfasındaki bir ögenin üzerine fare işaretçisini getirdiğinizde ne kadar bilginin görüntüleneceğini denetler.

source: If checked the number of times visited and the dates of the first and last visits are shown, in addition to the URL.
tr: İşaretlenmişse URL’nin yanı sıra, ziyaret sayısı ve ilk ve son ziyaret tarihleri ​​de gösterilir.

source: Selecting <guibutton>Clear History</guibutton> will clear out the entire history.
tr: <guibutton>Geçmişi Temizle</guibutton>’yi seçmek, tüm geçmişi temizleyecektir.
