Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_windowbehaviour.po
Languages: tr

source: Window Behavior
tr: Pencere Davranışı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: system settings
tr: sistem ayarları

source: actions
tr: eylemler

source: window
tr: pencere

source: window placement
tr: pencere yerleşimi

source: window size
tr: pencere boyutu

source: window management
tr: pencere yönetimi

source: window behavior
tr: pencere davranışı

source: focus
tr: odak

source: raise
tr: yükselt

source: titlebar
tr: başlık çubuğu

source: screen
tr: ekran

source: snap
tr: tuttur

source: In the upper part of this control module you can see several tabs: <guilabel>Focus</guilabel>, <guilabel>Titlebar Actions</guilabel>, <guilabel>Window Actions</guilabel>, <guilabel>Movement</guilabel> and <guilabel>Advanced</guilabel>. In the <guilabel>Focus</guilabel> panel you can configure how windows gain or lose focus, &ie; become active or inactive. Using <guilabel>Titlebar Actions</guilabel> and <guilabel>Window Actions</guilabel> you can configure how titlebars and windows react to mouse clicks. <guilabel>Movement</guilabel> allows you to configure how windows move and place themselves when started. The <guilabel>Advanced</guilabel> options cover some specialized options like <quote>window shading</quote>.
tr: Bu denetim modülünün üst kısmında birkaç sekme görebilirsiniz: <guilabel>Odak</guilabel>, <guilabel>Başlık Çubuğu Eylemleri</guilabel>, <guilabel>Pencere Eylemleri</guilabel>, <guilabel>Hareket</guilabel> ve <guilabel>Gelişmiş</guilabel>. <guilabel>Odak</guilabel> panelinde pencerelerin nasıl odak alıp kaybettiklerini; &ie; etkin veya devre dışı olduklarını yapılandırabilirsiniz. <guilabel>Başlık Çubuğu Eylemleri</guilabel> ve <guilabel>Pencere Eylemleri</guilabel> sekmeleriyle, başlık çubuklarının ve pencerelerin fare tıklamalarına nasıl tepki verdiğini; <guilabel>Hareket</guilabel> ile de pencerelerin başlatıldıklarında kendilerini nasıl taşıyıp yerleştirdiklerini yapılandırırsınız. <guilabel>Gelişmiş</guilabel> seçenekler, <quote>pencere panjurlama</quote> gibi gelişmiş özellikleri barındırır.

source: Please note that the configuration in this module will not take effect if you do not use &plasma;'s native window manager, &kwin;. If you do use a different window manager, please refer to its documentation for how to customize window behavior.
tr: &plasma;’nın yerel pencere yöneticisi &kwin;’i kullanmazsanız bu modüldeki yapılandırmanın etkili olmayacağını lütfen unutmayın. Farklı bir pencere yöneticisi kullanıyorsanız lütfen pencere davranışını nasıl özelleştireceğinizle ilgili belgelere bakın.

source: Focus
tr: Odak

source: The <quote>focus</quote> of the workspace refers to the window which the user is currently working on. The window with focus is often referred to as the <quote>active window</quote>.
tr: Çalışma alanının <quote>odak</quote>’ı, kullanıcının o anda üzerinde çalıştığı pencereyi ifade eder. Odaklı pencere genellikle <quote>etkin pencere</quote> olarak adlandırılır.

source: Focus does not necessarily mean the window is the one at the front &mdash; this is referred to as <quote>raised</quote>, and although this is configured here as well, focus and raising of windows are configured independently.
tr: Odak, pencerenin ön tarafta olduğu anlamına gelmez &mdash; buna <quote>yükseltilmiş</quote> denir ve bu burada da yapılandırılmış olsa da pencerelerin odaklanması ve yükseltilmesi bağımsız olarak yapılandırılır.

source: Windows activation policy
tr: Pencere etkinleştirme politikası

source: There are six methods &kwin; can use to determine the current focus:
tr: &kwin;’in geçerli odağı belirlemek için kullanacağı altı yöntem vardır:

source: Click to focus
tr: Odak için tıkla

source: A window becomes active when you click into it. This behaviour is common on other operating systems and likely what you want.
tr: Üzerine tıkladığınızda bir pencere etkin duruma gelir. Bu davranış, diğer işletim sistemlerinde yaygındır ve büyük olasılıkla sizin istediğiniz şeydir.

source: Click to focus (mouse precedence)
tr: Odak için tıkla (fare önceliği)

source: This is mostly the same as <guilabel>Click to focus</guilabel>. If an active window has to be chosen by the system (&eg; because the currently active one was closed) the window under the mouse is the preferred candidate. Unusual, but possible variant of <guilabel>Click to focus</guilabel>.
tr: Bu, çoğunlukla <guilabel>Odak için tıkla</guilabel> ile aynıdır. Sistem tarafından etkin bir pencerenin seçilmesi gerekiyorsa (&eg;,. o anda etkin olan kapalı olduğu için), farenin altındaki pencere tercih edilen adaydır. Alışılmadık; ancak <guilabel>Odak için tıkla</guilabel>’nın olası bir çeşididir.

source: Focus follows mouse
tr: Odak fareyi izler

source: Moving the mouse pointer actively over a normal window activates it. New windows such as the mini command line invoked with <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> will receive the focus, without you having to point the mouse at them explicitly. &eg; windows randomly appearing under the mouse will not gain the focus. Focus stealing prevention takes place as usual. Think as <guilabel>Click to focus</guilabel> just without having to actually click.
tr: Fare işaretçisini etkin olarak normal bir pencere üzerinde hareket ettirmek onu etkinleştirir. <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> ile çağrılan mini komut satırı gibi yeni pencereler, fareyi açıkça onlara doğrultmanıza gerek kalmadan odağı alacaktır. Örneğin, farenin altında rastgele görünen pencereler odağı kazanmayacaktır. Odak çalma önleme her zamanki gibi gerçekleşir. Gerçekten tıklamanıza gerek kalmadan <guilabel>Odak için tıkla</guilabel> gibi düşünün.

source: In other window managers, this is sometimes known as <quote>Sloppy focus follows mouse</quote>.
tr: Diğer pencere yöneticilerinde bu bazen <quote>Fareyi takip eden özensiz odak</quote> olarak bilinir.

source: Focus follows mouse (mouse precedence)
tr: Odak fareyi izler (fare önceliği)

source: This is mostly the same as <guilabel>Focus follows mouse</guilabel>. If an active window has to be chosen by the system (&eg; because the currently active one was closed) the window under the mouse is the preferred candidate. Choose this, if you want a hover controlled focus.
tr: Bu çoğunlukla <guilabel>Odak fareyi izler</guilabel> ile aynıdır. Sistem tarafından etkin bir pencerenin seçilmesi gerekiyorsa (&eg;,. o anda etkin olan kapalı olduğu için), farenin altındaki pencere tercih edilen adaydır. Üzerine gelme denetimli bir odak istiyorsanız bunu seçin.

source: Focus under mouse
tr: Odak farenin altında

source: The window that happens to be under the mouse pointer becomes active. If the mouse is not over a window (for instance, it's over the desktop wallpaper) the last window that was under the mouse has focus. New windows such as the mini command line invoked with <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> will not receive the focus, you must move the mouse over them to type.
tr: Fare imlecinin altında bulunan pencere etkin duruma gelir. Fare bir pencerenin üzerinde değilse (örneğin, masaüstü duvar kağıdının üzerindeyse) farenin altındaki son pencere odaklanır. <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> ile çağrılan mini komut satırı gibi yeni pencereler odağı almaz, yazmak için fareyi üzerilerine getirmeniz gerekir.

source: Focus strictly under mouse
tr: Odak katıca farenin altında

source: Similar to <guilabel>Focus under mouse</guilabel>, but even more strict with its interpretation. Only the window under the mouse pointer is active. If the mouse pointer is not over a window, no window has focus. New windows such as the mini command line invoked with <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> will not receive the focus, you must move the mouse over them to type.
tr: <guilabel>Odak farenin altında</guilabel>’ya benzer; ancak yorumuyla daha da katıdır. Yalnızca fare işaretçisinin altındaki pencere etkindir. Fare işaretçisi bir pencerenin üzerinde değilse hiçbir pencerenin odağı yoktur. <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> ile çağrılan mini komut satırı gibi yeni pencereler odağı almaz, yazmak için fareyi üzerilerine getirmeniz gerekir.

source: Note that <guilabel>Focus under mouse</guilabel> and <guilabel>Focus strictly under mouse</guilabel> prevent certain features, such as <guilabel>Focus stealing prevention</guilabel> and the <keycombo action="simul">&Alt;&Tab;</keycombo> walk-through-windows dialog, from working properly.
tr: <guilabel>Odak farenin altında</guilabel> ve <guilabel>Odak katıca farenin altında</guilabel>’nın <guilabel>Odak çalma koruması</guilabel> ve <keycombo action="simul">&Alt;&Tab;</keycombo> gibi bazı özelliklerin düzgün çalışmasını önlediğini unutmayın.

source: Delay focus by
tr: Odak gecikmesi

source: This is the delay after which the window the mouse pointer is over will automatically receive focus.
tr: Bu, fare işaretçisinin üzerinde bulunduğu pencerenin kendiliğinden odağı alacağı gecikmedir.

source: Focus stealing prevention
tr: Odak çalma koruması

source: This option specifies how much KWin will try to prevent unwanted focus stealing caused by unexpected activation of new windows.
tr: Bu seçenek, KWin’in yeni pencerelerin beklenmedik şekilde etkinleştirilmesinden kaynaklanan istenmeyen odak çalmayı ne kadar engellemeye çalışacağını belirtir.

source: None
tr: Yok

source: Prevention is turned off and new windows always become activated.
tr: Önleme kapatılır ve yeni pencereler her zaman etkinleştirilir.

source: <guilabel>Low</guilabel>
tr: <guilabel>Düşük</guilabel>

source: Prevention is enabled; when some window does not have support for the underlying mechanism and KWin cannot reliably decide whether to activate the window or not, it will be activated. This setting may have both worse and better results than the medium level, depending on the applications.
tr: Önleme etkindir; bazı pencerelerin altta yatan mekanizma için desteği olmadığında ve KWin pencereyi etkinleştirip etkinleştirmemeye güvenilir bir şekilde karar veremediğinde, etkinleştirilir. Bu ayar, uygulamalara bağlı olarak orta düzeyden hem daha kötü hem de daha iyi sonuçlara sahip olabilir.

source: Medium
tr: Orta

source: Prevention is enabled.
tr: Önleme etkindir.

source: High
tr: Yüksek

source: New windows get activated only if no window is currently active or if they belong to the currently active application. This setting is probably not really usable when not using mouse focus policy.
tr: Yeni pencereler, yalnızca şu anda etkin pencere yoksa veya o anda etkin olan uygulamaya aitlerse etkinleştirilir. Bu ayar, büyük olasılıkla fare odağı politikası kullanılmadığında gerçekten kullanılamaz.

source: Extreme
tr: Çok Yüksek

source: All windows must be explicitly activated by the user.
tr: Tüm pencereler açıkça kullanıcı tarafından etkinleştirilmelidir.

source: Windows that are prevented from stealing focus are marked as demanding attention, which by default means their taskbar entry will be highlighted. This can be changed in the Notifications control module.
tr: Odak çalması engellenen pencereler dikkat istiyor olarak işaretlenir, bu da öntanımlı olarak görev çubuğu girişlerinin vurgulanacağı anlamına gelir. Bu, Bildirimler denetim modülünde değiştirilebilir.

source: Raising windows
tr: Pencereleri yükseltme

source: Besides receiving focus, you can also control under which conditions windows get raised, &ie; brought to the front.
tr: Odak almanın yanı sıra, pencerelerin hangi koşullar altında yükseltileceğini; &ie;, öne getirileceğini de denetleyebilirsiniz.

source: You should make sure that at least one of the raising options is enabled, otherwise windows will not be raised at all.
tr: Yükseltme seçeneklerinden en az birinin etkinleştirildiğinden emin olmalısınız, aksi takdirde pencereler hiç kaldırılmaz.

source: <guilabel>Click raises active window</guilabel> will bring a window to the front when it is clicked on. This is enabled by default with a click to focus policy.
tr: <guilabel>Tıklama etkin pencereyi yükseltir</guilabel> üzerine tıklandığında bir pencereyi öne getirir. Bu, odaklanmak için tıkla politikasıyla öntanımlı olarak etkindir.

source: By activating <guilabel>Raise on hover, delayed by</guilabel> you can alternatively bring a window to the front if the mouse pointer is over that window for a specified period of time. You can determine the delay for this option by using the spin box control. This auto-raising option is only available with a hover to focus policy.
tr: <guilabel>Üzerine gelince yükselt; gecikmesi</guilabel> fare işaretçisi belirli bir süre boyunca o pencerenin üzerindeyse alternatif olarak bir pencereyi öne getirebilirsiniz. Döndürme kutusu denetimini kullanarak bu seçenek için gecikmeyi belirleyebilirsiniz. Bu otomatik yükseltme seçeneği, yalnızca odaklanmak için fareyle üzerine gelme ilkesiyle kullanılabilir.

source: Setting the delay too short will cause a rapid fire changing of windows, which can be quite distracting. Most people will like a delay of 100-300 ms. This is responsive, but it will let you slide over the corners of a window on your way to your destination without bringing that window to the front.
tr: Gecikmeyi çok kısa ayarlamak pencerelerin hızlı bir şekilde değiştirilmesine neden olur ve bu oldukça dikkat dağıtıcı olabilir. Çoğu insan 100–300 ms’lik bir gecikmeyi sevecektir. Bu duyarlıdır, ancak hedefinize giderken o pencereyi öne getirmeden pencerenin köşelerinden kaydırmanıza izin verir.

source: Multiscreen behavior
tr: Çoklu ekran davranışı

source: This controls the behavior of window focus with multiple screens. Note that these options appear only when more than one screen is currently connected.
tr: Bu, birden çok ekranla pencere odağının davranışını denetler. Bu seçeneklerin yalnızca o anda birden fazla ekran bağlı olduğunda göründüğünü unutmayın.

source: Separate screen focus
tr: Ekran odağını ayır

source: When this option is enabled, focus operations are limited only to the active screen. For instance, when you close a window, then the next window to receive focus will be a window on the active screen, even if there is a more recently used window on a different screen.
tr: Bu seçenek etkinleştirildiğinde, odak işlemleri yalnızca etkin ekranla sınırlıdır. Örneğin, bir pencereyi kapattığınızda, farklı bir ekranda daha yakın zamanda kullanılan bir pencere olsa bile, odağı alacak bir sonraki pencere etkin ekrandaki bir pencere olacaktır.

source: <title>Titlebar Actions</title>
tr: <title>Başlık Çubuğu Eylemleri</title>

source: In this panel you can configure what happens to windows when a mousebutton is clicked on their titlebars.
tr: Bu panelde, başlık çubuklarına bir fare düğmesiyle tıklandığında pencerelere ne olacağını yapılandırabilirsiniz.

source: <guilabel>Titlebar Actions</guilabel>
tr: <guilabel>Başlık Çubuğu Eylemleri</guilabel>

source: This section allows you to determine what happens when you double-click or scroll the mouse wheel on the titlebar of a window.
tr: Bu bölüm, bir pencerenin başlık çubuğunda çift tıkladığınızda veya fare tekerleğiyle sardığınızda ne olacağını belirlemenizi sağlar.

source: The following actions are available for <guilabel>Double-click</guilabel>:
tr: <guilabel>Çift tıklama</guilabel> için aşağıdaki işlemler kullanılabilir:

source: Maximize
tr: Ekranı kapla

source: Resizes the window to fill the height and width of the screen.
tr: Ekranın yüksekliğini ve genişliğini doldurmak için pencereyi yeniden boyutlandırır.

source: Vertically maximize
tr: Dikey olarak ekranı kapla

source: Resizes the window to the height of the screen.
tr: Pencereyi ekranın yüksekliğine göre yeniden boyutlandırır.

source: Horizontally maximize
tr: Yatay olarak ekranı kapla

source: Resizes the window to the width of the screen.
tr: Pencereyi ekranın genişliğine göre yeniden boyutlandırır.

source: Minimize
tr: Simge durumuna küçült

source: Hides the window into its minimized state, from which it can be restored &eg; via the Task Manager or Task Switcher.
tr: Pencereyi, geri yüklenebileceği simge durumuna küçültülmüş durumuna gizler; &eg;, Görev Yöneticisi veya Görev Değiştiricisi aracılığıyla.

source: Shade
tr: Panjuru kapat

source: Causes the window to be reduced to simply the titlebar. Double-clicking on the titlebar again restores the window to its normal size.
tr: Pencerenin yalnızca başlık çubuğuna indirgenmesine neden olur. Başlık çubuğuna tekrar çift tıklamak, pencereyi normal boyutuna geri yükler.

source: Close
tr: Kapat

source: Closes the window.
tr: Pencereyi kapatır.

source: Show on all desktops
tr: Tüm masaüstlerinde göster

source: Makes the window be visible on all Virtual Desktops.
tr: Pencereyi tüm Sanal Masaüstleri’nde görünür yapar.

source: Do nothing
tr: Bir şey yapma

source: Nothing happens on double-click.
tr: Çift tıkladığınızda hiçbir şey olmaz.

source: The <guilabel>Mouse wheel</guilabel> can be used to trigger an action depending on whether it is scrolled up or down:
tr: <guilabel>Fare tekerleği</guilabel>, yukarı veya aşağı sarılmasına bağlı olarak bir eylemi tetiklemek için kullanılabilir:

source: Raise/lower
tr: Yükselt/alçalt

source: Scrolling up will move the window on top of other windows.
tr: Yukarı sarmak, pencereyi diğer pencerelerin üstüne taşır.

source: Scrolling down will move the window below other windows.
tr: Aşağı sarmak, pencereyi diğer pencerelerin altına taşır.

source: Shade/unshade
tr: Panjuru kapat/aç

source: Scrolling up will collapse the window to just its titlebar.
tr: Yukarı sarmak, pencereyi yalnızca başlık çubuğuna daraltır.

source: Scrolling down will restore the window to its normal size.
tr: Aşağı sarmak, pencereyi normal boyutuna geri yükler.

source: Maximize/restore
tr: Ekranı kapla/geri yükle

source: Scrolling up will maximize the window to fill the whole screen.
tr: Yukarı sarmak, pencereyi tüm ekranı dolduracak şekilde büyütür.

source: Scrolling down will restore it to its previous size.
tr: Aşağı sarmak, onu önceki boyutuna geri getirir.

source: Keep above/below
tr: Üzerinde/altında tut

source: Scrolling up will make the window stay on top, covering other windows.
tr: Yukarı sarmak, pencerenin üstte kalmasını ve diğer pencereleri örtmesini sağlar.

source: Scrolling down will make the window stay covered below other windows.
tr: Aşağı sarmak, pencerenin diğer pencerelerin altında kapalı kalmasını sağlar.

source: Move to previous/next desktop
tr: Önceki/sonraki masaüstüne taşı

source: Scrolling up will move the window to the previous Virtual Desktop.
tr: Yukarı sarmak, pencereyi önceki Sanal Masaüstü’ne taşır.

source: Scrolling down will move the window to the next Virtual Desktop.
tr: Aşağı sarmak, pencereyi bir sonraki Sanal Masaüstü’ne taşır.

source: Change opacity
tr: Matlığı değiştir

source: Scrolling up will make the window less transparent.
tr: Yukarı sarmak, pencereyi daha az saydam duruma getirir.

source: Scrolling down will make the window more transparent.
tr: Aşağı sarmak, pencereyi daha saydam duruma getirir.

source: Nothing happens when scrolling up or down on the window's titlebar.
tr: Pencerenin başlık çubuğunda yukarı veya aşağı sarınca hiçbir şey olmaz.

source: You can have windows automatically unshade when you simply place the mouse over their shaded titlebar. Just check the <link linkend="advanced-unshading"><guilabel>Window unshading</guilabel></link> check box in the <guilabel>Advanced</guilabel> tab of this module. This is a great way to reclaim screen space when you are cutting and pasting between a lot of windows, for example.
tr: Pencerelerin panjuru kapalı başlık çubuğuna fare işaretçisini getirince kendiliğinden panjurun açılmasını sağlayabilirsiniz. Yalnızca bu modülün <guilabel>Gelişmiş</guilabel> sekmesindeki <link linkend="advanced-unshading"><guilabel>Pencere panjurunu aç</guilabel></link> onay kutusunu işaretleyin. Bu, sık sık birden çok pencere arasında kopyala ve yapıştır yapıyorsanız çok yararlıdır.

source: Titlebar and Frame Actions
tr: Başlık Çubuğu ve Çerçeve Eylemleri

source: This section allows you to determine what happens when you single click on the titlebar or frame of a window. Notice that you can have different actions associated with the same click depending on whether the window is active or not.
tr: Bu bölüm, bir pencerenin başlık çubuğuna veya çerçevesine bir kez tıkladığınızda ne olacağını belirlemenizi sağlar. Pencerenin etkin olup olmamasına bağlı olarak, aynı tıklamayla ilişkili farklı eylemleriniz olabileceğine dikkat edin.

source: For each combination of mousebuttons, Active and Inactive, you can select the most appropriate choice. The actions are as follows:
tr: Etkin ve Etkin Değil fare düğmelerinin her bir kombinasyonu için en uygun seçimi seçebilirsiniz. Eylemler aşağıdaki gibidir:

source: Raise
tr: Yükselt

source: Will bring the window to the top of the window stack. All other windows which overlap with this one will be hidden <quote>below</quote> it.
tr: Pencereyi, pencere yığınının en üstüne getirir. Bununla örtüşen diğer tüm pencereler onun <quote>altında</quote> gizlenecektir.

source: Lower
tr: Alçalt

source: Will move this window to the bottom of the window stack. This will get the window out of the way.
tr: Bu pencereyi pencere yığınının en altına taşır. Bu, pencereyi yoldan çekecektir.

source: Toggle raise and lower
tr: Yükselt/alçalt geçişi yap

source: This will raise windows which are not on top, and lower windows which are already on top.
tr: Bu, üstte olmayan pencereleri yükseltir ve zaten üstte olan pencereleri alçaltır.

source: Window menu
tr: Pencere menüsü

source: Will bring up a small submenu where you can choose window related commands (&ie; Move to Desktop, Move to Screen, Maximize, Minimize, Close, &etc;).
tr: Pencere ile ilgili komutları seçebileceğiniz küçük bir alt menü açacaktır (&eg;, Masaüstüne Taşı, Ekrana Taşı, Ekranı Kapla, Simge Durumuna Küçült, Kapat, vb.).

source: Nothing happens on click.
tr: Tıklayınca bir şey olmaz.

source: Maximize Button Actions
tr: Ekranı Kapla Düğmesi Eylemleri

source: This section allows you to determine the behavior of the three mouse buttons onto the maximize button.
tr: Bu bölüm, üç fare düğmesinin ekranı kaplayan düğme üzerindeki davranışını belirlemenizi sağlar.

source: Resizes the window to the height and width of the screen.
tr: Pencereyi ekranın yüksekliğine ve genişliğine göre yeniden boyutlandırır.

source: Window Actions
tr: Pencere Eylemleri

source: Inactive Inner Window
tr: Etkin Olmayan İç Pencere

source: This part of the module, allows you to configure what happens when you click on an inactive window, with any of the three mouse buttons or use the mouse wheel.
tr: Modülün bu kısmı, etkin olmayan bir pencereye üç fare düğmesinden herhangi biriyle tıkladığınızda veya fare tekerleğini kullandığınızda ne olacağını yapılandırmanıza olanak tanır.

source: Your choices are as follows:
tr: Seçenekleriniz şunlardır:

source: Activate, raise and pass click
tr: Etkinleştir, yükselt ve tıklamayı geçir

source: This makes the clicked window active, raises it to the top of the display, and passes a mouse click to the application within the window.
tr: Bu, tıklanan pencereyi etkin duruma getirir, ekranın üst kısmına yükseltir ve pencere içindeki uygulamaya bir fare tıklaması iletir.

source: Activate and pass click
tr: Etkinleştir ve tıklamayı geçir

source: This makes the clicked window active and passes a mouse click to the application within the window.
tr: Bu, tıklanan pencereyi etkin duruma getirir ve pencere içindeki uygulamaya bir fare tıklaması iletir.
