Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_kwindecoration.po
Languages: tr

source: Window Decorations
tr: Pencere Dekorasyonları

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Systemsettings
tr: sistem ayarları

source: window
tr: pencere

source: border
tr: kenarlık

source: theme
tr: tema

source: style
tr: biçem

source: This module allows you to select a style for the buttons and borders around the windows.
tr: Bu modül, pencerelerin etrafındaki düğmeler ve kenarlıklar için bir biçem seçmenizi sağlar.

source: <screeninfo>Window Decoration Configuration Module</screeninfo>
tr: <screeninfo>Pencere Dekorasyonu Yapılandırma Modülü</screeninfo>

source: <phrase>Window Decoration Configuration Module</phrase>
tr: <phrase>Pencere Dekorasyonu Yapılandırma Modülü</phrase>

source: Choose a window decoration style from the preview list, or download a new style using the <guibutton>Get New Window Decorations</guibutton> button.
tr: Önizleme listesinden bir pencere dekorasyonu biçemi seçin veya <guibutton>Yeni Pencere Dekorasyonları Al</guibutton> düğmesini kullanarak yeni bir biçem indirin.

source: The default window decoration is called <quote>Breeze</quote>.
tr: Öntanımlı pencere dekorasyonuna <quote>Esinti</quote> denir.

source: Each style has a different look, but also a different <quote>feel</quote>. Some have (sometimes invisible) <quote>resize</quote> borders all around the edge, which make resizing easier but moving more difficult. Some have no borders on certain edges.
tr: Her biçemin farklı bir görünümü; ancak aynı zamanda farklı bir <quote>hissi</quote> vardır. Bazılarının tüm kenarlarında (bazen görünmez) <quote>yeniden boyutlandır</quote> kenarlıklar vardır, bu da yeniden boyutlandırmayı kolaylaştırırken taşımayı daha zor hale getirir. Bazılarının belirli kenarlarında kenarlık yoktur.

source: You are encouraged to experiment with the different styles until you find one which best suits your pattern of work.
tr: Çalışma düzeninize en uygun olanı bulana kadar farklı biçemleri denemeniz teşvik edilir.

source: In the preview of each style you find a <inlinemediaobject><imageobject> <imagedata fileref="configure.png" format="PNG"/></imageobject></inlinemediaobject> configure button to open configuration dialogs for the decoration.
tr: Her bir biçemin önizlemesinde, dekorasyon yapılandırması iletişim kutusunu açmak için bir <inlinemediaobject><imageobject> <imagedata fileref="configure.png" format="PNG"/></imageobject></inlinemediaobject> yapılandırma düğmesi bulunur.

source: The options in this configuration dialog are applied to all windows. Some window decorations (&eg; <quote>Breeze</quote>) provide a <guilabel>Window-Specific Overrides</guilabel> tab. On this tab you can change the border size and the visibility of the window titlebar for particular windows.
tr: Bu yapılandırma iletişim kutusundaki seçenekler tüm pencerelere uygulanır. Bazı pencere dekorasyonları (&eg;, <quote>Esinti</quote>), bir <guilabel>Pencereye Özgü Geçersiz Kılmalar</guilabel> sekmesi sağlar. Bu sekmede, belirli pencereler için kenarlık boyutunu ve pencere başlık çubuğunun görünürlüğünü değiştirebilirsiniz.

source: Different options for particular windows you find in the &systemsettings; module <ulink url="help:/kcontrol/windowspecific">Window Rules</ulink>.
tr: Belirli pencereler için farklı seçenekleri <ulink url="help:/kcontrol/windowspecific">Pencere Kuralları</ulink> &systemsettings; modülünde bulabilirsiniz.

source: For accessibility purposes, some window decorations support extra wide borders. If this is available, you can also choose a <guilabel>Window border size</guilabel> here. The large borders are easier to see for low vision users, and easier to grab for people with limited mobility or difficulty using a mouse.
tr: Erişilebilirlik amacıyla, bazı pencere dekorasyonları ekstra geniş kenarlıkları destekler. Bu varsa buradan ayrıca bir <guilabel>Pencere kenarlığı boyutu</guilabel> seçebilirsiniz. Az gören kullanıcılar için geniş kenarlıkları görmek daha kolaydır ve sınırlı hareket kabiliyetine sahip veya fare kullanmakta güçlük çeken kişiler için daha kolay kavranır.

source: If you are interested in creating your own window decoration, you can learn more about it <ulink url="https://develop.kde.org/docs/extend/plasma/aurorae/">in this tutorial</ulink>.
tr: Kendi pencere dekorasyonunuzu yapmak istiyorsanız <ulink url="https://develop.kde.org/docs/extend/plasma/aurorae/">bu öğreticiden</ulink> daha fazla bilgi alabilirsiniz.

source: Decorations
tr: Dekorasyonlar

source: In this dialog you can change the decoration of the window. The available options depend on the selected style.
tr: Bu iletişim kutusundan pencerenin dekorasyonunu değiştirebilirsiniz. Kullanılabilir seçenekler seçili biçeme bağlıdır.

source: <screeninfo>Breeze Decoration Options</screeninfo>
tr: <screeninfo>Esinti Dekorasyon Seçenekleri</screeninfo>

source: <phrase>Breeze Decoration Options</phrase>
tr: <phrase>Esinti Dekorasyon Seçenekleri</phrase>

source: Titlebar Buttons
tr: Başlık Çubuğu Düğmeleri

source: This page allows you to customize the button location on the titlebar. You can drag buttons &eg; the <guilabel>Application menu</guilabel> into the titlebar, remove them or drag around the buttons until you have the order that makes you comfortable.
tr: Bu sayfa, başlık çubuğundaki düğme konumunu özelleştirmenizi sağlar. Örneğin, <guilabel>Uygulama Menüsü</guilabel>’nü başlık çubuğuna koyun, kaldırın veya sizi rahat ettiren bir sıralama elde edene kadar düğmeleri sürükleyin.

source: <screeninfo>Button Options</screeninfo>
tr: <screeninfo>Düğme Seçenekleri</screeninfo>

source: <phrase>Button Options</phrase>
tr: <phrase>Düğme Seçenekleri</phrase>

source: Enable <guilabel>Close windows by double clicking the window menu button</guilabel> to have an additional option to the Close button or if you have removed the Close button from the titlebar.
tr: Kapat düğmesine ek bir seçenek isterseniz veya başlık çubuğundan kaldırdıysanız <guilabel>Pencere menüsü düğmesine çift tıklayarak pencereleri kapat</guilabel> seçeneğini işaretleyin.

source: Check the <guilabel>Show titlebar buttons tooltips</guilabel> item if you want to see the default tooltips when you hover the titlebar buttons with the mouse pointer.
tr: Fare işaretçisiyle başlık çubuğu düğmeleri üzerine geldiğinizde öntanımlı araç ipuçlarını görmek istiyorsanız <guilabel>Başlık çubuğu düğmesi araç ipuçlarını göster</guilabel> seçeneğini işaretleyin.
