Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_workspaceoptions.po
Languages: tr

source: General Behavior
tr: Genel Davranış

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: System Settings
tr: sistem ayarları

source: desktop
tr: masaüstü

source: workspace
tr: çalışma alanı

source: This is a module to configure general workspace behavior.
tr: Bu, genel çalışma alanı davranışını yapılandırmak için bir modüldür.

source: Allow Plasma to show panel and widget tooltips
tr: Plasma’nın panel ve araç takımı ipuçlarını göstermesine izin ver

source: If this option is checked, tooltips are displayed hovering items in the &plasma; panel or on the desktop.
tr: Bu seçenek işaretliyse &plasma; panelleri veya masaüstünde ögelerin üzerine gelindiğinde araç ipuçları görüntülenir.

source: Allow Plasma to show OSD popups for status changes
tr: Plasma’nın EÜG ve durum değişikliği açılır görünümlerini göstermesine izin ver

source: If this option is checked, all Plasma widgets are allowed to show on-screen display (OSD) popups for changes like volume and brightness level, or audio device switching.
tr: Bu seçenek işaretlenirse tüm Plasma araç takımlarına, ses veya parlaklık düzeyi değişiklikleri veya ses aygıtı değişikliği gibi olaylar için ekran üzeri görüntü (OSD/EÜG) göstermeleri için izin verilir.

source: Animation speed
tr: Canlandırma hızı

source: Allows you to set the speed of desktop effect animations from <guilabel>Slow</guilabel> to <guilabel>Instant</guilabel>.
tr: Masaüstü canlandırma efektlerinin hızını <guilabel>Yavaş</guilabel>’tan <guilabel>Anında</guilabel> aralığında değiştirmenize izin verir.

source: <guimenu>Clicking files or folders</guimenu><guimenuitem>Opens them</guimenuitem>
tr: <guimenu>Dosyalara ve klasörlere tıklamak</guimenu><guimenuitem>Onları açar</guimenuitem>

source: If this option is checked, then files and folders will be opened with a single click of the <mousebutton>left</mousebutton> mouse button. To select files and folders, you can <mousebutton>left</mousebutton>-click on their selection markers, drag a selection rectangle around them, or <keycombo action="simul">&Ctrl;<mousebutton>Left</mousebutton></keycombo>-click. This is the default behavior, and it's designed to be consistent with what you would expect when you click links in web browsers.
tr: Bu seçenek işaretliyse dosyalar ve klasörler farenin <mousebutton>sol</mousebutton> düğmesine tek bir tıklamayla açılırlar. Dosyaları ve klasörleri seçmek için onların seçim imleyicilerine <mousebutton>sol</mousebutton>-fare düğmesiyle tıklayabilir, çevrelerinde bir seçim dörtgeni sürükleyip çizebilir veya <keycombo action="simul">&Ctrl;<mousebutton>Sol</mousebutton></keycombo> tık yapabilirsiniz. Bu, öntanımlı davranıştır ve web tarayıcılarındaki bağlantılara tıklamanızla eşdeğer bir deneyim sağlaması beklenir.

source: <guimenu>Clicking files or folders</guimenu><guimenuitem>Selects them</guimenuitem>
tr: <guimenu>Dosyalara ve klasörlere tıklamak</guimenu><guimenuitem>Onları seçer</guimenuitem>

source: If this option is checked, then files and folders must be double-clicked to be opened, while a single click will select them. This is the behavior you may know from other desktops or operating systems.
tr: Bu seçenek işaretliyse dosya ve klasörlerin açılabilmesi için çift tıklanması gerekirken, tek bir tıklama onları seçecektir. Bu, diğer masaüstlerinden veya işletim sistemlerinden aşina olduğunuz davranıştır.

source: <guimenu>Clicking in scrollbar track</guimenu><guimenuitem>Scrolls one page up and down</guimenuitem>
tr: <guimenu>Sarma çubuğu alanına tıklamak</guimenu><guimenuitem>Bir sayfa yukarı veya aşağı sarar</guimenuitem>

source: This is the default setting. Left-click in scrollbar track moves scrollbar by one page.
tr: Bu, öntanımlı ayardır. Sarma çubuğu alanında sol tık, sarma çubuğunu bir sayfa hareket ettirir.

source: <guimenu>Clicking in scrollbar track</guimenu><guimenuitem>Scrolls to the clicked location</guimenuitem>
tr: <guimenu>Sarma çubuğu alanına tıklamak</guimenu><guimenuitem>Tıklanan konuma sarar</guimenuitem>

source: Turns on the behavior when the scroll handle position jumps right to the position in the document where you have clicked. This is the behavior you may know from other desktops or operating systems.
tr: Bu davranış, sarma çubuğundaki bir alana tıkladığınızda, belgedeki eşdeğer konumuna gitmenizi sağlayan davranışı etkinleştirir. Bu, diğer masaüstlerinden veya işletim sistemlerinden aşina olmuş olabileceğiniz davranıştır.

source: <guimenu>Middle Click</guimenu><guimenuitem>Paste selected text</guimenuitem>
tr: <guimenu>Orta tık</guimenu><guimenuitem>Seçili metni yapıştır</guimenuitem>

source: If this option is checked, middle-clicking in a text field will paste from the clipboard, just like you would with <keycombo action="simul">&Ctrl;<keysym>V</keysym></keycombo>.
tr: Bu seçenek işaretliyse bir metin alanında orta tıklamak, panodaki içeriği yapıştırır. <keycombo action="simul">&Ctrl;<keysym>V</keysym></keycombo> ile eşdeğerdir.

source: Touch Mode
tr: Dokunmatik Kip

source: In Touch Mode, many elements of the user interface will become larger to more easily accommodate touch interaction.
tr: Dokunmatik Kip’te, kullanıcı arayüzünün birçok ögesi, dokunma etkileşimini daha kolay bir biçimde barındırmak için büyüyecektir.

source: <guimenu>Touch Mode</guimenu><guimenuitem>Automatically enable as needed</guimenuitem>
tr: <guimenu>Dokunmatik Kip</guimenu><guimenuitem>Gerektiğinde kendiliğinden etkinleştir</guimenuitem>

source: If this option is selected, Touch Mode will be automatically activated whenever the system detects a touchscreen but no mouse or touchpad. For example: when a transformable laptop's keyboard is flipped around or detached.
tr: Bu seçenek seçilirse sistem bir dokunmatik ekran algıladığında; ancak fare veya dokunmatik yüzey olmadığında Dokunmatik Kip kendiliğinden etkinleştirilir. Örneğin: Dönüştürülebilir bir dizüstü bilgisayarın klavyesi ters çevrildiğinde veya çıkarıldığında.

source: <guimenu>Touch Mode</guimenu><guimenuitem>Always enabled</guimenuitem>
tr: <guimenu>Dokunmatik Kip</guimenu><guimenuitem>Her zaman etkin</guimenuitem>

source: If this option is selected, Touch Mode will always be enabled. Use this option if you use &plasma; primarily with a touchscreen, or prefer larger click targets for other reasons.
tr: Bu seçenek seçilirse Dokunmatik Kip her zaman etkin olacaktır. &plasma; kullanıyorsanız bu seçeneği kullanın veya başka nedenlerle daha büyük tıklama hedeflerini tercih edin.

source: <guimenu>Touch Mode</guimenu><guimenuitem>Never enabled</guimenuitem>
tr: <guimenu>Dokunmatik Kip</guimenu><guimenuitem>Asla etkin değil</guimenuitem>

source: If this option is selected, Touch Mode will always be disabled. Use this option if you don't need Touch Mode on your device.
tr: Bu seçenek seçilirse Dokunmatik Kip her zaman devre dışı bırakılır. Aygıtınızda Dokunmatik Kip’e gereksiniminiz yoksa bu seçeneği kullanın.
