Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol6_webshortcuts.po
Languages: tr

source: Web Shortcuts
tr: Web Kısayolları

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Systemsettings
tr: sistem ayarları

source: enhanced browsing
tr: gelişmiş tarama

source: web shortcuts
tr: web kısayolları

source: browsing
tr: tarama

source: Introduction
tr: Giriş

source: &konqueror; offers some features to enhance your browsing experience. One such feature is <emphasis>Web Shortcuts</emphasis>.
tr: &konqueror;, tarama deneyiminizi geliştirmek için bazı özellikler sunar. Bunlardan biri de <emphasis>Web Kısayolları</emphasis>’dır.

source: You may already have noticed that &kde; is very Internet friendly. For example, you can click on the <guimenuitem>Run</guimenuitem> menu item or type the keyboard shortcut assigned to that command (<keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> or <keycombo action="simul">&Alt;&Space;</keycombo>, unless you have changed it) and type in a &URI;.
tr: &kde;’nin bayağı internet canlısı olduğunu fark etmiş olabilirsiniz. Örneğin, <guimenuitem>Çalıştır</guimenuitem> menü ögesine tıklayın veya bu eyleme atanmış klavye kısayolunu çağırın (<keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> veya <keycombo action="simul">&Alt;&Space;</keycombo>, eğer değiştirmediyseniz) ve bir &URI; girin.

source: Uniform Resource Identifier. A standardized way of referring to a resource such as a file on your computer, a World Wide Web address, an email address, &etc;
tr: Tekdüzen Kaynak Tanımlayıcı. Bilgisayarınızdaki bir dosyaya, bir internet veya bir e-posta adresine başvurmanın standartlaştırılmış bir yolu.

source: Web shortcuts, on the other hand, let you come up with new pseudo &URL; schemes, or shortcuts, that basically let you <emphasis>parameterize</emphasis> commonly used &URI;s. For example, if you like the Google search engine, you can configure &kde; so that a pseudo &URL; scheme like <emphasis>gg</emphasis> will trigger a search on Google. This way, typing <userinput>gg:<replaceable>my query</replaceable></userinput> will search for <replaceable>my query</replaceable> on Google.
tr: Web Kısayolları, bunun yanında yeni bir yalancıktan &URL; şeması veya kısayolu kullanmanıza izin verirler. Bunlarla, sık kullanılan &URL;’leri <emphasis>parametreleştirebilirsiniz</emphasis>. Örneğin, DuckDuckGo arama motorunu pek seviyorsanız &kde;’yi <emphasis>ddg</emphasis> gibi çalıştırıldığında DuckDuckGo’yu çağıracak bir &URL; şemasıyla yapılandırabilirsiniz. Böylece, <userinput>ddg:<replaceable>sorgu</replaceable></userinput>, DuckDuckGo üzerinde <replaceable>sorgu</replaceable>’yu arar.

source: One can see why we call these pseudo &URL; schemes. They are used like a &URL; scheme, but the input is not properly &URL; encoded, so one will type <userinput>google:kde apps</userinput> and not <userinput>google:kde+apps</userinput>.
tr: Bunları neden yalancı &URL; şemaları olarak adlandırdığımızı görebiliyorsunuzdur. Bir &URL; şeması gibi kullanılırlar; ancak girdi tam bir &URL; gibi kodlanmamıştır. Bundan dolayı <userinput>duckduckgo:kde+uygulamaları</userinput> yerine <userinput>duckduckgo:kde uygulamaları</userinput> yazılır.

source: You can use web shortcuts wherever you would normally use &URI;s. Shortcuts for several search engines should already be configured on your system, but you can add new keywords, and change or delete existing ones in this module.
tr: Normalde &URI;’ler kullandığınız her yerde web kısayollarını kullanabilirsiniz. Birkaç arama motoru için kısayollar sisteminizde zaten yapılandırılmış olmalıdır; ancak bu modülde yeni anahtar sözcükler ekleyebilir ve var olanları değiştirebilir veya silebilirsiniz.

source: Web Search Keywords
tr: Web Araması Anahtar Sözcükleri

source: The descriptive names of defined web shortcuts are shown in a list box. As with other lists in &kde;, you can click on a column heading to toggle the sort order between ascending and descending, and you can resize the columns.
tr: Tanımlanan web kısayollarının açıklayıcı adları bir liste kutusunda gösterilir. &kde; içindeki diğer listelerde olduğu gibi, sıralama düzenini artan ve azalan arasında değiştirmek için bir sütun başlığına tıklayabilir ve sütunları yeniden boyutlandırabilirsiniz.

source: At the bottom of the list the option <guilabel>Enable Web search keywords</guilabel> has to be checked to enable this feature. Use the buttons on the right to create, modify or delete shortcuts.
tr: Bu özelliği etkinleştirmek için listenin en altında <guilabel>Web’de arama anahtar sözcüklerini etkinleştir</guilabel> seçili olmalıdır. Kısayollar oluşturmak, değiştirmek ve silmek için sağdaki düğmeleri kullanın.

source: If <guilabel>Use preferred keywords only</guilabel> is checked, only keywords marked as preferred in the second column of the list are used in places where only a few select shortcuts can be shown at one time.
tr: Eğer <guilabel>Yalnızca yeğlenen kısayolları kullan</guilabel> işaretliyse yalnızca listenin ikinci sütununda yeğlenen olarak işaretlenen anahtar sözcükler aynı anda yalnızca birkaç seçim kısayolunun gösterilebildiği yerlerde kullanılır.

source: Below the list you find two additional options:
tr: Listenin altında iki adet ek seçenek bulacaksınız:

source: Default Web search keyword:
tr: Öntanımlı Web’de arama anahtar sözcüğü:

source: Select the search engine to use for input boxes that provide automatic lookup services when you type in normal words and phrases instead of a &URL;. To disable this feature select <guilabel>None</guilabel> from the list.
tr: &URL; yerine normal sözcükler ve sözcük öbekleri yazdığınızda otomatik arama hizmetleri sağlayan giriş kutuları için kullanılacak arama motorunu seçin. Bu özelliği devre dışı bırakmak için listeden <guilabel>Yok</guilabel> ögesini seçin.

source: Keyword delimiter:
tr: Anahtar sözcük sınırlandırıcı:

source: Choose the delimiter that separates the keyword from the phrase or word to be searched.
tr: Anahtar sözcüğü aranacak sözcük öbeğinden veya sözcükten ayıran sınırlayıcıyı seçin.

source: If you double-click on a specific entry in the list of defined search providers or click the <guibutton>Change...</guibutton> button, the details for that entry are shown in a popup dialog. In addition to the descriptive name for the item, you can also see the &URI; which is used, as well as the associated shortcuts which you can type anywhere in &kde; where &URI;s are expected. A given search provider can have multiple shortcuts, each separated by a comma.
tr: Tanımlı arama sağlayıcıları listesindeki belirli bir girişe çift tıklarsanız veya <guibutton>Değiştir…</guibutton> düğmesine tıklarsanız o girişin ayrıntıları bir açılır iletişim kutusunda gösterilir. Ögenin tanımlayıcı adına ek olarak &kde; içinde &URI;’lerin beklendiği her yere yazabileceğiniz ilişkilendirilmiş kısayolların yanı sıra kullanılan &URI;’yi de görebilirsiniz. Herhangi bir arama sağlayıcısının virgülle ayrılmış birden çok kısayolu olabilir.

source: The text boxes are used not only for displaying information about an item in the list of web shortcuts, but also for modifying or adding new items.
tr: Metin kutuları yalnızca web kısayolları listesindeki bir öge hakkında bilgi görüntülemek için değil, aynı zamanda yeni ögeler eklemek veya değiştirmek için de kullanılır.

source: You can change the contents of either the <guilabel>Shortcut URL:</guilabel> or the <guilabel>Shortcuts:</guilabel> text box. Click <guibutton>OK</guibutton> to save your changes or <guibutton>Cancel</guibutton> to exit the dialog with no changes.
tr: <guilabel>Kısayol URL’si:</guilabel> veya <guilabel>Kısayollar:</guilabel> metin kutusundaki içeriğin herhangi birini değiştirebilirsiniz. Değişikliklerinizi kaydetmek için <guibutton>Tamam</guibutton> düğmesine veya iletişim kutusundan değişikliklerinizi kaydetmeden çıkmak için <guibutton>İptal</guibutton>’i kullanın.

source: If you examine the contents of the <guilabel>Shortcut URL:</guilabel> text box, you will find that most, if not all of the entries have a <option>\{@}</option> in them. This sequence of four characters acts as a parameter, which is to say that they are replaced by whatever you happen to type after the colon character that is between a shortcut and its parameter. To add this query placeholder to a shortcut &URL;, click on the button at the right of the text box. Let's consider some examples to clarify how to use web shortcuts.
tr: <guilabel>Kısayol URL’si:</guilabel> metin kutusunun içeriğini incelerseniz tüm girişlerde olmasa da çoğunda bir <option>\{@}</option> bulunduğunu göreceksiniz. Bu dört dizi bir parametre görevi görür, yani kısayol ile parametresi arasındaki iki nokta üst üste karakterinden sonra ne yazarsanız yazın onların yerini alır. Bu sorgu yer tutucusunu bir kısayol &URL;’sine eklemek için metin kutusunun sağındaki düğmeyi tıklayın. Web kısayollarının nasıl kullanılacağını netleştirmek için bazı örneklere bakalım.

source: Suppose that the &URI; is <userinput>https://www.google.com/search?q=\{@}</userinput>, and <userinput>gg</userinput> is a shortcut to this &URI;. Then, typing <userinput>gg:<replaceable>alpha</replaceable></userinput> is equivalent to <userinput>https://www.google.com/search?q=<replaceable>alpha</replaceable></userinput>. You could type anything after the <userinput>:</userinput> character; whatever you have typed simply replaces the <option>\{@}</option> characters, after being converted to the appropriate character set for the search provider and then properly &URL;-encoded. Only the <option>\{@}</option> part of the search &URI; is touched, the rest of it is supposed to be properly &URL;-encoded already and is left as is.
tr: &URI;’nin <userinput>https://www.google.com/search?q=\{@}</userinput> olduğunu ve <userinput>gg</userinput>’nin de bu &URI; için bir kısayol olduğunu varsayalım. Sonrasında <userinput>gg:<replaceable>alfa</replaceable></userinput> yazmak, <userinput>https://www.google.com/search?q=<replaceable>alfa</replaceable></userinput>’ya eşdeğerdir. <userinput>:</userinput> karakterinden sonra istediğiniz bir şey yazabilirsiniz; yazdığınız her şey <option>\{@}</option> karakterinin yerine geçer. Bu girdi uygun karakter kümesine çevrilir ve &URL; düzgünce kodlanır. Arama &URI;’sinin yalnızca <option>\{@}</option> kısmına dokunulur; gerisi normal bir &URL; olarak kodlanmıştır ve öylece bırakılır.

source: You can also have shortcuts without parameters. Suppose the &URI; was <emphasis>file:/home/me/mydocs/calligra/words</emphasis> and the shortcut was <emphasis>mywords</emphasis>. Then, typing <userinput>mywords:</userinput> is the same as typing the complete &URI;. Note that there is nothing after the colon when typing the shortcut, but the colon is still required in order for the shortcut to be recognized as such.
tr: Aynı zamanda parametresiz kısayollar da oluşturabilirsiniz. &URI;’nin <emphasis>file:/home/ben/belgelerim/calligra/words</emphasis> olduğunu ve kısayolun <emphasis>words</emphasis> olduğunu varsayalım. Sonrasında <userinput>words:</userinput> yazmak, &URI;’nin tümünü yazmaya eşdeğerdir. Kısayolu yazarken iki noktadan sonra hiçbir şey olmadığına; ancak iki noktanın kısayolun tanımlanabilmesi adına her zaman gerekli olduğuna dikkat edin.

source: By now, you will have understood that even though these shortcuts are called web shortcuts, they really are shortcuts to parameterized &URI;s, which can point not only to web sites like search engines but also to anything else that can be pointed to by a &URI;. Web shortcuts are a very powerful feature of navigation in &kde;.
tr: Şimdiye kadar, bu kısayollara web kısayolları denmesine rağmen, bunların yalnızca arama motorları gibi web sitelerine değil, aynı zamanda bir kullanıcı tarafından işaret edilebilecek başka herhangi bir şeye de işaret edebilen parametreleştirilmiş &URI;’lerin kısayolları olduğunu anlayacaksınız. &URI; Web kısayolları, &kde;’de gezinmenin çok güçlü bir özelliğidir.
