Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_desktop.po
Languages: tr

source: Virtual Desktops
tr: Sanal Masaüstleri

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Systemsettings
tr: sistem ayarları

source: virtual
tr: sanal

source: desktop
tr: masaüstü

source: &kde; offers you the possibility to have several virtual desktops.
tr: &kde; size birkaç sanal masaüstüne sahip olma olanağı sunar.

source: You can change the names to the desktops by clicking on the <guibutton>Rename</guibutton> button (appears when you hover the desktop item in the list) and entering text into the text field.
tr: <guibutton>Yeniden Adlandır</guibutton> düğmesine (listedeki masaüstü ögesinin üzerine geldiğinizde görünür) tıklayıp metin alanına metin girerek masaüstlerinin adlarını değiştirebilirsiniz.

source: If you want to remove a desktop, use the trash overlay icon at the right of the desktop item.
tr: Bir masaüstünü kaldırmak istiyorsanız masaüstü ögesinin sağındaki çöp kutusu yer paylaşımı simgesini kullanın.

source: Press the <guibutton>Add</guibutton> button to add a virtual desktop (default name is <guilabel>New Desktop</guilabel>) to the list.
tr: Listeye bir sanal masaüstü eklemek için <guibutton>Ekle</guibutton> düğmesine basın (öntanımlı adı <guilabel>Yeni Masaüstü</guilabel>’dür).

source: You can configure the number of rows in the pager item on the panel. Just use the rows input box below the list to adjust the number of desktops. The desktops will be rearranged by the rows automatically.
tr: Paneldeki sayfalayıcıda satır sayısını yapılandırabilirsiniz. Masaüstü sayısını ayarlamak için listenin altındaki satır giriş kutusunu kullanmanız yeterlidir. Masaüstleri, satırlara göre kendiliğinden yeniden düzenlenecektir.

source: Navigation wraps around
tr: Dolaşım sarmalı

source: Enable this option if you want a keyboard or active desktop border navigation beyond the edge of a desktop to take you to the opposite edge of the new desktop.
tr: Bir klavyenin veya etkin masaüstü sınırında gezinmenin sizi yeni masaüstünün karşı kenarına götürmesini istiyorsanız bu seçeneği etkinleştirin.

source: Show animation when switching
tr: Geçerken canlandır

source: Select <guilabel>Slide</guilabel>, <guilabel>Desktop Cube Animation</guilabel>, or <guilabel>Fade Desktop</guilabel> from the drop-down box or switch animations off by unchecking the item. If the selected animation has settings options, click on the tools icon on the right of the drop-down box to launch a configuration dialog.
tr: Açılır kutudan <guilabel>Kaydır</guilabel>, <guilabel>Masaüstü Küp Canlandırması</guilabel> veya <guilabel>Masaüstünü Soldur</guilabel>’u seçin veya ögenin işaretini kaldırarak canlandırmaları kapatın. Seçilen canlandırmanın ayar seçenekleri varsa bir yapılandırma iletişim kutusunu başlatmak için açılır kutunun sağındaki araçlar simgesine tıklayın.

source: Show on-screen display when switching
tr: Değiştirirken ekran üzeri görüntü göster

source: Enable this option if you want to have an on-screen display for desktop switching.
tr: Masaüstü geçişi için ekran üzeri bir görünüm istiyorsanız bu seçeneği etkinleştirin.

source: Show desktop layout indicators
tr: Masaüstü yerleşimi göstergelerini göster

source: Enabling this option will show a small preview of the desktop layout indicating the selected desktop.
tr: Bu seçeneğin etkinleştirilmesi, seçili masaüstünü gösteren masaüstü yerleşiminin küçük bir önizlemesini gösterecektir.

source: Scrolling the mouse wheel over an empty space on the desktop or on the <guilabel>Pager</guilabel> icon in the panel will change to the next virtual desktop numerically, in the direction you scrolled (either up or down).
tr: Fare tekerleğini masaüstündeki boş bir alan üzerinde veya paneldeki <guilabel>Sayfalayıcı</guilabel> simgesi üzerinde kaydırmak, kaydırdığınız yönde (yukarı veya aşağı) sayısal olarak bir sonraki sanal masaüstüne geçecektir.

source: You can change this default behavior on the page <guilabel>Mouse Actions</guilabel> in the <guilabel>Desktop Settings</guilabel> (<keycombo action="simul">&Alt;<keycap>D</keycap></keycombo>, <keycombo action="simul">&Alt;<keycap>S</keycap></keycombo>).
tr: Bu öntanımlı davranışı <guilabel>Masaüstü Ayarları</guilabel> içindeki <guilabel>Fare Eylemleri</guilabel>’nden değiştirebilirsiniz (<keycombo action="simul">&Alt;<keycap>D</keycap></keycombo>, <keycombo action="simul">&Alt;<keycap>S</keycap></keycombo>).
