Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_kcmstyle.po
Languages: tr

source: Application Style
tr: Uygulama Biçemi

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: System Settings
tr: sistem ayarları

source: style
tr: biçem

source: application
tr: uygulama

source: widgets
tr: araç takımları

source: This module is used to configure how the individual widgets are drawn by &plasma;.
tr: Bu modül, bireysel araç takımlarının &plasma; tarafından nasıl çizildiğini yapılandırmak için kullanılır.

source: A <emphasis>Widget</emphasis> is a commonly-used programmer's term for referring to User Interface elements such as buttons, menus, and scroll bars. You can think of them as the fundamental pieces that are assembled to make your application.
tr: <emphasis>Araç takımı</emphasis>, düğmeler, menüler ve kaydırma çubukları gibi Kullanıcı Arayüzü ögelerini belirtmek için yaygın olarak kullanılan bir programcı terimidir. Bunları, uygulamanızı yapmak için bir araya getirilen temel parçalar olarak düşünebilirsiniz.

source: You can configure how the widgets are drawn with this module, but to change the color of the widgets, you should refer to the section entitled <ulink url="help:/kcontrol/colors/index.html">Colors</ulink>.
tr: Bu modül ile araç takımlarının nasıl çizileceğini yapılandırabilirsiniz; ancak araç takımlarının rengini değiştirmek için <ulink url="help:/kcontrol/colors/index.html">Renkler</ulink> başlıklı bölüme bakmalısınız.

source: The top grid, labeled <guilabel>Application Style</guilabel> contains a list of the previews of the pre-defined styles. Each style has a name, and a brief description is shown when you hover its item with the mouse pointer.
tr: <guilabel>Uygulama Biçemi</guilabel> etiketli üst ızgara, önceden tanımlanmış biçemlerin önizlemelerinin bir listesini içerir. Her biçemin bir adı vardır ve fare imleciyle ögenin üzerine geldiğinizde kısa bir açıklama gösterilir.

source: If you want to configure a &plasma; theme, use the <guilabel>Configure Style...</guilabel> overlay icon at the bottom right of the widget style icon in the grid.
tr: Bir &plasma; temasını yapılandırmak istiyorsanız ızgaradaki araç takımı biçemi simgesinin sağ alt köşesindeki <guilabel>Biçemi Yapılandır…</guilabel> kaplama simgesini kullanın.

source: If implemented, it is possible to change almost every aspect of the style: center tabbar tabs, draw toolbar item separators, draw focus indicator in lists, draw slider tick marks, enable extended resize handlers, define keyboard accelerators visibility, windows' drag mode, use frames for the better accessibility, use buttons on the scrollbars, use transparency in the menus.
tr: Uygulanırsa biçemin hemen hemen her yönünü değiştirmek olanaklıdır: sekme çubuğu sekmelerini ortalayın, araç çubuğu öge ayırıcıları çizin, listelerde odak göstergesi çizin, sürgü onay imleri çizin, genişletilmiş yeniden boyutlandırma işleyicilerini etkinleştirin, klavye ivmelendiricisi görünürlüğünü tanımlayın, pencerelerin sürükleme kipini değiştirin, daha iyi erişilebilirlik için çerçeveler kullanın, kaydırma çubuklarındaki düğmeleri kullanın, saydam menüler kullanın.

source: The general configuration can be made by pressing the <guibutton>Configure Icons and Toolbars</guibutton> button below the grid. This button opens a pane to select further settings.
tr: Genel yapılandırma, ızgaranın altındaki <guibutton>Simgeleri ve Araç Çubuklarını Yapılandır</guibutton> düğmesine basılarak yapılabilir. Bu düğme, daha fazla ayar seçmek için bir bölme açar.

source: Show icons: On buttons
tr: Simgeleri göster: Düğmelerde

source: If this option is selected, action buttons (like <guibutton>OK</guibutton> and <guibutton>Apply</guibutton>) will have a small icon located within them to act as a visual reference. If this option is not selected, then only text will appear on the button.
tr: Bu seçenek seçilirse eylem düğmelerinin (<guibutton>Tamam</guibutton> ve <guibutton>Uygula</guibutton> gibi) içlerinde görsel başvuru görevi görecek küçük bir simgesi olacaktır. Bu seçenek seçilmezse düğmede yalnızca metin görünür.

source: Show icons: In menus
tr: Simgeleri göster: Menülerde

source: If this option is selected, &kde; applications will show small icons alongside most menu items. If this option is not selected, then only text will appear in the menus. Changes to the visibility of menu icons will only affect newly started applications.
tr: Bu seçenek seçilirse &kde; uygulamalarının çoğu menü ögesinin yanında küçük simgeler gösterilir. Bu seçenek seçilmezse menülerde yalnızca metin görüntülenecektir. Menü simgelerinin görünürlüğündeki değişiklikler yalnızca yeni başlatılan uygulamaları etkiler.

source: <guilabel>Main toolbar label</guilabel>, <guilabel>Secondary toolbar label</guilabel>
tr: <guilabel>Ana araç çubuğu etiketi</guilabel>, <guilabel>İkincil araç çubuğu etiketi</guilabel>

source: These drop down boxes let you determine where on the button in both toolbars the text name of the button will appear as the default. If <guilabel>None</guilabel> is selected, then there is no text on the toolbar buttons. If <guilabel>Text only</guilabel> is selected, then the button's icon is replaced with a text name of the button. If <guilabel>Beside icons</guilabel> is selected, then the name of the button will be placed to the <emphasis>right</emphasis> of the icon. If <guilabel>Below icon</guilabel> is selected, the default will be to have the text of the button <emphasis>below</emphasis> the icon.
tr: Bu açılır kutular, düğmenin metin adının her iki araç çubuğunda düğmenin neresinde öntanımlı olarak görüneceğini belirlemenizi sağlar. <guilabel>Yok</guilabel> seçilirse araç çubuğu düğmelerinde metin olmaz. <guilabel>Yalnızca metin</guilabel> seçilirse düğmenin simgesi, düğmenin metin adıyla değiştirilir. <guilabel>Simgelerin yanında</guilabel> seçilirse düğmenin adı simgenin <emphasis>sağ</emphasis> yanına yerleştiriir. <guilabel>Simgenin altında</guilabel> seçilirse öntanımlı olarak düğmenin metni simgenin <emphasis>altında</emphasis> olur.

source: These options only specify the <emphasis>default</emphasis> location. Each application can override the settings used in this panel.
tr: Bu seçenekler yalnızca <emphasis>öntanımlı</emphasis> konumu belirtir. Her uygulama bu panelde kullanılan ayarları geçersiz kılabilir.

source: The <guibutton>Configure GNOME/GTK Application Style...</guibutton> button can be used to open the configuration tab where you can choose <guilabel>GTK theme</guilabel>, install GTK theme from file or <guibutton>Get New GNOME/GTK Application Styles</guibutton> from the Internet.
tr: <guibutton>GNOME/GTK Uygulama Biçemini Yapılandır…</guibutton> düğmesi, <guilabel>GTK temasını</guilabel> seçebileceğiniz veya dosyadan ve/veya <guibutton>Yeni GNOME/GTK Uygulama Biçemleri Al</guibutton> düğmesiyle internetten kurabileceğiniz bir yapılandırma sekmesini açar.
