Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_colors.po
Languages: tr

source: Intensity
tr: Yoğunluk

source: Intensity allows the overall color to be lightened or darkened. Setting the slider to the middle produces no change. The available effects are:
tr: Yoğunluk, genel rengin açılmasını veya koyulaşmasını sağlar. Sürgüyü ortaya ayarlamak herhangi bir değişiklik yaratmaz. Kullanılabilir efektler şunlardır:

source: Shade &mdash; makes everything lighter or darker in a controlled manner. Each &quot;tick&quot; on the slider increases or decreases the overall intensity (&ie; perceived brightness) by an absolute amount.
tr: Gölgele &mdash; her şeyi denetimli bir biçimde daha açık veya daha koyu yapar. Her bir “tik”, sürgüde toplam yoğunluğu (&ie; algılanan parlaklığı) mutlak bir miktarda artırır veya azaltır.

source: Darken &mdash; changes the intensity to a percentage of the initial value. A slider setting halfway between middle and maximum results in a color half as intense as the original. The minimum gives a color twice as intense as the original.
tr: Koyulaştır &mdash; yoğunluğu başlangıç değerinin bir yüzdesine değiştirir. Orta ve en yüksek arasında bir sürgü ayarı, özgünün yarısı kadar yoğun bir renkle sonuçlanır. En düşük, özgünden iki kat daha yoğun bir renk verir.

source: Lighten &mdash; conceptually the opposite of darken; lighten can be thought of as working with &quot;distance from white&quot;, where darken works with &quot;distance from black&quot;. The minimum is a color twice as &quot;far&quot; from white as the original, while halfway between middle and maximum gives an intensity halfway between the original color and white.
tr: Açıklaştır &mdash; kavramsal olarak koyulaştırmanın tersidir; açıklaştırma "beyazdan uzaklık" ile çalışırken, koyulaştırma "siyahtan uzaklık" ile çalışıyor olarak düşünülebilir. En düşük, özgünden iki kat daha beyaz “uzaklığındadır”; orta ve en yükseğin ortası ise özgün renk ile beyazın ortasında bir yoğunluk verir.

source: Color
tr: Renk

source: Color also changes the overall color, but is not limited to intensity. The available effects are:
tr: Renk ayrıca genel rengi de değiştirir; ancak yoğunlukla sınırlı değildir. Kullanılabilir efektler şunlardır:

source: Desaturate &mdash; changes the relative chroma. The middle setting produces no change; maximum gives a gray whose perceptual intensity equals that of the original color. Lower settings increase the chroma, giving a color that is less gray / more &quot;vibrant&quot; than the original.
tr: Doygunluğu Gider &mdash; göreceli kromayı değiştirir. Orta ayar herhangi bir değişiklik üretmez; en yüksek, algısal yoğunluğu özgün renginkine eşit olan bir gri verir. Daha düşük ayarlar kromayı artırarak özgünden daha az gri / daha "canlı" bir renk verir.

source: Fade &mdash; smoothly blends the original color into a reference color. The minimum setting on the slider produces no change; the maximum gives the reference color.
tr: Solgunlaştır &mdash; özgün rengi sorunsuz bir şekilde başvuru rengine karıştırır. Sürgüdeki en düşük ayar herhangi bir değişiklik üretmez; en yüksek ise başvuru rengini verir.

source: Tint &mdash; similar to Fade, except that the color (hue and chroma) changes more quickly while the intensity changes more slowly as the slider value is increased.
tr: Renklendir &mdash; sürgü değeri arttıkça yoğunluğun daha yavaş değişmesi ve rengin (ton ve kroma) daha tez değişmesi dışında solmaya benzer.

source: Contrast
tr: Karşıtlık

source: The contrast effects are similar to the color effects, except they apply to the text, using the background color as the reference color, and desaturate is not available. Fade produces text that &quot;fades out&quot; more quickly, but keeps its color longer, while Tint produces text that changes color to match the background more quickly while keeping a greater intensity contrast for longer (where &quot;longer&quot; means higher settings on the slider). For Contrast effects, the minimum setting on the slider produces no change, while maximum causes the text to completely disappear into the background.
tr: Karşıtlık efektleri, arka plan rengini başvuru rengi olarak kullanarak metne uygulanmaları ve doygunluk gidermenin kullanılamaması dışında renk efektlerine benzer. Solgunlaştır, “soluklaşan” metin üretirken; Renklendir, arka planla daha tez eşleşecek şekilde renk değiştiren ve daha uzun süre daha yüksek karşıtlık yoğunluğunu koruyan metin üretir (“daha uzun”, sürgüde daha yüksek ayarlar anlamına gelir). Karşıtlık efektleri için sürgüdeki en düşük ayar herhangi bir değişiklik oluşturmazken en yüksek ayar, metnin tümüyle arka planda kaybolmasına neden olur.
