Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_colors.po
Languages: tr

source: Colors
tr: Renkler

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: color
tr: renk

source: accent
tr: vurgu

source: Scheme Management
tr: Şema Yönetimi

source: This module lets you manage the color schemes on your machine. It shows a list of color schemes shipped with &plasma; and a preview at the top. Only one scheme is active at once, but you may edit schemes. You can remove schemes using the <guibutton>Remove Scheme</guibutton> button that is shown when you hover the mouse pointer over an item in the grid. Note that system schemes cannot be removed; the button for this action is disabled.
tr: Bu modül, makinenizdeki renk şemalarını yönetmenizi sağlar. &plasma; ile gelen renk şemalarının bir listesini ve üstte bir önizleme gösterir. Aynı anda yalnızca bir şema etkindir; ancak şemaları düzenleyebilirsiniz. Fare işaretçisini ızgaradaki bir ögenin üzerine getirdiğinizde gösterilen <guibutton>Şemayı Kaldır</guibutton> düğmesini kullanarak şemaları kaldırabilirsiniz. Sistem şemalarının kaldırılamayacağını unutmayın; bu eylem için düğme devre dışıdır.

source: It is possible to filter the scheme list using the <guilabel>Search...</guilabel> field above the grid. Moreover, you can use the combo box next to this field to show only the <guimenuitem>Light Schemes</guimenuitem> or the <guimenuitem>Dark Schemes</guimenuitem>.
tr: Şema listesini, ızgaranın üstünde bulunan <guilabel>Ara…</guilabel> alanıyla süzmek olanaklıdır. Dahası, alanın yanındaki çoklu kutuyu kullanarak yalnızca <guimenuitem>Açık Şemalar</guimenuitem>’ı veya <guimenuitem>Koyu Şemalar</guimenuitem>’ı görüntüleyebilirsiniz.

source: If you have an Internet connection, you can also browse and retrieve user-created schemes using <guibutton>Get New Color Schemes...</guibutton>.
tr: İnternet bağlantınız varsa <guibutton>Yeni Renk Şemaları Al…</guibutton> düğmesiyle kullanıcılar tarafından oluşturulmuş şemalara göz atabilirsiniz.

source: You can also install schemes from a file that you have downloaded or otherwise obtained, as well as import &kde; 4 schemes named like &quot;*.colors&quot;.
tr: İndirdiğiniz veya başka yollarla edildiğiniz şemaları veya “*.colors” biçimli &kde; 4 şemalarını da kurabilirsiniz.

source: This documentation will sometimes refer to the &quot;current&quot; scheme, or the &quot;active&quot; scheme. The &quot;current&quot; scheme is the set of colors and color scheme options that was most recently applied, &ie; what you would get if you choose <guibutton>Cancel</guibutton>. The &quot;active&quot; scheme is the set of colors as has been most recently edited by you, &ie; what you would get if you choose <guibutton>Apply</guibutton>.
tr: Bu belge, bazen “geçerli” veya “etkin” şemaya atıfta bulunur. “Geçerli” şema, en son uygulanan renkler ve renk şeması seçenekleridir; &ie;, <guibutton>İptal</guibutton>’e tıklarsanız alacağınız ayarlardır. “Etkin” şemaysa sizin tarafınızdan en son değiştirilen şemadır; &ie;, <guibutton>Uygula</guibutton> düğmesine tıkladığınızda alacağınız düzendir.

source: Accent Color
tr: Vurgu Rengi

source: The accent color is the color in which focused or selected elements are highlighted, and is also used for some other interface elements such as sliders or folder icons. It is also possible to tint all colors with the accent color (see more on color scheme options below). With <guilabel>Use accent color</guilabel>, you have three options for choosing an accent color:
tr: Vurgu rengi, odaklanılan veya seçilen ögelerin vurgulandığı renktir ve sürgüler veya klasör simgeleri gibi diğer bazı arabirim ögeleri için de kullanılır. Tüm renkleri vurgu rengiyle renklendirmek de olanaklıdır (aşağıdaki renk şeması seçenekleri hakkında daha fazla bilgi edinin). <guilabel>Vurgu rengi kullan</guilabel> ile vurgu rengi seçmek için üç seçeneğiniz vardır:

source: <guilabel>From current color scheme</guilabel>: This will leave the color of highlighted elements up to the color scheme, and not set a global accent color for all schemes. You can learn more about editing color schemes in the section below.
tr: <guilabel>Geçerli renk şemasından</guilabel>: Bu, vurgulanan ögelerin rengini renk şemasından alır ve tüm şemalar için genel bir vurgu rengi ayarlamaz. Aşağıdaki bölümde renk şemalarını düzenleme hakkında daha fazla bilgi edinebilirsiniz.

source: <guilabel>From current wallpaper</guilabel>: This will automatically extract a matching color from your desktop background image.
tr: <guilabel>Geçerli duvar kağıdından</guilabel>: Bu, masaüstü arka plan görselinizden kendiliğinden eşleşen bir renk çıkarır.

source: <guilabel>Custom</guilabel>: Here you can choose from a set of predefined colors or pick a custom color.
tr: <guilabel>Custom</guilabel>: Burada önceden tanımlanmış bir dizi renk arasından seçim yapabilir veya özel bir renk seçebilirsiniz.

source: Edit or Create Schemes
tr: Şemalar Oluşturmak veya Düzenlemek

source: To edit or create new schemes select a scheme from the list and press the <guibutton>Edit Scheme</guibutton> button to open a dialog with three tabs <guilabel>Options</guilabel>, <guilabel>Colors</guilabel>, and <guilabel>Disabled</guilabel>. When you have created a scheme you like, you can upload it, reset it or save it under a different name or overwrite the active scheme.
tr: Yeni şemalar oluşturmak veya onları düzenlemek için listeden bir şema seçin ve <guibutton>Şemayı Düzenle</guibutton> düğmesine basın. Üç sekmeli bir iletişim kutusu açılır: <guilabel>Seçenekler</guilabel>, <guilabel>Renkler</guilabel>, ve <guilabel>Devre Dışı</guilabel>. Hoşunuza giden bir şemayı oluşturduğunuzda, onu yükleyebilir, sıfırlayabilir veya farklı bir adla kaydedebilir veya etkin şemanın üzerine yazabilirsiniz.

source: Color Scheme Options
tr: Renk Şeması Seçenekleri

source: The <guilabel>Options</guilabel> tab allows you to change some properties that deal with how the color scheme is used, as well as some options that change the color scheme that are different from actually assigning colors.
tr: <guilabel>Seçenekler</guilabel> sekmesi, renk şemasının nasıl kullanıldığıyla ilgili bazı özelliklerin yanı sıra, gerçekte renk atamaktan farklı olarak renk şemasını değiştiren bazı seçenekleri değiştirmenize olanak tanır.

source: <guilabel>Apply effects to inactive windows</guilabel> &mdash; If checked, state effects (see <link linkend="color-effects">below</link>) will be applied to inactive windows. This can help visually identify active versus inactive windows, and may have aesthetic value, depending on your taste. However, some users feel that it causes distracting &quot;flickering&quot; since windows must be repainted when they become inactive. Unlike desktop effects, color state effects do not require compositing support and will work on all systems, however they will only work on &kde; applications.
tr: <guilabel>Etkin olmayan pencerelere efektleri uygula</guilabel> &mdash; İşaretlenirse durum efektleri (<link linkend="color-effects">aşağıya</link> bakın) etkin olmayan pencerelere uygulanır. Bu, etkin pencerelerle etkin olmayan pencereleri görsel olarak ayırt etmenize yardımcı olur ve zevkinize bağlı olarak estetik değer taşır. Ancak bazı kullanıcılar, pencereler etkin olmayan duruma geçtiğinde yeniden çizilmeleri gerektiğinden bunun rahatsız edici “titreşmelere” neden olduğunu düşünüyorlar. Masaüstü efektlerinin aksine, renk durumu efektleri bileşikleştirme desteğine gereksinim duymaz ve tüm sistemlerde çalışır; ancak bu yalnızca &kde; uygulamaları için geçerlidir.

source: <guilabel>Use different colors for inactive selections</guilabel> &mdash; If checked, the current selection in elements which do not have input focus will be drawn using a different color. This can assist visual identification of the element with input focus in some applications, especially those which simultaneously display several lists.
tr: <guilabel>Etkin olmayan seçimler için farklı renkler kullan</guilabel> &mdash; İşaretlenirse giriş odağı olmayan ögelerdeki geçerli seçim farklı bir renk kullanılarak çizilir. Bu, bazı uygulamalarda, özellikle birden fazla listeyi aynı anda görüntüleyen uygulamalarda, giriş odaklı ögenin görsel olarak tanımlanmasına yardımcı olabilir.

source: <guilabel>Shade sorted column in lists</guilabel> &mdash; If checked, multi-column lists will use a slightly different color to paint the column whose information is being used to sort the items in the list.
tr: <guilabel>Listelerdeki sıralı sütunları gölgele</guilabel> &mdash;İşaretlenirse çok sütunlu listeler, bilgileri listedeki ögeleri sıralamak için kullanılan sütunu boyamak için biraz farklı bir renk kullanır.

source: <guilabel>Tint all colors with accent color</guilabel> &mdash; If checked, all colors will get some of the accent color blended in. You can control how strongly the accent color should blend in by moving the <guilabel>Tint strength</guilabel> slider.
tr: <guilabel>Tüm renkleri vurgu rengiyle renklendir</guilabel> &mdash; İşaretlenirse tüm renklere vurgu renginin bir kısmı harmanlanır. <guilabel>Renklendirme gücü</guilabel> sürgüsünü sürerek vurgu renginin ne kadar güçlü karışması gerektiğini denetleyebilirsiniz.

source: <guilabel>Make window titlebars accent-colored</guilabel> &mdash; If checked, the color of the titlebar and header of windows will be tinted with the accent color. Active windows will be strongly highlighted in the accent color; inactive windows will get the accent color blended in more faintly.
tr: <guilabel>Pencere başlık çubuklarını vurgu rengiyle renklendir</guilabel> &mdash; İşaretlenirse başlık çubuğunun rengi ve pencere başlığı vurgu rengiyle renklendirilir. Etkin pencereler, vurgu renginde güçlü bir biçimde vurgulanacaktır; etkin olmayan pencerelerse vurgu renginin daha soluk bir şekilde harmanlanmasını sağlar.

source: <guilabel>Contrast</guilabel> &mdash; This slider controls the contrast of shaded elements, such as frame borders and the &quot;3D&quot; effects used by most styles. A lower value gives less contrast and therefore softer edges, while a higher value makes such edges &quot;stand out&quot; more.
tr: <guilabel>Karşıtlık</guilabel> &mdash; Bu sürgü, gölgelenen ögelerin karşıtlığını denetler; örneğin çerçeve kenarlıkları ve çoğu biçem tarafından kullanılan “3B” efektler. Düşük bir değer daha az karşıtlık verir ve daha yumuşak kenarlara neden olur; yüksekçe bir değer ise kenarların daha çok “ortaya çıkmasını” sağlar.

source: The <guilabel>Colors</guilabel> tab allows you to change the colors in the active color scheme.
tr: <guilabel>Renkler</guilabel> sekmesi, etkin renk şemasındaki renkleri değiştirmenize olanak sağlar.

source: Creating or changing a scheme is a simple matter of clicking on the swatch in the color list and selecting a new color. It is suggested that you save your scheme when you are done.
tr: Bir şema oluşturmak veya değiştirmek, renk listesindeki renk örneğine tıklayıp yeni bir renk seçmek kadar basit bir konudur. İşiniz bittiğinde planınızı kaydetmeniz önerilir.

source: The <guilabel>Common Colors</guilabel> set, which is displayed initially, is not actually a &quot;set&quot; in the sense used by Plasma (see next section), but presents a number of color roles in a way that makes it easier to edit the scheme as a whole. When creating a new color scheme, you will usually change these colors first, and use the other sets to tweak specific colors if needed.
tr: İlk başta görüntülenen <guilabel>Ana Renkler</guilabel> kümesi, özünde Plasma’nın kullandığı gibi bir “küme” değildir (sonraki bölüme bakın); ancak şemayı tümüyle düzenlemeyi kolay kılan bir sayıda renk rolleri sunar. Yeni bir renk şeması oluştururken öncelikle bu renkleri değiştirirsiniz ve gerekirse diğer renklere geçersiniz.

source: Note that <guilabel>Common Colors</guilabel> makes available roles from all sets. For example, &quot;View Background&quot; here is shorthand for the Normal Background role from the View set. Also, setting colors that do not refer to a specific set will change that color in <emphasis>all</emphasis> sets. (As an exception, &quot;Inactive Text&quot; will change the color for all sets <emphasis>except</emphasis> for Selection; there is a separate &quot;Selection Inactive Text&quot; for Inactive Text in the Selection set.) Some roles may not be visible under <guilabel>Common Colors</guilabel> at all, and can only be changed (if needed) by selecting the appropriate set.
tr: <guilabel>Ana Renkler</guilabel> kümesinin tüm kümelerden rolleri kullanılabilir yaptığını not edin. Örneğin, “Görünüm Arka Planı”, burada Görünüm kümesindeki Normal Arka Plan rolü için bir kısaltmadır. Ayrıca, belirli bir kümeye başvurmayan renkler ayarlamak, <emphasis>tüm</emphasis> kümelerdeki renkleri değiştirir. (bir istisna olarak, “Etkin Olmayan Metin” tüm kümeler için renkleri değiştirir; <emphasis>yalnızca</emphasis> Seçim’e dokunmaz; bunun için ayrı olarak Seçim kümesinde Etkin Olmayan Metin için “Seçim Etkin Olmayan Metin” vardır). Bazı roller <guilabel>Ana Renkler</guilabel> altında görünür bile olmayabilir ve yalnızca ilgili küme seçilerek değiştirilebilir (gerekirse).

source: Color Sets
tr: Renk Kümeleri

source: Plasma breaks the color scheme into several sets based on the type of user interface element, as follows:
tr: Plasma, renk şemasını kullanıcı arabirimi ögesinin türüne bağlı olarak aşağıdaki gibi birkaç kümeye ayırır:

source: <guilabel>View</guilabel> &mdash; information presentation elements, such as lists, trees, text input boxes, etc.
tr: <guilabel>Görünüm</guilabel> &mdash; listeler, ağaçlar, metin giriş kutuları vb. gibi bilgi sunum ögeleri.

source: <guilabel>Window</guilabel> &mdash; window elements that are not buttons or views.
tr: <guilabel>Pencere</guilabel> &mdash; düğme veya görünüm olmayan pencere ögeleri.

source: <guilabel>Button</guilabel> &mdash; buttons and similar elements.
tr: <guilabel>Düğme</guilabel> &mdash; düğmeler ve benzeri ögeler.

source: <guilabel>Selection</guilabel> &mdash; selected text and items.
tr: <guilabel>Seçim</guilabel> &mdash; seçili metin ve ögeler.

source: <guilabel>Tooltip</guilabel> &mdash; tool tips, &quot;What's This&quot; tips, and similar elements.
tr: <guilabel>İpucu</guilabel> &mdash; araç ipuçları, “Bu Nedir” ipuçları ve benzeri ögeler.

source: <guilabel>Complementary</guilabel> &mdash; Areas of applications with an alternative color scheme; usually with a dark background for light color schemes. Examples of areas with this inverted color scheme are the logout interface, the lock screen and the fullscreen mode for some applications.
tr: <guilabel>Tamamlayıcı</guilabel> &mdash; Alternatif renk şemasına iye uygulama alanları; genellikle açık renk şemaları için koyu bir arka plana sahip olanlar. Bu tersine çevrilmiş renk şemasına sahip alanlara örnek olarak oturumu kapatma arayüzü, kilit ekranı ve bazı uygulamalar için tam ekran kipi gösterilebilir.

source: Each set contains a number of color roles. Each set has the same roles. All colors are associated with one of the above sets.
tr: Her küme bir dizi renk rolü içerir. Her küme aynı rollere sahiptir. Tüm renkler yukarıdaki kümelerden biriyle ilişkilidir.

source: Color Roles
tr: Renk Rolleri

source: Each color set is made up of a number of roles which are available in all other sets. In addition to the obvious Normal Text and Normal Background, these roles are as follows:
tr: Her renk kümesi, diğer tüm kümelerde bulunan bir dizi rolden oluşur. Belirgin Normal Metin ve Normal Arka Plan’a ek olarak, bu roller aşağıdaki gibidir:

source: Alternate Background &mdash; used when there is a need to subtly change the background to aid in item association. This might be used &eg; as the background of a heading, but is mostly used for alternating rows in lists, especially multi-column lists, to aid in visually tracking rows.
tr: Alternatif Arka Plan &mdash; öge ilişkilendirmesine yardımcı olmak için arka planı ustaca değiştirmeye gereksinim duyulduğunda kullanılır. Bu; &eg;, bir başlığın arka planı olarak kullanılır; ancak çoğunlukla listelerde, özellikle çok sütunlu listelerde satırları görsel olarak izlemeye yardımcı olmak için değişen satırlarda da işe yarar.

source: Link Text &mdash; used for hyperlinks or to otherwise indicate &quot;something which may be visited&quot;, or to show relationships.
tr: Bağlantı Metni &mdash; köprüler için veya başka bir şekilde “ziyaret edilebilecek bir şey” veya ilişkileri göstermek için.

source: Visited Text &mdash; used for &quot;something (&eg; a hyperlink) that has been visited&quot;, or to indicate something that is "old".
tr: Ziyaret Edilmiş Metin &mdash; “ziyaret edilmiş” (&eg;, bir köprü) veya “eski” bir şeyi belirtmek için kullanılır.

source: Active Text &mdash; used to indicate an active element or attract attention, &eg; alerts, notifications; also for hovered hyperlinks.
tr: Etkin Metin &mdash; etkin bir ögeyi belirtmek veya dikkat çekmek için kullanılır; &eg;, uyarılar, bildirimler; ayrıca üzerine gelinen köprüler için.

source: Inactive Text &mdash; used for text which should be unobtrusive, &eg; comments, &quot;subtitles&quot;, unimportant information, etc.
tr: Etkin Olmayan Metin &mdash; göze batmaması gereken metinler için kullanılır; &eg;, yorumlar, “altyazılar”, önemsiz bilgiler vb.

source: Negative Text &mdash; used for errors, failure notices, notifications that an action may be dangerous (&eg; unsafe web page or security context), etc.
tr: Negatif Metin &mdash; hatalar, başarısızlık bildirimleri, bir eylemin tehlikeli olabileceğine dair bildirimler (&eg;,. güvenli olmayan web sayfası veya güvenlik içeriği), vb. için kullanılır.

source: Neutral Text &mdash; used to draw attention when another role is not appropriate; &eg; warnings, to indicate secure/encrypted content, etc.
tr: Nötr Metin &mdash; başka bir rol uygun olmadığında dikkat çekmek için kullanılır; &eg;, uyarılar, güvenli/şifreli içeriği belirtmek için vb.

source: Positive Text &mdash; used for success notices, to indicate trusted content, etc.
tr: Pozitif Metin &mdash; başarı bildirimleri, güvenilir içeriği belirtmek vb. için kullanılır.

source: As well as the text roles, there are a few additional &quot;decoration&quot; roles that are used for drawing lines or shading UI elements (while the above may, in appropriate circumstances, also be used for this purpose, the following are specifically <emphasis>not</emphasis> meant for drawing text). These are:
tr: Metin rollerinin yanı sıra, çizgiler çizmek veya kullanıcı arayüzü ögelerini gölgelendirmek için kullanılan birkaç ek “dekorasyon” rolü de vardır (yukarıdakiler, uygun durumlarda, bu amaç için de kullanılabilirken, aşağıdakiler özellikle metin çizmek için <emphasis>değildir</emphasis>). Bunlar:

source: Focus Decoration &mdash; used to indicate the item which has active input focus.
tr: Odak Dekorasyonu &mdash; etkin giriş odağına sahip olan ögeyi belirtmek için kullanılır.

source: Hover Decoration &mdash; used for mouse-over effects, &eg; the "illumination" effects for buttons.
tr: Üzerine Gelme Dekorasyonu &mdash; fareyle üzerine gelme efektleri için kullanılır; &eg;, düğmeler için "aydınlatma" efektleri.

source: In addition, except for Inactive Text, there is a corresponding background role for each of the text roles. Currently (except for Normal and Alternate Background), these colors are not chosen by the user, but are automatically determined based on Normal Background and the corresponding Text color. These colors may be previewed by selecting one of the sets other than &quot;Common Colors&quot;.
tr: Ayrıca Etkin Olmayan Metin dışında, metin rollerinin her biri için karşılık gelen bir arka plan rolü vardır. Şu anda (Normal ve Alternatif Arka Plan hariç), bu renkler kullanıcı tarafından seçilmez, Normal Arka Plan ve ilgili Metin rengine göre kendiliğinden belirlenir. Bu renkler, "Ana Renkler" dışındaki kümelerden biri seçilerek önizlenebilir.

source: The choice of color role is left to the developer; the above are guidelines intended to represent typical usage.
tr: Renk rolünün seçimi geliştiriciye bırakılmıştır; yukarıdakiler, tipik kullanımı temsil etmesi amaçlanan yönergelerdir.

source: Window Manager Colors
tr: Pencere Yöneticisi Renkleri

source: As previously stated, the Window Manager set has its own roles, independent of those in other sets. These are (currently) only accessible via <guilabel>Common Colors</guilabel>, and are as follows:
tr: Daha önce belirtildiği gibi, Pencere Yöneticisi kümesinin diğer kümelerden bağımsız olarak kendi rolleri vardır. Bunlara (şu anda) yalnızca <guilabel>Ana Renkler</guilabel> üzerinden erişilebilir ve aşağıdaki gibidir:

source: Active Titlebar &mdash; used to draw the title bar background, borders, and/or decorations for the active window (that is, the one with input focus). Not all window decorations will use this in the same way, and some may even use the Normal Background from the Window set to draw the title bar.
tr: Etkin Başlık Çubuğu &mdash; etkin pencere (yani, giriş odaklı pencere) için başlık çubuğu arka planını, kenarlıklarını ve/veya dekorasyonlarını çizmek için kullanılır. Tüm pencere dekorasyonları bunu aynı şekilde kullanmaz ve hatta bazıları başlık çubuğunu çizmek için Pencere kümesindeki Normal Arka Plan’ı kullanabilir.

source: Active Titlebar Text &mdash; used to draw the title bar text when Active Titlebar is used to draw the title bar background. May also be used for other foreground elements which use Active Titlebar as the background.
tr: Etkin Başlık Çubuğu Metni &mdash; başlık çubuğu arka planını çizmek için Etkin Başlık Çubuğu kullanıldığında, başlık çubuğu metnini çizmek için kullanılır. Arka plan olarak Etkin Başlık Çubuğu kullanan diğer ön plan ögeleri için de kullanılabilir.

source: The Inactive Titlebar [Text] roles are the same as the above, but for inactive windows, rather than active windows.
tr: Etkin Olmayan Başlık Çubuğu [Metin] rolleri, yukarıdakilerle aynıdır; ancak etkin pencereler yerine etkin olmayan pencereler içindir.

source: Disabled
tr: Devre Dışı

source: Color state effects from this tab are applied to interface elements in the inactive (windows that do not have focus; only if <guilabel>Apply inactive window color effects</guilabel> is enabled) or disabled states. By changing the effects, the appearance of elements in these states can be changed. Usually, inactive elements will have reduced contrast (text fades slightly into the background) and may have slightly reduced intensity, while disabled elements will have strongly reduced contrast and are often notably darker or lighter.
tr: Bu sekmedeki renk durumu efektleri, etkin olmayan (odağı olmayan pencereler; yalnızca <guilabel>Etkin olmayan pencere efektleri uygula</guilabel> etkinleştirilmişse) veya devre dışı bırakılmış durumdaki arayüz ögelerine uygulanır. Efektler değiştirilerek, bu durumlardaki ögelerin görünümü değiştirilebilir. Genellikle, etkin olmayan ögelerin karşıtlığı azalır (metin hafifçe arka planda kaybolur) ve yoğunluğu biraz azalırken, devre dışı bırakılan ögelerin karşıtlığı büyük ölçüde azalır ve genellikle belirgin şekilde daha koyu veya daha açık olur.

source: Three types of effects may be applied to each state (with the effects of the two states being independent). These are Intensity, Color and Contrast. The first two (Intensity, Color) control the overall color, while the last (Contrast) deals with the foreground colors relative to the background.
tr: Her duruma üç tür efekt uygulanabilir (iki durumun etkileri bağımsızdır). Bunlar Yoğunluk, Renk ve Kontrasttır. İlk ikisi (Yoğunluk, Renk) genel rengi kontrol ederken, sonuncusu (karşıtlık) arka plana göre ön plan renkleriyle ilgilenir.
