Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_region_language.po
Languages: tr

source: Region And Language
tr: Bölge ve Dil

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Systemsettings
tr: sistem ayarları

source: locale
tr: yerel ayar

source: country
tr: ülke

source: language
tr: dil

source: number
tr: sayı

source: translation
tr: çeviri

source: currency
tr: para birimi

source: On this page you can set your preferred languages and formats for the &plasma; Workspace and Applications to be displayed in.
tr: Bu sayfada, &plasma; Çalışma Alanı ve uygulamalarının kullanacağı dili ve biçimleri ayarlayabilirsiniz.

source: In most cases, you can simply select the language and all options will be set accordingly. The &plasma; Workspace and &kde; Applications are written in American English and are translated into many different languages by teams of volunteers. These translations need to be installed first before you can choose to use them.
tr: Çoğu durumda dili seçmeniz yeterlidir ve tüm seçenekler buna uygun bir biçimde ayarlanır. &plasma; Çalışma Alanı ve &kde; uygulamaları Amerikan İngilizcesi ile yazılır ve gönüllülerden oluşan ekipler tarafından birçok farklı dile çevrilir. Bu çevirilerin kullanılabilmesi için önce kurulmaları gerekir.

source: Ensure that you have installed the &plasma; language packages or translations for the languages you want to use.
tr: Kullanmak istediğiniz dil için &plasma; dil paketlerinin veya çevirilerinin kurulu olduğundan emin olun.

source: As &plasma; is built upon the &Qt; libraries, you need the &Qt; translations for the selected languages as well to have a fully localized &GUI;.
tr: &plasma;, &Qt; kitaplıkları üzerine yapıldığından, tümüyle çevrilmiş bir arayüze sahip olmak için seçili diller için olan &Qt; çevirilerinin de yapılmış olması gerekir.

source: On each selection bar you can see examples of what each setting looks like and which measurement units are used. In addition to numbers, you can see how currency values, dates, and times in long and short format are displayed. When you change any of the settings, the preview shows the effects of the changes before you apply them.
tr: Her seçim çubuğunda, her bir ayarın nasıl göründüğüne ve hangi ölçü birimlerinin kullanıldığına dair örnekler görebilirsiniz. Sayılara ek olarak, para birimi değerlerinin, tarihlerin ve saatlerin uzun ve kısa biçimde nasıl görüntülendiğini görebilirsiniz. Ayarlardan herhangi birini değiştirdiğinizde, önizleme, siz uygulamadan önce değişikliklerin etkilerini gösterir.

source: Clicking on the <guilabel>Add more...</guilabel> button on the language sub page will show you the list of available languages and will initially show your currently selected language. If the selection shows <quote>No Language Configured</quote> then you have not set a country and are defaulting to the language set by the system, normally C. If the language you want to use is not shown in this list then you will need to install it using the usual method for your system.
tr: Dil alt sayfasında <guilabel>Daha Fazla Ekle…</guilabel> düğmesine tıklamak ilk önce geçerli seçili dili ve sonrasında kullanılabilir diğer dillerin bir listesini gösterir. Eğer seçim <quote>Yapılandırılmış Dil Yok</quote> gösteriyorsa bir ülke seçmediğinizi ve sistemin öntanımlı dil değerlerine geri döndüğünü gösterir. Bu genelde C’dir. Kullanmak istediğiniz dil bu listede yoksa sisteminiz için olan normal yollarla bunu kurmalısınız.

source: You can remove a language from the main list by selecting it and then clicking on the <inlinemediaobject><imageobject><imagedata fileref="list-remove.png" format="PNG"/> </imageobject></inlinemediaobject> icon. You can change the order of preference in the list by selecting a language and clicking on the <inlinemediaobject><imageobject> <imagedata fileref="go-top.png" format="PNG"/> </imageobject></inlinemediaobject> icon.
tr: Ana listeden bir dili, onu seçip <inlinemediaobject><imageobject><imagedata fileref="list-remove.png" format="PNG"/> </imageobject></inlinemediaobject> simgesine tıklayarak kaldırabilirsiniz. Listedeki kullanım tercihi sırasını, bir dili seçip <inlinemediaobject><imageobject> <imagedata fileref="go-top.png" format="PNG"/> </imageobject></inlinemediaobject> simgesine tıklayarak değiştirebilirsiniz.

source: In case you need different individual format settings, you can select the locale for <guilabel>Numbers</guilabel>, <guilabel>Time</guilabel>, <guilabel>Currency</guilabel> and <guilabel>Measurement Units</guilabel>.
tr: Değişik bireysel biçim ayarlarına gerek duyuyorsanız <guilabel>Sayılar</guilabel>, <guilabel>Zaman</guilabel>, <guilabel>Para Birimi</guilabel> ve <guilabel>Ölçü Birimleri</guilabel> için olan yerel ayarları değiştirebilirsiniz.

source: Previously, Language and Formats were independent settings. Since &plasma; 5.26, they have been merged into this KCM called Region And Language. Changing a language does <emphasis>automatically change</emphasis> the settings for numbers, currency &etc; to the corresponding country or region. However, this change does not break the old configuration. The configuration file is still located at <emphasis>~/.config/plasma-localerc</emphasis> .
tr: Daha öncesinde, Dil ve Biçimler ayrı ayarlardı. &plasma; 5.26 sürümünden bu yana, Bölge ve Dil adı verilen bu ayar sayfasında toplandılar. Bir dili değiştirmek, o dil için olan sayıları, para birimini &etc; <emphasis>kendiliğinden</emphasis> ilgili ülkeye veya bölgeye göre değiştirir. Ancak, bu değişiklik eski yapılandırmayı bozmaz. Yapılandırma dosyası halen <emphasis>~/.config/plasma-localerc</emphasis> konumunda bulunur.
