Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_kcmactivities.po
Languages: tr

source: <title>Activities</title>
tr: <title>Etkinlikler</title>

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Systemsettings
tr: sistem ayarları

source: activity
tr: etkinlik

source: Introduction
tr: Giriş

source: This module allows configuring activities. Activities are a way to have multiple &plasma; setups, with each a different set of widgets and themes. Some activities can be private. Such activities do not track your actions. For example, they do not track what recent document you opened.
tr: Bu modül, etkinliklerin yapılandırılmasına izin verir. Etkinlikler, her biri birden çok &plasma; örneğini, her biri ayrı araç takımları ve temalarla ayarlamanıza izin verir. Bazı etkinlikler gizli olabilir. Bu tür etkinlikler eylemlerinizi izlemez. Örneğin, en son hangi belgeyi açtığınızı takip etmezler.

source: The module is divided into two tabs: <link linkend="activities-main"><guilabel>Activities</guilabel></link> and <link linkend="activities-switching"><guilabel>Switching</guilabel></link>.
tr: Modül, iki ayrı sekmeye ayrılmıştır: <link linkend="activities-main"><guilabel>Etkinlikler</guilabel></link> ve <link linkend="activities-switching"><guilabel>Geçiş</guilabel></link>.

source: <guilabel>Activities</guilabel>
tr: <guilabel>Etkinlikler</guilabel>

source: This tab lists your current activities. Hover items in the list with the mouse pointer to reveal the buttons to configure or remove activities.
tr: Bu sekme, geçerli etkinliklerinizi listeler. Etkinlikleri yapılandırmak veya kaldırmak için düğmeleri ortaya çıkarmak üzere fare imleciyle listedeki ögelerin üzerine gelin.

source: Use the <inlinemediaobject><imageobject><imagedata fileref="configure.png" format="PNG"/></imageobject></inlinemediaobject> overlay button to configure activity. You can change the following activity parameters:
tr: Etkinliği yapılandırmak için <inlinemediaobject><imageobject><imagedata fileref="configure.png" format="PNG"/></imageobject></inlinemediaobject> düğmesini kullanın. Aşağıdaki etkinlik parametrelerini değiştirebilirsiniz:

source: Icon
tr: Simge

source: The icon of activity can be seen on the activity manager selector of the &plasma; panel. Click on the current icon to choose some system-wide icon or browse the file system to select a custom icon.
tr: Etkinliğin simgesi, &plasma; panelinin etkinlik yöneticisi seçicisinde görülebilir. Sistemde olan simgelerden birini veya dosya sisteminizden bir simgeyi seçmek için geçerli simgenin üzerine tıklayın.

source: Name
tr: Ad

source: Give your activity a recognizable name.
tr: Etkinliğinize ayırt edilebilir bir ad verin.

source: Description
tr: Açıklama

source: A free-form description of the activity that is shown below the name on the activity manager selector of the &plasma; panel.
tr: &plasma; panelinin etkinlik yöneticisi seçicisindeki adın altında gösterilen bir açıklama metni.

source: Privacy
tr: Gizlilik

source: Check the <guilabel>Do not track usage for this activity</guilabel> item to switch off any tracking for your activity.
tr: Etkinliğiniz için herhangi bir tür izlemeyi devre dışı bırakmak için <guilabel>Bu etkinlikte kullanımı izleme</guilabel> ögesini seçin.

source: Shortcut for switching
tr: Etkinlik geçişi kısayolu

source: Press the first button to input the new shortcut to switch to the activity. Press the second button to remove the current shortcut.
tr: Etkinliğe geçmek için yeni kısayolu girmek üzere ilk düğmeye basın. Geçerli kısayolu kaldırmak için ikinci düğmeye basın.

source: Clicking on the <inlinemediaobject><imageobject><imagedata fileref="edit-delete.png" format="PNG"/></imageobject></inlinemediaobject> button removes the activity.
tr: <inlinemediaobject><imageobject><imagedata fileref="edit-delete.png" format="PNG"/></imageobject></inlinemediaobject> düğmesine tıklamak etkinliği kaldırır.

source: Clicking on the <guibutton>Create New...</guibutton> button below the list opens <guilabel>Create a New Activity</guilabel> dialog which is similar to the activity configuration dialog described above.
tr: Listenin altındaki <guibutton>Yeni Oluştur…</guibutton> düğmesine tıklamak, etkinlik yapılandırma iletişim kutusuna benzer bir <guilabel>Yeni Bir Etkinlik Oluştur</guilabel> iletişim kutusunu açar.

source: Switching
tr: Geçiş

source: Here, you can configure if &plasma; should remember the <guilabel>Current virtual desktop</guilabel> for each activity (needs restart). It is also possible to configure shortcuts for walking through the list of activities.
tr: Buradan, &plasma;’nın her bir etkinlik için <guilabel>Geçerli sanal masaüstü</guilabel>’nü anımsayıp anımsamaması gerektiğini yapılandırabilirsiniz (yeniden başlatma gerektirir). Ayrıca, etkinlikler listesinde gezinmek için olan kısayolları yapılandırmak da olanaklıdır.

source: For more information on how to use the &kde; shortcut system, see the <ulink url="help:/fundamentals/shortcuts.html"><emphasis>Using and Customizing Shortcuts</emphasis> section of the <emphasis>&kde; Fundamentals</emphasis> documentation</ulink>.
tr: &kde; kısayol sistemi hakkında daha fazla bilgi için <emphasis>&kde; Fundamentals</emphasis> belgelendirmesinin <ulink url="help:/fundamentals/shortcuts.html"><emphasis>Kısayolları Kullanmak ve Özelleştirmek</emphasis></ulink> bölümüne bakın.
