Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_bluedevil.po
Languages: tr

source: <firstname>Yuri</firstname><surname>Chornoivan</surname> <email>yurchor@ukr.net</email>
tr: <firstname>Yuri</firstname><surname>Çornoivan</surname> <email>yurchor@ukr.net</email>

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Systemsettings
tr: sistem ayarları

source: phone
tr: telefon

source: headphones
tr: kulaklık

source: earphones
tr: kulaklık

source: computer
tr: bilgisayar

source: headset
tr: mikrofonlu kulaklık

source: multimedia
tr: çoklu ortam

source: device
tr: aygıt

source: keyboard
tr: klavye

source: mouse
tr: fare

source: joypad
tr: oyun pedi

source: controller
tr: denetimci

source: camera
tr: kamera

source: printer
tr: yazıcı

source: imaging
tr: görselleme

source: wearable
tr: giyilebilir

source: <keyword>toy</keyword>
tr: <keyword>oyuncak</keyword>

source: health
tr: sağlık

source: peripheral
tr: çevre birimi

source: network
tr: ağ

source: On this page you can configure your Bluetooth devices for the &plasma; Workspace.
tr: Bu sayfada, &plasma; Çalışma Alanı için olan Bluetooth aygıtlarınızı yapılandırabilirsiniz.

source: Please press the <guibutton>Enable</guibutton> button to enable the &bluetooth; subsystem in your operating system.
tr: &bluetooth; alt sistemini işletim sisteminizde etkinleştirmek için <guibutton>Etkinleştir</guibutton> düğmesine basın.

source: <screeninfo>&bluetooth; &systemsettings; module</screeninfo>
tr: <screeninfo>&bluetooth; &systemsettings; modülü</screeninfo>

source: <phrase>&bluetooth; &systemsettings; module</phrase>
tr: <phrase>&bluetooth; &systemsettings; modülü</phrase>

source: Press the <guibutton>Configure...</guibutton> button to change the general &bluetooth; settings for your &plasma; Workspace.
tr: &plasma; Çalışma Alanı için olan genel &bluetooth; ayarlarını değiştirmek için <guibutton>Yapılandır…</guibutton> düğmesine basın.

source: <screeninfo>Configuring the general module settings</screeninfo>
tr: <screeninfo>Genel modül ayarlarını yapılandırma</screeninfo>

source: <phrase>Configuring the general module settings</phrase>
tr: <phrase>Genel modül ayarlarını yapılandırma</phrase>

source: You can make your &bluetooth; device <guilabel>Enabled</guilabel> and <guilabel>Visible</guilabel> for other &bluetooth; devices with the corresponding items.
tr: &bluetooth; aygıtınızı, denk gelen diğer &bluetooth; aygıtları için <guilabel>Etkin</guilabel> ve <guilabel>Görünür</guilabel> yapabilirsiniz.

source: It is possible to change the &bluetooth; subsystem behavior on receiving file. Your &plasma; Workspace can <guilabel>Ask for confirmation</guilabel>, <guilabel>Accept for trusted devices</guilabel> (see the <guilabel>Trusted</guilabel> in the device settings below) and <guilabel>Always accept</guilabel> the sent files. You can also configure the folder to store the received files.
tr: Dosya alımında &bluetooth; alt sistemi davranışını değiştirmek olanaklıdır. &plasma; Çalışma Alanı’nız, gönderilen dosyalar için <guilabel>Onay iste</guilabel>’yebilir, <guilabel>Güvenilir aygıtlar için kabul et</guilabel>’ebilir (aşağıda aygıt ayarlarında <guilabel>Güvenilir</guilabel> aygıtlara bakın) ve <guilabel>Her zaman kabul et</guilabel>’ebilir. Alınan dosyaların depolanacağı klasörü de yapılandırabilirsiniz.

source: Please press the back button at the top of the page to return to the main page of the configuration module.
tr: Yapılandırma modülünün ana sayfasına dönmek için sayfanın tepesindeki geri düğmesine basın.

source: You can add a &bluetooth; device to the main list by clicking the <guibutton>Add...</guibutton> button. Your neighborhood will be scanned for available devices. If the device you want to use is not shown in the scanning list then you will need to consult its manual for the instructions on how to set it up.
tr: <guibutton>Ekle…</guibutton> düğmesine basarak ana listeye bir &bluetooth; aygıtı ekleyebilirsiniz. Çevreniz, kullanılabilir aygıtları bulmak için taranacaktır. Kullanmak istediğiniz aygıt listede yoksa onu ayarlama yönergeleri için aygıtın kılavuzuna başvurun.

source: Configure the <guilabel>Manual PIN</guilabel> if needed and <mousebutton>left</mousebutton>-click on the detected device to pair it with your computer. See the device manual on the procedure of pairing, the mileadge may vary but usually, it is very straightforward.
tr: Gerekirse <guilabel>Elle PIN</guilabel>’i yapılandırın ve aygıtı bilgisayarınızla eşleştirmek için algılanan aygıta <mousebutton>sol</mousebutton>-fare düğmesiyle tıklayın. Eşleştirme prosedürü için aygıtın kılavuzuna bakabilirsiniz; bazı aygıtlar için farklı olabilir; ancak genelde çok kolaydır.

source: <screeninfo>Adding &bluetooth; device</screeninfo>
tr: <screeninfo>&bluetooth; aygıtı eklemek</screeninfo>

source: <phrase>Adding &bluetooth; device</phrase>
tr: <phrase>&bluetooth; aygıtı eklemek</phrase>

source: <mousebutton>Left</mousebutton>-click on the list item to configure its name in the devices list and make it <guilabel>Trusted</guilabel> and <guilabel>Blocked</guilabel>.
tr: Aygıtın adını değiştirmek, <guilabel>Güvenilir</guilabel> ve <guilabel>Engelli</guilabel> yapmak için aygıt listesinde üzerine <mousebutton>sol</mousebutton>-fare düğmesiyle tıklayın.

source: <screeninfo>Device settings</screeninfo>
tr: <screeninfo>Aygıt ayarları</screeninfo>

source: <phrase>Device settings</phrase>
tr: <phrase>Aygıt ayarları</phrase>

source: When hovering with the mouse cursor, every &bluetooth; device in the main list shows two buttons on the right.
tr: Fare imleciyle üzerineg gelindiğinde, ana listedeki her bir &bluetooth; aygıtı sağ yanda iki adet düğme gösterir.

source: Use <guiicon><inlinemediaobject><imageobject><imagedata fileref="network-connect.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> or <guiicon><inlinemediaobject><imageobject><imagedata fileref="network-disconnect.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> to connect or disconnect a device.
tr: Bir aygıtı bağlamak veya bağlantısını kesmek için <guiicon><inlinemediaobject><imageobject><imagedata fileref="network-connect.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> veya <guiicon><inlinemediaobject><imageobject><imagedata fileref="network-disconnect.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> kullanın.

source: You can remove a device from the main list by selecting it and then clicking on the <inlinemediaobject><imageobject><imagedata fileref="list-remove.png" format="PNG"/></imageobject></inlinemediaobject> icon.
tr: Ana listeden bir aygıtı kaldırmak için onu seçin ve sonrasında <inlinemediaobject><imageobject><imagedata fileref="list-remove.png" format="PNG"/></imageobject></inlinemediaobject> simgesine tıklayın.

source: If you need to switch &bluetooth; off for some reason press the <guibutton>Disable &bluetooth;</guibutton> button.
tr: Herhangi bir nedenden dolayı &bluetooth;’u kapatmanız gerekirse <guibutton>&bluetooth;’u Devre Dışı Bırak</guibutton> düğmesine basın.

source: System Tray Operation
tr: Sistem Tepsisi İşlemleri

source: You must be running the &plasma; desktop or another suitable window manager in order to display &bluetooth; in the system tray.
tr: &bluetooth; durumunu sistem tepsisinde görüntülemek için &plasma; masaüstü veya uygun başka bir pencere yöneticisi kullanmalısınız.

source: The &bluetooth; module by default displays an icon in the system tray. The icon provides both control and monitoring status indications. A normal &bluetooth; icon indicates that all devices are disconnected, while the icon with the horizontal dotted line indicates that some devices are connected to your computer.
tr: &bluetooth; modülü, öntanımlı olarak sistem tepsisinde bir simge görüntüler. Bu simge, durum belirteçlerini hem denetleme hem izleme olanağı sunar. Normal bir &bluetooth; simgesi, tüm aygıtların bağlantısının kesili olduğunu, üzerine noktalar olan bir simge ise bazı aygıtların bilgisayarınıza bağlı olduğunu gösterir.

source: If you hover the mouse cursor over the system tray icon, a summary of the connected device list is displayed as a tooltip.
tr: Sistem tepsisi simgesinin üzerine fareyle gelirseniz bağlı aygıtların özetini içeren bir listeyi araç ipucu olarak görebilirsiniz.

source: <mousebutton>Left</mousebutton>-click on the system tray icon to toggle between displaying and hiding the <link linkend="controlpanel">&bluetooth; main control panel</link>.
tr: <link linkend="controlpanel">&bluetooth; ana denetim panelini</link> gösterme ve gizleme arasında geçiş yapmak için sistem tepsisi simgesine <mousebutton>sol</mousebutton> fare düğmesi ile tıklayın.

source: <mousebutton>Right</mousebutton>-click on the system tray icon to display its context menu with just one item:
tr: Bağlam menüsünü görüntülemek için sistem tepsisi simgesinin üzerine <mousebutton>sağ</mousebutton> fare düğmesi ile tıklayın.

source: Configure &bluetooth;
tr: &bluetooth;’u Yapılandır

source: Starts the <link linkend="kcmbluetooth">&plasma; &bluetooth; configuration module</link>.
tr: <link linkend="kcmbluetooth">&plasma; &bluetooth; yapılandırma modülünü</link> başlatır.

source: The &bluetooth; main control panel
tr: &bluetooth; ana denetim paneli

source: The &bluetooth; main control panel can be used to control your computer's &bluetooth; subsystem.
tr: &bluetooth; ana denetim paneli, bilgisayarınızın &bluetooth; alt sistemini denetlemek için kullanılabilir.

source: <screeninfo>&bluetooth; tray control panel</screeninfo>
tr: <screeninfo>&bluetooth; tepsisi denetim paneli</screeninfo>

source: <phrase>&bluetooth; tray control panel</phrase>
tr: <phrase>&bluetooth; tepsisi denetim paneli</phrase>

source: The top row of the panel contains the &bluetooth; switcher to enable or disable the &bluetooth; module, the <quote>plus</quote> button to <link linkend="adddevice">add &bluetooth; devices</link>, and the <quote>configure</quote> button to start the <link linkend="kcmbluetooth">&plasma; &bluetooth; configuration module</link>.
tr: Panelin üst sırası, &bluetooth; modülünü etkinleştirmek veya devre dışı kullanmak için kullanılan &bluetooth; anahtarını içerir; <quote>artı</quote> düğmesiyle <link linkend="adddevice">&bluetooth; aygıtları ekleyebilirsiniz</link> ve <quote>Yapılandır</quote> düğmesi ise <link linkend="kcmbluetooth">&plasma; &bluetooth; yapılandırma modülünü başlatır</link>.

source: The main space of the panel is devoted to the paired devices.
tr: Panelin ana alanı, eşleştirilmiş aygıtlara ayrılmıştır.

source: Click on the <guilabel>v</guilabel> button at the right of the device item to expand its properties.
tr: Bir aygıtın özelliklerini genişletmek için aygıtın sağ yanında bulunan <guilabel>v</guilabel> düğmesine basın.

source: The <guibutton>Send file...</guibutton> button will be shown only if the corresponding device is connected and ready to receive files. This feature may need some additional software to be installed. If needed, please follow the instructions and consult your distribution documentation.
tr: <guibutton>Dosya Gönder</guibutton> düğmesi yalnızca denk gelen aygıt bağlı ve dosya almaya hazır ise gösterilir. Bu özellik, bazı ek yazılımların kurulu olmasını gerektirebilir. Gerekirse dağıtımınızın bu konu ile ilgili olan yardım belgelerine başvurun.
