Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_windowspecific.po
Languages: tr

source: Maximized attribute is emulated by using both <guilabel>Maximized horizontally</guilabel> and <guilabel>Maximized vertically</guilabel> or <guilabel>Initial placement</guilabel> with the <guilabel>Maximizing</guilabel> argument.
tr: Ekranı kaplamış özniteliği, <guilabel>Ekranı Kaplama</guilabel> özniteliğiyle hem <guilabel>Ekranı yatay olarak kaplamış</guilabel> hem de <guilabel>Ekranı dikey olarak kaplamış</guilabel> veya <guilabel>Başlangıç yerleşimi</guilabel> kullanılarak öykünülür.

source: Initial placement
tr: Başlangıç yerleşimi

source: Override the global window placement strategy with one of the following:
tr: Global pencere yerleştirme stratejisini aşağıdakilerden biriyle geçersiz kılın:

source: <guilabel>Default</guilabel> - use the global window placement strategy.
tr: <guilabel>Öntanımlı</guilabel> — genel pencere yerleştirme stratejisini kullanın.

source: <guilabel>No Placement</guilabel> - top-left corner.
tr: <guilabel>Yerleştirme yok</guilabel> — sol üst köşe.

source: <guilabel>Minimal Overlapping</guilabel> - place where no other window exists.
tr: <guilabel>En az çakışan</guilabel> — başka pencerenin olmadığı yerdir.

source: <guilabel>Maximized</guilabel> - start the window maximized.
tr: <guilabel>Ekranı kaplamış</guilabel> — pencereyi ekranı kaplamış olarak başlatın.

source: <guilabel>Centered</guilabel> - center of the desktop.
tr: <guilabel>Ortalanmış</guilabel> — masaüstünün merkezi.

source: Random
tr: Rastgele

source: In Top-Left Corner
tr: Sol üst köşede

source: Under Mouse
tr: Farenin altında

source: <guilabel>On Main Window</guilabel> - restrict placement of a child window to the boundaries of the parent window.
tr: <guilabel>Ana pencerede</guilabel> — bir alt pencerenin yerleşimini ana pencerenin sınırlarıyla sınırlayın.

source: Ignore requested geometry
tr: İstenen geometriyi yok say

source: Toggle whether to accept or ignore the window's requested geometry position. To avoid conflicts between the default placement strategy and the window's request, the placement strategy is ignored when the window's request is accepted.
tr: Pencerenin istenen geometri konumunu kabul etmek veya yok saymak arasında geçiş yapın. Öntanımlı yerleştirme stratejisi ile pencerenin isteği arasındaki çakışmaları önlemek için pencerenin isteği kabul edildiğinde yerleştirme stratejisi yok sayılır.

source: Minimum size, Maximum size
tr: En küçük boyut, En büyük boyut

source: The minimum and maximum size allowed for the window.
tr: Pencere için izin verilen en küçük ve en büyük boyut.

source: Obey geometry restrictions
tr: Geometri kısıtlamalarına uy

source: Toggle whether to adhere to the window's requested aspect ratio or <emphasis>base increment</emphasis>.In order to understand this attribute, some background is required. Briefly, windows must request from the Window Manager, a base increment: the minimum number of <emphasis>height</emphasis> X <emphasis>width</emphasis> pixels per re-size request. Typically, it's 1x1. Other windows though, for example terminal emulators or editors, use fixed-fonts and request their base-increment according to the size of one character.
tr: Pencerenin istenen en boy oranına mı yoksa <emphasis>temel artışa</emphasis> mı bağlı kalacağınızı açın/kapatın. Bu özniteliği anlamak için biraz arka plan gereklidir. Kısaca, pencereler, Pencere Yöneticisi’nden bir temel artış talep etmelidir: Yeniden boyutlandırma isteği başına en az <emphasis>yükseklik</emphasis> X <emphasis>genişlik</emphasis> piksel sayısı olmalıdır. Genellikle 1 × 1’dir. Diğer pencereler, örneğin uçbirim öykünücüleri veya düzenleyicileri, eş aralıklı yazıtiplerini kullanır ve bir karakterin boyutuna göre taban artışlarını ister.

source: <title>Arrangement &amp; Access</title>
tr: <title>Düzenleme ve Erişim</title>

source: Keep above, Keep below
tr: Üzerinde tut, Altında tut

source: Toggle whether to keep the window above/below all others.
tr: Pencerenin diğerlerinin üstünde/altında tutulup tutulmayacağını açın/kapatın.

source: Autogroup with identical
tr: Eşdeğeriyle otomatik grupla

source: Toggle the grouping (commonly known as <emphasis>tabbing</emphasis>) of windows.
tr: Pencerelerin gruplandırmasını (genellikle <emphasis>sekmeleme</emphasis> olarak bilinir) açın/kapatın.

source: Autogroup in foreground
tr: Ön planda otomatik grupla

source: Toggle whether to make the window active when it is added to the current Autogroup.
tr: Geçerli otomatik gruba eklendiğinde pencerenin etkin olup olmayacağını açın/kapatın.

source: Autogroup by ID
tr: Kimliğe göre otomatik grupla

source: Create a group via a user-defined ID. More than one rule can share the same ID to allow for seemingly unrelated windows to be grouped.
tr: Kullanıcı tanımlı bir kimlik aracılığıyla bir grup oluşturun. Görünüşte ilgisiz pencerelerin gruplandırılmasına izin vermek için birden fazla kural aynı kimliği paylaşabilir.

source: Skip taskbar
tr: Görev çubuğunu atla

source: Toggle whether to display the window in the taskbar.
tr: Pencerenin görev çubuğunda görüntülenip görüntülenmeyeceğini açın/kapatın.

source: Skip pager
tr: Sayfalayıcıyı atla

source: Toggle whether to display the window in pager.
tr: Pencerenin sayfalayıcıda görüntülenip görüntülenmeyeceğini açın/kapatın.

source: Skip switcher
tr: Değiştiriciyi atla

source: Toggle whether to display the window in the <guilabel>ALT+TAB</guilabel> list.
tr: Pencerenin <guilabel>SEÇENEK+SEKME</guilabel> listesinde görüntülenip görüntülenmeyeceğini açın/kapatın.

source: Shortcut
tr: Kısayol

source: Assign a shortcut to the window. When <guilabel>Edit...</guilabel> is clicked, additional instructions are presented.
tr: Pencereye bir kısayol atayın. <guilabel>Düzenle…</guilabel> tıklandığında, ek yönergeler sunulur.

source: <title>Appearance &amp; Fixes</title>
tr: <title>Görünüş ve Düzeltmeler</title>

source: No titlebar and frame
tr: Başlık çubuğu ve çerçeve yok

source: Toggle whether to display the titlebar and frame around the window.
tr: Başlık çubuğunun ve pencerenin etrafındaki çerçevenin görüntülenip görüntülenmemesini açın/kapatın.

source: Titlebar color scheme
tr: Başlık çubuğu renk şeması

source: Select a color scheme for the titlebar of the window.
tr: Pencerenin başlık çubuğu için bir renk şeması seçin.

source: Active/Inactive opacity
tr: Etkin/Etkin olmayan matlık

source: When the window is active/inactive, set its opacity to the percentage specified.
tr: Pencere etkin/etkin değilken, matlığını belirtilen yüzdeye ayarlayın.

source: <guilabel>Active/Inactive opacity</guilabel> can only be affected when <guilabel>Desktop Effects</guilabel> are enabled.
tr: <guilabel>Etkin/Etkin olmayan matlık</guilabel>, yalnızca <guilabel>Masaüstü Efektleri</guilabel> etkinleştirildiğinde etkilenir.

source: Focus stealing prevention
tr: Odak çalma koruması

source: When a window wants focus, control on a scale (from <guilabel>None</guilabel> to <guilabel>Extreme</guilabel>) whether to honor the request and place above all other windows, or ignore its request (potentially leaving the window behind other windows):
tr: Bir pencere odağı istediğinde, isteği yerine getirip diğer tüm pencerelerin üstüne yerleştirip yerleştirmeyeceğinizi (<guilabel>Yok</guilabel> ile <guilabel>Çok Yüksek</guilabel> arasında) bir ölçekte denetleyin veya isteğini yok sayın (potansiyel olarak diğer pencerelerin arkasındaki pencere):

source: None - Always grant focus to the window.
tr: Yok — Odağı her zaman pencereye verin.

source: <para>Low</para>
tr: <para>Düşük</para>

source: High
tr: Yüksek

source: Extreme - The window's focus request is denied. Focus is only granted by explicitly requesting via the mousing.
tr: Çok Yüksek — Pencerenin odak isteği reddedildi. Odak, yalnızca fare aracılığıyla açıkça istendiğinde verilir.

source: See <guilabel>Accept focus</guilabel> to make a window read-only - not accept any keyboard input.
tr: Bir pencereyi saltokunur yapmak ve herhangi bir klavye girişini kabul etmemesi için <guilabel>Odağı kabul et</guilabel>’e bakın.

source: Accept focus
tr: Odağı kabul et

source: Toggle whether the window accepts keyboard input. Make the window read-only.
tr: Pencerenin klavye girişini kabul edip etmemesini açın/kapatın. Pencereyi saltokunur yapın.

source: Ignore global shortcuts
tr: Global kısayolları yok say

source: Toggle whether to ignore global shortcuts (as defined by <menuchoice><guimenu>System Settings</guimenu><guisubmenu>Shortcuts and Gestures</guisubmenu><guimenuitem>Global Shortcuts</guimenuitem></menuchoice> or by running <varname>kcmshell6 keys</varname> in <guilabel>konsole</guilabel>) while the window is active.
tr: Pencere etkinken global kısayolları yok saymayı açın/kapatın (<menuchoice><guimenu>Sistem Ayarları</guimenu><guisubmenu>Kısayollar ve Hareketler</guisubmenu><guimenuitem>Global Kısayollar</guimenuitem></menuchoice>’da tanımlandığı üzere veya <guilabel>konsole</guilabel>’da <varname>kcmshell6 keys</varname> yazarak).

source: Closeable
tr: Kapatılabilir

source: Toggle whether to display the <guilabel>Close</guilabel> button on the title bar.
tr: Başlık çubuğunda <guilabel>Kapat</guilabel> düğmesinin görüntülenip görüntülenmemesini açın/kapatın.

source: A terminal window may still be closed by the end user by ending the shell session however using <guilabel>Accept focus</guilabel> to disable keyboard input will make it more difficult to close the window.
tr: Bir uçbirim penceresi, kabuk oturumunu sonlandırarak son kullanıcı tarafından yine de kapatılabilir; ancak klavye girişini devre dışı bırakmak için <guilabel>Odağı kabul et</guilabel> öğesinin kullanılması, pencerenin kapatılmasını daha zor hale getirecektir.

source: <emphasis role="bold">Window type</emphasis>
tr: <emphasis role="bold">Pencere türü</emphasis>

source: Change the window to another type and inherit the characteristics of that window:
tr: Pencereyi başka bir türe değiştirin ve o pencerenin özelliklerini devralın:

source: Normal Window
tr: Normal Pencere

source: Dialog Window
tr: İletişim Kutusu

source: Utility Window
tr: İzlence Penceresi

source: Dock (panel)
tr: Rıhtım (Panel)

source: Toolbar
tr: Araç Çubuğu

source: Torn-Off Menu
tr: Ayrılmış Menü

source: Splash Screen
tr: Açılış Ekranı

source: Desktop
tr: Masaüstü

source: Standalone Menubar
tr: Bağımsız Menü Çubuğu

source: On Screen Display
tr: Ekran Üzeri Görüntü

source: Use with care because unwanted results may be introduced. For example, a <guilabel>Splash Screen</guilabel> is a automatically closed by &kwin; when clicked.
tr: Dikkatli kullanın; çünkü istenmeyen sonuçlar ortaya çıkabilir. Örneğin bir <guilabel>Açılış Ekranı</guilabel>, tıklandığında &kwin; tarafından otomatik olarak kapatılır.

source: Block compositing
tr: Bileşikleştirmeyi engelle

source: Toggle whether to disable compositing while the window <emphasis>exists</emphasis>. If compositing is enabled and the rule specifies to disable compositing, while <emphasis>any</emphasis> matching window exists, compositing will be disabled. Compositing is re-enabled when the last matching window terminates.
tr: Pencere <emphasis>varken</emphasis> bileşikleştirmenin devre dışı bırakılıp bırakılmayacağını değiştirin. Bileşikleştirme etkinleştirilirse ve kural bileşikleştirmenin devre dışı bırakılacağını belirtirse <emphasis>herhangi bir</emphasis> eşleştirme penceresi varken bileşikleştirme devre dışı bırakılır. Bileşikleştirme, son eşleşen pencere sona erdiğinde yeniden etkinleştirilir.

source: Examples
tr: Örnekler

source: The first example details all the necessary steps to create the rules. In order to keep this page a manageable size, subsequent examples only list steps specific to the example.
tr: İlk örnek, kuralları oluşturmak için gerekli tüm adımları ayrıntılandırır. Bu sayfayı yönetilebilir bir boyutta tutmak için sonraki örneklerde yalnızca örneğe özgü adımlar listelenmiştir.

source: The <guilabel>Pager</guilabel> attribute refers to the <guilabel>Virtual Desktop Manager</guilabel>:
tr: <guilabel>Sayfalayıcı</guilabel> özniteliği, <guilabel>Sanal Masaüstü Yöneticisi</guilabel> ile ilgilidir:

source: Pin a Window to a Desktop and set other Attributes
tr: Bir Pencereyi Masaüstüne Sabitleyin ve Diğer Öznitelikleri Ayarlayın

source: Pin &akregator; to <emphasis>Virtual Desktop 2</emphasis>. Additionally, start the application with a preferred size and position. For each attribute, use the <guilabel>Apply Initially</guilabel> <link linkend="parameters">parameter</link> so it can be overridden at run-time.
tr: &akregator;’ü <emphasis>Sanal Masaüstü 2</emphasis>’ye sabitleyin. Ek olarak, uygulamayı yeğlenen bir boyutla ve konumda başlatın. Her bir öznitelik için <guilabel>Başlangıçta Uygula</guilabel> <link linkend="parameters">parametresini</link> kullanın ki çalışma zamanında geçersiz kılınabilsin.

source: The &kwin; rule is created as follows:
tr: &kwin; kuralı şöyle oluşturulur:

source: Start &akregator; on <emphasis>desktop two</emphasis>, size and position it to suit:
tr: &akregator;’ü <emphasis>ikinci masaüstünde</emphasis> başlatın ve istediğiniz gibi konumlandırıp boyutlandırın:

source: Right-click on the titlebar and select <menuchoice><guimenu>More Actions</guimenu><guimenuitem>Window Manager Settings...</guimenuitem></menuchoice>:
tr: Başlık çubuğunda sağ tıklayıp <menuchoice><guimenu>Daha Fazla Eylem</guimenu><guimenuitem>Pencere Yöneticisi Ayarları…</guimenuitem></menuchoice>’nı seçin:

source: Select the <guilabel>Window Rules</guilabel> in the left column and click on <guilabel>New...</guilabel>:
tr: Sol sütunda <guilabel>Pencere Kuralları</guilabel>’nı seçin ve <guilabel>Yeni…</guilabel>’ye tıklayın:

source: The <guilabel>Edit Window-Specific Settings</guilabel> window is displayed. <guilabel>Window matching</guilabel> is the default tab:
tr: <guilabel>Pencereye Özgü Ayarları Düzenle</guilabel> penceresi görüntülenir. <guilabel>Pencere eşleştirme</guilabel> öntanımlı sekmedir:

source: Click <guilabel>Detect Window Properties</guilabel> with <guilabel>0s delay</guilabel> the cursor immediately turns into cross-hairs. Click (anywhere) inside the &akregator; window (but not the title bar). The window criteria are presented. Match only by primary class name so leave the check boxes unchecked - for additional information see <link linkend="window-matching">window matching</link>:
tr: <guilabel>0 sn gecikme</guilabel> ile <guilabel>Pencere Özelliklerini Algıla</guilabel>’ya tıklayın, imleç hemen artı işaretine dönüşür. &akregator; penceresi içinde (herhangi bir yere) tıklayın; (ancak başlık çubuğuna değil). Pencere kriterleri sunulur. Yalnızca birincil sınıf adına göre eşleştirin, bu nedenle onay kutularını işaretlemeyin — ek bilgi için <link linkend="window-matching">pencere eşleştirme</link> bölümüne bakın:

source: Clicking <guilabel>OK</guilabel> the previous window back-fills the results in the <guilabel>Window Matching</guilabel> tab. Enter a meaningful text in the <guilabel>Description</guilabel> field (which is displayed in the <guilabel>KWin Rule</guilabel> window):
tr: Önceki pencerede <guilabel>Tamam</guilabel>’a tıklamak, <guilabel>Pencere Eşleştirme</guilabel> sekmesindeki sonuçları geri doldurur. <guilabel>Açıklama</guilabel> alanına (<guilabel>KWin Kuralı</guilabel> penceresindeki) anlamlı bir metin girin:

source: Enable the window attributes: <guilabel>Position</guilabel>, <guilabel>Size</guilabel> and <guilabel>Desktop</guilabel>. The initial values are set by <guilabel>Detect Window Properties</guilabel> and can be overridden:
tr: Pencere özniteliklerini etkinleştirin: <guilabel>Konum</guilabel>,<guilabel>Boyut</guilabel> ve <guilabel>Masaüstü</guilabel>. Başlangıç değerleri <guilabel>Pencere Özelliklerini Algıla</guilabel> tarafından ayarlanır ve geçersiz kılınabilir:

source: Clicking <guilabel>OK</guilabel> in the previous window returns to the main <guilabel>KWin Rules</guilabel>. The new rule with its description is listed:
tr: Önceki pencerede <guilabel>Tamam</guilabel>’a tıklandığında ana <guilabel>KWin Kuralları</guilabel>’na geri dönülür. Açıklamasıyla birlikte yeni kural listelenmiştir:

source: Click <guilabel>OK</guilabel> to close the window.
tr: Pencereyi kapatmak için <guilabel>Tamam</guilabel>’a tıklayın.

source: Done.
tr: Bitti.

source: Application on all Desktops and Handle One Child Window Uniquely
tr: Tüm Masaüstlerinde Uygulamayı ve Bir Alt Pencereyi Benzersizce İşleyin

source: Except for conversation windows, display &kopete; and its children windows on all desktops and skip the systray and pager. For children conversation windows, treat them as the parent window except show them in systray.
tr: Konuşma pencereleri dışında, &kopete; ve alt pencereleri tüm masaüstlerinde açılır ve sistem tepsisi ile sayfalayıcıyı atlar. Alt konuşma pencereleri için bunları sistem tepsisinde gösterme dışında ana pencere olarak ele alın.

source: For each attribute, use the <guilabel>Force</guilabel> <link linkend="parameters">parameter</link> so it can not be overridden.
tr: Her bir öznitelik için <guilabel>Zorla</guilabel> <link linkend="parameters">parametresini</link> kullanın, böylece geçersiz kılınamaz.

source: In order to implement the above, two rules need to be created:
tr: Yukarıdakileri uygulamak için iki kuralın oluşturulması gerekir:

source: A rule for <guilabel>Kopete Chat</guilabel> and
tr: <guilabel>Kopete Sohbeti</guilabel> için bir kural ve

source: A rule for &kopete;
tr: &kopete; için bir kural

source: The <guilabel>Kopete Chat</guilabel> rule's matching-criteria is more restrictive than the <emphasis>Kopete</emphasis> rule as it needs to match a specific Window Role: the chat window. Due to <link linkend="rule-evaluation">rule evaluation</link> processing, the <guilabel>Kopete Chat</guilabel> rule must precede the &kopete; rule in the <link linkend="kopete-kwin-rule-list">KWin Rule list for Kopete</link>.
tr: <guilabel>Kopete Sohbeti</guilabel> kuralının eşleştirme kriteri, belirli bir pencere rolüyle, yani sohbet penceresiyle eşleşmesi gerektiğinden, <emphasis>Kopete</emphasis> kuralından daha kısıtlayıcıdır. <link linkend="rule-evaluation">Kural değerlendirmesi</link> işlemesi nedeniyle, <link linkend="kopete-kwin-rule-list">KWin Rule list for Kopete için KWin Kuralı listesi</link> içindeki &kopete; kuralından önce gelmelidir.

source: Kopete Chat Rule
tr: Kopete Sohbeti Kuralı

source: Assuming a <guilabel>Kopete Chat</guilabel> window is open:
tr: Bir <guilabel>Kopete Sohbeti</guilabel> penceresinin açık olduğunu varsayarsak:

source: Use <guilabel>Detect Window Properties</guilabel> and select the <guilabel>Kopete Chat</guilabel> window. Check the <guilabel>Window role</guilabel> box to restrict the criteria to chat windows - for additional information see <link linkend="window-matching">window matching</link>:
tr: <guilabel>Pencere Özelliklerini Algıla</guilabel>’yı kullanın ve <guilabel>Kopete Sohbeti</guilabel> penceresini seçin. Kriterleri sohbet pencereleriyle sınırlamak için <guilabel>Pencere rolü</guilabel> kutusunu işaretleyin — ek bilgi için <link linkend="window-matching">pencere eşleştirme</link>bölümüne bakın:

source: Clicking <guilabel>OK</guilabel> in the previous window back-fills the results in the <guilabel>Window Matching</guilabel> tab. Enter a meaningful text in the <guilabel>Description</guilabel> box:
tr: Önceki pencerede <guilabel>Tamam</guilabel>’a tıklandığında <guilabel>Pencere Eşleştirme</guilabel> sekmesindeki sonuçlar geri doldurulur. <guilabel>Açıklama</guilabel> kutusuna anlamlı bir metin girin:

source: Enable the following attributes:
tr: Aşağıdaki öznitelikleri etkinleştirin:

source: Click through to complete entry of the rule.
tr: Kuralın girişini tamamlamak için tıklayın.

source: The <guilabel>Skip taskbar</guilabel> attribute is set to <guilabel>No</guilabel> to display the window in the taskbar which loosely translates to: <emphasis>no</emphasis> <emphasis>do not</emphasis> <emphasis>skip taskbar</emphasis> <inlinemediaobject> <imageobject> <imagedata fileref="Face-smile.png" format="PNG"/> </imageobject> </inlinemediaobject>.
tr: Pencereyi görev çubuğunda görüntülemek için <guilabel>Görev çubuğunu atla</guilabel> özniteliği <guilabel>Hayır</guilabel> olarak ayarlanmıştır. Bu da şu anlama gelir: <emphasis>Hayır</emphasis>, <emphasis>görev çubuğunu</emphasis> <emphasis>atlama</emphasis> <inlinemediaobject> <imageobject> <imagedata fileref="Face-smile.png" format="PNG"/> </imageobject> </inlinemediaobject>.

source: Kopete Rule
tr: Kopete Kuralı

source: Assuming &kopete; is open:
tr: &kopete;’nin açık olduğunu varsayarsak:

source: Use <guilabel>Detect Window Properties</guilabel> and select the &kopete; window. Match only by primary class name so leave the check boxes unchecked - for additional information see <link linkend="window-matching">window matching</link>:
tr: <guilabel>Pencere Özelliklerini Algıla</guilabel>’yı kullanın ve &kopete; penceresini seçin. Yalnızca birincil sınıf adına göre eşleştirin, bu nedenle onay kutularını işaretlemeyin — ek bilgi için <link linkend="window-matching">pencere eşleştirme</link> bölümüne bakın:

source: Kopete KWin Rule List
tr: Kopete KWin Kuralı Listesi

source: As mentioned, due to <link linkend="rule-evaluation">rule evaluation</link> processing, the <guilabel>Kopete Chat</guilabel> rule must precede the &kopete; rule:
tr: Söz edildiği üzere, <link linkend="rule-evaluation">kural değerlendirmesi</link> nedeniyle, <guilabel>Kopete Sohbeti</guilabel> kuralı &kopete; kuralından önce gelmelidir:

source: Suppress a Window from showing on Pager
tr: Bir Pencerenin Sayfalayıcıda Gösterilmesini Engelleyin

source: <guilabel>KNotes</guilabel> currently does not allow for its notes to skip the pager however a rule easily solves this shortcoming.
tr: <guilabel>K Notlar</guilabel> şu anda notlarının sayfalayıcıyı atlamasına izin vermiyor; ancak bir kural bu eksikliği kolayca çözer.

source: Assuming a <emphasis>sticky note</emphasis>' window is available:
tr: Bir <emphasis>yapışkan not</emphasis> penceresinin var olduğunu varsayarsak:

source: Use <guilabel>Detect Window Properties</guilabel> and select any <emphasis>sticky note</emphasis> window. Match only by primary class name so leave the check boxes unchecked - for additional information see <link linkend="window-matching">window matching</link>:
tr: <guilabel>Pencere Özelliklerini Algıla</guilabel>’yı kullanın ve herhangi bir <emphasis>yapışkan not</emphasis> penceresini seçin. Yalnızca birincil sınıf adına göre eşleştirin, bu nedenle onay kutularını işaretlemeyin — ek bilgi için <link linkend="window-matching">pencere eşleştirme</link> bölümüne bakın:

source: Enable the <guilabel>Skip Pager</guilabel> attribute with the <guilabel>Force</guilabel> <link linkend="parameters">parameter</link>:
tr: <guilabel>Sayfalayıcıyı Atla</guilabel> özniteliğini <guilabel>Zorla</guilabel> <link linkend="parameters">parametresiyle</link> etkinleştirin:

source: Force a Window to the Top
tr: Bir Pencereyi En Üste Zorla

source: To pop an active window to the top, set its <guilabel>Focus stealing prevention</guilabel> attribute to <guilabel>None</guilabel>, typically, in conjunction with the <guilabel>Force</guilabel> <link linkend="parameters">parameter</link>:
tr: Etkin bir pencereyi en yukarıda açmak için onun <guilabel>Odak çalma koruması</guilabel> özniteliğini <guilabel>Yok</guilabel> olarak ayarlayın; genellikle <guilabel>Zorla</guilabel> <link linkend="parameters">parametresiyle</link> birlikte kullanılır:

source: Multiple Rules per Application
tr: Uygulama Başına Birden Çok Kural

source: <application>Thunderbird</application> has several different child windows. This example:
tr: <application>Thunderbird</application> birkaç farklı alt pencereye sahiptir. Bu örnekte:
