Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_keys.po
Languages: tr

source: Shortcuts
tr: Kısayollar

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: key bindings
tr: düğme bağıntıları

source: bindings
tr: bağıntılar

source: shortcuts
tr: kısayollar

source: Introduction
tr: Giriş

source: While most of the functionality offered by &plasma; can be accessed using a simple <quote>point and click</quote> interface, many people prefer using the keyboard for some tasks. Pressing something like <keycombo action="simul"> &Ctrl;<keycap>F</keycap></keycombo> is often just faster than moving your hands off the keyboard to the mouse, opening the <guimenu>Edit</guimenu> menu and selecting <guimenuitem>Find</guimenuitem>.
tr: &plasma; tarafından sunulan işlevselliğin birçoğuna temel bir <quote>işaretle ve tıkla</quote> arayüzüyle erişilebilirken, birçok kişi bazı görevler için klavyeyi kullanmayı yeğler. <keycombo action="simul"> &Ctrl;<keycap>F</keycap></keycombo> gibi bir kısayollu kullanmak, çoğu zaman elinizi klavyeden kaldırıp fareyi almak ve <guimenu>Düzen</guimenu> menüsünü açıp <guimenuitem>Bul</guimenuitem>’u seçmekten çok daha hızlıdır.

source: As different people have different preferences about keyboard shortcuts, &plasma; offers full customization of <quote>key bindings.</quote> A key binding or shortcut is a combination of an action with a key or a combination of keys.
tr: Farklı kişilerin klavye kısayolları hakkında farklı tercihleri olduğundan, &plasma; <quote>düğme bağıntılarının</quote> tam olarak özelleştirilmesine izin verir. Bir düğme bağıntısı veya kısayol, bir eylemin bir düğme veya bir düğme kombinasyonu ile birleşimidir.

source: Standard Shortcuts and Global Shortcuts
tr: Standart Kısayollar ve Global Kısayollar

source: Standard shortcuts and Global shortcuts work just the same. Actually, in a certain way standard or application shortcuts are <quote>global</quote> as well. The only difference is:
tr: Standart kısayollar ve Global kısayollar aynı biçimde çalışır. Aslında, belirli bir şekilde standart veya uygulama kısayolları da <quote>global</quote>’dir. Tek farkı:

source: <quote>Standard shortcuts</quote> refer to actions that are often available in applications, such as Save, Print, Copy &etc;
tr: <quote>Standart kısayollar</quote> genellikle uygulamalarda bulunan Kaydet, Yazdır, Kopyala vb. eylemlere başvurur.

source: <quote>Global shortcuts</quote> are shortcuts for actions that make sense even when no application is opened. These shortcuts usually refer to actions like switching desktops, manipulating windows &etc;
tr: <quote>Global kısayollar</quote>, hiçbir uygulama açık değilken bile anlamlı olan eylemler için kısayollardır. Bu kısayollar genellikle masaüstleri arasında geçiş yapma, pencereleri değiştirme vb. işlemlere başvurur.

source: Please note, that the application shortcuts configured here are <emphasis>only</emphasis> the standard actions often found in applications. Most applications will define their own actions as well, for which you have to customize key bindings using the application's key bindings dialog.
tr: Lütfen burada yapılandırılan uygulama kısayollarının <emphasis>yalnızca</emphasis> uygulamalarda sıklıkla bulunan standart eylemler olduğunu unutmayın. Çoğu uygulama, uygulamanın düğme bağıntıları iletişim kutusunu kullanarak özelleştirmeniz gereken kendi eylemlerini de tanımlar.

source: Standard Shortcuts page
tr: Standart Kısayollar sayfası

source: At the top of this dialog you see an input box, where you can search interactively for shortcut names (&eg; Copy) or combination of keys (&eg; <quote><userinput>Ctrl+C</userinput></quote>) by typing them literally here.
tr: Bu iletişim kutusunun üst kısmında, etkileşimli olarak kısayol adlarını buraya yazarak (&eg;, Kopyala) veya düğme kombinasyonlarını (&eg;, <quote><userinput>Kontrol+C</userinput></quote>) arayabileceğiniz bir giriş kutusu görürsünüz.

source: Below the search box you can see a list of key bindings, &ie; associations between actions (&eg; Copy) shown in the <guilabel>Action</guilabel> column and keys or combination of keys (&eg; <keycombo action="simul">&Ctrl;<keycap>C</keycap> </keycombo>) shown in the <guilabel>Shortcut</guilabel> or <guilabel>Alternate</guilabel> column.
tr: Arama kutusunun altında düğme bağıntılarının bir listesini görebilirsiniz. Bunlara örnek olarak, <guilabel>Eylem</guilabel> sütününda gösterilen eylemler arasındaki ilişkilendirmeler (&eg;, Kopyala) ve <guilabel>Kısayol</guilabel> veya <guilabel>Alternatif</guilabel> sütünundaki düğmeler veya düğme kombinasyonları (&eg;, <keycombo action="simul">&Ctrl;<keycap>C</keycap> </keycombo>) verilebilir.

source: Global Shortcuts page
tr: Global Kısayollar sayfası

source: At the left of this page is a list box which allows you to select a <guilabel>Component</guilabel> like KWin, Plasma Desktop &etc; The defined shortcuts for the selected component are displayed in the <guilabel>Action</guilabel> and <guilabel>Global</guilabel> column in the list view.
tr: Bu sayfanın solunda, KWin, Plasma Masaüstü vb. gibi bir <guilabel>Bileşen</guilabel> seçmenizi sağlayan bir liste kutusu bulunur. Seçilen bileşen için tanımlanan kısayollar, liste görünümünde <guilabel>Eylem</guilabel> ve <guilabel>Global</guilabel> sütunlarında görüntülenir.

source: This page has the same search box as the <guilabel>Standard Shortcuts</guilabel> tab.
tr: Bu sayfa, <guilabel>Standart Kısayollar</guilabel> sekmesiyle aynı arama kutusuna sahiptir.

source: Use <guiicon><inlinemediaobject><imageobject><imagedata fileref="list-add.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> or <guiicon><inlinemediaobject><imageobject><imagedata fileref="remove.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> to add or remove a component.
tr: Bir bileşen eklemek veya kaldırmak için <guiicon><inlinemediaobject><imageobject><imagedata fileref="list-add.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> veya <guiicon><inlinemediaobject><imageobject><imagedata fileref="remove.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> düğmelerini kullanın.

source: Adding a component opens a dialog to pick applications from the start menu structure to add launchers to be usable as shortcuts. If an application has jumplist options they will be available as actions.
tr: Bir bileşen eklemek, kısayol olarak kullanılabilecek başlatıcılar eklemek için başlat menüsü yapısından uygulamaları seçmek üzere bir iletişim kutusu açar. Bir uygulamanın atlama listesi seçenekleri varsa bunlar eylem olarak kullanılabilir.

source: Click the <guilabel>File</guilabel> drop down box at the right to import/export a Scheme, set all shortcuts to none.
tr: Bir şemayı içe/dışa aktarmak için sağdaki <guilabel>Dosya</guilabel> açılır kutusuna tıklayın, tüm kısayolları yok olarak ayarlayın.

source: Global shortcuts can now be configured to jump to specific tasks within an application.
tr: Global kısayollar artık bir uygulama içindeki belirli görevlere atlayacak şekilde yapılandırılabilir.

source: By default you can open the application menu by just pressing the &Meta; key.
tr: Öntanımlı olarak, uygulama menüsünü yalnızca &Meta; düğmesine basarak açabilirsiniz.

source: Configuring Key Bindings
tr: Düğme Bağıntılarını Yapılandırmak

source: Configuring key bindings is pretty easy. In the middle of these &systemsettings; modules you will find a list of available actions. If there's a key binding configured for that action you will find it in the columns right to it. Just select the action you want to configure.
tr: Düğme bağıntılarını yapılandırmak oldukça kolaydır. Bu &systemsettings; modülünün ortasında, kullanılabilir eylemlerin bir listesini bulacaksınız. Bu eylem için yapılandırılmış bir düğme bağıntısı varsa onu da hemen yanındaki sütunlarda bulacaksınız. Yalnızca yapılandırmak istediğiniz eylemi seçin.

source: After you have selected an action in the list you will notice that this item is highlighted and you see two additional check boxes below this item in the list view. There you can configure a combination of keys or maybe no key binding at all for the selected action.
tr: Listede bir eylem seçtikten sonra, bu ögenin vurgulandığını fark edersiniz ve liste görünümünde bu ögenin altında iki ek onay kutusu göreceksiniz. Orada, seçilen eylem için bir düğme kombinasyonunu yapılandırabilir veya belki de hiçbir düğme bağıntısı koymayabilirsiniz.

source: <guilabel>Default</guilabel>: the selected action will be associated with &kde;'s default value. This is a good choice for most actions, as &kde; comes with reasonable key bindings we have thought about.
tr: <guilabel>Öntanımlı</guilabel>: Seçili eylem, &kde;’nin öntanımlı değeriyle ilişkilendirilecektir. Bu, çoğu eylem için iyi bir seçimdir; çünkü &kde; makul olduğunu düşündüğümüz düğme bağıntılarıyla gelir.

source: <guilabel>Custom</guilabel>: if this option is enabled, you can create a key combination for the selected action. Click on the button labeled either <guibutton>None</guibutton> or labeled with the previously selected custom shortcut. Now the button label changes to <guibutton>Input</guibutton>. Then press any modifier key (&ie; &Shift;, &Ctrl;, or &Alt;) and then normal key or a function key (&eg; <keycap>F11</keycap>) you want to assign to this key combination.
tr: <guilabel>Özel</guilabel>: Bu seçenek etkinleştirilirse seçili eylem için bir düğme kombinasyonu oluşturabilirsiniz. <guibutton>Yok</guibutton> etiketli veya önceden seçilen özel kısayolla etiketlenmiş düğmeyi tıklayın. Şimdi düğme etiketi <guibutton>Giriş</guibutton> olarak değişir. Ardından herhangi bir niteleyici düğmeye (&eg; &Shift;, &Ctrl; veya &Alt;) ve ardından bu düğme kombinasyonuna atamak istediğiniz normal düğmeye veya bir işlev düğmesine (&eg;, <keycap>F11</keycap>) basın.

source: Clicking on the <guilabel>Alternate</guilabel> column of a row in the list allows to edit the second shortcut for the action.
tr: Listedeki bir satırın <guilabel>Alternatif</guilabel> sütununa tıklamak, eylem için ikinci kısayolu düzenlemeye izin verir.
