Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_plasma-*.po
Languages: pa

source: <!ENTITY i18n-plasmapa 'Audio Volume'>
pa: <!ENTITY i18n-plasmapa 'Ses'>

source: ROLES_OF_TRANSLATORS
pa: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: This documentation describes the &i18n-plasmapa; Systemsettings module.
pa: Bu belgelendirme, &i18n-plasmapa; sistem ayarları modülünü açıklar.

source: System
pa: sistem

source: Settings
pa: ayarlar

source: configuration
pa: yapılandırma

source: multimedia
pa: çoklu ortam

source: sound
pa: ses

source: volume
pa: ses düzeyi

source: speaker
pa: hoparlör

source: headset
pa: mikrofonlu kulaklık

source: Introduction
pa: Giriş

source: &i18n-plasmapa; provides the user with a mechanism to control the volume of devices and applications using the PulseAudio sound system.
pa: &i18n-plasmapa; kullanıcıya, PulseAudio ses sistemini kullanan aygıtların ve uygulamaların ses düzeyini denetlemesi için bir mekanizma sağlar.

source: System Settings Module
pa: Sistem Ayarları Modülü

source: &i18n-plasmapa; allows the user to control the volume of output devices, application-level channels, input and recording devices. It allows the user to route audio to and from specific devices. &i18n-plasmapa; consists of a system settings module and a Plasma widget, which can usually be found in the system tray area.
pa: &i18n-plasmapa;, kullanıcının çıkış aygıtlarının, uygulama düzeyi kanallarının, giriş ve kayıt aygıtlarının ses düzeyini denetlemesine izin verir. Kullanıcının belirli aygıtlara ve aygıtlardan ses yönlendirebilmesini sağlar. &i18n-plasmapa;, genellikle sistem tepsisi alanında bulunabilen bir sistem ayarları modülü ve bir Plasma araç takımından oluşur.

source: &i18n-plasmapa; groups volume and sound settings for different channels or devices into the following groups:
pa: &i18n-plasmapa;, farklı kanallar veya aygıtlar için ses düzeyi ve ses ayarlarını aşağıdaki gruplarda gruplandırır:

source: Applications: Applications that play audio, such as your music player or web browser.
pa: Uygulamalar: Müzik çalarınız veya web tarayıcınız gibi ses çalan uygulamalar.

source: Recording: Change the volume of recording devices, such as a connected microphone or head set.
pa: Kayıt: Bağlı bir mikrofon veya kulaklık gibi kayıt aygıtlarının ses düzeyini değiştirin.

source: Output Devices: Output devices, you can find your headphone jack or bass woofer or connected bluetooth speaker here, grouped under the sound card they are connected to.
pa: Çıkış Aygıtları: Çıkış aygıtları altında, kulaklık jakınızı veya bass woofer’ınızı veya bağlı Bluetooth hoparlörünüzü burada bağlı oldukları ses kartının altında gruplanmış halde bulabilirsiniz.

source: Input Devices: Sound input devices that maybe be connected to your computer.
pa: Giriş Aygıtları: Bilgisayarınıza bağlı olabilecek ses giriş aygıtları.

source: Configuration: This tab allows to set specific profiles to such as Analog Stereo or Digital Surround 5.1. For bluetooth devices, you can switch to the high-fidelity AD2P bluetooth profile here.
pa: Yapılandırma: Bu sekme, Analog Stereo veya Digital Surround 5.1 gibi belirli profillerin ayarlanmasına izin verir. Bluetooth aygıtları için yüksek kaliteli AD2P Bluetooth profiline buradan geçiş yapabilirsiniz.

source: Plasma Widget
pa: Plasma Araç Takımı

source: The &i18n-plasmapa; Plasma Widget is automatically loaded in the system tray area. Clicking on the speaker icon in the panel opens a popup with volume control sliders for different playback devices, and allows to change their volume individually.
pa: &i18n-plasmapa; Plasma Araç Takımı, kendiliğinden sistem tepsisi alanına yüklenir. Paneldeki hoparlör simgesine tıklandığında, farklı kayıttan çalma/oynatma aygıtları için ses denetim sürgüleri içeren bir açılır pencere açılır ve bunların ses düzeylerinin ayrı ayrı değiştirilmesine izin verilir.

source: Credits and License
pa: Emeği Geçenler ve Lisans

source: Program copyright 2014-2015 Harald Sitter
pa: Program telif hakkı 2014–2015 Harald Sitter

source: Documentation Copyright &copy; 2015 &Sebastian.Kuegler; &Sebastian.Kuegler.mail;
pa: Belgelendirme telif hakkı &copy; 2015 &Sebastian.Kuegler; &Sebastian.Kuegler.mail;

source: CREDIT_FOR_TRANSLATORS
pa: <para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
