Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_icons.po
Languages: tr

source: Icons
tr: Simgeler

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: icon
tr: simge

source: &plasma; comes with a full set of icons in several sizes. These icons are being used all over &plasma;: the desktop, the panel, the &dolphin; file manager, in every toolbar of every &plasma; application, etc. The icons control module offers you very flexible ways of customizing the way &plasma; handles icons.
tr: &plasma;, birkaç boyutta tam simge kümeleri ile birlikte gelir. Bu simgeler, &plasma;’nın her yerinde kullanılırlar: Masaüstü, panel, &dolphin; dosya yöneticisi, her bir &plasma; uygulamasının araç çubuklarında vb. Simgeler denetim modülü, &plasma;’nın simgeleri işleme yolunu özelleştirmek için esnek yordamlar sunar.

source: Here's a screenshot of the icon theme manager
tr: İşte simge teması yöneticisinin bir ekran görüntüsü

source: Customizing &plasma; icons
tr: &plasma; simgelerini özelleştirmek

source: In this module you can:
tr: Bu modülde şunları yapabilirsiniz:

source: install and choose icon themes
tr: simge temaları kurmak ve onları seçmek

source: choose different icon sizes
tr: değişik simge boyutları seçmek

source: remove icon themes
tr: simge temalarını kaldırmak

source: Please note that some of these settings may depend on your selected icon theme. &plasma; comes with several icon themes by default, Breeze, Breeze Dark and Oxygen.
tr: Lütfen bu ayarlardan bazılarının seçtiğiniz simge temasına bağlı olabileceğini unutmayın. &plasma; öntanımlı olarak Esinti, Esinti Koyu ve Oksijen olmak üzere birkaç simge temasıyla birlikte gelir.

source: At the top is a preview of the current theme icons. Most default installations will have only a few icon theme available, amongst them the &plasma; default Breeze theme. You can also download more from the Internet from <ulink url="https://store.kde.org/">https://store.kde.org/</ulink> or install them from a local file.
tr: En üstte, geçerli tema simgelerinin bir önizlemesi bulunur. Çoğu öntanımlı kurulum, aralarında &plasma; öntanımlısı olan Esinti temasının olduğu birkaç simge teması içerir. Ayrıca <ulink url="https://store.kde.org/">https://store.kde.org/</ulink> adresinden daha fazlasını indirebilir veya yerel bir dosyadan kurabilirsiniz.

source: On hover an animated preview shows a random selection, common mime types and common folder icons.
tr: Fareyle üzerine gelindiğinde canlandırmalı bir önizleme; rastgele bir seçimi, ortak MIME türlerini ve ortak klasör simgelerini gösterir.

source: If you want to remove a theme, use the <inlinemediaobject><imageobject><imagedata fileref="edit-delete.png" format="PNG"/></imageobject></inlinemediaobject> overlay icon at the bottom right of the theme icon. To undo this action click on the <inlinemediaobject><imageobject><imagedata fileref="edit-undo.png" format="PNG"/></imageobject></inlinemediaobject> icon. If you hit the <guibutton>Apply</guibutton> button the themes selected for removal are actually deleted, so you cannot undo individual or all deletions.
tr: Bir temayı kaldırmak için simge temasının sağ alt köşesindeki <inlinemediaobject><imageobject><imagedata fileref="edit-delete.png" format="PNG"/></imageobject></inlinemediaobject> kaplama simgesine tıklayın. To undo this action click on the <inlinemediaobject><imageobject><imagedata fileref="edit-undo.png" format="PNG"/></imageobject></inlinemediaobject> icon. If you hit the <guibutton>Apply</guibutton> button the themes selected for removal are actually deleted, so you cannot undo individual or all deletions.

source: <guilabel>Configure Icon Sizes</guilabel>
tr: <guilabel>Simge Boyutlarını Yapılandır</guilabel>

source: Select one of the components and use the slider to adapt the corresponding size.
tr: Bileşenlerden birini seçin ve ilgili boyuta uyarlamak için sürgüyü kullanın.

source: <screeninfo>Configure Icon Sizes</screeninfo>
tr: <screeninfo>Simge Boyutlarını Yapılandır</screeninfo>

source: <phrase>Configure Icon Sizes</phrase>
tr: <phrase>Simge Boyutlarını Yapılandır</phrase>

source: Get New Icons...
tr: Yeni Simgeler Al…

source: You need to be connected to the Internet to use it. Clicking on this button will display a dialog where you can choose a new icon theme. Clicking on <guibutton>Install</guibutton> in the dialog will install the chosen icon theme and after you <guibutton>Close</guibutton> the installer your new theme is immediately available.
tr: Kullanmak için internete bağlı olmanız gerekir. Bu düğmeye tıklamak, yeni bir simge teması seçebileceğiniz bir iletişim kutusu görüntüler. İletişim kutusundaki <guibutton>Kur</guibutton> seçeneğine tıklamak, seçilen simge temasını kurar ve Kur ekranını <guibutton>Kapat</guibutton>’tıktan sonra yeni temayı hemen kullanabilirsiniz.

source: <screeninfo>Get New Icons</screeninfo>
tr: <screeninfo>Yeni Simgeler Al</screeninfo>

source: <phrase>Get New Icons</phrase>
tr: <phrase>Yeni Simgeler Al</phrase>

source: Install from File...
tr: Dosyadan Kur…

source: If you downloaded new themes from the internet, you can use this to browse to the location of those newly downloaded themes. Clicking on this button will bring you the file dialog to point to the icon theme tarball you have on your disk.
tr: İnternetten yeni temalar indirdiyseniz yeni indirilen temaların konumuna göz atmak için bunu kullanabilirsiniz. Bu düğmeye tıklamak, diskinizde bulunan simge teması arşiv paketini seçmenizi sağlayacak dosya iletişim kutusunu açar.

source: Clicking <guibutton>Open</guibutton> in this dialog will install the theme you pointed to and make it available in the theme list.
tr: Bu iletişim kutusunda işaret ettiğiniz dosya için <guibutton>Aç</guibutton> düğmesine tıklamak temayı kurar ve tema listesinde kullanılabilir yapar.
