Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_clock.po
Languages: tr

source: Date &amp; Time
tr: Tarih ve Zaman

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Systemsettings
tr: sistem ayarları

source: clock
tr: saat

source: date
tr: tarih

source: time
tr: zaman

source: <keyword>set</keyword>
tr: <keyword>ayarla</keyword>

source: configure
tr: yapılandır

source: You can use this module to alter the system date and time, using a convenient graphical interface.
tr: Kullanımı kolay bir grafik arayüzle, sistem tarihini ve zamanını değiştirmek için bu modülü kullanabilirsiniz.

source: As these settings do not only affect you as a user, but rather the whole system, you must have system administrator (<systemitem class="username">root</systemitem>) access to change the system date and time. If you do not have this access level, this module will only show you the current settings, but your changes will not be saved.
tr: Bu ayarlar yalnızca bir kullanıcı olarak sizi değil tüm sistemi etkilediğinden, sistem tarih ve saatini değiştirmek için sistem yöneticisi (<systemitem class="username">root</systemitem>) erişiminiz olmalıdır. Bu erişim düzeyine sahip değilseniz bu modül size yalnızca geçerli ayarları gösterecek; ancak değişiklikleriniz kaydedilmeyecektir.

source: Date and Time
tr: Tarih ve Zaman

source: If you check <guilabel>Set date and time automatically</guilabel> this module will use <acronym>systemd</acronym> to fetch date and time.
tr: <guilabel>Tarihi ve zamanı kendiliğinden ayarla</guilabel> onay kutusunu işaretlerseniz bu modül, tarih ve zaman bilgisini almak için <acronym>systemd</acronym> kullanır.

source: On a computer without <acronym>systemd</acronym> the <acronym>NTP</acronym> utilities <command>rdate</command> or <command>ntpdate</command> are used. If these utilities are missing please install them.
tr: <acronym>systemd</acronym> olmayan bir bilgisayarda, <acronym>NTP</acronym> izlenceleri olan <command>rdate</command> veya <command>ntpdate</command> kullanılır. Bu izlenceler sisteminizde yoksa lütfen onları kurun.

source: When you log in to the &plasma; session while being online or when you later connect to the Internet the access to one or more <acronym>NTP</acronym> servers happens.
tr: Çevrimiçiyken &plasma; oturumunu açtığınızda veya daha sonra internete bağlandığınızda, bir veya birden çok <acronym>NTP</acronym> sunucusuna erişim gerçekleşir.

source: This is not sufficient, however, for maintaining an accurate clock in the long run. This is useful for occasionally setting the time on machines that do not have full-time network access, such as laptops.
tr: Ancak bu, uzun vadede doğru bir saat tutmak için yeterli değildir. Bu, dizüstü bilgisayarlar gibi tam zamanlı ağ erişimi olmayan makinelerde ara sıra zamanı ayarlamak için kullanışlıdır.

source: If you do not use a time server, you are able to set the date manually in the calendar.
tr: Bir zaman sunucusu kullanmıyorsanız tarihi takvimde elle ayarlayabilirsiniz.

source: Use the controls at the bottom of the calendar to select the current date, enter the date in the edit box or select the week of the year from the drop down box.
tr: Geçerli tarihi seçmek için takvimin altındaki denetimleri kullanın, tarihi düzenleme kutusuna girin veya açılan kutudan yılın haftasını seçin.

source: You set the time using the spin boxes at the bottom of the analog clock. You can also directly enter your value.
tr: Analog saatin altındaki döndürme kutularını kullanarak zamanı ayarlarsınız. Değerinizi doğrudan da girebilirsiniz.

source: Time Zone
tr: Zaman Dilimi

source: To set a new time zone, simply select your area from the list below. Use the filter box to find the desired <guilabel>Area</guilabel> or <guilabel>Region</guilabel>.
tr: Yeni bir zaman dilimi ayarlamak için aşağıdaki listeden bölgenizi seçmeniz yeterlidir. İstenen <guilabel>Alan</guilabel>’ı veya <guilabel>Bölge</guilabel>’yi bulmak için süzgeç kutusunu kullanın.
