Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_kcmaudiocd.po
Languages: tr

source: Audio-CD
tr: Ses CD’si

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@îcloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Applications 19.04
tr: Uygulamalar 19.04

source: System Settings
tr: Sistem Ayarları

source: audio
tr: ses

source: compact disc
tr: kompakt disk

source: Audiocd KIO Worker Configuration
tr: Ses CD’si KIO İşçisi Yapılandırması

source: The module <guilabel>Audiocd KIO Worker Configuration</guilabel> page is divided in the <guilabel>General</guilabel> tab, the <guilabel>Names</guilabel> tab, and the encoder parameter tabs.
tr: <guilabel>Audiocd KIO İşçisi Yapılandırması</guilabel> sayfası; <guilabel>Genel</guilabel> <guilabel>Adlar</guilabel> ve kodlayıcı parametreleri sekmesi olarak üçe ayrılır.

source: The General Tab
tr: Genel Sekmesi

source: <screeninfo>The <guilabel>General</guilabel> tab</screeninfo>
tr: <screeninfo><guilabel>Genel</guilabel> sekmesi</screeninfo>

source: <phrase>The <guilabel>General</guilabel> tab</phrase>
tr: <phrase><guilabel>Genel</guilabel> sekmesi</phrase>

source: This tab contains the general parameters which apply to the whole process of reading data from CD.
tr: Bu sekme, CD’den veri okuma işleminin tamamı için geçerli olan genel parametreleri içerir.

source: Use error correction when reading the CD
tr: CD’yi okurken hata düzeltmesi kullan

source: When writing Audio CD, the process adds 64 bits of error correction data to each frame. After this, 8 bits of subcode or subchannel data are added to each of the encoded frames, which is used for control and addressing when playing the CD. Ignoring such data correction can speed up reading but can also produce some unwanted artifacts.
tr: Ses CD’si yazarken, işlem her kareye 64 bitlik hata düzeltme verisi ekler. Bundan sonra, kodlanmış karelerin her birine, CD çalınırken denetim ve adresleme için kullanılan 8 bitlik alt kod veya alt kanal verisi eklenir. Bu tür veri düzeltmelerinin yok sayılması okumayı hızlandırabilir; ancak aynı zamanda bazı istenmeyen kalıntılar da üretebilir.

source: Skip on errors
tr: Hataları atla

source: The default is never skipping on errors of the medium. This is needed to ensure the high quality of the results.
tr: Öntanımlı ayar, ortamın hatalarını asla atlamamaktır. Sonuçların yüksek kalitesini sağlamak için bu gereklidir.

source: Encoder Priority
tr: Kodlayıcı Önceliği

source: It is possible to determine encoder priority to ensure that the encoder process will not prevent you from doing some other tasks in parallel (the lower values) or to speed up the encoding (the higher values).
tr: Kodlayıcı işleminin sizi paralel olarak başka bazı görevleri yapmanızı engellememesini sağlamak (daha düşük değerler) veya kodlamayı hızlandırmak (daha yüksek değerler) için kodlayıcı önceliğini belirlemek olanaklıdır.

source: The Names Tab
tr: Adlar Sekmesi

source: <screeninfo>The <guilabel>Names</guilabel> tab</screeninfo>
tr: <screeninfo><guilabel>Adlar</guilabel> sekmesi</screeninfo>

source: <phrase>The <guilabel>Names</guilabel> tab</phrase>
tr: <phrase><guilabel>Adlar</guilabel> sekmesi</phrase>

source: The <guilabel>Names</guilabel> tab can be used to fine-tune the file names for the encoded data. It is possible to use some macros and <ulink url="https://en.wikipedia.org/wiki/Regular_expression">regular expressions</ulink> to produce the names exactly to your needs.
tr: <guilabel>Adlar</guilabel> sekmesi, kodlanan verinin dosya adlarının ince ayarını yapmak için kullanılabilir. Gereksinimlerinize göre istediğiniz adları elde etmek için makrolar ve <ulink url="https://tr.wikipedia.org/wiki/D%C3%BCzenli_ifade">düzenli ifadeler</ulink> kullanılabilir.

source: You can use the interactive testing field at the bottom part of the page to prove that the correct names will be produced.
tr: Doğru adların üretileceğini kanıtlamak için sayfanın alt kısmındaki etkileşimli sınama alanını kullanabilirsiniz.

source: The FLAC Encoder Tab
tr: FLAC Kodlayıcısı Sekmesi

source: <screeninfo>The <guilabel>FLAC Encoder</guilabel> tab</screeninfo>
tr: <screeninfo><guilabel>FLAC Kodlayıcısı</guilabel> sekmesi</screeninfo>

source: <phrase>The <guilabel>FLAC Encoder</guilabel> tab</phrase>
tr: <phrase><guilabel>FLAC Kodlayıcısı</guilabel> sekmesi</phrase>

source: The FLAC encoder tab is only available if Audiocd KIO worker was compiled with libFLAC.
tr: FLAC kodlayıcı sekmesi yalnızca Audiocd KIO işçisi libFLAC ile derlenmişse kullanılabilir.

source: FLAC is a lossless compressed audio format free of any patents or license fees. It maintains perfect CD audio quality while reducing file size by about 50%. When using this codec the filesize is much larger than Opus, Ogg Vorbis or MP3.
tr: FLAC; herhangi bir patent veya lisans ücreti gerektirmeyen, kayıpsız, sıkıştırılmış bir ses biçimidir. Dosya boyutunu yaklaşık %​50 oranında azaltırken mükemmel CD ses kalitesini korur. Bu kodlayıcı bileşeni kullanıldığında dosya boyutu Opus, Ogg Vorbis veya MP3’ten çok daha büyüktür.

source: Flac compression level
tr: FLAC sıkıştırması düzeyi

source: The compression level is an integer value between 0 and 8 that represents the tradeoff between file size and compression speed.
tr: Sıkıştırma düzeyi, dosya boyutu ile sıkıştırma hızı arasındaki dengeyi temsil eden 0 ile 8 arasında bir tamsayı değeridir.

source: Setting the compression level to 0 yields the shortest compression time but generates a comparably big file.
tr: Sıkıştırma düzeyini 0’a ayarlamak en kısa sıkıştırma süresini sağlar; ancak karşılaştırılabilir derecede büyük bir dosya oluşturur.

source: On the other hand, a compression level of 8 makes compression quite slow but produces the smallest file.
tr: Öte yandan 8’lik bir sıkıştırma düzeyi, sıkıştırmayı oldukça yavaşlatır; ancak en küçük dosyayı üretir.

source: Note that since FLAC is by definition a lossless codec, the audio quality of the output is exactly the same regardless of the compression level.
tr: FLAC, tanımı gereği kayıpsız bir kodlayıcı bileşeni olduğundan, çıkışın ses kalitesinin, sıkıştırma düzeyinden bağımsız olarak tümüyle aynı olduğunu unutmayın.

source: Also, levels above 5 dramatically increase compression time but create an only slightly smaller file, and are not recommended.
tr: Ayrıca, 5’in üzerindeki düzeyler sıkıştırma süresini önemli ölçüde artırır; ancak yalnızca biraz daha küçük bir dosya oluşturur ve önerilmez.

source: The MP3 Encoder Tab
tr: MP3 Kodlayıcısı Sekmesi

source: <screeninfo>The <guilabel>MP3 Encoder</guilabel> tab</screeninfo>
tr: <screeninfo><guilabel>MP3 Kodlayıcısı</guilabel> sekmesi</screeninfo>

source: <phrase>The <guilabel>MP3 Encoder</guilabel> tab</phrase>
tr: <phrase><guilabel>MP3 Kodlayıcısı</guilabel> sekmesi</phrase>

source: The MP3 encoder tab is only available if <ulink url="http://lame.sourceforge.net/">LAME</ulink> utilities are installed in the system.
tr: MP3 kodlayıcısı sekmesi yalnızca sisteminizde <ulink url="http://lame.sourceforge.net/">LAME</ulink> izlenceleri kuruluysa kullanılabilir.

source: MP3 (or MPEG-1 Audio Layer III) is a patented digital audio codec using a form of lossy data compression. In spite of its shortcomings, it is a common format for consumer audio storage, and is widely supported on portable music players.
tr: MP3 (veya MPEG-1 Ses Katmanı III), kayıplı veri sıkıştırma biçimini kullanan patentli bir sayısal ses kodlama bileşenidir. Eksikliklerine rağmen, tüketici ses depolaması için yaygın bir biçimdir ve taşınabilir müzik çalarlarda geniş çapta desteklenir.

source: Audiocd KIO worker uses the LAME encoder to produce <filename class="extension">mp3</filename> files. LAME is considered the best MP3 encoder, mostly thanks to the dedicated work of its developers and the open source licensing model that allowed the project to tap into engineering resources from all around the world.
tr: Audiocd KIO işçisi, <filename class="extension">mp3</filename> dosyaları oluşturmak için LAME kodlayıcısını kullanır. LAME, çoğunlukla geliştiricilerinin özverili çalışmaları ve projenin dünyanın her yerinden mühendislik kaynaklarından yararlanmasına olanak tanıyan açık kaynak lisanslama modeli sayesinde en iyi MP3 kodlayıcısı olarak kabul ediliyor.

source: Encoding Method
tr: Kodlama Yöntemi

source: The bitrate is a measure of the quantity of data used to represent a second of the audio track. It is possible to determine <guilabel>Constant bitrate</guilabel> for predictable file size. The MP3 encoder also supports a <guilabel>Variable bitrate</guilabel> setting, which means that the bitrate value fluctuates along the track based on the complexity of the audio content. More complex intervals of data are encoded with a higher bitrate than less complex ones; this approach yields overall better quality and a smaller file than having a constant bitrate throughout the track.
tr: Bit hızı, ses parçasının bir saniyesini temsil etmek için kullanılan veri miktarının bir ölçüsüdür. Tahmin edilebilir dosya boyutu için <guilabel>Sabit bit hızı</guilabel> belirlemek olanaklıdır. MP3 kodlayıcısı ayrıca <guilabel>Değişken bit hızı</guilabel> ayarını da destekler; bu, bit hızı değerinin, ses içeriğinin karmaşıklığına bağlı olarak parça boyunca dalgalandığı anlamına gelir. Daha karmaşık veri aralıkları, daha az karmaşık olanlara göre daha yüksek bir bit hızıyla kodlanır; bu yaklaşım, parça boyunca sabit bir bit hızına sahip olmaktan genel olarak daha iyi kalite ve daha küçük bir dosya sağlar.

source: You can also define the quality of encoding. The lower quality can speed up the encoding process for the price of some data loss.
tr: Ayrıca kodlamanın kalitesini de tanımlayabilirsiniz. Düşük kalite, bir miktar veri kaybı karşılığında kodlama sürecini hızlandırabilir.

source: Options
tr: Seçenekler

source: Check the <guilabel>Copyrighted</guilabel> item if the produced data are copyright protected.
tr: Üretilen veriler telif hakkıyla korunuyorsa <guilabel>Telif hakkıyla korunuyor</guilabel> ögesini işaretleyin.

source: Check the <guilabel>Original</guilabel> item if the extraction of data is made from the original &CD;.
tr: Verinin çıkarılması özgün &CD;’den yapılıyorsa <guilabel>Özgün</guilabel> ögesini işaretleyin.

source: When the <guilabel>ISO encoding</guilabel> item is checked, LAME will enforce the 7680 bit limitation on total frame size. The compatibility with ISO might be important for hardware players.
tr: <guilabel>ISO kodlaması</guilabel> ögesi işaretlendiğinde, LAME, toplam kare boyutu üzerinde 7680 bit sınırlamasını uygular. CD çalarlar için ISO ile uyumluluk önemli olabilir.

source: The CRC <guilabel>Error Protection</guilabel> item can be used to add a checksum to each data frame. Such protection can enhance the stability of the MP3 data storing.
tr: CRC <guilabel>hata koruması</guilabel> ögesi, her veri karesine bir sağlama toplamı eklemek için kullanılabilir. Bu tür bir koruma, MP3 verisini depolamanın kararlılığını artırabilir.

source: The <guilabel>Write ID3 tag</guilabel> item is used to enforce LAME to write <ulink url="https://en.wikipedia.org/wiki/ID3">ID3 metadata</ulink> to each produced MP3 file.
tr: <guilabel>ID3 etiketini yaz</guilabel> ögesi, LAME’in üretilen her bir MP3 dosyasına <ulink url="https://en.wikipedia.org/wiki/ID3">ID3 üst verisini</ulink> eklemesini sağlar.

source: Filter Settings
tr: Süzgeç Ayarları

source: It is possible to apply bandwidth filtering to the data. It is used to limit the high or low frequencies that are encoded. Most of us cannot hear the high frequencies anyway, and they are the most <quote>expensive</quote> bitwise, when it comes to encoding. They also tend to be the cause of artifacts.
tr: Verilere bant genişliği süzgeci uygulamak olanaklıdır. Kodlanan yüksek veya düşük frekansları sınırlamak için kullanılır. Zaten çoğumuz yüksek frekansları duyamayız ve kodlama söz konusu olduğunda bit bazında en <quote>pahalı</quote> olanlardır. Ayrıca kalıntıların nedeni olma eğilimindedirler.

source: Variable Bitrate Settings
tr: Değişken Bit Hızı Ayarları

source: You can also choose <guilabel>Average bitrate</guilabel>, which is the default, or <guilabel>Maximal bitrate</guilabel>, <guilabel>Minimal bitrate</guilabel> and whether <guilabel>Minimal value is a hard limit</guilabel>.
tr: Ayrıca öntanımlı olan <guilabel>Ortalama bit hızı</guilabel>’nı veya <guilabel>En yüksek bit hızı</guilabel>, <guilabel>En düşük bit hızı</guilabel> ve <guilabel>En düşük değer sabit bir sınırdır</guilabel> seçeneklerini kullanabilirsiniz.

source: 160 kb/s is a good choice for music listening on a portable player. Anything below 120 kb/s might be unsatisfactory for music and anything above 256 kb/s is probably overkill.
tr: 160 kb/sn, taşınabilir bir çalarda müzik dinlemek için iyi bir seçimdir. 120 kb/sn’nin altındaki herhangi bir değer müzik için yetersiz olabilir ve 256 kb/sn’nin üzerindeki herhangi bir değer büyük olasılıkla aşırıdır.

source: It is also possible to <guilabel>Write Xing VBR tag</guilabel> into the file. Xing was responsible for creating an encoder notable for its VBR tag, which enables more accurate seeking within variable bitrate files. Among other things, Xing's VBR tag contains information about the total duration of an MP3 file, something that is not otherwise readily available from the MPEG stream.
tr: Dosyaya <guilabel>Xing VBR etiketini yaz</guilabel>’mak da olanaklıdır. Xing, değişken bit hızına sahip dosyalar içinde daha doğru arama yapılmasını sağlayan VBR etiketiyle dikkat çeken bir kodlayıcı oluşturmaktan sorumluydu. Xing’in VBR etiketi, diğer şeylerin yanı sıra, bir MP3 dosyasının toplam süresi hakkında bilgi içerir; bu, MPEG akışında başka türlü kolayca bulunamayan bir şeydir.

source: The Opus Encoder Tab
tr: Opus Kodlayısıcı Sekmesi

source: <screeninfo>The <guilabel>Opus Encoder</guilabel> tab</screeninfo>
tr: <screeninfo><guilabel>Opus Kodlayıcısı</guilabel> sekmesi</screeninfo>

source: <phrase>The <guilabel>Opus Encoder</guilabel> tab</phrase>
tr: <phrase><guilabel>Opus Kodlayıcısı</guilabel> sekmesi</phrase>

source: The Opus encoder tab is only available if <ulink url="https://opus-codec.org/">opus-tools</ulink> are installed in the system.
tr: Opus kodlayıcısı sekmesi yalnızca sisteminizde <ulink url="https://opus-codec.org/">opus-tools</ulink> izlenceleri kuruluysa kullanılabilir.

source: Opus is a totally open, royalty-free, highly versatile audio codec. Opus is unmatched for interactive speech and music transmission over the Internet, but is also intended for storage and streaming applications.
tr: Opus tümüyle açık, telifsiz, çok yönlü bir ses kodlayıcısı bileşenidir. Opus, internet üzerinden etkileşimli konuşma ve müzik aktarımı konusunda eşsizdir; ancak aynı zamanda depolama ve akış uygulamaları için de tasarlanmıştır.

source: This setting allows you to choose between <guilabel>Complexity based</guilabel> and <guilabel>Bitrate based</guilabel> encoding. The complexity based encoding uses some speculative algorithms for the price of an unpredictable size of the results.
tr: Bu ayar, <guilabel>Karmaşıklık tabanlı</guilabel> ve <guilabel>Bit hızı tabanlı</guilabel> kodlama arasında seçim yapmanıza olanak tanır. Karmaşıklığa dayalı kodlama, sonuçların öngörülemeyen boyutunun maliyeti için bazı spekülatif algoritmalar kullanır.

source: There are several things which influence the Opus encoder choice between CPU complexity and quality/bitrate. The complexity of encoding can be selected using an integer from 0 to 10, where 0 yields the lowest quality and 10 yields the highest quality.
tr: CPU karmaşıklığı ile kalite/bit hızı arasındaki Opus kodlayıcısı seçimini etkileyen birkaç şey vardır. Kodlamanın karmaşıklığı, 0’dan 10’a kadar bir tamsayı kullanılarak seçilebilir; burada 0 en düşük kaliteyi, 10 ise en yüksek kaliteyi verir.

source: Opus is more efficient when operating with variable bitrate (<guilabel>Average variable bitrate</guilabel>), which is the default. It is possible to use constrained variable bitrate (<guilabel>Constrained variable bitrate</guilabel>, an analog of constant bitrate for MP3) when the low-latency transmission is required over a relatively slow connection. In some (rare) applications, constant bitrate (<guilabel>Constant bitrate</guilabel>) is required.
tr: Opus, öntanımlı olan değişken bit hızıyla (<guilabel>Ortalama değişken bit hızı</guilabel>) çalışırken daha verimlidir. Nispeten yavaş bir bağlantı üzerinden düşük gecikmeli iletim gerektiğinde, kısıtlı değişken bit hızı (<guilabel>Kısıtlı değişken bit hızı</guilabel>, MP3 için sabit bit hızının bir benzeri) kullanmak olanaklıdır. Bazı (nadir) uygulamalarda sabit bit hızı (<guilabel>Sabit bit hızı</guilabel>) gereklidir.

source: It is recommended to use 64-128 kbit/s bitrate for stereo music.
tr: Çift kanallı müzik için 64–128 kbit/sn bit hızının kullanılması tavsiye edilir.

source: Add track information
tr: Parça bilgisini ekle

source: When checked, add a description of the song to the file header. This makes it easy for the user to get advanced song information shown by his media player. You can get this information automatically via the Internet. Look at the &systemsettings; CDDB Retrieval module for details.
tr: İşaretlendiğinde, şarkının açıklamasını dosya başlığına ekleyin. Bu, kullanıcının ortam oynatıcısı tarafından gösterilen gelişmiş şarkı bilgilerini almasını kolaylaştırır. Bu bilgiyi internet üzerinden otomatik olarak alabilirsiniz. Ayrıntılar için &systemsettings; CDDB Alma modülüne bakın.

source: The Ogg Vorbis Encoder Tab
tr: Ogg Vorbis Kodlayıcısı Sekmesi

source: <screeninfo>The <guilabel>Ogg Vorbis Encoder</guilabel> tab</screeninfo>
tr: <screeninfo><guilabel>Ogg Vorbis Kodlayıcısı</guilabel> sekmesi</screeninfo>

source: <phrase>The <guilabel>Ogg Vorbis Encoder</guilabel> tab</phrase>
tr: <phrase><guilabel>Ogg Vorbis Kodlayıcısı</guilabel> sekmesi</phrase>

source: The Ogg Vorbis encoder tab is only available if Audiocd KIO worker was compiled with <ulink url="https://xiph.org/vorbis/">libvorbis</ulink>.
tr: Ogg Vorbis kodlayıcı sekmesi yalnızca Audiocd KIO işçisi <ulink url="https://xiph.org/vorbis/">libvorbis</ulink> ile derlenmişse kullanılabilir.

source: Ogg Vorbis is an open and royalty-free audio codec for lossy audio compression. It produces smaller files than MP3 at equivalent or higher quality.
tr: Ogg Vorbis, kayıplı ses sıkıştırmaya yönelik açık ve telifsiz bir ses kodlayıcısı bileşenidir. Eşdeğer veya daha yüksek kalitede MP3’ten daha küçük dosyalar üretir.

source: This setting allows you to choose between <guilabel>Quality based</guilabel> and <guilabel>Bitrate based</guilabel> encoding. The quality based encoding uses some speculative algorithms for the price of an unpredictable size of the results.
tr: Bu ayar, <guilabel>Kalite tabanlı</guilabel> ve <guilabel>Bit hızı tabanlı</guilabel> kodlama arasında seçim yapmanıza olanak tanır. Kalite tabanlı kodlama, sonuçların öngörülemeyen boyutunun maliyeti için bazı spekülatif algoritmalar kullanır.

source: The quality of Ogg Vorbis encoding can be selected using an integer from 0 to 10, where 0 yields the lowest quality and 10 yields the highest quality.
tr: Ogg Vorbis kodlamasının kalitesi, 0’dan 10’a kadar bir tamsayı kullanılarak seçilebilir; burada 0 en düşük kaliteyi, 10 ise en yüksek kaliteyi verir.

source: As an alternative variable bitrate can be used. It is possible to choose <guilabel>Average bitrate</guilabel>, which is the default, or <guilabel>Maximal bitrate</guilabel> and <guilabel>Minimal bitrate</guilabel>.
tr: Alternatif değişken olarak bit hızı kullanılabilir. Öntanımlı olan <guilabel>Ortalama bit hızı</guilabel> veya <guilabel>En yüksek bit hızı</guilabel> ve <guilabel>En düşük bit hızı</guilabel> arasında seçim yapmak olanaklıdır.
