Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_lookandfeel.po
Languages: tr

source: <title>Global Theme</title>
tr: <title>Global Tema</title>

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: System Settings
tr: sistem ayarları

source: appearance
tr: görünüş

source: <keyword>Global Theme</keyword>
tr: <keyword>Global Tema</keyword>

source: style
tr: biçem

source: theme
tr: tema

source: look
tr: görünüm

source: feel
tr: his

source: desktop
tr: masaüstü

source: skin
tr: deri

source: design
tr: tasarım

source: <keyword>UI</keyword>
tr: <keyword>Kullanıcı Arayüzü</keyword>

source: Global Themes
tr: Global Temalar

source: Global Themes provide a common look and feel for many components at once:
tr: Global Temalar, aynı anda birçok bileşen için ortak bir görünüm ve his sağlar:

source: Desktop Layout: An arrangement of panels and widgets - for example a bottom panel with a task manager and application launcher, or a top panel with global menu and system tray
tr: Masaüstü Yerleşimi: Paneller ve araç takımlarından oluşan bir aranjman — örneğin görev yöneticisi ve uygulama başlatıcısı içeren bir alt panel veya global menü ve sistem tepsisi içeren bir üst panel

source: Color Scheme: Color palette used throughout &plasma; and applications
tr: Renk Şeması: &plasma; ve uygulamalar boyunca kullanılan renk paleti

source: Application Style: Appearance of user interface elements such as buttons, menus, and scroll bars
tr: Uygulama Biçemi: Düğmeler, menüler ve sarma çubukları gibi kullanıcı arayüzü ögeleri

source: Plasma Style: Appearance of panels and widgets
tr: Plasma Biçemi: Panellerin ve araç takımlarının görünüşü

source: Window Decoration: Window borders and titlebar buttons
tr: Pencere Dekorasyonu: Pencere kenarlıkları ve başlık çubuğu düğmeleri

source: Icons: Icons used throughout &plasma; and applications
tr: Simgeler: &plasma; ve uygulamalar boyunca kullanılan simgeler

source: Cursors: Mouse pointers
tr: İmleçler: Fare işaretçileri

source: Task Switcher: Overlay for switching between open windows, typically invoked with the keyboard shortcut Alt+Tab
tr: Görev Değiştiricisi: Açık pencereler arasında geçiş yapmak için kullanılan kaplama; genelde Seçenek+Sekme düğmeleri ile çağrılır

source: Splash Screen: Loading screen shown during &plasma; startup
tr: Açılış Ekranı: &plasma; başlangıcında gösterilen yükleme ekranı

source: Login Screen: Screen with a user selector and password prompt shown when the computer is started up
tr: Oturum Açma Ekranı: Bilgisayar başlatıldığında bir kullanıcı seçici ve parola istemi bulunan ekran

source: Lock Screen: Screen with a user password prompt shown when the computer is locked
tr: Kilit Ekranı: Bilgisayar kilitli olduğunda gösterilen, içinde bir parola istemi bulunan ekran

source: Wallpaper: A desktop background image
tr: Duvar Kağıdı: Bir masaüstü arka plan görseli

source: By applying a Global Theme, you can change all of the above together. You can also apply only some components of a Global Theme, such as a color scheme or a window decoration. You can choose which components to change either when applying a Global Theme, or apply individual components by using the other System Settings subsections.
tr: Bir Global Tema uygulayarak, yukarıdakilerin hepsini birlikte değiştirebilirsiniz. Renk şeması veya pencere dekorasyonu gibi yalnızca Global Tema’nın bazı bileşenlerini de uygulayabilirsiniz. Bir Global Tema uygularken hangi bileşenlerin değiştirileceğini seçebilir veya diğer Sistem Ayarları alt bölümlerini kullanarak tek tek bileşenleri uygulayabilirsiniz.

source: Manage Global Themes
tr: Global Temaları Yönetmek

source: In this module you can:
tr: Bu modülde şunları yapabilirsiniz:

source: apply Global Themes
tr: Global Temaları uygulamak

source: install new Global Themes, and remove installed Global Themes
tr: Yeni Global Temalar kurmak ve kurulu Global Temaları kaldırmak

source: Screenshot of the Global Theme manager
tr: Global Tema Yöneticisi ekran görüntüsü

source: Apply Global Themes
tr: Global Temalar Uygulamak

source: You can see a preview of each theme by clicking on the image icon that appears when hovering over a theme thumbnail.
tr: Bir tema küçük görselinin üzerine geldiğinizde görünen görsel simgesine tıklayarak her temanın önizlemesini görebilirsiniz.

source: When clicking on a Global Theme, a dialog will show up asking you which components of the theme you would like to apply. You can select from various appearance settings and the desktop layout.
tr: Bir Global Tema’ya tıkladığınızda, temanın hangi bileşenlerini uygulamak istediğinizi soran bir iletişim kutusu açılacaktır. Çeşitli görünüş ayarları ve masaüstü yerleşimi arasından seçim yapabilirsiniz.

source: Screenshot of the Global Theme component chooser
tr: Global Tema bileşeni seçici ekran görüntüsü

source: After making your selection, click the <guibutton>Apply</guibutton> button to confirm your choice.
tr: Seçiminizi yaptıktan sonra onaylamak için <guibutton>Uygula</guibutton> düğmesine tıklayın.

source: Install Global Themes
tr: Global Temalar Kurmak

source: With the button <guilabel>Get New Global Themes...</guilabel>, you can install new Global Themes by third-party providers. You need to be connected to the internet in order to access these themes. Clicking on <guibutton>Install</guibutton> in one of the themes in the dialog will install the chosen Global Theme, and after you close the dialog, your new theme is immediately available.
tr: <guilabel>Yeni Global Temalar Al…</guilabel> düğmesiyle, üçüncü taraf sağlayıcılar tarafından yeni Global Temalar kurabilirsiniz. Bu temalara erişmek için internete bağlı olmanız gerekir. İletişim kutusundaki temalardan birinde <guibutton>Kur</guibutton>’a tıklamak, seçili Global Tema’yı yükler ve iletişim kutusunu kapattıktan sonra yeni temanız hemen kullanılabilir.

source: <screeninfo>Get New Global Themes...</screeninfo>
tr: <screeninfo>Yeni Global Temalar Al…</screeninfo>

source: <phrase>Get New Global Themes...</phrase>
tr: <phrase>Yeni Global Temalar Al…</phrase>

source: To remove an installed Global Theme, click on the button with the trash icon that appears when hovering over a theme thumbnail. Note that you can only remove Global Themes that you have downloaded yourself.
tr: Kurulu bir Global Tema’yı kaldırmak için bir tema küçük görselinin üzerine geldiğinizde görünen çöp kutusu simgesinin bulunduğu düğmeyi tıklayın. Yalnızca kendi indirdiğiniz Global Temaları kaldırabileceğinizi unutmayın.

source: If you are interested in creating your own theme, you can learn more about the various components <ulink url="https://develop.kde.org/docs/plasma/">here</ulink>.
tr: Kendi temanızı oluşturmak isterseniz çeşitli bileşenler hakkında ayrıntılı bilgiyi <ulink url="https://develop.kde.org/docs/plasma/">buradan</ulink> alabilirsiniz.
