Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_khtml-java-js.po
Languages: tr

source: Java and JavaScript
tr: Java ve JavaScript

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Applications 16.12
tr: Uygulamalar 16.12

source: Systemsettings
tr: Sistem Ayarları

source: browsing
tr: tarama

source: &Java; and JavaScript
tr: &Java; ve JavaScript

source: &Java; allows applications to be downloaded and run by a web browser, provided you have the necessary software installed on your machine. Many web sites make use of &Java; (for example, online banking services or interactive gaming sites). You should be aware that running programs from unknown sources could pose a threat to the security of your computer, even if the potential extent of the damage is not great.
tr: &Java; gerekli yazılım makinenizde kuruluysa uygulamaların bir web tarayıcısı tarafından indirilmesine ve çalıştırılmasına izin verir. Birçok web sitesi &Java; kullanır (örneğin, çevrimiçi bankacılık hizmetleri veya etkileşimli oyun siteleri). Bilinmeyen kaynaklardan program çalıştırmanın, olası hasarın boyutu büyük olmasa bile, bilgisayarınızın güvenliği için bir tehdit oluşturabileceğinin farkında olmalısınız.

source: The check box <guilabel>Enable Java globally</guilabel> allows you to turn &Java; support on for all web sites by default. You can also select to turn &Java; on or off for specific hosts. To add a policy for a specific host, click the <guibutton>New…</guibutton> button to bring up a dialog in which you can type the host name and then choose to accept or reject &Java; code from that particular host, which will add the domain to the list on the left of the page.
tr: <guilabel>Java’yı global olarak etkinleştir</guilabel> onay kutusu, öntanımlı olarak tüm web siteleri için &Java; desteğini açmanızı sağlar. Ayrıca belirli ana bilgisayarlar için &Java;’yı açmayı veya kapatmayı seçebilirsiniz. Belirli bir ana bilgisayar için bir politika eklemek için ana bilgisayar adını yazabileceğiniz ve ardından belirli ana bilgisayardan &Java; kodunu kabul etmeyi veya reddetmeyi seçebileceğiniz bir iletişim kutusu açmak için <guibutton>Yeni…</guibutton> düğmesine tıklayın; bu, etki alanını sayfanın solundaki listeye ekleyecektir.

source: You can select a host in the list, and click the <guibutton>Change…</guibutton> button to choose a different policy for that host. Clicking the <guibutton>Delete</guibutton> button removes the policy for the selected host; after deletion, the global settings will then apply to that host.
tr: Listeden bir ana bilgisayarı seçebilir ve o ana bilgisayar için farklı bir politika seçmek üzere <guibutton>Değiştir…</guibutton> düğmesine tıklayabilirsiniz. <guibutton>Sil</guibutton> düğmesine tıklamak, seçili ana bilgisayar için politikayı kaldırır; silme işleminden sonra, global ayarlar o ana bilgisayara uygulanır.

source: Finally, the group of controls labeled <guilabel>Java Runtime Settings</guilabel> allows you to set some options for the way in which &Java; should run.
tr: Son olarak, <guilabel>Java Çalışma Zamanı Ayarları</guilabel> etiketli denetim grubu, &Java;’nın çalıştırılması için bazı seçenekler ayarlamanıza olanak tanır.

source: <guilabel>Use security manager</guilabel> is normally enabled by default. This setting will cause the <acronym>JVM</acronym> to run with a Security Manager in place. This will keep applets from being able to read and write to your file system, creating arbitrary sockets, and other actions which could be used to compromise your system. Disable this option at your own risk. You can modify your <filename>$<envar>HOME</envar>/.java.policy</filename> file with the &Java; policytool utility to give code downloaded from certain sites more permissions.
tr: <guilabel>Güvenlik yöneticisi kullan</guilabel> normalde öntanımlı olarak etkindir. Bu ayar, <acronym>JVM</acronym>’nin bir güvenlik yöneticisi ile çalışmasını sağlar. Bu, uygulamaların dosya sisteminizi okuyup yazmasını, keyfi yuvalar oluşturmasını ve sisteminizi tehlikeye atmak için kullanılabilecek diğer eylemleri yapmasını engeller. Bu seçeneği devre dışı bırakmak sizin riskinizdedir. Belirli sitelerden indirilen kodlara daha fazla izin vermek için <filename>$<envar>HOME</envar>/.java.policy</filename> dosyanızı &Java; policytool yardımcı programıyla değiştirebilirsiniz.

source: <guilabel>Use KIO</guilabel> will cause the <acronym>JVM</acronym>to use &kde;’s own <acronym>KIO</acronym> transports for network connections.
tr: <guilabel>KIO’yu kullan</guilabel>, <acronym>JVM</acronym>’nin ağ bağlantıları için &kde;’nin kendi <acronym>KIO</acronym> taşımalarını kullanmasını sağlar.

source: The <guilabel>Shutdown applet server when inactive for more than</guilabel> check box allows you to save resources by closing the &Java; Applet Server when it is not in use, rather than leaving it running in the background. Leaving this disabled may make &Java; applets start up faster, but it will use system resources when you are not using a &Java; applet. If you enable this, you can set a timeout.
tr: <guilabel>Şu kadar süre kadar etkin olmadığında uygulamacık sunucusunu kapat</guilabel> onay kutusu, &Java; uygulamacağı sunucusunu arka planda çalışır durumda bırakmak yerine, kullanılmadığında kapatarak özkaynak tasarrufu yapmanızı sağlar. Bunu devre dışı bırakmak &Java; uygulamacıklarının daha hızlı başlamasını sağlayabilir; ancak &Java; uygulamacığını kullanmadığınızda sistem özkaynaklarını kullanır. Bunu etkinleştirirseniz bir zaman aşımı ayarlayabilirsiniz.

source: You can either opt to have &konqueror; automatically detect the &Java; installation on your system, or specify the path to the installation yourself by selecting <guilabel>Path to Java executable or java</guilabel>. You may want to choose the latter method, for instance, if you have multiple &Java; installations on your system, and want to specify which one to use. If the &Java; Virtual Machine you are using requires any special startup options, you can type them in the text box labeled <guilabel>Additional Java arguments</guilabel>.
tr: Sisteminizdeki &Java; kurulumunu &konqueror; kendiliğinden algılamayı seçebilir veya <guilabel>Java yürütülebiliri yolu veya “java” yolu</guilabel> seçeneğini belirleyerek kurulum yolunu kendiniz belirtebilirsiniz. Örneğin, sisteminizde birden fazla &Java; kurulumu varsa ve hangisinin kullanılacağını belirtmek istiyorsanız ikinci yöntemi tercih edebilirsiniz. Kullandığınız &Java; sanal makinesi herhangi bir özel başlatma seçeneği gerektiriyorsa bunları <guilabel>Ek Java argümanları</guilabel> etiketli metin kutusuna yazabilirsiniz.

source: Despite the name, JavaScript is not related at all to &Java;.
tr: Adına rağmen JavaScript’in &Java; ile hiçbir ilgisi yoktur.

source: The first part of this tab works the same as the &Java; settings.
tr: Bu sekmenin ilk kısmı &Java; ayarlarıyla aynı şekilde çalışmaktadır.

source: The checkbox <guilabel>Enable JavaScript globally</guilabel> allows you to turn JavaScript support on for all web sites by default. You can also select to turn JavaScript on or off for specific hosts. To add a policy for a specific host, click the <guibutton>New…</guibutton> button to bring up a dialog in which you can type the host name and then choose to accept or reject JavaScript code from that particular host, which will add the domain to the list on the left of the page.
tr: <guilabel>JavaScript’i global olarak etkinleştir</guilabel> onay kutusu, öntanımlı olarak tüm web siteleri için JavaScript desteğini açmanızı sağlar. Ayrıca, belirli ana bilgisayarlar için JavaScript’i açmayı veya kapatmayı seçebilirsiniz. Belirli bir ana bilgisayar için bir politika eklemek üzere, ana bilgisayar adını yazabileceğiniz ve ardından söz konusu ana bilgisayardan JavaScript kodunu kabul etmeyi veya reddetmeyi seçebileceğiniz bir iletişim kutusu açmak için <guibutton>Yeni…</guibutton> düğmesine tıklayın; bu, etki alanını sayfanın solundaki listeye ekleyecektir.

source: The final set of options in the section <guilabel>Global JavaScript Policies</guilabel> determine what happens when a page uses JavaScript for specific actions.
tr: <guilabel>Global JavaScript Politikaları</guilabel> bölümündeki seçeneklerin son kümesi, bir sayfanın belirli eylemler için JavaScript kullandığında ne olacağını belirler.

source: You can individually enable or disable the ability of JavaScript to manipulate your windows by moving, resizing or changing focus. You can also disable JavaScript from changing the status bar text, so that for instance, you can always see where links will take you when clicked. The choices for these options are <guilabel>Allow</guilabel> and <guilabel>Ignore</guilabel>.
tr: JavaScript’in pencerelerinizi taşıyarak, yeniden boyutlandırarak veya odaklamayı değiştirerek yönetme yeteneğini ayrı ayrı etkinleştirebilir veya devre dışı bırakabilirsiniz. Ayrıca JavaScript’in durum çubuğu metnini değiştirmesini de devre dışı bırakabilirsiniz, böylece örneğin, tıklandığında bağlantıların sizi nereye götüreceğini her zaman görebilirsiniz. Bu seçenekler için seçenekler <guilabel>İzin Ver</guilabel> ve <guilabel>Yok Say</guilabel> olarak sunulur.

source: For opening a new window, there is even more control. You can set &konqueror; to <guilabel>Allow</guilabel> all such requests, <guilabel>Ask</guilabel> each time a request is made, or <guilabel>Deny</guilabel> all popup requests.
tr: Yeni bir pencere açmak için daha da fazla denetim vardır. &konqueror;’un tüm bu tür isteklere <guilabel>İzin Ver</guilabel>, her istek yapıldığında <guilabel>Sor</guilabel> veya tüm açılır pencere isteklerini <guilabel>Reddet</guilabel> olarak yanıtlayacak biçimde davranmasını ayarlayabilirsiniz.

source: The <guilabel>Smart</guilabel> setting will only allow JavaScript popup windows when you have explicitly chosen a link that creates one.
tr: <guilabel>Akıllı</guilabel> ayarı, yalnızca bir JavaScript açılır penceresi oluşturan bir bağlantıyı açıkça seçtiğinizde JavaScript açılır pencerelerine izin verir.
