Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_kgamma.po
Languages: tr

source: Monitor Gamma
tr: Monitör Gaması

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: System Settings
tr: sistem ayarları

source: Monitor
tr: Monitör

source: Calibration
tr: Kalibrasyon

source: Gamma
tr: Gama

source: Introduction
tr: Giriş

source: This module is a tool for monitor gamma correction. With proper gamma settings, your display (websites, images, &etc;) will look the same on your monitor as on other monitors.
tr: Bu modül, monitör gamasını düzeltmek için bir araçtır. Düzgün gama ayarlarıyla monitörünüzdeki web siteler, görseller, &etc;, başka monitörlerdekiyle aynı görünecektir.

source: It allows you to alter the monitor's gamma correction of the &X-Server;. But that's not all to do. For good results you have to set the correct brightness, contrast and color balance of your monitor. This may be difficult and you have to repeat every step several times. For perfect results you need really good (and expensive) hardware.
tr: &X-Server;’ın monitörün gama düzeltmesini değiştirmenize izin verir. Yapılacak tek şey bu değilidir. İyi sonuçlar için monitörünüzde doğru parlaklık, karşıtlık ve renk dengesini ayarlamanız gerekir. Bu zor olabilir ve her adımı birkaç kez yinelemeniz gerekebilir. Mükemmel sonuçlar için gerçekten iyi (ve pahalı) bir donanıma gereksiniminiz vardır.

source: Use the four sliders to define the gamma correction either as a single value, or separately for the red, green and blue components. The &X-Server; default setting for gamma is 1.00 (&Mac; 1.80, WinXX 2.20). The test images help you to find proper settings.
tr: Gama düzeltmesini tek bir değer olarak veya kırmızı, yeşil ve mavi bileşenler için ayrı ayrı tanımlamak üzere dört sürgüyü kullanın. &X-Server; gaması için öntanımlı ayar 1,00’dir (&Mac; 1.80, WinXX 2.20). Sınama görselleri, uygun ayarları bulmanıza yardımcı olur.

source: To store the gamma settings system wide, enable the option <guilabel>Save settings system wide</guilabel>. The system settings will be restored at next &X-Server; startup. You need root access to use this option. Use this if you want to correct the gamma settings for all users and graphical environments on this machine.
tr: Gama ayarlarını sistem genelinde kaydetmek için <guilabel>Ayarları sistem geneli için kaydet</guilabel> seçeneğini kullanın. Sistem ayarları, bir sonraki &X-Server; başlangıcında geri yüklenecektir. Bu seçeneği kullanmak için yönetici erişiminiz olması gerekir. Bunu, bu makinedeki tüm kullanıcılar ve grafik çevreler için gama ayarlarını düzeltmek istiyorsanız kullanın.

source: To store the gamma settings to your personal &plasma; configuration, do not enable that option. The user settings will be restored at next &plasma; startup and replace temporary the system gamma settings. The system settings are not removed by that and will be restored at next &X-Server; startup.
tr: Gama ayarlarını kendi kişisel &plasma; yapılandırmanız için depolamak istiyorsanız bu seçeneği etkinleştirmeyin. Kullanıcı ayarları bir sonraki &plasma; başlangıcında geri yüklenir ve geçici sistem gama ayarlarının yerine geçer. Sistem ayarlar bunun tarafından kaldırılmaz ve bir sonraki &X-Server; başlangıcında geri yüklenir.

source: On multi head systems, select the screen you want to alter with the combo box. This will also work with xinerama enabled. If you want to set all screens to the same gamma values, enable the <guilabel>Sync screens</guilabel> option. On systems with only one screen this option will take no effect.
tr: Çok başlı sistemlerde, değiştirmek istediğiniz ekranı çoklu kutudan seçin. Bu, xinerama etkinken de çalışır. Tüm ekranları aynı gama değerlerine ayarlamak istiyorsanız <guilabel>Ekranları eşzamanla</guilabel> seçeneğini etkinleştirin. Tek ekranlı sistemlerde bu seçeneğin bir etkisi olmaz.

source: Using the Test Images
tr: Sınama Görsellerini Kullanmak

source: This module provides six different test pictures selectable from the drop down box at the top of the window.
tr: Bu modül, pencerenin üst kısmındaki açılır kutudan seçilebilen altı farklı sınama resmi sağlar.

source: Grey Scale Test Image
tr: Gri Tonlu Sınama Görseli

source: You should be able to see the following:
tr: Aşağıdakini görebilmelisiniz:

source: A grayscale with 20 different sections
tr: 20 farklı bölümlü bir gri tonlu görsel

source: The darkest section pure black
tr: En koyu bölüm saf siyah

source: The lightest section pure white
tr: En açık bölüm saf beyaz

source: No hint of any color in the gray tones
tr: Gri tonlarda hiçbir başka rengin bir izi yok

source: If you cannot see all of the 20 sections, use your monitors contrast settings or the <guilabel>Gamma:</guilabel> slider to correct this. If black is not pure black, try to darken the monitor, if white is not pure white, try to lighten it. If you see any colors in the gray tones alter the color balance settings of your monitor or the <guilabel>Red:</guilabel>, <guilabel>Green:</guilabel> and <guilabel>Blue:</guilabel> sliders.
tr: 20 bölümün tümünü göremiyorsanız bunu düzeltmek için monitörünüzün karşıtlık ayarlarıyla veya <guilabel>Gama:</guilabel> sürgüsüyle oynayın. Siyahlar saf siyah değilse monitöyü karartmayı, beyazlar saf beyaz değilse açmayı deneyin. Gri tonlarda başka bir rengin izlerini görüyorsanız monitörünüzün renk dengesi ayarlarını veya <guilabel>Kırmızı:</guilabel>, <guilabel>Yeşil:</guilabel> ve <guilabel>Mavi:</guilabel> sürgüleriyle oynayın.

source: RGB Scale Test Picture
tr: RGB Tonlu Sınama Resmi

source: You should be able to see three strips, each with 16 sections of red, green or blue tones. The darkest sections should be pure black, the brightest should be pure red, green or blue. If you don't see all sections of a color strip, try to lighten or darken this color.
tr: Her biri 16 bölümden oluşan kırmızı, yeşil veya mavi tonlardan oluşan üç şerit görebilmeniz gerekir. En koyu bölümler saf siyah, en parlak bölümler ise saf kırmızı, yeşil veya mavi olmalıdır. Bir renk şeridinin tüm bölümlerini görmüyorsanız bu rengi açmayı veya koyulaştırmayı deneyin.

source: CMY Scale Test Picture
tr: CMS Tonlu Sınama Resmi

source: You should be able to see three strips, each with 11 sections of cyan, magenta or yellow tones. The brightest sections should be pure white, the darkest should be pure cyan, magenta or yellow.
tr: Her biri camgöbeği, mor veya sarı tonlarında 11 bölüm içeren üç şerit görebilmeniz gerekir. En parlak bölümler saf beyaz, en koyu bölümler ise saf camgöbeği, mor veya sarı olmalıdır.

source: If you cannot see all cyan sections, try to lighten or darken red
tr: Tüm camgöbeği bölümleri göremiyorsanız kırmızıyı açmayı veya koyulaştırmayı deneyin.

source: If you cannot see all magenta sections, try to lighten or darken green
tr: Tüm mor bölümlerini göremiyorsanız yeşili açmayı veya koyulaştırmayı deneyin.

source: If you cannot see all yellow sections, try to lighten or darken blue
tr: Tüm sarı bölümleri göremiyorsanız maviyi açmayı veya koyulaştırmayı deneyin.

source: Advanced Test Pictures
tr: Gelişmiş Sınama Resimleri

source: The following three pictures show you the abilities of your monitor at three points of the gray spectrum. If you cannot see all of the details, don't be worry, or buy better hardware.
tr: Aşağıdaki üç resim, gri spektrumun üç noktasında monitörünüzün yeteneklerini göstermektedir. Tüm ayrıntıları göremiyorsanız endişelenmeyin veya daha iyi bir donanım satın alın.

source: Dark Gray Test Picture
tr: Koyu Gri Sınama Resmi

source: You should be able to see 10 different rectangles of dark gray within a black box. The chart shows you 1% steps from black.
tr: Bir kara kutu içinde 10 farklı koyu gri dikdörtgen görebilmeniz gerekir. Grafik size siyahtan %​1 adım gösterir.

source: Mid Gray Test Picture
tr: Orta Gri Sınama Resmi

source: This picture shows you 11 gray rectangles within a 50% gray box. You should be able to see all of the rectangles except the middle one. The rectangles represent the steps from 45% to 55% gray.
tr: Bu resim size %​50 gri bir kutu içinde 11 gri dikdörtgen gösterir. Ortadaki dışında, tüm dikdörtgenleri görebilmeniz gerekir. Dikdörtgenler, %​45–%​55 gri arasındaki adımları temsil eder.

source: Light Gray Test Picture
tr: Açık Gri Sınama Resmi

source: You should be able to see 10 different rectangles of light gray within a white box. The chart shows you 1% steps from white.
tr: Beyaz bir kutu içinde 10 farklı açık gri dikdörtgen görebilmeniz gerekir. Grafik size beyazdan %​1 adım gösterir.
