Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_cursortheme.po
Languages: tr

source: Cursor Theme
tr: İmleç Teması

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: This is the documentation for the &systemsettings; module to customize the mouse cursor appearance.
tr: Bu, fare imleci görünüşünü özelleştirmek için kullanılan &systemsettings; modülünün belgelendirmesidir.

source: Systemsettings
tr: sistem ayarları

source: mouse
tr: fare

source: cursor
tr: imleç

source: pointer
tr: işaretçi

source: bouncing
tr: zıplayan

source: blinking
tr: yanıp sönen

source: animation
tr: canlandırma

source: launch
tr: başlat

source: feedback
tr: geri bildirim

source: theme
tr: tema

source: This module allows you to
tr: Bu modül, şunları yapmanıza izin verir

source: select a cursor theme
tr: bir imleç teması seçmenize

source: configure a cursor animation for launching applications
tr: uygulamaları başlatmak için bir imleç canlandırması yapılandırmanıza

source: The features provided by this module may not be available on some systems.
tr: Bu modül tarafından sağlanan özellikler bazı sistemlerde kullanılamayabilir.

source: Cursor Theme Management
tr: İmleç Teması Yönetimi

source: Screenshot of the Cursor Theme manager
tr: İmleç Teması Yöneticisi’nin ekran görüntüsü

source: To use a cursor theme, simply select it and click the <guilabel>Apply</guilabel> button.
tr: Bir imleç temasını kullanmak için onu seçin ve <guilabel>Uygula</guilabel> düğmesine tıklayın.

source: You can remove cursor themes using the trash button that appears when you hover the mouse pointer over the theme item in the list. Note that you can not remove the pre-installed themes.
tr: Fare işaretçisini listedeki tema ögesinin üzerine getirdiğinizde görünen çöp kutusu düğmesini kullanarak imleç temalarını kaldırabilirsiniz. Kurulu gelen temaları kaldıramayacağınızı unutmayın.

source: Use the <guilabel>Get New Cursors...</guilabel> button to launch the <guilabel>Download New Cursors</guilabel> dialog and download additional themes from the internet.
tr: <guilabel>Yeni İmleçler İndir</guilabel> iletişim kutusunu başlatmak için <guilabel>Yeni İmleçler Al…</guilabel> düğmesine tıklayın ve internetten yeni temalar indirin.

source: Screenshot of the Get New Cursor Themes
tr: Yeni İmleçler Al ekran görüntüsü

source: You can also install cursor themes files you have downloaded or otherwise obtained using the <guilabel>Install from File...</guilabel> button.
tr: İndirdiğiniz veya başka yollarla edildiğiniz imleç temalarını kurmak için <guilabel>Dosyadan Kur…</guilabel> düğmesini kullanın.

source: If you are interested in creating your own cursor theme, you can find information <ulink url="https://userbase.kde.org/Special:MyLanguage/Create_your_own_mouse_cursor_theme">here</ulink>.
tr: Kendi imleç temanızı oluşturmak istiyorsanız bununla ilgili bilgiyi <ulink url="https://userbase.kde.org/Special:MyLanguage/Create_your_own_mouse_cursor_theme">burada</ulink> bulabilirsiniz.

source: Cursor size
tr: İmleç boyutu

source: Some themes allow choosing the cursor size. Use the <guilabel>Size</guilabel> field to select the appropriate size.
tr: Bazı temalar, imleç boyutunu seçmenize izin verir. <guilabel>Boyut</guilabel> alanını kullanarak size uygun boyutu seçin.

source: Screenshot of the Cursor Size
tr: İmleç Boyutu ekran görüntüsü

source: Launch feedback
tr: Başlatma geri bildirimi

source: Sometimes it is reassuring to know that your computer didn't just ignore your command, and something is happening behind the scenes. In this dialog <guilabel>Configure Launch Feedback...</guilabel>, you can configure visible feedback to help you know if you really hit that icon or not.
tr: Bazen bilgisayarınızın komutlarınızı görmezden gelmediğini ve perde arkasında bir şeyler olduğunu bilmek güven vericidir. Bu <guilabel>Başlatma Geri Bildirimini Yapılandır…</guilabel> iletişim kutusunda, o simgeye gerçekten basıp basmadığınızı anlamanıza yardımcı olması için görünür geri bildirimi yapılandırabilirsiniz.

source: Screenshot of the Launch Feedback
tr: Başlatma Geri Bildirimi ekran görüntüsü

source: The traditional way to indicate that your computer is busy is to modify the cursor, and you can turn this on by choosing a <guilabel>Cursor</guilabel>.
tr: Bilgisayarınızın meşgul olduğunu belirtmenin geleneksel yolu imleci değiştirmektir ve bunu bir <guilabel>İmleç</guilabel> seçerek açabilirsiniz.

source: With this option enabled, your cursor will have an icon attached to it for a short time, when a new application is being launched. You can configure how long this icon is displayed beside your cursor with the <guilabel>Stop animation after:</guilabel> spinbox. The default is 5 seconds.
tr: Bu seçenek etkinleştirildiğinde, yeni bir uygulama başlatılırken imlecinize kısa bir süre için eklenmiş bir simge olacaktır. <guilabel>Canlandırmayı şundan sonra durdur:</guilabel> döndürme kutusuyla bu simgenin imlecinizin yanında ne kadar süre görüntüleneceğini yapılandırabilirsiniz. Öntanımlı ayar 5 saniyedir.

source: There are several variations of busy cursor available, including a <guilabel>No Feedback</guilabel>, a <guilabel>Blinking</guilabel>, a <guilabel>Bouncing</guilabel> or a <guilabel>Static</guilabel> cursor icon with no animation.
tr: Meşgul imlecinin birden çok çeşidi vardır: <guilabel>Geri bildirim yok</guilabel>, <guilabel>Yanıp sönen</guilabel>, <guilabel>Zıplayan</guilabel>, <guilabel>Durgun</guilabel>.

source: Traditional &plasma; launch notification has taken another form, which you can also enable and disable here. Normally when you start an application, it gets an immediate entry in the taskbar, with the icon replaced by a spinning hourglass to let you know something is happening. You can toggle this behavior on and off with the <guilabel>Enable animation</guilabel> checkbox.
tr: Geleneksel &plasma; başlatma bildirimi, burada da etkinleştirip devre dışı bırakabileceğiniz başka bir biçim aldı. Normalde bir uygulamayı başlattığınızda, görev çubuğuna anında bir giriş yapılır ve simge, bir şeyler olduğunu size bildirmek için dönen bir kum saati ile değiştirilir. <guilabel>Canlandırmayı etkinleştir</guilabel> onay kutusuyla bu davranışı açıp kapatabilirsiniz.

source: Not all applications that you start will eventually show a window, or an entry in the taskbar. Some of them, for example, are docked into the &plasma; system tray. Alternatively, it might be that you sent it off to a different virtual desktop, and in the <guilabel>Behavior</guilabel> section of the <ulink url="help:/plasma-desktop/panel.html"> <guilabel>Task Manager Settings</guilabel></ulink> the option <guilabel>From the current desktop</guilabel> is checked for the <guilabel>Show only tasks</guilabel> switcher. Setting a timeout ensures that, even in these cases, you can still get launch feedback, but also that it will go away when the job is done.
tr: Başlattığınız tüm uygulamalar sonunda görev çubuğunda bir pencere veya giriş göstermez. Örneğin bazıları &plasma; sistem tepsisine rıhtımlanır. Alternatif olarak, farklı bir sanal masaüstüne gönderilmiş olabilir ve <ulink url="help:/plasma-desktop/panel.html"><guilabel>Görev Yöneticisi Ayarları</guilabel></ulink>’nın <guilabel>Davranış</guilabel> bölümünde <guilabel>Görevleri yalnızca</guilabel> ayarı <guilabel>Geçerli masaüstünden göster</guilabel> olarak ayarlanmış olabilir. Bir zaman aşımı ayarlamak, böyle durumlarda hâlâ başlangıç geri bildirimi almanızı sağlar ve iş bittiğinde bildirim kendiliğinden gider.
