Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_kwintabbox.po
Languages: tr

source: Task Switcher
tr: Görev Değiştiricisi

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: System Settings
tr: sistem ayarları

source: desktop
tr: masaüstü

source: window
tr: pencere

source: navigation
tr: dolaşım

source: switch
tr: değiştir

source: alt-tab
tr: seçenek-sekme

source: Navigating through Windows
tr: Pencereler Arasında Dolaşmak

source: The Task Switcher allows the user to easily switch between currently open windows using the keyboard. It is highly configurable, and allows the user to control its behavior, visual appearance, keyboard shortcuts, and window filtering.
tr: Görev Değiştiricisi, kullanıcının klavyeyi kullanarak o anda açık olan pencereler arasında kolayca geçiş yapmasına olanak tanır. Yüksek düzeyde yapılandırılabilir ve kullanıcının davranışını, görsel görünümünü, klavye kısayollarını ve pencere süzmeyi denetlemesine izin verir.

source: Screenshot of the default Task Switcher
tr: Öntanımlı Görev Değiştiricisi ekran görüntüsü

source: The Task Switcher is often invoked using the key combination <keycombo>&Alt;&Tab;</keycombo>, but this can be changed. When invoked, it shows a list of all the currently open windows, optionally filtered and augmented according to the configuration settings. For example, the list may be filtered to show only windows that meet certain criteria, such as windows that are currently visible. Once the window list is shown, the user can cycle forward and backward through all the listed windows by repeatedly hitting the Task Switcher key combination. Releasing the Task Switcher key combination will activate the window that was selected in the list.
tr: Görev Değiştiricisi genellikle <keycombo>&Alt;&Tab;</keycombo> düğme kombinasyonu kullanılarak çağrılır; ancak bu değiştirilebilir. Çağrıldığında, yapılandırma ayarlarına göre isteğe bağlı olarak süzülmüş ve genişletilmiş olarak o anda açık olan tüm pencerelerin bir listesini gösterir. Örneğin, liste, şu anda görünür olan pencereler gibi yalnızca belirli ölçütleri karşılayan pencereleri gösterecek şekilde süzülebilir. Pencere listesi gösterildiğinde kullanıcı, Görev Değiştiricisi düğme kombinasyonuna art arda basarak listelenen tüm pencereler arasında ileri ve geri gidebilir. Görev Değiştiricisi düğme kombinasyonunun bırakılması, listede seçili pencereyi etkinleştirir.

source: Because the Task Switcher offers so many configuration options, two distinct collections of configuration settings can be defined. These collections are called <guilabel>Main</guilabel> and <guilabel>Alternative</guilabel>, and each can have a unique set of key combinations assigned to them.
tr: Görev Değiştiricisi çok sayıda yapılandırma seçeneği sunduğundan, iki farklı yapılandırma ayarı koleksiyonu tanımlanabilir. Bu koleksiyonlara <guilabel>Ana</guilabel> ve <guilabel>Alternatif</guilabel> adı verilir ve her biri kendilerine atanmış benzersiz bir düğme kombinasyonu grubuna sahip olabilir.

source: The configuration options for each of the Main and Alternative collections are presented in four groupings, as follows:
tr: Ana ve Alternatif koleksiyonların her biri için yapılandırma seçenekleri aşağıdaki gibi dört grup halinde sunulur:

source: Visualization
tr: Görselleştirme

source: This group of configuration options controls how the list of windows is displayed on the screen. The default visualization is called <guilabel>Breeze</guilabel>. It lists all open windows along the left-hand side of the screen. Other visualizations include <guilabel>Cover Switch</guilabel> (a 3D carousel), <guilabel>Flip Switch</guilabel> (a 3D stack of cards), and <guilabel>Medium Rounded</guilabel> (a Microsoft &Windows;-style list of icons). Many more visualizations can be downloaded and installed by clicking the <guibutton>Get New Task Switchers...</guibutton> button at the bottom right of the dialog box.
tr: Bu yapılandırma seçenekleri grubu, pencere listesinin ekranda nasıl görüntüleneceğini denetler. Öntanımlı görselleştirmeye <guilabel>Esinti</guilabel> adı verilir. Ekranın sol tarafında tüm açık pencereleri listeler. Diğer görselleştirmeler arasında <guilabel>Kapak Değiştirici</guilabel> (bir 3B atlıkarınca), <guilabel>Işığı Aç/Kapat</guilabel> (3B kart yığını) ve <guilabel>Orta Yuvarlak</guilabel> (bir Microsoft &Windows; tarzı simgeler listesi) vardır. İletişim kutusunun sağ alt kısmındaki <guibutton>Yeni Görev Değiştiriciler Al…</guibutton> düğmesine tıklayarak daha birçok görselleştirme indirilebilir ve kurulabilir.

source: Once a visualization has been selected from the drop-down list, the button to the right of the list can be clicked to see a preview or to configure visualization-specific options.
tr: Açılır listeden bir görselleştirme seçildikten sonra, bir önizleme görmek veya görselleştirmeye özgü seçenekleri yapılandırmak için listenin sağındaki düğme tıklanabilir.

source: The <guilabel>Show selected window</guilabel> checkbox determines how clearly the user will see which window will be activated. If this box is checked, then all windows will be hidden except for the one that is currently highlighted in the Task Switcher.
tr: <guilabel>Seçili pencereyi göster</guilabel> onay kutusu, kullanıcının hangi pencerenin etkinleştirileceğini ne kadar net göreceğini belirler. Bu kutu işaretlenirse Görev Değiştiricisi’nde o anda vurgulanan pencere dışındaki tüm pencereler gizlenecektir.

source: There may be cases where the desired Task Switcher visualization cannot be shown. One of these situations can be when a process called 'compositing' is turned off or disabled. If this ever happens, the window list will still be shown, but in a very simple format.
tr: İstenen Görev Değiştiricisi görselleştirmesinin gösterilemediği durumlar olabilir. Bu durumlardan biri, “bileşikleştirme” adı verilen bir işlemin kapatıldığı veya devre dışı bırakıldığı zaman olabilir. Böyle bir durumda, pencere listesi yine de gösterilir; ancak çok basit bir biçimde.

source: Shortcuts
tr: Kısayollar

source: This section allows you to define up to four Task Switcher keyboard shortcuts for the <guilabel>Main</guilabel> configuration and four more for the <guilabel>Alternative</guilabel> configuration. The <guilabel>Main</guilabel> shortcuts are predefined, while the <guilabel>Alternative</guilabel> shortcuts need to be defined manually.
tr: Bu bölüm, <guilabel>Ana</guilabel> yapılandırması için dört adede kadar Görev Değiştiricisi klavye kısayolu ve <guilabel>Alternatif</guilabel> yapılandırması için dört tane daha tanımlamanıza olanak tanır. <guilabel>Ana</guilabel> kısayolları önceden tanımlanmıştır, <guilabel>Alternatif</guilabel> kısayollarının ise elle tanımlanması gerekir.

source: In the <guilabel>All Windows</guilabel> section, the <guilabel>Forward</guilabel> and <guilabel>Reverse</guilabel> shortcuts will cycle forward and backward through the list of open windows.
tr: <guilabel>Tüm Pencereler</guilabel> bölümünde, <guilabel>İleri</guilabel> ve <guilabel>Geri</guilabel> kısayolları, açık pencereler listesinde ileri ve geri dönmeyi sağlar.

source: In the <guilabel>Current Application</guilabel> section, the <guilabel>Forward</guilabel> and <guilabel>Reverse</guilabel> shortcuts can be set to cycle through the windows of the currently active application. For example, if you have three &dolphin; file browser windows open, then you would be able to use these shortcuts to just cycle among the three &dolphin; windows.
tr: <guilabel>Geçerli Uygulama</guilabel> bölümünde, <guilabel>İleri</guilabel> ve <guilabel>Geri</guilabel> kısayolları, o anda etkin olan uygulamanın pencereleri arasında geçiş yapacak şekilde ayarlanabilir. Örneğin, üç &dolphin; penceresi açıksa bu kısayolları kullanarak üç &dolphin; penceresi arasında dolaşabilirsiniz.

source: To change a keyboard shortcut, click the <guibutton>Forward</guibutton> or <guibutton>Reverse</guibutton> button and type the desired shortcut combination. Be sure to use a modifier key like &Ctrl; or &Alt; as part of the shortcut, otherwise you might not be able to cycle through the window list properly.
tr: Bir klavye kısayolunu değiştirmek için <guibutton>İleri</guibutton> veya <guibutton>Geri</guibutton> düğmesine tıklayın ve istediğiniz kısayol kombinasyonunu yazın. &Ctrl; gibi bir niteleyici düğme kullandığınızdan veya &Alt; düğmesinin kısayolun bir parçası olduğundan emin olun; aksi takdirde pencere listesinde düzgün bir şekilde dolaşamayabilirsiniz.

source: Any of the defined keyboard shortcuts can be used to invoke the Task Switcher. To invoke the Task Switcher without using the keyboard, you can define screen edge actions in the &systemsettings; module <ulink url="help:/kcontrol/kwinscreenedges/index.html"><guilabel>Screen Edges</guilabel></ulink>.
tr: Görev Değiştiricisi’ni çağırmak için tanımlanmış klavye kısayollarından herhangi biri kullanılabilir. Görev Değiştiricisi’ni klavyeyi kullanmadan çalıştırmak için <ulink url="help:/kcontrol/kwinscreenedges/index.html"><guilabel>Ekran Kenarları</guilabel></ulink> &systemsettings; modülünü kullanın.

source: Content
tr: İçerik

source: The options in this section partially control which windows will appear in the Task Switcher list.
tr: Bu bölümdeki seçenekler, Görev Değiştiricisi listesinde hangi pencerelerin görüneceğini kısımsal olarak denetler.

source: The <guilabel>Sort Order</guilabel> drop-down list specifies whether the windows should be listed in <guilabel>Stacking Order</guilabel> or <guilabel>Recently Used</guilabel> order. <guilabel>Stacking Order</guilabel> is the order in which the windows appear on top of each other on the screen, while <guilabel>Recently Used</guilabel> order is the order in which the windows have been used. <guilabel>Recently Used</guilabel> order makes it very easy to switch between the two most frequently used windows because they will always appear in the top 2 positions in the list.
tr: <guilabel>Sıralama Düzeni</guilabel> açılır listesi, pencerelerin <guilabel>Yığınlama Düzeni</guilabel> mi yoksa <guilabel>Son Kullanılanlar</guilabel> sıralamasında mı listeleneceğini belirtir. <guilabel>Yığın Düzeni</guilabel>, pencerelerin ekranda üst üste gelme sırasını, <guilabel>Son Kullanılanlar</guilabel> sıralaması ise pencerelerin kullanılma sırasıdır. <guilabel>Son Kullanılanlar</guilabel> sıralaması, her zaman listede ilk 2 sırada görünecekleri için en sık kullanılan iki pencere arasında geçiş yapmayı çok kolaylaştırır.

source: The <guilabel>Include "Show Desktop" icon</guilabel> option will add a Show Desktop option to the window list. This allows the user to easily select the Desktop as the 'window' to show.
tr: <guilabel>“Masaüstünü Göster” simgesini içer</guilabel> seçeneği, pencere listesine bir Masaüstünü Göster seçeneği ekleyecektir. Bu, kullanıcının gösterilecek “pencere” olarak Masaüstünü kolayca seçmesini sağlar.

source: The <guilabel>Only one window per application</guilabel> option reduces clutter by only showing one window for each open application. If an application has multiple windows open, then its most recently activated window will be shown in the list and the others will not be shown.
tr: <guilabel>Her uygulama için yalnızca bir pencere</guilabel> seçeneği, her açık uygulama için yalnızca bir pencere göstererek karmaşayı azaltır. Bir uygulamanın birden fazla açık penceresi varsa en son etkinleştirilen penceresi listede gösterilecek ve diğerleri gösterilmeyecektir.

source: The <guilabel>Order minimized windows after unminimized windows</guilabel> option will show you all unminimized windows first, even if they are less recent or further at the bottom than some of the minimized windows.
tr: <guilabel>Küçültülmüş pencereleri diğer pencerelerden sonra sırala</guilabel> seçeneği, küçültülmüş pencerelerin bazılarından daha yakın tarihli veya daha altta olsalar bile, önce tüm küçültülmemiş pencereleri gösterir.

source: Filter Windows By
tr: Pencereleri Şuna Göre Süz

source: This section contains options for additionally filtering the Task Switcher's list of windows.
tr: Bu bölüm, Görev Değiştiricisi’nin pencere listesini ek olarak süzmek için seçenekler içerir.

source: The <guilabel>Virtual Desktops</guilabel> option filters the list of windows according to which virtual desktop is currently active. If you consistently put specific windows on specific virtual desktops, then this filtering option can make it easy to switch to windows within or across those virtual desktops. Select <guilabel>Current desktop</guilabel> to only show windows on the current virtual desktop. Select <guilabel>All other desktops</guilabel> to show only the windows on the virtual desktops that are not currently active.
tr: <guilabel>Sanal Masaüstleri</guilabel> seçeneği, o anda etkin olan sanal masaüstüne göre pencerelerin listesini süzer. Belirli sanal masaüstlerine sürekli olarak belirli pencereler yerleştirirseniz bu süzme seçeneği, bu sanal masaüstleri içinde veya arasında pencerelere geçişi kolaylaştırabilir. Yalnızca geçerli sanal masaüstündeki pencereleri göstermek için <guilabel>Geçerli masaüstü</guilabel> ögesini seçin. Sanal masaüstlerinde yalnızca şu anda etkin olmayan pencereleri göstermek için <guilabel>Diğer tüm masaüstleri</guilabel>’ni seçin.

source: The <guilabel>Activities</guilabel> option filters the list of windows according to which Activity is currently active. As with Virtual Desktop filtering, this option can make it easier to switch to applications within or across all Activities. Select <guilabel>Current activity</guilabel> to only show windows that are part of the current Activity. Select <guilabel>All other activities</guilabel> to only show windows that are part of the Activities that are not currently active.
tr: <guilabel>Etkinlikler</guilabel> seçeneği, şu anda etkinliğin etkin olduğu pencerelerin listesini süzer. Sanal Masaüstü süzmede olduğu gibi, bu seçenek tüm Etkinlikler içinde veya genelinde uygulamalara geçişi kolaylaştırabilir. Yalnızca geçerli etkinliğin parçası olan pencereleri göstermek için <guilabel>Geçerli etkinlik</guilabel> ögesini seçin. Yalnızca şu anda etkin olmayan etkinliklerin parçası olan pencereleri göstermek için <guilabel>Diğer tüm etkinlikler</guilabel>’i seçin.

source: The <guilabel>Screens</guilabel> option filters the list of windows according to which display screen is currently active. Select <guilabel>Current screen</guilabel> to only show windows that are on the display that currently has the mouse pointer on it. Select <guilabel>All other screens</guilabel> to show the windows that are on all other displays. This option can be useful to users who want to quickly switch between windows that are on the same monitor in a multi-monitor setup.
tr: <guilabel>Ekranlar</guilabel> seçeneği, o anda etkin olan görüntüleme ekranına göre pencerelerin listesini süzer. Yalnızca o anda üzerinde fare işaretçisinin bulunduğu ekranda bulunan pencereleri göstermek için <guilabel>Geçerli ekran</guilabel>’ı seçin. Diğer tüm ekranlardaki pencereleri göstermek için <guilabel>Diğer tüm ekranlar</guilabel>’ı seçin. Bu seçenek, çoklu monitör kurulumunda aynı monitörde bulunan pencereler arasında tez geçiş yapmak isteyen kullanıcılar için yararlı olabilir.

source: The active screen is the one that the mouse pointer is currently on, not the screen that the currently active window is on.
tr: Etkin ekran, o anda etkin pencerenin açık olduğu ekran değil, fare işaretçisinin o anda üzerinde olduğu ekrandır.

source: The <guilabel>Minimization</guilabel> option filters the list of windows according to whether they are hidden or not. Select <guilabel>Visible windows</guilabel> to only show windows that have not been minimized. Select <guilabel>Hidden windows</guilabel> to only show the minimized windows.
tr: <guilabel>Simge durumuna küçültme</guilabel> seçeneği, pencerelerin listesini gizli olup olmamalarına göre süzer. Yalnızca simge durumuna küçültülmemiş pencereleri göstermek için <guilabel>Görünür pencereler</guilabel>’i seçin. Yalnızca simge durumuna küçültülmüş pencereleri göstermek için <guilabel>Gizli pencereler</guilabel>’i seçin.

source: If you uncheck an option in this section, then no filtering will be applied for that option. For example, if you check the Screens option and clear the other three options, then the Task Switcher window list will only be filtered according to which windows are on the current display.
tr: Bu bölümdeki bir seçeneğin işaretini kaldırırsanız o seçenek için herhangi bir süzgeç uygulanmaz. Örneğin, Ekranlar seçeneğini işaretler ve diğer üç seçeneği temizlerseniz Görev Değiştiricisi pencere listesi yalnızca geçerli ekranda hangi pencerelerin bulunduğuna göre süzülür.

source: All of the options described in the above sections work together to provide very fine-grained control of the Task Switcher's behavior and appearance. For example, you could define the <guilabel>Main</guilabel> settings collection to be invoked with the <keycombo>&Alt;&Tab;</keycombo> key combination, to show the open windows in a carousel, to only show one window per application, and to only list windows that are on the current desktop and on the currently active screen. This can provide very fast context-sensitive window switching if you have both 'work' and 'home' virtual desktops, and then keep all of your spreadsheets for work and home on the same monitor.
tr: Yukarıdaki bölümlerde açıklanan seçeneklerin tümü, Görev Değiştiricisi’nin davranışı ve görünüşü üzerinde çok ayrıntılı denetim sağlamak için birlikte çalışır. Örneğin, bir döngüde açık pencereleri göstermek için <keycombo>&Alt;&Tab;</keycombo> düğme kombinasyonu ile çağrılacak <guilabel>Ana</guilabel> ayarlar koleksiyonunu yalnızca bir pencere gösterecek şekilde, uygulama başına ve yalnızca geçerli masaüstünde ve o anda etkin olan ekranda bulunan pencereleri listelemek için tanımlayabilirsiniz. Bu, hem ’iş’ hem de ’ev’ sanal masaüstleriniz varsa bağlama duyarlı çok hızlı pencere geçişi sağlayabilir ve ardından iş ve ev için tüm elektronik tablolarınızı aynı monitörde tutar.

source: The availability of the <guilabel>Alternative</guilabel> Task Switcher configuration gives you a second way to easily filter and browse through the window lists. With eight key combinations available across the two Task Switcher configurations, it should be possible to easily and quickly navigate through large numbers of windows.
tr: <guilabel>Alternatif</guilabel> Görev Değiştiricisi yapılandırmasının kullanılabilirliği, size pencere listelerini kolayca süzmek ve göz atmak için ikinci bir yol sunar. İki Görev Değiştiricisi yapılandırmasında bulunan sekiz düğme kombinasyonuyla, çok sayıda pencere arasında kolay ve tez dolaşabilirsiniz.
