Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_kded.po
Languages: tr

source: Background Services
tr: Arka Plan Hizmetleri

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Systemsettings
tr: sistem ayarları

source: Service
tr: Hizmet

source: The <guilabel>Service Manager</guilabel> module allows you to have an overview of all plugins of the &kde; Daemon, also referred to as &kde; Services. Generally, there are two types of service:
tr: <guilabel>Hizmet Yöneticisi</guilabel> modülü, &kde; Ardalan Süreçleri’nin, başka bir adıyla &kde; Ardalan Süreçleri’nin genel bir görünümünü sunar. Genelde iki tür hizmet vardır:

source: Load-on-Demand Services
tr: İsteğe Bağlı Yüklenen Hizmetler

source: This is a list of available &kde; services which will be started on demand. They are only listed for convenience, as you cannot manipulate these services.
tr: Bunlar, istendiğinde başlatılacak olan kullanılabilir &kde; hizmetlerinin bir listesidir. Yalnızca bilginiz olması için listelenirler ve bu hizmetleri manipüle edemezsiniz.

source: Startup Services
tr: Başlangıç Hizmetleri

source: This shows all &kde; services that can be loaded on &kde; startup. Services checked in the <guilabel>Use</guilabel> column will be invoked on next startup.
tr: Burası, &kde; başlangıcında yüklenebilen tüm &kde; hizmetlerini gösterir. <guilabel>Kullanım</guilabel> sütununda işaretlenmiş hizmetler bir sonraki başlangıçta çağrılırlar.

source: Be careful with deactivation of unknown services: some services are vital for &kde;; do not deactivate services if you do not know what you are doing.
tr: Ne yaptığını bilmediğiniz hizmetleri devre dışı bırakırken dikkatli olun. Bazı hizmetler, &kde;’nin düzgün çalışması için elzemdir.

source: To change the <guilabel>Status</guilabel> of a service, select it in the list. Then you can use the <guibutton>Start</guibutton> and <guibutton>Stop</guibutton> to change the status of a service from <guilabel>Not running</guilabel> to <guilabel>Running</guilabel> and vice versa.
tr: Bir hizmetin <guilabel>Durum</guilabel>’unu değiştirmek için onu listede seçin. Sonrasında hizmetlerin durumunu <guilabel>Çalışmıyor</guilabel>’dan <guilabel>Çalışıyor</guilabel>’a veya tam tersine değiştirmek için <guibutton>Başlat</guibutton> ve <guibutton>Durdur</guibutton> düğmelerini kullanabilirsiniz.
