Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_keyboard.po
Languages: tr

source: Keyboard
tr: Klavye

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: System Settings
tr: sistem ayarları

source: keyboard
tr: klavye

source: This module allows you to choose how your keyboard works.
tr: Bu modül, klavyenizin nasıl çalıştığını seçmenize izin verir.

source: There are three tabs in this module.
tr: Bu modülde üç adet sekme vardır.

source: The Hardware tab
tr: Donanım sekmesi

source: The actual effect of setting these options depends upon the features provided by your keyboard hardware and the X server on which &plasma; is running. As an example, you may find that changing the key click volume has no effect because that feature is not available on your system.
tr: Bu seçeneklerin gerçekte yapacağı etki, klavye donanımınız ve &plasma;’nın üzerinde çalıştığı X sunucusu tarafından sağlanan özelliklere bağlıdır. Örnek olarak, düğme vuruş sesi düzeyini değiştirmenin bir etkisi olmadığını ayrımlayabilirsiniz; çünkü donanımınız bu özelliği desteklemiyordur.

source: Keyboard model:
tr: Klavye modeli:

source: Here you can set your keyboard model. This setting is independent of your keyboard layout and refers to the &quot;hardware&quot; model, &ie; the way your keyboard is manufactured. Modern keyboards that come with your computer usually have two extra keys and are referred to as &quot;104-key&quot; models, which is probably what you want if you do not know what kind of keyboard you have.
tr: Burada klavye modelinizi ayarlayabilirsiniz. Bu ayar klavye yerleşiminizden bağımsızdır ve “donanım” modeli, &ie; klavyenizin üretilme biçimidir. Bilgisayarınızla birlikte gelen çağdaş klavyelerde genellikle fazladan iki düğme bulunur ve bunlara “104 düğmeli” denir. Ne tür bir klavyeye sahip olduğunuzu bilmiyorsanız en iyisi bu ayara dokunmayın.

source: NumLock on Plasma Startup
tr: Plasma Başlangıcında Sayı Kilidi Durumu

source: You can choose to either always <guilabel>Turn on</guilabel> or <guilabel>Turn off</guilabel> the NumLock when &plasma; starts, or you can choose to have &plasma; leave NumLock at whatever it was set to before &plasma; started up.
tr: &plasma; başlangıcında Sayı Kilidi’ni ister <guilabel>Açık</guilabel> veya <guilabel>Kapalı</guilabel> olarak ayarlayabilir veya &plasma;’nın Sayı Kilidi’ni &plasma; başlangıcı öncesi hangi durumdayse öyle bırakması gerektiğini söyleyebilirsiniz.

source: When a key is held:
tr: Bir düğme basılı tutulduğunda:

source: It is possible to select one of the tree options here, namely
tr: Bu iki seçenekten birini seçebilirsiniz

source: Show accented and similar characters
tr: Aksanlı ve benzer karakterleri göster

source: If this option is selected, when a key is held down while entering text, a popup is shown which lets one choose between various accented forms of the character.
tr: Bu seçenek seçilirse metin girerken bir düğme basılı tutulduğunda, karakterin çeşitli aksanlı biçimleri arasında seçim yapılmasını sağlayan bir açılır pencere gösterilir.

source: Do nothing
tr: Hiçbir şey yapma

source: This option allows you to turn off any activities when you pressing and holding down the keys.
tr: Bu seçenek, düğmeleri basılı tuttuğunuzda tüm etkinlikleri kapatmanızı sağlar.

source: Repeat the key
tr: Düğmeyi yinele

source: When this option is selected, pressing and holding down a key emits the same character repeatedly until the key is released. Pressing and holding the key will have the same effect as pressing it multiple times in succession.
tr: Bu seçenek seçildiğinde, bir düğmeye basıp basılı tutmak, düğme bırakılana kadar aynı karakteri yineler. Düğmeye basıp basılı tutmak, art arda birkaç kez basmakla aynı etkiye sahiptir.

source: Almost all users will want to have this option enabled, because it makes navigating through documents with the arrow keys significantly easier.
tr: Ok düğmeleriyle belgeler arasında gezinmeyi önemli ölçüde kolaylaştırdığından, neredeyse tüm kullanıcılar bu seçeneğin etkinleştirilmesini isteyecektir.

source: Delay
tr: Gecikme

source: This option allows you to set the delay after which a pressed key will start generating keycodes.
tr: Bu seçenek, basılan bir düğmenin ardından düğme kodları oluşturmaya başlayacağı gecikmeyi ayarlamanıza olanak tanır.

source: Rate
tr: Hız

source: This option allows you to set the rate at which keycodes are generated while a key is pressed.
tr: Bu seçenek, bir düğmeye basılırken düğme kodlarının oluşturulma hızını ayarlamanıza olanak tanır.

source: Type some characters into the <guilabel>Test area</guilabel> text box to verify the settings.
tr: Ayarları doğrulamak için <guilabel>Sınama alanı</guilabel> metin kutusuna bir şeyler yazın.

source: Many computers won't support this function.
tr: Birçok bilgisayar bu ayarı desteklemez.

source: The Layouts tab
tr: Yerleşimler sekmesi

source: This tab lets you choose what keyboard layouts you want to use, what indicator you want in the system tray, how you want to switch and which shortcuts you will use.
tr: Bu sekme, kullanmak istediğiniz klavye yerleşimlerini, sistem tepsisinde hangi göstergeyi istediğinizi, nasıl geçiş yapmak istediğinizi ve hangi kısayolları kullanacağınızı seçmenizi sağlar.

source: Layout Indicator
tr: Yerleşim Göstergesi

source: You can choose to <guilabel>Show layout indicator</guilabel> which will show the language iso name in the system tray. You can choose to show the indicator even if you have a single layout enabled and you can show the language flag instead of only the ISO code by checking <guilabel>Show flag</guilabel>.
tr: Sistem tepsisinde dilin ISO adını gösterecek olan <guilabel>Yerleşim göstergesini göster</guilabel>’i seçebilirsiniz. Tek bir yerleşimi etkinleştirmiş olsanız bile göstergeyi göstermeyi seçebilir ve <guilabel>Bayrağı göster</guilabel> seçeneğini işaretleyerek sadece ISO kodu yerine dil bayrağını gösterebilirsiniz.

source: Switching Policy
tr: Değiştirme Politikası

source: If you select <guilabel>Application</guilabel> or <guilabel>Window</guilabel> switching policy, changing the keyboard layout will only affect the current application or window. <guilabel>Global</guilabel> will change the keyboard layout globally and <guilabel>Desktop</guilabel> will change it only for the current virtual desktop.
tr: <guilabel>Uygulama</guilabel> veya <guilabel>Pencere</guilabel> değiştirme politikasını seçerseniz klavye yerleşimini değiştirmek yalnızca geçerli uygulamayı veya pencereyi etkiler. <guilabel>Global</guilabel>, klavye yerleşimini genel olarak ve <guilabel>Masaüstü</guilabel> yalnızca geçerli sanal masaüstü için değiştirir.

source: Shortcuts for Switching Layout
tr: Yerleşim Değiştirme Kısayolları

source: <guilabel>Main shortcuts</guilabel> is a shortcut for switching layouts which is handled by X.org. <guilabel>3rd level shortcuts</guilabel> is a shortcut for switching to a third level of the active layout (if it has one) which is handled by X.org. It allows modifier-only shortcuts. <guilabel>Alternative shortcut</guilabel> is a shortcut for switching layouts which is handled by &plasma;. It does not support modifier-only shortcuts and also may not work in some situations (&eg; if popup is active or from screensaver).
tr: <guilabel>Ana kısayollar</guilabel>, X.org tarafından yönetilen yerleşimleri değiştirmek için kullanılan bir kısayoldur. <guilabel>3. düzey kısayollar</guilabel>, X.org tarafından yönetilen etkin yerleşimin (varsa) üçüncü düzeyine geçmek için kullanılan bir kısayoldur. Yalnızca niteleyici kısayollara izin verir. <guilabel>Alternatif kısayol</guilabel>, &plasma; tarafından yönetilen yerleşimleri değiştirmek için kullanılan bir kısayoldur. Yalnızca niteleyici kısayolları desteklemez ve ayrıca bazı durumlarda çalışmayabilir (&eg;, açılır pencere etkinse veya ekran koruyucusundansa).

source: Configure layouts
tr: Yerleşimleri yapılandır

source: If you check <guilabel>Configure layouts</guilabel> you will be able to add and remove keyboard layouts in order to switch between them when you need.
tr: <guilabel>Yerleşimleri yapılandır</guilabel> seçeneğine tıklarsanız gerektiğinde birbirleri arasında geçiş yapmak üzere yeni klavye yerleşimleri ekleyebilir veya kaldırabilirsiniz.

source: Clicking on <guibutton>Add</guibutton> will open a dialog where you will be able to choose the new keyboard layout you want to add as well as its variant, label and shortcut.
tr: <guibutton>Ekle</guibutton>’ye tıkladığınızda, eklemek istediğiniz yeni klavye yerleşiminin yanı sıra varyantını, etiketini ve kısayolunu seçebileceğiniz bir iletişim kutusu açılır.

source: The list of layouts right to the <guilabel>Layout</guilabel> label in the <guilabel>Add Layout</guilabel> dialog can be narrowed down using <guilabel>Limit selection by language</guilabel> drop-down list. You can click on <guibutton>Preview</guibutton> button to preview chosen layout in a separate window.
tr: <guilabel>Yerleşim Ekle</guilabel> iletişim kutusundaki <guilabel>Yerleşim</guilabel> etiketinin sağındaki yerleşim listesi, <guilabel>Seçimi dile göre sınırla</guilabel> açılır listesi kullanılarak daraltılabilir. Seçili yerleşimi ayrı bir pencerede önizlemek için <guibutton>Önizle</guibutton> düğmesine tıklayabilirsiniz.

source: You can order the layouts with the up and down buttons, the top one being the default one.
tr: Yerleşimleri yukarı ve aşağı düğmeleriyle sıralayabilirsiniz, en üstteki öntanımlı olandır.

source: Spare layouts
tr: Yedek yerleşimler

source: This option can be enabled only if you have more than two layouts.
tr: Bu seçenek, yalnızca ikiden fazla yerleşiminiz varsa etkinleştirilebilir.

source: Spare layouts allow to toggle between small number of layouts easily while keeping more layouts handy close by. For example you might use 3 languages: English, Ukrainian and German but first two are used often and third one just occasionally. In this case you can configure first two as main layouts (setting <guilabel>Main layout count</guilabel>: 2) and German one as spare one - when you toggle with keyboard and left mouse button the switch will happen between main layouts only but you can always choose 3rd layout with context menu.
tr: Yedek yerleşimler, daha fazla yerleşimi yakınınızda tutarken az sayıda yerleşim arasında kolayca geçiş yapmanızı sağlar. Örneğin, 3 dil konuşuyorsunuz: İngilizce, Rusça ve Japonca; ancak ilk ikisini sıklıkla, üçüncüsünü ise nadiren kullanıyor olabilirsiniz. Bu durumda, ilk ikisini ana yerleşim olarak (<guilabel>Ana yerleşim sayısı</guilabel>: 2) ve Japoncayı yedek olarak yapılandırabilirsiniz — klavye ve sol fare düğmesiyle geçiş yaptığınızda, geçiş yalnızca ana yerleşimler arasında gerçekleşir; ancak bağlam menüsüyle her zaman 3. yerleşimi seçebilirsiniz.

source: When spare layout is chosen it replaces the last main layout (this is done for technical reasons, usually global shortcuts work based on the 1st active layout so it's more reliable to preserve the 1st layout when allowing to activate spare layouts).
tr: Yedek yerleşim seçildiğinde, son ana yerleşimi değiştirir (bu teknik nedenlerle yapılır, genellikle genel kısayollar 1. etkin yerleşime göre çalışır, bu nedenle yedek yerleşimleri etkinleştirmeye izin verirken 1. yerleşimi korumak daha güvenilirdir).

source: As X.org only allows to have 4 layouts to switch <quote>spare layouts</quote> feature also allows to overcome this limitation: user can have up to 4 main layouts (managed by X.org) but 4 more spare layouts allowed (managed by layout switcher). Thus user can conveniently work with up to total of 8 layouts (although the 4 spare layouts limit can be raised in the future).
tr: X.org aralarında geçiş yapmak için yalnızca 4 yerleşime izin verdiğinden, <quote>yedek yerleşimler</quote> özelliği, bu sınırlamanın üstesinden gelinmesine olanak tanır: Kullanıcı en fazla 4 ana yerleşime (X.org tarafından yönetilen) sahip olabilir; ancak 4 yedek yerleşime daha izin verilir (yerleşim değiştiricisi tarafından yönetilir). Böylece kullanıcı, toplam 8 yerleşime kadar rahat bir şekilde çalışabilir (yine de gelecekte 4 yedek yerleşim sınırı yükseltilebilir).

source: The Advanced tab
tr: Gelişmiş sekmesi

source: In this tab, if you check <guilabel>Configure keyboard options</guilabel> you will then be able to set a few options regarding some special keys settings. You can expand these options by clicking on the &gt; symbol on the left of the option then you choose your setting in the expanded list.
tr: Bu sekmede, <guilabel>Klavye seçeneklerini yapılandır</guilabel> seçeneğini işaretlerseniz bazı özel düğme ayarlarıyla ilgili birkaç seçeneği belirleyebilirsiniz. Bu seçenekleri, seçeneğin solundaki &gt; sembolünü, ardından genişletilmiş listede ayarınızı seçerek değiştirin.

source: This is a &GUI; to help creating custom keyboard layouts for &X11; using XKB.
tr: XKB kullanarak &X11; için klavye yerleşimleri oluşturmaya yardımcı olmak için bir grafik arayüz vardır.

source: For more information please refer to the <emphasis>Links</emphasis> section on the <ulink url="https://www.freedesktop.org/wiki/Software/XKeyboardConfig">XKeyboardConfig page on freedesktop.org</ulink>.
tr: Daha fazla bilgi için <ulink url="https://www.freedesktop.org/wiki/Software/XKeyboardConfig">freedesktop.org üzerindeki XKeyboardConfig sayfası</ulink> <emphasis>Links (Bağlantılar)</emphasis> bölümüne bakın.
