Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_kwinscreenedges-x11.po
Languages: tr

source: Screen Edges
tr: Ekran Kenarları

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Volkan</firstname><surname>Gezer</surname><affiliation><address><email>volkangezer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Systemsettings
tr: sistem ayarları

source: desktop
tr: masaüstü

source: effects
tr: efektler

source: screen
tr: ekran

source: edge
tr: kenar

source: Active screen edges allow you to activate effects by pushing your mouse cursor against the edge of the screen. Here you can configure which effect will get activated on each edge and corner of the screen.
tr: Etkin ekran kenarları, fare imlecinizi ekranın kenarına doğru iterek efektleri etkinleştirmenizi sağlar. Burada, ekranın her kenarında ve köşesinde hangi efektin etkinleştirileceğini yapılandırabilirsiniz.

source: Click with any mouse button onto a square and select an effect in the context menu. Edges with a blue square have already an attached effect, a grey-colored square indicates that no effect is selected for this edge.
tr: Herhangi bir fare düğmesiyle bir kareye tıklayın ve bağlam menüsünden bir efekt seçin. Mavi kareli kenarların zaten ekli bir efekti vardır, gri renkli kare bu kenar için hiçbir efektin seçilmediğini gösterir.

source: The number of accessible items in the context menu depends on the settings in the module <ulink url="help:/kcontrol/kwineffects-x11/index.html"> <guilabel>Desktop Effects</guilabel></ulink> in the <guilabel>Workspace</guilabel> category. Select your favorite effects from the <guilabel>Window Management</guilabel> group. This activates the corresponding items in the context menu.
tr: Bağlam menüsündeki erişilebilir efektlerin sayısı, <guilabel>Çalışma Alanı</guilabel> kategorisinde bulabileceğiniz <ulink url="help:/kcontrol/kwineffects-x11/index.html"><guilabel>Masaüstü Efektleri</guilabel></ulink> modülündeki ayarlara bağlıdır. Favori efektlerinizi <guilabel>Pencere Yönetimi</guilabel> grubundan seçin. Bu, bağlam menüsündeki ilgili ögeleri etkinleştirir.

source: If you are looking for the setting to enable switching of desktops by pushing your mouse cursor against the edge of the screen choose one of the <guilabel>Present Windows</guilabel> effects from the context menu.
tr: Fare imlecinizi ekranın kenarına doğru iterek masaüstleri arasında geçiş yapmayı etkinleştirecek ayarı arıyorsanız bağlam menüsünden <guilabel>Pencereleri Sun</guilabel> efektlerinden birini seçin.

source: You can enable <guilabel>Maximize: Windows dragged to top edge</guilabel>, <guilabel>Tile: Windows dragged to left or right edge</guilabel> or <guilabel>Trigger quarter tiling in:</guilabel> and set a percentage of the screen to trigger the tiling.
tr: <guilabel>Ekranı Kapla: Üst kenarar sürüklenen pencereler</guilabel>, <guilabel>Döşe: Sağ veya sol kenara sürüklenen pencereler</guilabel> or <guilabel>Çeyrek döşemeyi şurada tetikle:</guilabel> ayarlarını etkinleştirebilir ve döşemeyi tetikleyecek ekran yüzdesini girebilirsiniz.

source: In the <guilabel>Movement</guilabel> tab of the <guilabel>Window Behavior</guilabel> settings module in the <guilabel>Window Management</guilabel> section of the system settings, you can configure snap zones for windows to moved to the screen edges, center or other windows when they get near them.
tr: Sistem ayarlarının <guilabel>Pencere Yönetimi</guilabel> bölümünde bulunan <guilabel>Pencere Davranışı</guilabel> ayarları modülündeki <guilabel>Hareket</guilabel> sekmesinden pencereler kenarlara, merkeze veya diğer pencerelerin yakınlarına taşındığında tutturulacakları bölgeleri yapılandırabilirsiniz.

source: Disable the <guilabel>Remain active when windows are fullscreen</guilabel> option to suppress triggering screen edge actions when an application is running in fullscreen.
tr: Bir uygulama tam ekran kipinde çalışıyorken ekran kenarı eylemlerini tetiklemeyi bastırmak istiyorsanız <guilabel>Pencereler tam ekranken etkin kal</guilabel> seçeneğini devre dışı bırakın.

source: Using the <guilabel>Switch desktop on edge</guilabel> item, configure if you want to switch to another desktop when pushing the mouse cursor to an edge of the screen, &eg; only when moving windows.
tr: <guilabel>Kenarda masaüstünü değiştir</guilabel> ögesini kullanarak, fare imlecini bir ekranın kenarına getirdiğinizde başka bir masaüstüne geçmek isteyip istemediğinizi yapılandırın; &eg;, pencereleri taşırken.

source: <guilabel>Activation delay</guilabel> is the amount of time required for the mouse cursor to be pushed against the edge of the screen before the action is triggered.
tr: <guilabel>Etkinleştirme gecikmesi</guilabel>, eylem tetiklenmeden önce fare imlecinin ekran kenarlığına itilmesi gereken süredir.

source: <guilabel>Reactivation delay</guilabel> is the amount of time required after triggering an action until the next trigger can occur.
tr: <guilabel>Yeniden etkinleştirme gecikmesi</guilabel>, bir tetik gerçekleşmesinden sonra sonraki tetiğin gerçekleşmesi için geçmesi gereken süredir.
