Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_fontinst.po
Languages: tr

source: Font Management
tr: Yazıtipi Yönetimi

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Systemsettings
tr: sistem ayarları

source: fonts
tr: yazıtipleri

source: This module is responsible for installing, un-installing, previewing and managing your fonts.
tr: Bu modül; yazıtiplerinizi kurmaktan, kaldırmaktan, önizlemekten ve yönetmekten sorumludur.

source: Font Groups
tr: Yazıtipi Grupları

source: There are 4 special pre-defined font groups:
tr: Dört adet önceden tanımlı özel yazıtipi grubu vardır:

source: <quote>All Fonts</quote> This will display all fonts, both personal and system-wide.
tr: <quote>Tüm Yazıtipleri</quote> Bu, tüm yazıtiplerini görüntüler, hem kişisel hem sistem.

source: <quote>Personal Fonts</quote> The fonts shown will be your personal fonts, and will not be available to other users.
tr: <quote>Kişisel Yazıtipleri</quote> Gösterilen yazıtipleri, sizin kişisel yazıtipleriniz olacaktır; başka kullanıcılar bunları kullanamaz.

source: <quote>System Fonts</quote> The fonts shown will be those available to all users. Installing a font system-wide, or removing a system-wide font, will require administrator privileges.
tr: <quote>Sistem Yazıtipleri</quote> Burada gösterilen yazıtiplerini bütün kullanıcılar kullanabilir. Bir yazıtipini sistem genelinde kurmak veya sistem genelinde kurulu bir yazıtipini kaldırmak, yönetici ayrıcalıkları gerektirir.

source: <quote>Unclassified</quote> This will list all fonts that have not been placed into any user-defined groups. This group will only appear if you have some user-defined groups.
tr: <quote>Sınıflandırılmamış</quote> Bu, kullanıcı tanımlı herhangi bir gruba yerleştirilmemiş tüm yazıtiplerini listeler. Bu grup yalnızca daha önceden kullanıcı tanımlı gruplar oluşturulmuşsa görünür.

source: To add a font to a group, drag it from the list of fonts onto a group. To remove a font from a group, drag the font onto the <quote>All Fonts</quote> group.
tr: Bir gruba bir yazıtipini eklemek için listeden bir grubun üzerine sürükleyin. Bir yazıtipini gruptan kaldırmak için yazıtipini <quote>Tüm Yazıtipleri</quote> grubuna sürükleyin.

source: Below this list you find buttons to create a new group, remove a group and enable or disable the fonts in the current group.
tr: Bu listenin altında yeni bir grup oluşturmak, bir grubu kaldırmak ve geçerli gruptaki yazıtiplerini etkinleştirmek veya devre dışı bırakmak için düğmeler bulacaksınız.

source: In the context menu of this list you have additional menuitems to print font samples and export a font to a zip archive.
tr: Bu listenin bağlam menüsünde yazıtipi örnekleri yazdırmak ve bir yazıtipini bir zip arşivine dışa aktarmak için ek menü ögeleri bulunur.

source: Enabling and Disabling
tr: Etkinleştirmek ve Devre Dışı Bırakmak

source: Users with many fonts may find it useful to only have certain fonts enabled (or active) at certain times. To facilitate this, this module will allow you to disable individual fonts, or whole groups of fonts. Disabling a font does not remove the font from the system, it simply hides it so that it no longer appears within applications. Re-enabling a font will then allow it to be used.
tr: Çok sayıda yazıtipine sahip kullanıcılar, belirli zamanlarda yalnızca belirli yazıtiplerinin etkinleştirilmesini (veya etkin olmasını) yararlı bulabilir. Bunu kolaylaştırmak için bu modül, tek tek yazıtiplerini veya tüm yazıtipi gruplarını devre dışı bırakmanıza izin verecektir. Bir yazıtipini devre dışı bırakmak, yazıtipini sistemden kaldırmaz, yalnızca gizler, böylece artık uygulamalarda görünmez. Bir yazıtipini yeniden etkinleştirmek, artık kullanılmasına izin verir.

source: Font List
tr: Yazıtipi Listesi

source: The main display is a list of the installed fonts, grouped via the fonts' family name - the number in square brackets represents the number of installed styles for that family. &eg; the <quote>Times</quote> font may be listed as:
tr: Ana görüntü, yazıtiplerinin aile adına göre gruplandırılmış kurulu yazıtiplerinin bir listesidir — köşeli parantez içindeki sayı, o aile için kurulu biçemlerin sayısını temsil eder. Örneğin, <quote>Times</quote> yazıtipi şu şekilde listelenebilir:

source: Regular
tr: Düzenli

source: Italic
tr: Yatık

source: Bold
tr: Kalın

source: Bold Italic
tr: Kalın Yatık

source: To install a font, press the <guibutton>Install from File...</guibutton> button, and select the desired fonts from within the file dialog. The selected font group will control where the fonts will be installed.
tr: Bir yazıtipi kurmak için <guibutton>Dosyadan Kur…</guibutton> düğmesine basın ve dosya iletişim kutusundan istediğiniz yazıtiplerini seçin. Seçili yazıtipi grubu, yazıtiplerinin nereye kurulacağını denetleyecektir.

source: To un-install fonts, select the appropriate fonts from the list, and press the <inlinemediaobject><imageobject><imagedata fileref="edit-delete.png" format="PNG"/></imageobject></inlinemediaobject> button.
tr: Yazıtiplerini kaldırmak için uygun yazıtiplerini listeden seçin ve <inlinemediaobject><imageobject><imagedata fileref="edit-delete.png" format="PNG"/></imageobject></inlinemediaobject> düğmesine basın.

source: Click with the &RMB; to open a context menu with some additional actions like <guilabel>Enable</guilabel>, <guilabel>Disable</guilabel>, <guilabel>Print</guilabel>, <ulink url="help:/kfontviewer/index.html"><guilabel>Open in Font Viewer</guilabel></ulink> and <guilabel>Reload</guilabel>.
tr: <guilabel>Etkinleştir</guilabel>, <guilabel>Devre Dışı Bırak</guilabel>, <guilabel>Yazdır</guilabel>, <ulink url="help:/kfontviewer/index.html"><guilabel>Yazıtipi Görüntüleyicide Aç</guilabel></ulink>ve <guilabel>Yeniden Yükle</guilabel> gibi ek özellikleri görmek için &RMB; ile tıklayarak bağlam menüsünü açın.

source: Font Filtering
tr: Yazıtipi Süzmek

source: A text field on top of the font preview allows you to filter the list of fonts. You can filter fonts based upon different categories:
tr: Yazıtipi önizlemesinin üstündeki bir metin alanı, yazıtipi listesini süzebilmenizi sağlar. Yazıtiplerini farklı kategorilere göre süzebilirsiniz:

source: Family.
tr: Aile.

source: Style.
tr: Biçem.

source: Foundry.
tr: Dökümevi.

source: FontConfig match. This allows you to enter a family name, and see the family that fontconfig would actually use.
tr: FontConfig eşleşmesi. Bu, bir aile adı girerek FontConfig’in özünde kullanacağı aile adını görebilmenizi sağlar.

source: Font file type.
tr: Yazıtipi dosyası türü.

source: Font file name.
tr: Yazıtipi dosyası adı.

source: Font file location.
tr: Yazıtipi dosyası konumu.

source: Writing system.
tr: Yazı sistemi.

source: Get New Fonts
tr: Yeni Yazıtipleri Al

source: New fonts may be installed from local files, or downloaded using <guilabel>Get Hot New Stuff</guilabel>. The <guilabel>Get New Fonts...</guilabel> entry in the tool button (located above the group list), allows you to install fonts from the Internet. The fonts downloaded in this manner will be installed into your <quote>Personal Fonts</quote> group. To install system-wide, you will need to move them to the <quote>System Fonts</quote> group - this may be achieved by dragging the fonts over the <quote>System Fonts</quote> group entry and will require administrator privileges.
tr: Yeni yazıtipleri yerel dosyalardan veya <guilabel>Yeni Çıkanları Al</guilabel> yerinden indirilebilir. Araç kutusunda bulunan <guilabel>Yeni Yazıtipleri Al…</guilabel> düğmesi (grup listesinin üstünde bulunur), internetten yazıtipleri kurmanıza izin verir. Böyle kurulan yazıtipleri <quote>Kişisel Yazıtipleri</quote> grubunuza gider. Sistem geneline kurmak için onları <quote>Sistem Yazıtipleri</quote> grubuna kaldırmanız gerekir — bunu, yazıtiplerini <quote>Sistem Yazıtipleri</quote> grubu girdisine sürükleyerek yapabilirsiniz; sizden yönetici parolası istenecektir.

source: Duplicate Fonts
tr: Yinelenmiş Yazıtipleri

source: If you have lots of fonts installed on your system it is possible that you may have duplicates.
tr: Sisteminizde çok fazla yazıtipi varsa belki aralarından birkaçı aynı olabilir.

source: Click on the <guilabel>Find Duplicates...</guilabel> button to open a simple tool that will scan your system looking for fonts that have multiple files associated with them. For example, if you have <quote>times.ttf</quote> and <quote>times.TTF</quote> installed in <quote>/usr/local/share/fonts</quote> the underlying font mechanism (called <quote>FontConfig</quote>) will only see one of these. So, if you un-installed the font, it would re-appear, as only one of the files would have been removed. Running this tool will produce a dialog listing each font that has multiple files, and the corresponding list of files. To select a file for deletion, click on the column containing the trash can icon.
tr: Kendileriyle ilişkilendirilmiş birden çok dosyaya sahip yazıtiplerini aramak için sisteminizi tarayacak basit bir aracı açmak üzere <guilabel>Yinelenenleri Bul…</guilabel> düğmesine tıklayın. Örneğin, <quote>/usr/local/share/fonts</quote> içinde <quote>times.ttf</quote> ve <quote>times.TTF</quote> kuruluysa altında yatan yazıtipi mekanizması (<quote>FontConfig</quote>), bunlardan yalnızca birini görecektir. Bu nedenle, yazıtipini kaldırırsanız dosyalardan yalnızca biri kaldırılacağı için yeniden görünecektir. Bu aracı çalıştırmak, birden çok dosyaya sahip her yazıtipini ve karşılık gelen dosya listesini listeleyen bir iletişim kutusu oluşturur. Silinecek bir dosya seçmek için çöp kutusu simgesini içeren sütuna tıklayın.

source: Preview
tr: Önizleme

source: This displays a preview text in different font sizes.
tr: Bu, değişik yazıtipi puntolarında bir önizleme metni görüntüler.

source: Using the context menu enables you to zoom in and out, select a preview type (<guilabel>Standard Preview</guilabel> or <guilabel>All Characters</guilabel>) and change the preview text.
tr: Bağlam menüsünü kullanarak yakınlaştırabilir/uzaklaştırabilir ve bir önizleme türü seçebilir (<guilabel>Standart Önizleme</guilabel> veya <guilabel>Tüm Karakterler</guilabel>), ayrıca önizleme metnini değiştirebilirsiniz.

source: Launch the application &kfontview; if you need additional preview types for Unicode Blocks.
tr: Unicode Blokları için ek önizleme türlerine gereksiniminiz varsa &kfontview; uygulamasını başlatın.
