Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_screenlocker.po
Languages: tr

source: Screen Locking
tr: Ekran Kilidi

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: systemsettings
tr: sistem ayarları

source: screenlocker
tr: ekran kilidi

source: screen locker
tr: ekran kilidi

source: Using this module, you can determine how much time must pass before the screen locker is activated, configure the grace period for unlocking the screen without password, and choose the appearance of your screen locker.
tr: Bu modülü kullanarak, ekran kilidinin etkinleştirilmesi için ne kadar zaman geçmesi gerektiğini belirleyebilir, şifre olmadan ekran kilidini açmak için yetkisiz kullanım süresini yapılandırabilir ve ekran kilitleyicinizin görünüşünü seçebilirsiniz.

source: At the top is a check box to have the screen locker <guilabel>Lock screen automatically</guilabel>, and a spin box which determines the period of inactivity before the screen locker should be started. You can enter any positive number of minutes in this box.
tr: En üstte, ekran kilidininin kendiliğinden başlatılması için <guilabel>Ekranı kendiliğinden kilitle</guilabel> seçeneği ve kilidin çalışmaya başlayacağı boşta kalma süresini ayarlamak için bir döndürme kutusu bulunur. İstediğiniz bir pozitif tamsayıyı girebilirsiniz.

source: The <guilabel>After waking from sleep</guilabel> check box can be used to switch locking the desktop screen after the system suspension on and off.
tr: <guilabel>Uykudan uyandıktan sonra</guilabel> onay kutusu ile sistem uyanınca ekranın kilitli kalmasını sağlayabilir ve parola isteyebilirsiniz.

source: Below that is a spinbox labeled <guilabel>Allow unlocking without password for</guilabel>. When you press a key or click a mouse button to end the screen locker before the time in the spinbox and return to your work, you must not enter a password. The password used is the same password you used to login to your machine.
tr: Bunun altında <guilabel>Parola istemeden kilit açma süresi</guilabel> diye bir döndürme kutusu bulunur. Dönen kutudaki süreden önce ekran kilidini sonlandırmak ve işinize geri dönmek için bir düğmeye veya fare düğmesine bastığınızda, şifre girmezsiniz. Kullanılan parola, makinenizde oturum açmak için kullandığınız parolayla aynıdır.

source: Locking the screen manually causes the password protection to engage immediately.
tr: Ekranın elle kilitlenmesi, parola korumasının hemen devreye girmesine neden olur.

source: You can define a shortcut to lock the screen using the <guilabel>Keyboard shortcut</guilabel> field.
tr: <guilabel>Klavye kısayolu</guilabel> alanını kullanarak ekranı kilitlemek için bir kısayol tanımlayabilirsiniz.

source: The default shortcut <keycombo action="simul">&Ctrl;&Alt;<keycap>L</keycap></keycombo> provides a quick way to lock the screen manually.
tr: Öntanımlı kısayol olan <keycombo action="simul">&Ctrl;&Alt;<keycap>L</keycap></keycombo>, ekranı elle kilitlemek için tez bir yol sunar.

source: If you would like to change the background in locked status press the <guibutton>Configure</guibutton> button besides the <guilabel>Appearance</guilabel> label. Then you can change the <guilabel>Wallpaper type</guilabel>.
tr: Kilitli durumdaki arka plan görselini değiştirmek için <guibutton>Görünüş</guibutton> etiketinin yanında bulunan <guilabel>Yapılandır</guilabel> düğmesine tıklayın. Sonrasında, <guilabel>Duvar kağıdı türü</guilabel>’nü yapılandırabilirsiniz.

source: You can select a <guilabel>Plain Color</guilabel> as wallpaper type.
tr: Duvar kağıdı türü olarak <guilabel>Düz Renk</guilabel> seçebilirsiniz.

source: Alternatively use a single image or a slideshow with images from a folder or load new wallpapers from the Internet.
tr: Alternatif olarak, tek bir görsel veya bir klasördeki görsellerle bir slayt gösterisi kullanın veya internetten yeni duvar kâğıtları yükleyin.
