Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_solid-device-automounter.po
Languages: tr

source: Device Auto-Mount
tr: Aygıtı Kendiliğinden Bağla

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Systemsettings
tr: sistem ayarları

source: automount
tr: kendiliğinden bağla

source: device
tr: aygıt

source: This dialog allows you to configure automatic mounting of disks and volumes.
tr: Bu iletişim kutusu, disklerin ve bölümlerinin otomatik bağlanmasını yapılandırmanıza olanak tanır.

source: If you enable the automatic mounting features in this module, you will not need to use the device notifier applet or the navigation panel in the file manager to get access to a recently plugged in device.
tr: Bu modülde otomatik bağlama özelliklerini etkinleştirirseniz yenice takılmış bir aygıta erişmek için aygıt bildirici uygulamacığını veya dosya yöneticisindeki dolaşım panelini kullanmanıza gerek kalmaz.

source: At the top of the dialog you find the global settings, which can be overridden for each single device in the <guilabel>Device Overrides</guilabel> list. For a single-user desktop it is recommended to have all the check boxes above the overrides list enabled.
tr: İletişim kutusunun en üstünde, <guilabel>Aygıt Geçersiz Kılmalar</guilabel> listesindeki her bir aygıt için geçersiz kılınabilen global ayarları bulabilirsiniz. Tek kullanıcılı bir masaüstü için geçersiz kılmalar listesinin üzerindeki tüm onay kutularının etkinleştirilmesi önerilir.

source: Enable automatic mounting of removable media
tr: Çıkarılabilir ortamların otomatik bağlanmasını etkinleştir

source: When this is unchecked, no device automounting of any kind will happen, regardless of anything selected in the <guilabel>Device Overrides</guilabel> section.
tr: Bu seçilmediğinde, <guilabel>Aygıt Geçersiz Kılmalar</guilabel> bölümünde ne seçili olursa olsun hiçbir türlü bir aygıt otomatik bağlaması gerçekleşmeyecektir.

source: Only automatically mount removable media that has been manually mounted before
tr: Yalnızca daha önce elle bağlanmış çıkarılabilir ortamı kendiliğinden bağla

source: When this is checked, &plasma; will only automatically mount devices it remembers. A device is <quote>remembered</quote> if it has ever been mounted before; &eg; plugging in a &USB; media player to charge is not sufficient to <quote>remember</quote> it. If the files are not accessed, &plasma; will not automatically mount the player next time it is seen. Once they have been accessed, however, &plasma; will remember to automatically make the contents accessible to your system.
tr: Bu işaretlendiğinde, &plasma; yalnızca anımsadığı aygıtları kendiliğinden bağlar. Bir aygıt, daha önce bağlanmışsa <quote>anımsanır</quote>; &eg;, &USB; ortam oynatıcıyı şarj etmek onu <quote>anımsamak</quote> için yeterli değildir. Dosyalara erişilmezse &plasma; oynatıcı bir sonraki görüldüğünde kendiliğinden bağlamayacaktır. Ancak bunlara erişildikten sonra, &plasma; içeriği kendiliğinden sisteminiz için erişilebilir hale getirmeyi anımsar.

source: Automatically mount all removable media at login
tr: Oturum açılışında tüm çıkarılabilir ortamları kendiliğinden bağla

source: If any removable storage devices are connected to your system when you login to your desktop, &plasma; will automatically make the contents available to your system for other programs to read.
tr: Masaüstünüzde oturum açtığınızda sisteminize herhangi bir çıkarılabilir depolama aygıtı bağlıysa &plasma; diğer programların okuması için içeriği sisteminizde kendiliğinden kullanılabilir hale getirecektir.

source: Automatically mount removable media when attached
tr: Takıldığında çıkarılabilir ortamı kendiliğinden bağla

source: When this is checked, &plasma; will automatically make the contents of any storage device available to the system when it is plugged in or attached.
tr: Bu işaretlendiğinde, &plasma; herhangi bir depolama aygıtı takıldığında onun içeriğini kendiliğinden sisteme sunar.

source: Automatic mount
tr: Otomatik bağla

source: This list contains the storage devices known to &plasma;. If <guilabel>On Login</guilabel> is checked, the device will be automatically mounted even though <guilabel>Automatically mount all removable media at login</guilabel> is unchecked. The same applies for <guilabel>On Attach</guilabel>.
tr: Bu liste, &plasma; tarafından bilinen depolama aygıtlarını içerir. <guilabel>Oturum Açıldığında</guilabel> işaretliyse <guilabel>Oturum açılışında tüm çıkarılabilir ortamları kendiliğinden bağla</guilabel> işaretlenmemiş olsa bile aygıt kendiliğinden bağlanır. Aynı durum <guilabel>Takıldığında</guilabel> için de geçerlidir.

source: If <guilabel>Enable automatic mounting of removable media</guilabel> is unchecked, the overrides do not apply and no devices will be automatically mounted.
tr: <guilabel>Çıkarılabilir ortamların otomatik bağlanmasını etkinleştir</guilabel> seçili değilse geçersiz kılmalar uygulanmaz ve hiçbir aygıt kendiliğinden bağlanmaz.

source: Forget Device
tr: Aygıtı Unut

source: Clicking this button causes &plasma; to <quote>forget</quote> that the selected devices ever existed. This is only useful if <guilabel>Only automatically mount removable media that has been manually mounted before</guilabel> is checked. Once a device is forgotten and &plasma; is set to only automatically mount familiar devices, the device will not be automatically mounted.
tr: Bu düğmeye tıklamak &plasma;’nın seçili aygıtı <quote>unutmasını</quote> sağlar. Bu yalnızca <guilabel>Yalnızca daha önce elle bağlanmış çıkarılabilir ortamı kendiliğinden bağla</guilabel> seçiliyse işe yarar. Bir aygıt unutulduğunda ve &plasma; yalnızca tanınır aygıtları otomatik olarak bağlamaya ayarlıysa aygıt kendiliğinden bağlanmaz.
