Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_solid-actions.po
Languages: tr

source: Device Actions
tr: Aygıt Eylemleri

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: System Settings
tr: sistem ayarları

source: Solid
tr: Katı

source: actions
tr: eylemler

source: devices
tr: aygıtlar

source: hardware
tr: donanım

source: Actions for new devices
tr: Yeni aygıtlar için eylemler

source: Introduction
tr: Giriş

source: This module allows you to set up the actions you want to associate when you plug new devices.
tr: Bu modül, yeni aygıtlar taktığınızda ilişkilendirmek istediğiniz eylemleri ayarlamanıza olanak tanır.

source: <screeninfo>Screenshot of the Device Actions Manager</screeninfo>
tr: <screeninfo>Aygıt Eylemleri Yöneticisi’nin ekran görüntüsü</screeninfo>

source: <phrase>Screenshot of the Device Actions Manager</phrase>
tr: <phrase>Aygıt Eylemleri Yöneticisinin Ekran Görüntüsü</phrase>

source: You will see listed all of the possible actions that are available when devices are plugged in. Please note that they will only be available under certain conditions.
tr: Aygıtlar takıldığında kullanılabilecek tüm olası eylemlerin listelendiğini göreceksiniz. Lütfen bunların yalnızca belirli koşullar altında kullanılabileceğini unutmayın.

source: <guibutton>Add</guibutton> This will ask you to supply a name for your new action, then will open that action for editing. If you do not supply all the required details in that dialog, then your action will be deleted.
tr: <guibutton>Ekle</guibutton> Bu, sizden yeni eyleminiz için bir ad vermenizi isteyecek ve ardından bu eylemi düzenleme için açacaktır. Bu iletişim kutusunda gerekli tüm ayrıntıları sağlamazsanız eyleminiz silinir.

source: <guibutton>Edit</guibutton> This will allow you to change the Name, Icon, command to execute and the conditions the action must match to be shown.
tr: <guibutton>Düzenle</guibutton> Bu; adı, simgeyi, yürütülecek komutu ve eylemin gösterilmesi için eşleşmesi gereken koşulları değiştirmenize izin verir.

source: <guibutton>Discard / Cannot be deleted / Remove</guibutton> This will do different actions, depending on if it was supplied with your system or created by you. You can only discard changes to system wide actions, if there are no changes then these actions cannot be deleted. User created actions are completely removed, including all changes.
tr: <guibutton>At / Silinemez / Kaldır</guibutton> Bu, sisteminizle birlikte sağlanmış veya sizin tarafınızdan oluşturulmuş olmasına bağlı olarak farklı eylemler gerçekleştirecektir. Değişiklikleri yalnızca sistem genelindeki eylemlerde iptal edebilirsiniz, herhangi bir değişiklik yoksa bu eylemler silinemez. Kullanıcı tarafından oluşturulan eylemler, tüm değişiklikler içerilmek üzere tamamen kaldırılır.

source: Add Action
tr: Eylem Ekle

source: The <guibutton>Add</guibutton> button brings you a dialog to enter the new action name.
tr: <guibutton>Ekle</guibutton> düğmesi size yeni eylem adını girmeniz için bir iletişim kutusu getirir.

source: <screeninfo>Screenshot of the Add Action dialog</screeninfo>
tr: <screeninfo>Eylem Ekle iletişim kutusunun ekran görüntüsü</screeninfo>

source: <phrase>Screenshot of the Add Action dialog</phrase>
tr: <phrase>Eylem Ekle iletişim kutusunun ekran görüntüsü</phrase>

source: The action name should correctly describe the action. After entering a name and clicking <guibutton>OK</guibutton>, the Edit Action dialog will show to allow you to set up the action properties.
tr: Eylem adı, eylemi doğru şekilde tanımlamalıdır. Bir ad girdikten ve <guibutton>Tamam</guibutton>’a tıkladıktan sonra, eylem özelliklerini ayarlamanıza izin vermek için Eylemi Düzenle iletişim kutusu görüntülenecektir.

source: Edit Action
tr: Eylemi Düzenle

source: This dialog allows you to change the settings of the action you selected.
tr: Bu iletişim kutusu, seçtiğiniz eylemin ayarlarını değiştirmenizi sağlar.

source: <screeninfo>Screenshot of the Edit Action dialog</screeninfo>
tr: <screeninfo>Eylemi Düzenle iletişim kutusunun ekran görüntüsü</screeninfo>

source: <phrase>Screenshot of the Edit Action dialog</phrase>
tr: <phrase>Eylemi Düzenle iletişim kutusunun ekran görüntüsü</phrase>

source: This includes the icon, the action name, the action command and the various parameters. You can change the icon by clicking on it.
tr: Buna simge, eylem adı, eylem komutu ve çeşitli parametreler dahildir. Üzerine tıklayarak ikonu değiştirebilirsiniz.

source: The parameters are displayed in a tree, the top item having to be true in order for the action to be shown.
tr: Parametreler bir ağaç biçiminde görüntülenir, eylemin gösterilmesi için en üstteki ögenin doğru olması gerekir.

source: Edit parameter
tr: Parametreyi Düzenle

source: Parameter type
tr: Parametre türü

source: This controls what can be contained inside it, or what matching is performed to check if it is true.
tr: Bu, içinde nelerin bulunabileceğini veya doğru olup olmadığını denetlemek için hangi eşleştirmenin gerçekleştirileceğini denetler.

source: Property Match
tr: Özellik Eşleşmesi

source: Compares the specified property of the Device (using <guilabel>Device type</guilabel> and <guilabel>Value name</guilabel>) and using the evaluator, compares it against the text provided.
tr: Aygıtın belirtilen özelliğini (<guilabel>Aygıt türü</guilabel> ve <guilabel>Değer adı</guilabel> kullanarak) karşılaştırır ve değerlendiriciyi kullanarak sağlanan metinle karşılaştırır.

source: Content Conjunction
tr: İçerik Bağlantısı

source: All sub-properties of this must be true for it to be true itself.
tr: Bunun kendisinin doğru olması için tüm alt özelliklerinin doğru olması gerekir.

source: Content Disjunction
tr: İçerik Ayrılığı

source: Any sub-property of this may be true for it to be true itself.
tr: Bunun herhangi bir alt özelliği, kendisinin doğru olması için doğru olabilir.

source: Device interface match
tr: Aygıt Arayüzü Eşleşmesi

source: Checks to see if the Device can be classed as the selected Device type.
tr: Aygıtın seçili aygıt türü olarak sınıflandırılıp sınıflandırılamayacağını denetler.

source: Device type
tr: Aygıt türü

source: These are the possible device types supported by &plasma; on your system. They are used in both Property and Device interface matches.
tr: Bunlar, &plasma; tarafından sisteminizde desteklenen olası aygıt türleridir. Hem özellik hem de aygıt arayüzü eşleşmelerinde kullanılırlar.

source: Value name
tr: Değer adı

source: This is a list of all possible property names for the selected device type. It also provides the selection of the value evaluator (which is either <guilabel>Equals</guilabel> or <guilabel>Contains</guilabel>), and allows entry of the text to be compared with.
tr: Bu, seçili aygıt türü için olası tüm özellik adlarının bir listesidir. Ayrıca değer değerlendiricinin (<guilabel>Eşittir</guilabel> veya <guilabel>İçerir</guilabel>) seçimini sağlar ve karşılaştırılacak metnin girilmesine izin verir.

source: Reset Parameter
tr: Parametreyi Sıfırla

source: Reverts any unsaved changes you have made to this parameter.
tr: Bu parametrede yaptığınız kaydedilmemiş değişiklikleri geri alır.

source: Save Parameter changes
tr: Parametre Değişikliklerini Kaydet

source: Saves the changes you have made to the parameter.
tr: Parametrede yaptığınız değişiklikleri kaydeder.
