Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_windowspecific.po
Languages: tr

source: Window Rules
tr: Pencere Kuralları

source: <firstname>Parts of this documentation was converted from the KDE UserBase <ulink url="https://userbase.kde.org/KWin Rules">KWin Rules</ulink> page and updated by the &kde; Documentation team to Plasma 5.8.</firstname> <surname></surname>
tr: <firstname>Bu belgelendirmenin bir kısmı KDE Kullanıcı Tabanı<ulink url="https://userbase.kde.org/KWin Rules">KWin Kuralları</ulink> sayfasından dönüştürülmüş ve &kde; Belgelendirme Takımı tarafından Plasma 5.8 için uyarlanmıştır.</firstname> <surname></surname>

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Here you can customize window settings specifically only for some windows.
tr: Buradan pencere ayarlarını yalnızca belirli pencereler için özelleştirebilirsiniz.

source: window settings
tr: pencere ayarları

source: window placement
tr: pencere konumlandırması

source: window size
tr: pencere boyutu

source: Window Specific Settings: Quick Start
tr: Pencereye Özgü Ayarlar: Tez Başlangıç

source: Please note that this configuration will not take effect if you do not use &kwin; as your window manager. If you do use a different window manager, please refer to its documentation for how to customize window behavior.
tr: &plasma;’nın yerel pencere yöneticisi &kwin;’i kullanmazsanız bu modüldeki yapılandırmanın etkili olmayacağını lütfen unutmayın. Farklı bir pencere yöneticisi kullanıyorsanız lütfen pencere davranışını nasıl özelleştireceğinizle ilgili belgelere bakın.

source: Many of the settings you can configure here are those you can configure on a global basis in the <guilabel>Window Behavior</guilabel> &systemsettings; module, however some of them are even more detailed.
tr: Burada yapılandırabileceğiniz ayarların çoğu, genel olarak <guilabel>Pencere Davranışı</guilabel> &systemsettings; modülünde yapılandırabileceğiniz ayarlardır; ancak burada bazıları daha ayrıntılıdır.

source: They encompass geometry, placement, whether a window should be kept above or below others, focus stealing prevention, and translucency settings.
tr: Geometriyi, yerleşimi, bir pencerenin diğerlerinin üzerinde mi yoksa altında mı tutulması gerektiğini, odak çalmayı önlemeyi ve saydamlık ayarlarını kapsar.

source: You can access this module in two ways: from the titlebar of the application you wish to configure, or from the &systemsettings;. If you start it from within &systemsettings; you can use the <guibutton>New...</guibutton> to create a window profile, and the <guibutton>Detect Window Properties</guibutton> button on the resulting dialog to partially fill in the required information for the application you wish to configure.
tr: Bu modüle iki şekilde erişebilirsiniz: Yapılandırmak istediğiniz uygulamanın başlık çubuğundan veya &systemsettings;’ndan. &systemsettings; içinden başlatırsanız bir pencere profili oluşturmak için <guibutton>Yeni..</guibutton>’yi ve ortaya çıkan iletişim kutusundaki <guibutton>Pencere Özelliklerini Algıla</guibutton> düğmesini kullanarak yapılandırmak istediğiniz uygulama için gerekli bilgileri kısmen doldurabilirsiniz.

source: You can also at any time <guibutton>Modify...</guibutton> or <guibutton>Delete</guibutton> any stored settings profile, and reorder the list. Reordering the list using the <guibutton>Move Up</guibutton> and <guibutton>Move Down</guibutton> buttons effects on how they are applied.
tr: Ayrıca istediğiniz bir zamanda herhangi bir depolanan ayarlar profilini <guibutton>Değiştir…</guibutton> veya <guibutton>Sil</guibutton> yapabilir ve listeyi yeniden sıralayabilirsiniz. <guibutton>Yukarı Taşı</guibutton> ve <guibutton>Aşağı Taşı</guibutton> düğmelerinin nasıl uygulandıklarına etkisi olur.

source: Overview
tr: Genel Görünüm

source: &kwin; allows the end-user to define rules to alter an application's window attributes.
tr: &kwin;, kullanıcının bir uygulamanın pencere özniteliklerini değiştirmek için kurallar tanımlamasına izin verir.

source: For example, when an application is started, it can be forced to always run on <emphasis>Virtual Desktop 2</emphasis>. Or a defect in an application can be worked-around to force the window above others.
tr: Örneğin, bir uygulama başlatıldığında, her zaman <emphasis>Sanal Masaüstü 2</emphasis> üzerinde çalışmaya zorlanabilir. Veya bir uygulamadaki bir kusur, pencereyi diğerlerinin üzerinde zorlayarak çözülebilir.

source: Step-by-step <link linkend="examples">examples</link> are provided along with detailed information on using the <link linkend="kwin-rule-editor">&kwin; Rule Editor</link> to specify <link linkend="window-matching">Window Matching</link> and <link linkend="window-attributes">Window Attributes</link>.
tr: <link linkend="kwin-rule-editor">&kwin; Kural Düzenleyicisi</link>’ni kullanma ve <link linkend="window-matching">Pencere Eşleştirme</link>’yi ve <link linkend="window-attributes">Pencere Öznitelikleri</link>’ni belirtmek üzerine adım adım <link linkend="examples">örnekler</link> sağlanır.

source: Examples and Application Workaround
tr: Örnekler ve Uygulama Geçici Çözümü

source: To see what's possible, detailed <link linkend="examples">examples</link> are provided which can also be used to model your own rules.
tr: Neyin olanaklı olduğunu görmek ve kendi kurallarınızı modellemek için de kullanılabilecek ayrıntılı <link linkend="examples">örnekler</link> sağlanmıştır.

source: A special page is dedicated to address <link linkend="application-workarounds">Application Workaround</link>.
tr: <link linkend="application-workarounds">Uygulama Geçici Çözümü</link>’nü ele almak için özel bir sayfa ayrılmıştır.

source: KWin Rule Editor
tr: KWin Kural Düzenleyicisi

source: Invoking the KWin Rule Editor
tr: KWin Kural Düzenleyicisi’ni Çağırmak

source: There are several ways to invoke the &kwin; Rule Editor. Below are two:
tr: &kwin; kural düzenleyicisini çağırmanın birkaç yolu vardır. Aşağıda ikisini bulabilirsiniz:

source: Right-click on the title-bar of any window, choose <menuchoice><guimenu>More Actions</guimenu><guimenuitem>Window Manager Settings...</guimenuitem></menuchoice> and in the <guilabel>Configure</guilabel> window, select <guilabel>Window Rules</guilabel> or
tr: Herhangi bir pencerenin başlık çubuğuna sağ tıklayın ve <menuchoice><guimenu>Daha Fazla Eylem</guimenu><guimenuitem>Pencere Yöneticisi Ayarları…</guimenuitem></menuchoice> ve <guilabel>Yapılandır</guilabel> penceresinde <guilabel>Pencere Kuralları</guilabel>’nı seçin veya şu yolu izleyin:

source: <guimenu>System Settings</guimenu><guisubmenu>Window Behavior</guisubmenu><guimenuitem>Window Rules</guimenuitem>
tr: <guimenu>Sistem Ayarları</guimenu><guisubmenu>Pencere Davranışı</guisubmenu><guimenuitem>Pencere Kuralları</guimenuitem>

source: The main window is used to:
tr: Ana pencere şunun için kullanılır:

source: Affect rules with <guilabel>New...</guilabel>, <guilabel>Modify...</guilabel> and <guilabel>Delete</guilabel>
tr: Kuralları, <guilabel>Yeni…</guilabel>, <guilabel>Değiştir…</guilabel> ve <guilabel>Sil</guilabel> ile etkilemek

source: Share rules with others via <guilabel>Import</guilabel> and <guilabel>Export</guilabel>
tr: Kuralları, <guilabel>İçe Aktar</guilabel> ve <guilabel>Dışa Aktar</guilabel> ile başkalarıyla paylaşmak

source: Ensure desired <link linkend="rule-evaluation">rule evaluation</link> using <guilabel>Move Up</guilabel> and <guilabel>Move Down</guilabel>
tr: <guilabel>Yukarı Taşı</guilabel> ve <guilabel>Aşağı Taşı</guilabel> ile istenen <link linkend="rule-evaluation">kural değerlendirmesinin</link> yapıldığından emin olmak

source: Rule Evaluation
tr: Kural Değerlendirmesi

source: When an application starts (or the rules are modified), &kwin; evaluates the rules from the top of the list to the bottom. For all rules which match a window, the collective set of attributes are applied to the window, then the window is displayed.
tr: Bir uygulama başlatıldığında (veya kurallar değiştirildiğinde), &kwin; kuralları listenin başından sonuna kadar değerlendirir. Bir pencereyle eşleşen tüm kurallar için toplu öznitelikler pencereye uygulanır, ardından pencere görüntülenir.

source: Should two or more matching rules enable the same attribute, the setting in the <emphasis>first</emphasis> rule in the list is used.
tr: İki veya daha fazla eşleşen kuralın aynı özniteliği etkinleştirmesi durumunda, listedeki <emphasis>ilk</emphasis> kuralın ayarı kullanılır.

source: You can tailor children windows for the application by placing the more restrictive rules first - see the <link linkend="application-on-all-desktops-and-handle-one-child-window-uniquely">Kopete and Kopete Chat Window</link> example.
tr: Önce daha kısıtlayıcı kurallar koyarak alt pencereleri uygulama için uyarlayabilirsiniz — örnek olarak <link linkend="application-on-all-desktops-and-handle-one-child-window-uniquely">Kopete ve Kopete Sohbet Penceresi</link> verilebilir.

source: Rule Editor
tr: Kural Düzenleyicisi

source: The editor is composed of four tabs:
tr: Düzenleyici, dört sekmeden oluşur:

source: Window matching
tr: Pencere eşleştirme

source: <guilabel>Size &amp; Position</guilabel>
tr: <guilabel>Boyut ve Konum</guilabel>

source: <guilabel>Arrangement &amp; Access</guilabel>
tr: <guilabel>Düzenleme ve Erişim</guilabel>

source: <guilabel>Appearance &amp; Fixes</guilabel>
tr: <guilabel>Görünüş ve Düzeltmeler</guilabel>

source: As the name implies, <guilabel>Window matching</guilabel> is used to specify criteria to match one or more windows. The other three tabs are used to alter the attributes of the matching windows.
tr: Adından da anlaşılacağı gibi <guilabel>Pencere eşleştirme</guilabel>, bir veya daha fazla pencereyi eşleştirmek için kriter belirtmek için kullanılır. Diğer üç sekme, eşleşen pencerelerin özniteliklerini değiştirmek için kullanılır.

source: Panels can also be affected.
tr: Paneller de etkilenebilir.

source: Window Matching
tr: Pencere Eşleştirme

source: Each window rule has user specified <link linkend="window-matching">Window Matching</link> criteria. &kwin; uses the criteria to determine whether the rule is applicable for an application.
tr: Her pencere kuralı, kullanıcı tarafından belirlenen <link linkend="window-matching">Pencere Eşleştirme</link> kriterine sahiptir. &kwin; kuralın bir uygulama için geçerli olup olmadığını belirlemek için ölçütleri kullanır.

source: Window Attributes
tr: Pencere Öznitelikleri

source: Along with Window Matching criteria, each window rule has a set of <link linkend="window-attributes">Window Attributes</link>. The attributes override the corresponding application's settings and are applied before the window is displayed by &kwin;.
tr: Pencere Eşleştirme ölçütlerinin yanı sıra, her pencere kuralının bir dizi <link linkend="window-attributes">Pencere Öznitelikleri</link> vardır. Öznitelikler ilgili uygulamanın ayarlarını geçersiz kılar ve pencere &kwin; tarafından görüntülenmeden önce uygulanır.

source: The <guilabel>Window Matching</guilabel> tab is used to specify the criteria &kwin; uses to evaluate whether the rule is applicable for a given window.
tr: <guilabel>Pencere Eşleştirme</guilabel> sekmesi ,&kwin; tarafından kuralın belirli bir pencere için geçerli olup olmadığını değerlendirmek için kullanılır.

source: Zero (match any window) or more of the following may be specified:
tr: Sıfır (herhangi bir pencereyle eşleşir) veya aşağıdakilerden daha fazlası belirtilebilir:

source: <guilabel>Window class (application)</guilabel> - match the class.
tr: <guilabel>Pencere sınıfı (uygulama)</guilabel> — sınıfı eşleştirin.

source: <guilabel>Match whole window class</guilabel> - include matching the secondary class.
tr: <guilabel>Tüm pencere sınıfını eşleştir</guilabel> — ikincil sınıfı eşleştirmeyi içerir.

source: <guilabel>Window role</guilabel> - restrict the match to the function of the window (&eg; a <emphasis>main window</emphasis>, a <emphasis>chat window</emphasis>, &etc;)
tr: <guilabel>Pencere rolü</guilabel> — eşleşmeyi pencerenin işleviyle sınırlayın (&eg;, bir <emphasis>ana pencere</emphasis>, bir <emphasis>sohbet penceresi</emphasis>, &etc;)

source: <guilabel>Window types</guilabel> - restrict the match to the type of window: <guilabel>Normal Window</guilabel>, <guilabel>Dialog Window</guilabel>, &etc;
tr: <guilabel>Pencere türleri</guilabel> — eşleşmeyi pencere türüyle sınırlayın: <guilabel>Normal Pencere</guilabel>, <guilabel>İletişim Kutusu</guilabel>, &etc;

source: <guilabel>Window title</guilabel> - restrict the match to the title of the window.
tr: <guilabel>Pencere başlığı</guilabel> — eşleşmeyi pencerenin başlığıyla sınırlayın.

source: <guilabel>Machine (hostname)</guilabel> - restrict the match to the host name associated with the window.
tr: <guilabel>Makine (makine adı)</guilabel> — eşleşmeyi, pencereyle ilişkili makine adıyla kısıtlayın.

source: While it's possible to manually enter the above information, the preferred method is to use the <guilabel>Detect Window Properties</guilabel> button.
tr: Yukarıdaki bilgileri elle girmek olanaklı olsa da, tercih edilen yöntem <guilabel>Pencere Özelliklerini Algıla</guilabel> düğmesini kullanmaktır.

source: For each field, the following operators can be applied against the field value:
tr: Her alan için alan değerine karşı aşağıdaki işleçler uygulanabilir:

source: <guilabel>Unimportant</guilabel> - ignore the field.
tr: <guilabel>Önemsiz</guilabel> — alanı yok sayın.

source: Exact Match
tr: Tam Eşleşme

source: Substring Match
tr: Altdizi Eşleşmesi

source: Both <guilabel>Exact Match</guilabel> and <guilabel>Substring Match</guilabel> implement case insensitive matching. For example, <emphasis>AB</emphasis> matches the string <emphasis>AB</emphasis>, <emphasis>ab</emphasis>, <emphasis>Ab</emphasis> and <emphasis>aB</emphasis>.
tr: Hem <guilabel>Tam Eşleşme</guilabel> ve <guilabel>Altdizi Eşleşmesi</guilabel> BÜYÜK/küçük harf duyarlı eşleşmeyi uygulayabilir. Örneğin, <emphasis>AB</emphasis>, <emphasis>AB</emphasis> dizisiyle; <emphasis>ab</emphasis>, <emphasis>Ab</emphasis> ve <emphasis>aB</emphasis> ile eşleşebilir.

source: <guilabel>Regular Expression</guilabel> - Qt's regular expressions are implemented - see <ulink url="https://doc.qt.io/qt-5/qregexp.html">pattern matching using regular expressions</ulink>.
tr: <guilabel>Düzenli İfade</guilabel> — Qt’nin düzenli ifadeleri uygulanır — bkz. <ulink url="https://doc.qt.io/qt-5/qregexp.html">düzenli ifadeler kullanarak model eşleştirme</ulink>.

source: Detect Window Properties
tr: Pencere Özelliklerini Algıla

source: The <guilabel>Detect Window Properties</guilabel> function simplifies the process of entering the matching-criteria.
tr: <guilabel>Pencere Özelliklerini Algıla</guilabel> işlevi, eşleştirme kriterlerini girme sürecini basitleştirir.

source: For the application you'd like to create a rule, start the application.
tr: Kural oluşturmak istediğiniz uygulama için uygulamayı başlatın.

source: Next, in the <guilabel>Window matching</guilabel> tab, set the number of seconds of delay before the <guilabel>Detect Window Properties</guilabel> function starts. The default is zero seconds.
tr: Ardından, <guilabel>Pencere eşleştirme</guilabel> sekmesinde, <guilabel>Pencere Özelliklerini Algıla</guilabel> işlevi başlamadan önceki gecikme saniyesini ayarlayın. Öntanımlı değer sıfır saniyedir.

source: Click on <guilabel>Detect Window Properties</guilabel> and
tr: <guilabel>Pencere Özelliklerini Algıla</guilabel>’ya tıklayın ve

source: When the mouse-cursor turns to cross-hairs, place it inside the application window (not the title bar) and left-click.
tr: Fare imleci artı işaretine döndüğünde, onu uygulama penceresinin içine (başlık çubuğuna değil) yerleştirin ve sol tıklayın.

source: A new window is presented with information about the selected window. Select the desired fields:
tr: Seçilen pencere üzerine bilgi içeren yeni bir pencere sunulur. İstediğiniz alanları seçin:

source: <guilabel>Secondary class name</guilabel> - some applications have a secondary class name. This value can be used to restrict windows by this value.
tr: <guilabel>İkincil sınıf adı</guilabel> — bazı uygulamaların ikincil bir sınıf adı vardır. Bu değer, pencereleri bu değere göre kısıtlamak için kullanılabilir.

source: Window role
tr: Pencere rolü

source: <guilabel>Window type</guilabel>
tr: <guilabel>Pencere türü</guilabel>

source: Window title
tr: Pencere başlığı

source: Click the <guilabel>OK</guilabel> button to back-fill the <guilabel>Window Matching</guilabel> criteria.
tr: <guilabel>Pencere Eşleştirme</guilabel> kriterlerini yeniden doldurmak için <guilabel>Tamam</guilabel> düğmesine tıklayın.

source: By using a combination of the information, a rule can apply to an entire application (by <guilabel>Class</guilabel>) or a to a specific window <guilabel>Type</guilabel> within the <guilabel>Class</guilabel> - say a <guilabel>Toolbar</guilabel>.
tr: Bilgilerin kombinasyonunu kullanarak bir kural, tüm uygulamaya (<guilabel>Sınıf</guilabel> tarafından) veya <guilabel>Sınıf</guilabel> içindeki belirli bir pencere <guilabel>Tür</guilabel>’üne uygulanabilir; örneğin, bir <guilabel>Araç Çubuğu</guilabel>.

source: The attributes which can be set are grouped by function in three tabs:
tr: Ayarlanabilen öznitelikler, işleve göre üç sekmede gruplandırılmıştır:

source: Each attribute has a set of parameters which determines its disposition.
tr: Her özniteliğin, yerini belirleyen bir dizi parametresi vardır.

source: Parameters
tr: Parametreler

source: Each attribute, minimally, accepts one of the following parameters. Additional, attribute-specific arguments are listed within each <link linkend="attributes">attribute</link> definition.
tr: Her öznitelik en az olarak aşağıdaki parametrelerden birini kabul eder. Her bir <link linkend="attributes">öznitelik</link> tanımında ek, özniteliğe özgü bağımsız değişkenler listelenir.

source: Do Not Affect
tr: Etkileme

source: Ensure a subsequent rule, which matches the window, does not affect the attribute.
tr: Pencereyle eşleşen bir sonraki kuralın özniteliği etkilemediğinden emin olun.

source: Apply Initially
tr: Başlangıçta Uygula

source: Start the window with the attribute and allow it to be changed at run-time.
tr: Pencereyi öznitelikle başlatın ve çalışma zamanında değiştirilmesine izin verin.

source: Remember
tr: Anımsa

source: Use the attribute setting as defined in the rule and if changed at run-time, save and use the new value instead.
tr: Öznitelik ayarını kuralda tanımlandığı şekilde kullanın ve çalışma zamanında değiştirilirse bunun yerine yeni değeri kaydedin ve kullanın.

source: Force
tr: Zorla

source: The setting cannot be changed at run-time.
tr: Ayar çalışma zamanında değiştirilemez.

source: Apply Now, Force Temporarily
tr: Şimdi Uygula, Geçici Olarak Zorla

source: Apply/Force the setting once and unset the attribute.The difference between the two is at run-time, <guilabel>Apply Now</guilabel> allows the attribute to be changed and <guilabel>Force Temporarily</guilabel> prohibits it to be altered until all affected windows exit.
tr: Ayarı bir kez Uygula/Zorla ve özniteliğin ayarını kaldır. İkisi arasındaki fark çalışma zamanındadır, <guilabel>Şimdi Uygula</guilabel> özniteliğin değiştirilmesine izin verir ve <guilabel>Geçici Olarak Zorla</guilabel> bunu yasaklar etkilenen tüm pencereler çıkana kadar değiştirilmelidir.

source: For <guilabel>Apply Now</guilabel>, if the rule has no other attributes set, the rule is deleted after evaluation whereas <guilabel>Force Temporarily</guilabel>, the rule is deleted after the last affected window terminates.
tr: <guilabel>Şimdi Uygula</guilabel> için kuralın ayarlanmış başka bir özniteliği yoksa kural değerlendirmeden sonra silinir; ancak <guilabel>Geçici Olarak Zorla</guilabel> ile, etkilenen son pencere sona erdikten sonra kural silinir.

source: Attributes
tr: Öznitelikler

source: The <guilabel>Detect Window Properties</guilabel> button back-fills attribute-specific values - for more information see <link linkend="window-matching">Window Matching</link>. For example the height and width values of the <guilabel>Size</guilabel> attribute is set to the height and width of the detected window.
tr: <guilabel>Pencere Özelliklerini Algıla</guilabel> düğmesi özniteliğe özgü değerleri geri doldurur — daha fazla bilgi için <link linkend="window-matching">Pencere Eşleştirme</link> bölümüne bakın. Örneğin, <guilabel>Boyut</guilabel> özniteliğinin yükseklik ve genişlik değerleri, algılanan pencerenin yükseklik ve genişliğine ayarlanır.

source: <guilabel>Yes/No</guilabel> arguments are used to toggle on or off attributes. Leniency with grammar helps one understand how a setting will be processed. <inlinemediaobject> <imageobject> <imagedata fileref="Face-smile.png" format="PNG"/> </imageobject> </inlinemediaobject> For example, the attribute <guilabel>Skip taskbar</guilabel>, when set to <guilabel>No</guilabel> means do not skip the taskbar. In other words, show the window in the taskbar.
tr: <guilabel>Evet/Hayır</guilabel> argümanları, öznitelikleri açıp kapatmak için kullanılır. Dilbilgisi ile hoşgörü, bir ayarın nasıl işleneceğini anlamanıza yardımcı olur. <inlinemediaobject> <imageobject> <imagedata fileref="Face-smile.png" format="PNG"/> </imageobject> </inlinemediaobject> Örneğin, <guilabel>Görev çubuğunu atla</guilabel> özelliği <guilabel>Hayır</guilabel> olarak ayarlandığında, görev çubuğunu atlamayın anlamına gelir. Başka bir deyişle, pencereyi görev çubuğunda gösterin.

source: <title>Size &amp; Position</title>
tr: <title>Boyut ve Konum</title>

source: Position
tr: Konum

source: Position the window's upper left corner at the specified x,y coordinate.
tr: Pencerenin sol üst köşesini belirtilen x,y koordinatına konumlandırın.

source: &kwin;'s origin, (0,0), is the upper left of the desktop.
tr: &kwin;’in başlangıç noktası (0,0), masaüstünün sol üst köşesidir.

source: Size
tr: Boyut

source: The width and height of the window.
tr: Pencerenin genişliği ve yüksekliği.

source: Maximized horizontally, Maximized vertically
tr: Yatay/dikey olarak ekranı kaplamış

source: These attributes are used to toggle the maximum horizontal/minimum horizontal window attribute.
tr: Bu öznitelikler, en büyük yatay/en küçük yatay pencere özniteliği arasında geçiş yapmak için kullanılır.

source: Desktop, Activity, Screen
tr: Masaüstü, Etkinlik, Ekran

source: Place the window on the specified <emphasis>(Virtual) Desktop</emphasis>, <emphasis>Activity</emphasis> or <emphasis>Screen</emphasis>. Use <guilabel>All Desktops</guilabel> to place the window on all <emphasis>Virtual Desktops</emphasis>.
tr: Pencereyi belirtilen <emphasis>(Sanal) Masaüstü</emphasis>, <emphasis>Etkinlik</emphasis> veya <emphasis>Ekran</emphasis> üzerine yerleştirin. Pencereyi tüm <emphasis>Sanal Masaüstlerine</emphasis> yerleştirmek için <guilabel>Tüm Masaüstleri</guilabel>’ni kullanın.

source: Fullscreen, Minimized, Shaded
tr: Tam ekran, Simge durumuna küçültülmüş, Panjuru kapatılmış

source: Toggle the Fullscreen, Minimize and Shading window attribute. For example, a window can be started Minimized or if it is started Minimized, it can be forced to not.
tr: Tam Ekran, Simge Durumuna Küçült ve Panjuru Kapat pencere özniteliğini değiştirin. Örneğin, bir pencere küçültülmüş olarak başlatılabilir veya küçültülmüş olarak başlatılırsa açılmamaya zorlanabilir.
