Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_joystick.po
Languages: tr

source: Game Controller
tr: Oyun Kumandası

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: System Settings
tr: sistem ayarları

source: joystick
tr: oyun çubuğu

source: controller
tr: kumanda

source: gamepad
tr: oyun kolu

source: calibrate
tr: kalibre et

source: Calibrate Game Controller
tr: Oyun Kumandasını Kalibre Et

source: This module provides an interface to calibrate your game controller as well as see which functions on your game controller are mapped to which logical button or axis.
tr: Bu modül, oyun kumandanızı kalibre etmenin yanı sıra oyun kumandanızdaki hangi işlevlerin hangi mantıksal düğme veya eksenle eşlemlendiğini görmeniz için bir arayüz sağlar.

source: Here's a screenshot of the game controller module
tr: İşte oyun kumandası modülünün bir ekran görüntüsü

source: The game controller module
tr: Oyun kumandası modülü

source: Device
tr: Aygıt

source: Here you can see the logical location of the device. If you have more than one game controller, you can also select which one to configure.
tr: Burada aygıtın mantıksal konumunu görebilirsiniz. Birden fazla oyun kumandanız varsa hangisini yapılandıracağınızı da seçebilirsiniz.

source: If no game controller is automatically found on your computer and you know that there is one attached, you can enter the correct device file here.
tr: Bilgisayarınızda kendiliğinden oyun kumandası bulunmazsa ve bağlı olduğunu biliyorsanız doğru aygıt dosyasını buraya girebilirsiniz.

source: Position
tr: Konum

source: The plotted location of the X and Y axes of the game controller's joystick. Enable <guibutton>Show trace</guibutton> to plot the path of the joystick from one point to another.
tr: Oyun kumandanızın çubuğunun X ve Y eksenlerinin çizilen konumu. Oyun çubuğunun yolunu bir noktadan diğerine çizmek için <guibutton>İzi göster</guibutton>’i etkinleştirin.

source: If the joystick cannot reach every point on this graph, or if it does not center correctly, you need to calibrate your device.
tr: Oyun çubuğu bu grafiğin her noktasına ulaşamıyorsa veya doğru merkezlemiyorsa aygıtınızı kalibre etmeniz gerekir.

source: Buttons
tr: Düğmeler

source: A place to see the pressed state of buttons on your game controller and if the buttons are mapped correctly. When a button is pressed, <guilabel>PRESSED</guilabel> will appear next to the logical number (as the computer sees it) of the button which was pressed.
tr: Oyun kumandanızdaki düğmelerin basılı durumunu ve düğmelerin doğru şekilde eşlenip eşlemlenmediğini görebileceğiniz bir yer. Bir düğmeye basıldığında, basılan düğmenin mantıksal numarasının (bilgisayarın gördüğü şekliyle) yanında <guilabel>BASILDI</guilabel> görünür.

source: Axes
tr: Eksenler

source: This displays the numerical values of the axis positions. 0 is centered and the maximum and minimum values depend on the game controller and the particular axis.
tr: Bu, eksen konumlarının sayısal değerlerini görüntüler. 0 ortadır ve en yüksek ve en düşük değerler oyun kumandasına ve ilgili eksene bağlıdır.

source: Calibrate
tr: Kalibre Et

source: Clicking on <guibutton>Calibrate</guibutton> will open a dialog to calibrate every axis on your joysticks.
tr: <guibutton>Kalibre Et</guibutton>’e tıklamak, oyun çubuklarınızdaki her bir ekseni kalibre etmek için bir iletişim kutusu açar.

source: <screeninfo>Calibrating your game controller</screeninfo>
tr: <screeninfo>Oyun kumandanızı kalibre etmek</screeninfo>

source: <phrase>Calibrating your game controller</phrase>
tr: <phrase>Oyun kumandanızı kalibre etmek</phrase>

source: Each axis will have to be moved to the minimum position, then the center, and finally the maximum position. A meter in the bottom left corner of the dialog will help determine which way increases and which way decreases the values.
tr: Her eksenin en düşük konuma, ardından merkeze ve son olarak da en yüksek konuma hareket ettirilmesi gerekecektir. İletişim kutusunun sol alt köşesindeki bir ölçü, değerlerin hangi yönde arttığını ve hangi yönde azaldığını belirlemeye yardımcı olur.
