Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_notifications.po
Languages: tr

source: System Notification Settings
tr: Sistem Bildirim Ayarları

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Systemsettings
tr: sistem ayarları

source: system notification
tr: sistem bildirimi

source: notification
tr: bildirim

source: &plasma;, like all applications, needs to inform the user when a problem occurs, a task is completed, or something has happened. &plasma; uses a set of <quote>System Notifications</quote> to keep the user informed on what is happening.
tr: Tüm uygulamalar gibi &plasma; da bir sorun oluştuğunda, bir görev tamamlandığında veya başka bir şey olduğunda kullanıcıya bildirmesi gerekir. &plasma;, neler olup bittiği hakkında kullanıcıyı bilgilendirmek için bir <quote>Sistem Bildirimleri</quote> kümesi kullanır.

source: Using this module, you can determine what &plasma; does to communicate each event.
tr: Bu modülü kullanarak, &plasma;’nın her bir olay için nasıl iletişim kuracağını belirleyebilirsiniz.

source: Notification Settings
tr: Bildirim Ayarları

source: Do Not Disturb mode
tr: Rahatsız Etmeyin Kipi

source: This mode disables all visual and most audible notifications to let you focus on your current task. Settings in this section let you configure under which circumstances &plasma; automatically enables do not disturb mode.
tr: Bu kip, geçerli görevinize odaklanmanızı sağlamak için tüm görsel ve çoğu sesli bildirimleri devre dışı bırakır. Bu bölümdeki ayarlar, &plasma;’nın hangi durumlarda kendiliğinden rahatsız etmeyin kipini etkinleştireceğini belirlemenize izin verir.

source: Enable when screens are mirrored
tr: Ekranlar yansıtıldığında

source: Automatically enable do not disturb mode when you mirror your screens, for example during a presentation.
tr: Örneğin bir sunum sırasında ekranlarınızı yansıttığınızda, rahatsız etmeyin kipini kendiliğinden etkinleştirin.

source: Enable while screen sharing
tr: Ekran paylaşımı sırasında

source: Automatically enable do not disturb mode when you share your screens, for example during an online lecture.
tr: Örneğin bir çevrimiçi ders sırasında ekranınızı paylaştığınızda, rahatsız etmeyin kipini kendiliğinden etkinleştirin.

source: Enable while a fullscreen application is focused
tr: Bir tam ekran uygulama odaktayken etkinleştir

source: Automatically enable do not disturb mode while you are using a fullscreen application, for example watching a video.
tr: Tam ekran bir uygulama kullanırken Rahatsız Etmeyin kipini kendiliğinden etkinleştirin; örneğin bir video izlerken.

source: Show critical notifications
tr: Kritik bildirimleri göster

source: Whether to show critical notifications, such as your battery is almost empty, to show even when in do not disturb mode.
tr: Pilinizin bitmek üzere olması gibi kritik bildirimlerin rahatsız etmeyin kipindeyken bile gösterilip gösterilmeyeceği.

source: Toggle with:
tr: Şununla aç/kapat:

source: A global shortcut you can press to enable and disable do not disturb mode anytime.
tr: Rahatsız etmeyin kipini istediğiniz zaman etkinleştirmek ve devre dışı bırakmak için kullanabileceğiniz global bir kısayol.

source: Filters
tr: Süzgeçler

source: Critical notifications: <guiicon>Always keep on top</guiicon>
tr: Kritik bildirimler: <guiicon>Her zaman üstte</guiicon>

source: Keep critical notifications, such as your battery is almost empty, always on top. This ensures they will also be visible while watching a fullscreen video or giving a presentation.
tr: Pilinizin bitmek üzere olması gibi kritik bildirimleri her zaman üstte tutun. Bu, tam ekran video izlerken veya sunum yaparken de görünür olmalarını sağlar.

source: Normal notifications: <guiicon>Always keep on top</guiicon>
tr: Normal bildirimler: <guiicon>Her zaman üstte</guiicon>

source: Keep normal notifications, such as messages, always on top. This ensures they will also be visible while watching a fullscreen video or giving a presentation.
tr: İletiler gibi normal bildirimleri her zaman üstte tutun. Bu, tam ekran video izlerken veya sunum yaparken de görünür olmalarını sağlar.

source: Low priority notifications: <guiicon>Show popup</guiicon> and <guiicon>Show in history</guiicon>
tr: Düşük öncelikli bildirimler: <guiicon>Açılır pencere göster</guiicon> ve <guiicon>Geçmişte göster</guiicon>

source: Whether low priority notifications, such as track changes in your media player, will be shown as popups or in the history, respectively.
tr: Ortam oynatıcınızdaki değişiklikleri izlemek gibi düşük öncelikli bildirimlerin sırasıyla açılır pencere olarak mı yoksa geçmişte mi gösterileceği.

source: Behavior
tr: Davranış

source: Popup: <guiicon>Show near notification icon</guiicon>
tr: Açılır pencere: <guiicon>Bildirim simgesi yakınında</guiicon>

source: Show notification popups close to where your notification icon is located in your panel.
tr: Panelinizde bildirim simgenizin bulunduğu yere yakın bildirim açılır pencereleri gösterin.

source: Custom…
tr: Özel…

source: Lets you choose a fixed screen corner where notification popups will be positioned.
tr: Bildirim açılır pencerelerinin konumlandırılacağı sabit bir ekran köşesi seçmenizi sağlar.

source: Hide after:
tr: Şundan sonra gizle:

source: After how many seconds the notification popup will automatically disappear. You can choose anywhere between 1 and 120 seconds.
tr: Bildirim açılır penceresi kaç saniye sonra kendiliğinden kaybolur. 1–120 saniye arasında herhangi bir seçim yapabilirsiniz.

source: Application Progress and Badges
tr: Uygulama İlerlemesi ve Rozetler

source: Application progress
tr: Uygulama ilerlemesi

source: Options in this section control how application progress, such as copying or downloading a file, is presented.
tr: Bu bölümdeki seçenekler, bir dosyanın kopyalanması veya indirilmesi gibi uygulama ilerlemesinin nasıl sunulacağını denetler.

source: Show in task manager
tr: Görev yöneticisinde göster

source: Colorize the window in the panel based on the progress.
tr: İlerlemeye göre paneldeki pencereyi renklendirin.

source: Show in notifications
tr: Bildirimlerde göster

source: Show a notification popup during the progress.
tr: İlerleme sırasında bir bildirim açılır penceresi gösterin.

source: Keep popup open during progress
tr: İlerleme sırasında açılır pencereyi açık tut

source: Whether the popup should remain visible for the entire duration of the progress or automatically hide. It will always be shown again when the task finishes or fails.
tr: Açılır pencerenin tüm ilerleme süresi boyunca görünür kalması mı yoksa kendiliğinden gizlenmesi mi gerektiği. Görev bittiğinde veya başarısız olduğunda her zaman yeniden gösterilecektir.

source: Notification badges
tr: Bildirim rozetleri

source: Let applications show badges, such as an unread message count, in the panel.
tr: Uygulamaların panelde okunmayan ileti sayısı gibi rozetleri göstermesine izin verin.

source: Application Settings
tr: Uygulama Ayarları

source: Clicking the <guilabel>Configure...</guilabel> button at the end of the list opens the application settings page which lets you configure notification behavior on a per-application and per-service basis.
tr: Listenin sonundaki <guilabel>Yapılandır…</guilabel> düğmesine tıklamak, uygulama ve hizmet bazında bildirim davranışını yapılandırmanıza izin veren uygulama ayarları sayfasını açar.

source: Use the sidebar on the left to choose an entry from the <guilabel>Applications</guilabel> or <guilabel>System Services</guilabel> category.
tr: <guilabel>Uygulamalar</guilabel> veya <guilabel>Sistem Hizmetleri</guilabel> kategorisinden bir giriş seçmek için soldaki kenar çubuğunu kullanın.

source: General warning popups as well as startup and shutdown sounds are located under the <guilabel>Plasma Workspace</guilabel> service.
tr: Genel uyarı açılır pencerelerinin yanı sıra başlatma ve kapatma sesleri <guilabel>Plasma Çalışma Alanı</guilabel> hizmetinin altında bulunur.

source: Applications that do not provide proper identification, such as shell scripts, can be configured using the <guilabel>Other Applications</guilabel> entry.
tr: Kabuk betikleri gibi uygun tanımlama sağlamayan uygulamalar, <guilabel>Diğer Uygulamalar</guilabel> girişi kullanılarak yapılandırılabilir.

source: Show popups
tr: Açılır pencereleri göster

source: Whether this application may show popup notifications.
tr: Bu uygulamanın açılır bildirimler gösterip gösteremeyeceği.

source: Show in do not disturb mode
tr: Rahatsız Etmeyin kipinde göster

source: Whether this application may show popup notifications even when in do not disturb mode.
tr: Bu uygulamanın, rahatsız etmeyin kipindeyken bile açılır pencere bildirimleri gösterip gösteremeyeceği.

source: Show in history
tr: Geçmişte göster

source: Whether this application's notifications will be kept in the notification history.
tr: Bu uygulamanın bildirimlerinin bildirim geçmişinde tutulup tutulmayacağı.

source: Show notification badges
tr: Bildirim rozetlerini göster

source: Whether this application may show badges, such as an unread message count, in the panel.
tr: Bu uygulamanın panelde okunmayan ileti sayısı gibi rozetler gösterip gösteremeyeceği.

source: Configure Events...
tr: Olayları Yapılandır…

source: For &kde; applications you can also configure each notification individually.
tr: &kde; uygulamaları için ayrıca her bildirimi ayrı ayrı yapılandırabilirsiniz.
