Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kcontrol_kcmaccess.po
Languages: tr

source: Accessibility
tr: Erişilebilirlik

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Systemsettings
tr: sistem ayarları

source: accessibility
tr: erişilebilirlik

source: keys
tr: düğmeler

source: bell
tr: zil

source: Introduction
tr: Giriş

source: This module is designed to help users who have difficulty hearing audible cues, or who have difficulty using a keyboard.
tr: Bu modül, işitsel ipuçlarını duymakta güçlük çeken veya klavye kullanmakta güçlük çeken kullanıcılara yardımcı olmak için tasarlanmıştır.

source: The module is divided into six tabs: <link linkend="access-bell"><guilabel>Bell</guilabel></link>, <link linkend="access-modifier-keys"><guilabel>Modifier keys</guilabel></link>, <link linkend="access-keyboard-filters"><guilabel>Keyboard Filters</guilabel></link>, <link linkend="access-activation-gestures"><guilabel>Activation Gestures</guilabel></link>, <link linkend="mouse-navigation"><guilabel>Mouse Navigation</guilabel></link>, and <link linkend="access-screenreader"><guilabel>Screen Reader</guilabel></link>.
tr: Modül, altı sekmeye bölünmüştür: <link linkend="access-bell"><guilabel>Zil</guilabel></link>, <link linkend="access-modifier-keys"><guilabel>Niteleyici Düğmeler</guilabel></link>, <link linkend="access-keyboard-filters"><guilabel>Klavye Süzgeçleri</guilabel></link>, <link linkend="access-activation-gestures"><guilabel>Etkinleştirme Hareketleri</guilabel></link>, <link linkend="mouse-navigation"><guilabel>Fare Dolaşımı</guilabel></link>, ve <link linkend="access-screenreader"><guilabel>Ekran Okuyucusu</guilabel></link>.

source: Bell
tr: Zil

source: This panel is divided into an <guilabel>Audible Bell</guilabel> section and a <guilabel>Visible Bell</guilabel> section.
tr: Bu panel, bir <guilabel>Sesli Zil</guilabel> ve <guilabel>Görsel Zil</guilabel> bölümlerine ayrılmıştır.

source: The top check box labeled <guilabel>Use System Bell</guilabel>, determines whether the normal System bell rings. If this option is disabled, the System bell will be silenced.
tr: Üstteki <guilabel>Sistem Zilini Kullan</guilabel> etiketli onay kutusu, normal sistem zilinin çalıp çalmayacağını belirler. Bu seçenek devre dışı bırakılırsa sistem zili susacaktır.

source: The next check box down can be used to play a different sound whenever the system bell is triggered. To activate, place a mark in the check box labeled <guilabel>Use customized bell</guilabel>, and enter the complete pathname to the sound file in the text box labeled <guilabel>Sound to play</guilabel>. If you want, you can select the <guibutton>Browse</guibutton> button to navigate through your filesystem to find the exact file.
tr: Bir sonraki onay kutusu, sistem zili her tetiklendiğinde farklı bir ses çalmak için kullanılabilir. Etkinleştirmek için <guilabel>Özelleştirilmiş zil kullan</guilabel> etiketli onay kutusunu işaretleyin ve <guilabel>Çalınacak ses</guilabel> etiketli metin kutusuna ses dosyasının tam yol adını girin. İsterseniz tam dosyayı bulmak üzere dosya sisteminizde gezinmek için <guibutton>Göz At</guibutton> düğmesini seçebilirsiniz.

source: For those users who have difficulty hearing the System bell, or those users who have a silent computer, &kde; offers the <emphasis>visual bell</emphasis>. This provides a visual signal (inverting the screen or flashing a color across it) when the system bell would normally sound.
tr: Sistem zilini duymakta güçlük çeken veya sessiz bir bilgisayarı olan kullanıcılar için &kde;, <emphasis>görsel zili</emphasis> sunar. Bu, sistem zili normalde çaldığında görsel bir sinyal (ekran renklerini ters çevirerek veya üzerinde bir renk yanıp söner) sağlar.

source: To use the visual bell, first place a mark in the check box labeled <guilabel>Use visual bell</guilabel>.
tr: Görsel zili kullanmak için önce <guilabel>Görsel zili kullan</guilabel> etiketli onay kutusunu işaretleyin.

source: You can then select between <guilabel>Invert screen</guilabel>, or <guilabel>Flash screen</guilabel>. If you select <guilabel>Invert screen</guilabel>, all colors on the screen will be reversed. If you choose <guilabel>Flash screen</guilabel>, you can choose the color by clicking the button to the right of the <guilabel>Flash screen</guilabel> selection.
tr: Daha sonra <guilabel>Ekranı tersine çevir</guilabel> veya <guilabel>Flaş</guilabel> arasında seçim yapabilirsiniz. <guilabel>Ekranı tersine çevir</guilabel>’i seçerseniz ekrandaki tüm renkler tersine çevrilir. <guilabel>Flaş</guilabel>’ı seçerseniz <guilabel>Flaş</guilabel> seçiminin sağındaki düğmeye tıklayarak rengi seçebilirsiniz.

source: The spin box can be used to adjust the duration of the visible bell. The default value is 500 msec, or half a second.
tr: Döndürme kutusu, görsel zilin süresini ayarlamak için kullanılabilir. Öntanımlı değer 500 msn veya yarım saniyedir.

source: Modifier keys
tr: Niteleyici Düğmeler

source: There are the two sections <guilabel>Sticky Keys</guilabel> and <guilabel>Locking Keys</guilabel> to this panel.
tr: Bu panelde <guilabel>Yapışkan Düğmeler</guilabel> ve <guilabel>Kilitleme Düğmeleri</guilabel> olmak üzere iki bölüm vardır.

source: Use Sticky Keys
tr: Yapışkan Düğmeleri Kullan

source: If this option is enabled, you can press and release the &Shift;, &Alt; or &Ctrl; keys, and then press another key to get a key combo (example: <keycombo action="simul">&Ctrl;&Alt;&Del;</keycombo> could be done with &Ctrl;, then &Alt; and then &Del;).
tr: Bu seçenek etkinleştirilirse &Shift;, &Alt; veya &Ctrl; düğmelerine basın ve ardından bir düğme kombinasyonu elde etmek için başka bir düğmeye basın (örnek: <keycombo action="simul">&Ctrl;&Alt;&Del;</keycombo> &Ctrl;, ardından &Alt; ve ardından &Del; ile yapılabilir).

source: Also in this section is a check box labeled <guilabel>Lock Sticky Keys</guilabel>. If this check box is enabled, the &Alt;, &Ctrl; and &Shift; keys stay <quote>selected</quote> until you <quote>de-selected</quote> them.
tr: Ayrıca bu bölümde <guilabel>Yapışkan Düğmeleri Kilitle</guilabel> etiketli bir onay kutusu bulunur. Bu onay kutusu etkinleştirilirse &Alt;, &Ctrl; ve &Shift; düğmeler, siz onların <quote>seçimini kaldırana</quote> kadar <quote>seçili</quote> kalır.

source: As an example:
tr: Örnek olarak:

source: With <guilabel>Lock Sticky Keys</guilabel> disabled:
tr: <guilabel>Yapışkan Düğmeleri Kilitle</guilabel> devre dışıyken:

source: If you press the &Shift; key then press the <keycap>F</keycap> key, the computer interprets this as <keycombo action="simul">&Shift;<keycap>F</keycap></keycombo>. Now if you type a <keycap>P</keycap>, the computer interprets this as the letter p (no shift).
tr: &Shift; düğmesine, ardından <keycap>F</keycap> düğmesine basarsanız bilgisayar bunu <keycombo action="simul">&Shift;<keycap>F</keycap></keycombo> olarak yorumlar. Şimdi bir <keycap>P</keycap> yazarsanız bilgisayar bunu p harfi (küçük) olarak yorumlar.

source: With <guilabel>Lock Sticky Keys</guilabel> enabled:
tr: <guilabel>Yapışkan Düğmeleri Kilitle</guilabel> etkinken:

source: If you press the &Shift; key <emphasis>twice</emphasis> then press the <keycap>F</keycap> key, the computer interprets this as <keycombo action="simul">&Shift;<keycap>F</keycap></keycombo>. Now if you type a <keycap>P</keycap>, the computer interprets this as the letter P (<keycombo action="simul">&Shift;<keycap>P</keycap></keycombo>). To de-select the &Shift; key, press it again.
tr: &Shift; düğmesine <emphasis>iki kez</emphasis>, ardından <keycap>F</keycap> düğmesine basarsanız bilgisayar bunu <keycombo action="simul">&Shift;<keycap>F</keycap></keycombo> olarak yorumlar. Şimdi bir <keycap>P</keycap> yazarsanız bilgisayar bunu P harfi olarak yorumlar (<keycombo action="simul">&Shift;<keycap>P</keycap></keycombo>). Seçimi kaldırmak için &Shift; düğmesine yeniden basın.

source: Keyboard Filters
tr: Klavye Süzgeçleri

source: There are two sections to this panel.
tr: Bu panelde iki bölüm vardır.

source: Use slow keys
tr: Yavaş düğmeleri kullan

source: If this option is enabled, you must hold the key down for a specified length of time (adjustable with the spin box) before the keystroke will be accepted. This helps prevent accidental key strokes.
tr: Bu seçenek etkinleştirilirse düğme vuruşu kabul edilmeden önce düğmeyi belirli bir süre basılı tutmalısınız (döndürme kutusuyla ayarlanabilir). Bu, yanlışlıkla düğme vuruşlarını önlemeye yardımcı olur.

source: Use bounce keys
tr: Sıçrama düğmelerini kullan

source: If this option is enabled, you must wait for a specified length of time (configurable with the spin box) before the next key press can be accepted. This prevents accidental multiple key strokes.
tr: Bu seçenek etkinleştirilirse bir sonraki düğme basımının kabul edilebilmesi için belirli bir süre (döndürme kutusuyla yapılandırılabilir) beklemeniz gerekir. Bu, yanlışlıkla birden fazla düğme vuruşunu önler.

source: Activation Gestures
tr: Etkinleştirme Hareketleri

source: <guilabel>Activation Gestures</guilabel> with these options:
tr: <guilabel>Etkinleştirme Hareketleri</guilabel>’nde şu seçenekler vardır:

source: Use gestures for activating sticky keys and slow keys
tr: Yapışkan ve yavaş düğmeleri etkinleştirmek için hareketleri kullan

source: Here you can activate keyboard gestures that turn on the following features:
tr: Buradan, aşağıdaki özellikleri açan klavye hareketlerini etkinleştirebilirsiniz:

source: Mouse Keys: Press &Shift;+NumLock
tr: Fare düğmeleri: &Shift;+Sayı Kilidi düğmelerine bas

source: Sticky keys: Press &Shift; key 5 consecutive times
tr: Yapışkan düğmeler: &Shift; düğmesine 5 kez ard arda bas

source: Slow keys: Hold down &Shift; for 8 seconds
tr: Yavaş düğmeler: &Shift;düğmesini 8 saniye boyunca basılı tut

source: Turn sticky keys and slow keys off after a certain period of inactivity
tr: Belirli bir süre etkinlik olmaması durumunda yapışkan ve yavaş düğmeleri kapatır

source: <guilabel>Notification</guilabel> with these options:
tr: <guilabel>Bildirim</guilabel>’de şu seçenekler vardır:

source: Use the system bell whenever a gesture is used to turn an accessibility feature on or off
tr: Bir erişilebilirlik özelliğini açmak veya kapatmak için bir hareket kullanıldığında sistem zilini kullan

source: Show a confirmation dialog whenever a keyboard accessibility feature is turned on or off
tr: Bir klavye erişilebilirlik özelliği her açıldığında veya kapatıldığında bir onay iletişim kutusu göster

source: If this option is checked, &kde; will show a confirmation dialog whenever a keyboard accessibility feature is turned on or off.
tr: Bu seçenek işaretliyse &kde;, bir klavye erişilebilirlik özelliği her açıldığında veya kapatıldığında bir onay iletişim kutusu gösterecektir.

source: Ensure you know what you are doing if you uncheck it, as the keyboard accessibility settings will then always be applied without confirmation.
tr: İşareti kaldırırsanız ne yaptığınızı bildiğinizden emin olun, çünkü klavye erişilebilirlik ayarları her zaman onaylanmadan uygulanacaktır.

source: Use &kde;'s system notification mechanism whenever a keyboard accessibility feature is turned on or off
tr: Bir klavye erişilebilirlik özelliği her açıldığında veya kapatıldığında &kde;’nin sistem bildirim mekanizmasını kullan

source: Click the <guibutton>Configure Notifications</guibutton> button to open a dialog which allows you to edit the notifications for status changes of all keys.
tr: Tüm düğmelerin durum değişiklikleri için bildirimleri düzenlemenizi sağlayan bir iletişim kutusu açmak için <guibutton>Bildirimleri Yapılandır</guibutton> düğmesine tıklayın.

source: Mouse Navigation
tr: Fare Dolaşımı

source: This tab allows you to configure the keyboard number pad keys as a mouse-type device. This may be useful when you are working on a device without another pointing device, or where you have no other use for the number pad.
tr: Bu sekme, klavye sayısal düğme takımını fare gibi bir aygıt olarak yapılandırmanıza olanak tanır. Bu, başka bir işaretleme aygıtı olmayan bir aygıt üzerinde çalışırken veya sayısal düğme takımını başka şekilde kullanmadığınız durumlarda yararlı olabilir.

source: Move pointer with keyboard (using the num pad)
tr: İmleci hareket ettirmek için sayısal düğme takımını kullan

source: To enable keyboard mouse mode, you need to select the check box labeled <guilabel>Move pointer with keyboard (using the num pad)</guilabel>. When you do this, the other settings will become enabled, and you can customize the keyboard pointer behavior further, if required.
tr: Klavye fare kipini etkinleştirmek için <guilabel>İmleci hareket ettirmek için sayısal düğme takımını kullan</guilabel> etiketli onay kutusunu seçmeniz gerekir. Bunu yaptığınızda, diğer ayarlar etkinleştirilir ve gerekirse klavye imleci davranışını daha da özelleştirebilirsiniz.

source: The various keys on the number pad move in the direction you would expect. Note that you can move diagonally as well as up, down, left and right. The <keycap>5</keycap> key emulates a click to a pointer button, typically &LMB;. You change which button is emulated by using the <keycap>/</keycap> key (which makes it &LMB;), <keycap>*</keycap> key (which makes it &MMB;) and <keycap>-</keycap> (which makes it &RMB;). Using the <keycap>+</keycap> emulates a double click to the selected pointer button. You can use the <keycap>0</keycap> key to emulate holding down the selected pointer button (for easy dragging), and then use the <keycap>.</keycap> to emulate releasing the selected pointer button.
tr: Sayısal düğme takımındaki çeşitli düğmeler, beklediğiniz yönde hareket eder. Çapraz olarak ve ayrıca yukarı, aşağı, sola ve sağa hareket edebileceğinizi unutmayın. <keycap>5</keycap> düğmesi, genellikle &LMB; ile yapılan tıklamayı öykünür. <keycap>/</keycap> düğmesini (&LMB; yapar), <keycap>*</keycap> düğmesini (&MMB; yapar) ve <keycap>-</keycap> düğmesini kullanarak hangi düğmeyi öyküneceğini değiştirirsiniz (bu onu &RMB; yapar). <keycap>+</keycap> düğmesinin kullanılması, seçili işaretçi düğmesine çift tıklamayı öykünür. Seçili işaretçi düğmesini basılı tutmayı (kolay sürükleme için) öykünmek için <keycap>0</keycap> düğmesini kullanabilir ve ardından seçilen işaretçi düğmesini bırakarak öykünmek için <keycap>.</keycap> düğmesini kullanabilirsiniz.

source: Acceleration delay
tr: İvmelendirme gecikmesi

source: This is the time (in milliseconds) between the initial key press and the first repeated motion event for mouse key acceleration.
tr: Bu, düğmeye ilk basış ile fare düğmesi ivmelendirmesi için ilk yinelenen hareket olayı arasındaki süredir (milisaniye olarak).

source: Repeat interval
tr: Yineleme aralığı

source: This is the time in milliseconds between repeated motion events for mouse key acceleration.
tr: Bu, fare düğmesi ivmelendirmesi için yinelenen hareket olayları arasındaki milisaniye türünden süredir.

source: Acceleration time
tr: İvmelendirme süresi

source: This is the time in milliseconds before the pointer reaches a maximum speed for mouse key acceleration.
tr: Bu, işaretçinin fare düğmesi ivmelendirmesi için en yüksek hıza ulaşmasından önceki milisaniye türünden süredir.

source: Maximum speed
tr: En yüksek hız

source: This is the maximum speed in pixels per second the pointer can reach for mouse key acceleration.
tr: Bu, işaretçinin fare düğmesi ivmelendirmesi için ulaşabileceği piksel/saniye türünden en yüksek hızdır.

source: Pointer acceleration
tr: İşaretçi ivmelendirmesi

source: This is the amount of acceleration to apply to mouse key acceleration.
tr: Bu, fare düğmesi ivmelendirmesine uygulanacak ivme miktarıdır.

source: Screen Reader
tr: Ekran Okuyucusu

source: Install a screen reader application like <ulink url="https://en.wikipedia.org/wiki/Orca_(assistive_technology)">Orca</ulink> together with <application>speech-dispatcher</application>.
tr: <ulink url="https://en.wikipedia.org/wiki/Orca_(assistive_technology)">Orca</ulink> gibi bir ekran okuyucu uygulamayı, <application>konuşma dağıtıcısı</application> ile birlikte kurun.

source: Test that sound from speech dispatcher works using the command <command>spd-say hello</command> in a terminal.
tr: Bir uçbirimde <command>spd-say esenlikler</command> komutunu kullanarak konuşma dağıtım programından gelen sesin çalıştığını sınayın.

source: In addition you need a text to speech synthesizer like &eg; <application>espeak</application>.
tr: Ek olarak bir metinden konuşma sentezleyici uygulamaya gereksiniminiz var; &eg;, <application>espeak</application>.

source: Enable the screen reader in the checkbox, logout and restart your desktop session.
tr: Onay kutusundan ekran okuyucuyu etkinleştirin, oturumu kapatın ve yeniden açın.

source: For &plasma; itself, make sure to use the traditional <guilabel>Application Menu</guilabel>, and check that this menu has a keyboard shortcut associated (<keycombo action="simul">&Alt;<keycap>F1</keycap></keycombo>). When pressing this shortcut, the menu should open and be read when navigating the menu with the arrow keys.
tr: &plasma; için geleneksel <guilabel>Uygulama Menüsü</guilabel>’nü kullandığınızdan ve bu menüyle bir klavye kısayolunun ilişkili olduğundan emin olun (<keycombo action="simul">&Alt;<keycap>F1</keycap></keycombo>). Bu kısayola basıldığında menü açılmalı ve menüde ok düğmeleriyle dolaşırken etiketler okunmalıdır.
