Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kded6_man-kded6.8.po
Languages: tr

source: kded6 User's Manual
tr: kded6 Kullanıcı Kılavuzu

source: Maintainer
tr: Bakımcı

source: Original author
tr: Özgün yazar

source: &kde; daemon - triggers Sycoca database updates when needed.
tr: &kde; ardalan süreci, gerektiğinde Sycoca veritabanını günceller.

source: Synopsis
tr: Özet

source: Description
tr: Açıklama

source: <command>kded6</command> consolidates several small services in one process. These are mostly &DBus; services provided by KDED modules, but it also manages sycoca (a binary cache of servicetypes, &MIME; types and services used by KService) and KConfig update scripts as needed.
tr: <command>kded6</command>, tek süreçte birden çok küçük hizmeti birleştirir. Bunlar çoğunlukla KDED modülleri tarafından sağlanan &DBus; hizmetleridir; ancak gerekirse sycoca (hizmet türleri, &MIME; türleri ve KService tarafından kullanılan hizmetlerin ikili önbelleği) ve KConfig güncelleme betiklerini de yönetir.

source: For sycoca, it monitors the directories containing .desktop files. When a file is added/removed, it waits 5 seconds (in case of a series of updates), and then launches <command>kbuildsycoca6</command> to update the sycoca.
tr: Sycoca için .desktop dosyalarını içeren dizinleri izler. Bir dosya eklendiğinde veya kaldırıldığında 5 saniye kadar bekler (bir güncelleme serisi durumunda), ardından sycoca’yı güncellemek için <command>kbuildsycoca6</command> komutunu başlatır.

source: For KConfig, it checks newly-installed update files, &ie; the *.upd files used to update configuration files of users when the configuration file formats changes, and runs the KConfig update utility to perform the updates.
tr: KConfig için yeni kurulan güncelleme dosyalarını denetler, örn. yapılandırma dosyası biçimleri değiştiğinde kullanıcıların yapılandırma dosyalarını güncellemek için kullanılan *.upd dosyaları ve güncellemeleri gerçekleştirmek için KConfig güncelleme izlencesini çalıştırır.

source: Those tasks are also run when <command>kded6</command> is started to ensure that the user configuration is up to date.
tr: Bu görevler <command>kded6</command> başladığında da kullanıcı yapılandırmasını güncel tutmak için çalıştırılır.

source: You do not normally need to run <command>kded6</command> directly; &plasma; desktop sessions run it automatically, and it is started on demand when an application attempts to use a &DBus; interface provided by it or one of its modules.
tr: Normalde <command>kded6</command> komutunu doğrudan çalıştırmanız gerekmez; &plasma; masaüstü oturumu kendiliğinden çalıştırır ve bir uygulama onun tarafından sağlanan bir &DBus; arayüzünü veya modüllerinden birini çağırdığında başlatılır.

source: Options
tr: Seçenekler

source: Check the sycoca database, updating it if necessary, and exit.
tr: sycoca veritabanını denetleyin, gerekliyse güncelleyin ve çıkın.

source: Configuration
tr: Yapılandırma

source: <command>kded6</command> can be configured with the <filename>kded6rc</filename> ini-style configuration file. On &UNIX; systems, this can be found at <filename><varname>$XDG_CONFIG_HOME</varname>/kded6rc</filename>; if <varname>$XDG_CONFIG_HOME</varname> is not set, this defaults to <filename>~/.config/kded6rc</filename>.
tr: <command>kded6</command> komutu, <filename>kded6rc</filename> ini-biçemli yapılandırma dosyasıyla yapılandırılabilir. &UNIX; sistemlerde, bu <filename><varname>$XDG_CONFIG_HOME</varname>/kded6rc</filename> konumunda bulunabilir; <varname>$XDG_CONFIG_HOME</varname> ayarlanmamışsa öntanımlı değer <filename>~/.config/kded6rc</filename> olur.

source: Configuration file entries are read on-demand, so changes can be made while <command>kded6</command> is running. However, all the current configuration options only really affect the startup behaviour of <command>kded6</command>.
tr: Yapılandırma dosyası girdileri istendiğinde okunur, böylece değişiklikler <command>kded6</command> çalışırken yapılabilir. Ancak tüm geçerli yapılandırma seçenekleri gerçekten yalnızca <command>kded6</command> davranışını etkiler.

source: The <option>[General]</option> section has the following options:
tr: <option>[Genel]</option> bölümü şu seçenekleri içerir:

source: Whether to update sycoca at startup (default: <constant>true</constant>).
tr: Sycoca’nın açılışta güncellenip güncellenmeyeceği (öntanımlı: <constant>true</constant>).

source: Whether to perform outstanding KConfig updates at startup (default: <constant>true</constant>).
tr: Kalmış KConfig güncellemelerinin açılışta yapılıp yapılmayacağı (öntanımlı: <constant>true</constant>).

source: Whether to check file timestamps when performing the initial sycoca update (default: <constant>true</constant>). See the documentation for <command>kbuildsycoca6</command> for more details.
tr: İlk sycoca güncellemesini yaparken dosya zaman damgalarının denetlenip denetlenmeyeceği (öntanımlı: <constant>true</constant>). Ayrıntılar için <command>kbuildsycoca6</command> belgelendirmesine göz atın.

source: Whether to delay the initial sycoca update until about a minute after starting (default: <constant>false</constant>).
tr: İlk sycoca güncellemesinin başlangıçtan bir dakika sonraya kadar geciktirilip geciktirilmemesi (öntanımlı: <constant>false</constant>).

source: Each module also has a <option>[Module-<replaceable>name</replaceable>]</option> section in <filename>kded6rc</filename>, where <replaceable>name</replaceable> is the name of the module's desktop file without the <filename>.desktop</filename> extension. This contains an <option>autoload</option> option that specifies whether the module should be automatically loaded when <command>kded6</command> is started (default: <constant>false</constant>). Note that this setting can also be changed via <command>kded6</command>'s &DBus; interface.
tr: Her modül ayrıca <filename>kded6rc</filename> içinde bir <option>[Modül-<replaceable>ad</replaceable>]</option> kısmına sahiptir, burada <replaceable>ad</replaceable>, modülün masaüstü dosyasının <filename>.desktop</filename> uzantısı olmadan adıdır. Bu modülün <command>kded6</command> başlatıldığında kendiliğinden yüklenip yüklenmemesi gerektiğini belirten bir <option>autoload</option> seçeneği içerir (öntanımlı: <constant>false</constant>). Bu ayarın <command>kded6</command> &DBus; arayüzüyle de değiştirilebileceğini söyleyelim.

source: See Also
tr: Ayrıca Bakınız

source: Bugs
tr: Hatalar

source: Please use <ulink url="https://bugs.kde.org">&kde;'s bugtracker</ulink> to report bugs.
tr: Hataları bildirmek için lütfen <ulink url="https://bugs.kde.org">&kde;’nin hata izleyicisini</ulink> kullanın.
