Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kdesu.po
Languages: tr

source: The &kdesu; handbook
tr: &kdesu; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: &kdesu; is a graphical front end for the &UNIX; <command>su</command> command.
tr: &kdesu; &UNIX; <command>su</command> komutu için bir grafiksel ön yüzdür.

source: password
tr: parola

source: root
tr: kök

source: Introduction
tr: Giriş

source: Welcome to &kdesu;! &kdesu; is a graphical front end for the &UNIX; <command>su</command> command for the K Desktop Environment. It allows you to run a program as different user by supplying the password for that user. &kdesu; is an unprivileged program; it uses the system's <command>su</command>.
tr: &kdesu;’ya hoş geldiniz! &kdesu;, &UNIX; <command>su</command> komutunun K Masaüstü Ortamı için hazırlanmış bir grafiksel ön yüzüdür. Bir programı, başka bir kullanıcının parolasını sağlayarak o kullanıcıymış gibi çalıştırmaya izin verir. &kdesu; ayrıcalıksız bir programdır, sistemin <command>su</command> komutunu kullanır.

source: &kdesu; has one additional feature: it can remember passwords for you. If you are using this feature, you only need to enter the password once for each command. See <xref linkend="sec-password-keeping"/> for more information on this and a security analysis.
tr: &kdesu; programının bir ek özelliği vardır: Sizin için parolaları anımsayabilir. Bu özelliği kullanıyorsanız her bir komut için parolanızı yalnızca bir kez girmeniz gerekir. Bunun ve bir güvenlik çözümlemesi üzerine daha fazla bilgi için <xref linkend="sec-password-keeping"/> bölümüne bakın.

source: This program is meant to be started from the command line or from <filename>.desktop</filename> files. Although it asks for the <systemitem class="username">root</systemitem> password using a &GUI; dialog, I consider it to be more of a command line &lt;-&gt; &GUI; glue instead of a pure &GUI; program.
tr: Bu program, komut satırından veya <filename>.desktop</filename> dosyalarından başlatılmak üzere tasarlanmıştır. Bir &GUI; iletişim kutusu kullanarak <systemitem class="username">root</systemitem> parolasını sorsa da, bir &GUI; programından daha çok bir &lt;-&gt; &GUI; yapıştırıcısıdır.

source: Since <command>kdesu</command> is no longer installed in <userinput> $(kf5-config --prefix)</userinput>/bin but in <userinput>kf5-config --path libexec</userinput> and therefore not in your <envar>Path</envar>, you have to use <userinput>$(kf5-config --path libexec)<command>kdesu</command></userinput> to launch <command>kdesu</command>.
tr: <command>kdesu</command> komutu, artık <userinput> $(kf5-config --prefix)</userinput>/bin değil de <userinput>kf5-config --path libexec</userinput> konumunda kurulu olduğundan ve dolayısıyla <envar>PATH</envar>’inizde olmadığından, <command>kdesu</command> komutunu başlatmak için <userinput>$(kf5-config --path libexec)<command>kdesu</command></userinput> kullanmalısınız.

source: Using &kdesu;
tr: &kdesu; Kullanımı

source: Usage of &kdesu; is easy. The syntax is like this:
tr: &kdesu; kullanımı çok kolaydır. Sözdizim şöyledir:

source: <command>kdesu</command> <group choice="opt"><option>-c</option> <replaceable> command</replaceable></group> <group choice="opt"><option>-d</option></group> <group choice="opt"><option>-f</option> <replaceable> file</replaceable></group> <group choice="opt"><option>-i</option> <replaceable> icon name</replaceable></group> <group choice="opt"><option>-n</option></group> <group choice="opt"><option>-p</option> <replaceable> priority</replaceable></group> <group choice="opt"><option>-r</option></group> <group choice="opt"><option>-s</option></group> <group choice="opt"><option>-t</option></group> <group choice="opt"><option>-u</option> <replaceable> user</replaceable></group> <group choice="opt"><option>--noignorebutton</option></group> <group choice="opt"><option>--attach</option> <replaceable> winid</replaceable></group>
tr: <command>kdesu</command> <group choice="opt"><option>-c</option> <replaceable> komut</replaceable></group> <group choice="opt"><option>-d</option></group> <group choice="opt"><option>-f</option> <replaceable> dosya</replaceable></group> <group choice="opt"><option>-i</option> <replaceable> simge adı</replaceable></group> <group choice="opt"><option>-n</option></group> <group choice="opt"><option>-p</option> <replaceable> öncelik</replaceable></group> <group choice="opt"><option>-r</option></group> <group choice="opt"><option>-s</option></group> <group choice="opt"><option>-t</option></group> <group choice="opt"><option>-u</option> <replaceable> kullanıcı</replaceable></group> <group choice="opt"><option>--noignorebutton</option></group> <group choice="opt"><option>--attach</option> <replaceable> winid</replaceable></group>

source: <command>kdesu</command> <arg choice="opt">&kde; Generic Options</arg> <arg choice="opt">&Qt; Generic Options</arg>
tr: <command>kdesu</command> <arg choice="opt">&kde; Genel Seçenekleri</arg> <arg choice="opt">&Qt; Genel Seçenekleri</arg>

source: The command line options are explained below.
tr: Komut satırı seçenekleri aşağıda açıklanmıştır.

source: -c <replaceable>command</replaceable>
tr: -c <replaceable>komut</replaceable>

source: This specifies the command to run as root. It has to be passed in one argument. So if, for example, you want to start a new file manager, you would enter at the prompt: <userinput>$(kf5-config --path libexec)<command>kdesu <option>-c <replaceable> &dolphin;</replaceable></option></command></userinput>
tr: Bu, komutun yönetici olarak çalışacağını belirtir. Bir argüman ile geçirilmelidir. Örneğin, yeni bir dosya yöneticisi başlatmak istiyorsanız komut isteminde şunu girerdiniz: <userinput>$(kf5-config --path libexec)<command>kdesu <option>-c <replaceable> &dolphin;</replaceable></option></command></userinput>

source: Show debug information.
tr: Hata ayıklama bilgisini gösterin.

source: -f <replaceable>file</replaceable>
tr: -f <replaceable>dosya</replaceable>

source: This option allow efficient use of &kdesu; in <filename>.desktop</filename> files. It tells &kdesu; to examine the file specified by <parameter>file</parameter>. If this file is writable by the current user, &kdesu; will execute the command as the current user. If it is not writable, the command is executed as user <parameter>user</parameter> (defaults to root).
tr: Bu seçenek, &kdesu;’nun <filename>.desktop</filename> dosyalarında etkili kullanımını sağlar. &kdesu;’ya <parameter>dosya</parameter> parametresiyle verilen dosyayı incelemesini söyler. Dosyaya geçerli kullanıcı tarafından yazılabiliyorsa &kdesu; komutu geçerli kullanıcı olarak yürütür. Aksi durumda, komut <parameter>kullanıcı</parameter> olarak yürütülür (öntanımlı olarak yönetici).

source: <parameter>file</parameter> is evaluated like this: if <parameter>file</parameter> starts with a <literal>/</literal>, it is taken as an absolute filename. Otherwise, it is taken as the name of a global &kde; configuration file.
tr: <parameter>dosya</parameter> parametresi şöyle değerlendirilir: Eğer <parameter>dosya</parameter> bir <literal>/</literal> ile başlıyorsa mutlak bir dosya adı olarak alınır. Aksi takdirde global bir &kde; yapılandırma dosyası olarak kabul edilir.

source: <option>-i</option> <replaceable>icon name</replaceable>
tr: <option>-i</option> <replaceable>simge adı</replaceable>

source: Specify icon to use in the password dialog. You may specify just the name, without any extension.
tr: Parola iletişim kutusunda kullanılmak üzere bir simge belirtin. Herhangi bir uzantı olmadan yalnızca adı belirtebilirsiniz.

source: For instance to run &konqueror; in filemanager mode and show the &konqueror; icon in the password dialog:
tr: Örneğin &konqueror; uygulamasını dosya yöneticisi kipinde çalıştırmak ve &konqueror; simgesini parola iletişim kutusunda göstermek için:

source: Do not keep the password. This disables the <guilabel>keep password</guilabel> checkbox in the password dialog.
tr: Parolayı tutmayın. Bu seçenek, parola iletişim kutusundaki <guilabel>parolayı tut</guilabel> onay kutusunu devre dışı bırakır.

source: <option>-p</option> <replaceable>priority</replaceable>
tr: <option>-p</option> <replaceable>öncelik</replaceable>

source: Set priority value. The priority is an arbitrary number between 0 and 100, where 100 means highest priority, and 0 means lowest. The default is 50.
tr: Öncelik değerini ayarlayın. Öncelik, 1–100 arasında herhangi bir numaradır; 100 en yüksek önceliği ve 0 ise en düşük önceliği belirtir. Öntanımlı değer 50’dir.

source: Use realtime scheduling.
tr: Gerçek zamanlı zamanlama kullanın.

source: Stop the kdesu daemon. See <xref linkend="sec-password-keeping"/>.
tr: kdesu ardalan sürecini durdurun. Bkz. <xref linkend="sec-password-keeping"/>.

source: Enable terminal output. This disables password keeping. This is largely for debugging purposes; if you want to run a console mode app, use the standard <command>su</command> instead.
tr: Uçbirim çıktısını etkinleştirin. Bu, parola tutmayı devre dışı bırakır. Bu genelde hata ayıklama amaçlı kullanılır; bir konsol kipli uygulama çalıştırmak istiyorsanız bunun yerine standart olan <command>su</command> komutunu kullanın.

source: <option>-u</option> <replaceable> user</replaceable>
tr: <option>-u</option> <replaceable> kullanıcı</replaceable>

source: While the most common use for &kdesu; is to run a command as the superuser, you can supply any user name and the appropriate password.
tr: &kdesu;’nun en yaygın kullanımı bir komutu yönetici kullanıcı olarak çalıştırmak olsa da, herhangi bir kullanıcı adını ve parolayı da verebilirsiniz.

source: Internals
tr: İç Yapılar

source: X authentication
tr: X kimlik doğrulaması

source: The program you execute will run under the root user id and will generally have no authority to access your X display. &kdesu; gets around this by adding an authentication cookie for your display to a temporary <filename>.Xauthority</filename> file. After the command exits, this file is removed.
tr: Yürüttüğünüz program yönetici kimliği altında çalışır ve genelde X ekranınıza ulaşmak için yetkisi yoktur. &kdesu;, geçici bir <filename>.Xauthority</filename> dosyasına bir kimlik doğrulama çerezi ekleyerek bunun tarafından dolaşır. Komut çıktığında dosya kaldırılır.

source: If you don't use X cookies, you are on your own. &kdesu; will detect this and will not add a cookie but you will have to make sure that root is allowed to access to your display.
tr: X çerezleri kullanmıyorsanız kendi başınızasınız. &kdesu; bunu algılar ve bir tanımlama bilgisi eklemez; ancak yöneticinin ekranınıza erişmesine izin verildiğinden emin olmanız gerekir.

source: Interface to <command>su</command>
tr: <command>su</command> Komutuyla Etkileşim

source: &kdesu; uses the sytem's <command>su</command> for acquiring priviliges. In this section, I explain the details of how &kdesu; does this.
tr: &kdesu;, yetki almak için sistemin <command>su</command> komutunu kullanır. Bu bölümde, &kdesu;’nun bunu nice yaptığı anlatılır.

source: Because some <command>su</command> implementations (&ie; the one from &RedHat;) don't want to read the password from <literal>stdin</literal>, &kdesu; creates a pty/tty pair and executes <command>su</command> with its standard filedescriptors connected to the tty.
tr: Bazı <command>su</command> uygulamaları (örn. &RedHat;), parolaları <literal>stdin</literal>’den okumak istemez; &kdesu; bir pty/tty çifti oluşturur ve <command>su</command> komutunu kendi dosya tanımlayıcıları tty’ye iliştirilmiş bir biçimde yürütür.

source: To execute the command the user selected, rather than an interactive shell, &kdesu; uses the <option>-c</option> argument with <command>su</command>. This argument is understood by every shell that I know of so it should work portably. <command>su</command> passes this <option>-c</option> argument to the target user's shell, and the shell executes the program. Example command: <command>su <option>root -c <replaceable>the_program</replaceable></option></command>.
tr: Etkileşimli bir kabuk yerine kullanıcının seçtiği komutu yürütmek için &kdesu;, <command>su</command> komutunu <option>-c</option> argümanıyla kullanır. Bu argüman bilinen her kabukla çalışır, bu yüzden sıkıntı çıkarmaması gerekir. <command>su</command>, bu <option>-c</option> argümanını hedef kullanıcının kabuğuna geçiriri ve kabuk programı yürütür. Örnek komut: <command>su <option>root -c <replaceable>program</replaceable></option></command>.

source: Instead of executing the user command directly with <command>su</command>, &kdesu; executes a little stub program called <application>kdesu_stub</application>. This stub (running as the target user), requests some information from &kdesu; over the pty/tty channel (the stub's stdin and stdout) and then executes the user's program. The information passed over is: the X display, an X authentication cookie (if available), the <envar>PATH</envar> and the command to run. The reason why a stub program is used is that the X cookie is private information and therefore cannot be passed on the command line.
tr: Kullanıcı komutunu doğrudan <command>su</command> ile yürütmek yerine, &kdesu; <application>kdesu_stub</application> denen ufak bir yalancı program yürütür. Bu program (hedef kullanıcı olarak çalışır), &kdesu;’dan pty/tty kanalı üzerine bilgi ister (programcığın stdin’i ve stdout’u) ve sonrasında kullanıcının programını yürütür. Diğer yana geçirilen bilgi X ekranı, bir X kimlik doğrulama çerezi (varsa), <envar>PATH</envar> ve çalıştırılacak komuttur. Yalancı bir programın kullanılma nedeni, X çerezinin gizli bilgi olması ve komut satırında geçirilememesidir.

source: Password Checking
tr: Parola Denetimi

source: &kdesu; will check the password you entered and gives an error message if it is not correct. The checking is done by executing a test program: <filename>/bin/true</filename>. If this succeeds, the password is assumed to be correct.
tr: &kdesu; girdiğiniz parolaları denetler ve yanlışsa bir hata iletisi verir. Denetim, bir sınama programı yürütülerek yapılır: <filename>/bin/true</filename>. Bu başarılı olursa parola doğru varsayılır.

source: Password Keeping
tr: Parolayı Tutmak

source: For your comfort, &kdesu; implements a <quote>keep password</quote> feature. If you are interested in security, you should read this paragraph.
tr: Konforunuz için &kdesu; bir <quote>parolayı tut</quote> özelliği içerir. Güvenlik konusunda ilgiliyseniz bu paragrafı okumalısınız.

source: Allowing &kdesu; to remember passwords opens up a (small) security hole in your system. Obviously, &kdesu; does not allow anybody but your user id to use the passwords, but, if done without caution, this would lowers <systemitem class="username">root</systemitem>'s security level to that of a normal user (you). A hacker who breaks into your account, would get <systemitem class="username">root</systemitem> access. &kdesu; tries to prevent this. The security scheme it uses is, in my opinion at least, reasonably safe and is explained here.
tr: &kdesu;’nun parolaları anımsamasına izin vermek sisteminizde (ufak) bir güvenlik açığı doğurur. Tabii ki &kdesu; sizin kullanıcı kimliğiniz dışındaki kimsenin parolanızı kullanmasına izin vermez; ancak dikkatli kullanılmazsa bu <systemitem class="username">yönetici</systemitem>’nin güvenlik düzeyini normal bir kullanıcının düzeyine (sen) düşürür. Hesabınızı kıran bir deşici, <systemitem class="username">yönetici</systemitem> erişimi alabilir. &kdesu; bunu engellemeye çalışır. Kullandığı güvenlik şeması görece güvenlidir ve burada açıklanmıştır.

source: &kdesu; uses a daemon, called <application>kdesud</application>. The daemon listens to a &UNIX; socket in <filename>/tmp</filename> for commands. The mode of the socket is 0600 so that only your user id can connect to it. If password keeping is enabled, &kdesu; executes commands through this daemon. It writes the command and <systemitem class="username">root</systemitem>'s password to the socket and the daemon executes the command using <command>su</command>, as describe before. After this, the command and the password are not thrown away. Instead, they are kept for a specified amount of time. This is the timeout value from in the control module. If another request for the same command is coming within this time period, the client does not have to supply the password. To keep hackers who broke into your account from stealing passwords from the daemon (for example, by attaching a debugger), the daemon is installed set-group-id nogroup. This should prevent all normal users (including you) from getting passwords from the <application>kdesud</application> process. Also, the daemon sets the <envar>DISPLAY</envar> environment variable to the value it had when it was started. The only thing a hacker can do is execute an application on your display.
tr: &kdesu;, <application>kdesud</application> denen bir ardalan süreci kullanır. Süreç, komutlar için <filename>/tmp</filename> içindeki bir &UNIX; yuvasını dinler. Yuvanın kipi 0600’dır; böylece yalnızca sizin kullanıcı kimliğiniz ona bağlanabilir. Parolayı tutma etkinleştirilmişse &kdesu; komutları bu ardalan süreci üzerinden yürütür. Komutu ve <systemitem class="username">yönetici</systemitem>’nin parolasını yuvaya yazar ve ardalan komutu daha önce açıklandığı üzere <command>su</command> ile yürütür. Sonrasında komut ve parola atılmaz. Bunun yerine belirli bir süre tutulurlar. Bu, denetim modülündeki zaman aşımı değeridir. Bu süre içinde aynı komut için bir istek gelirse istemcinin parolayı sağlamasına gerek kalmaz. Deşicilerin ardalan sürecinden parolaları çıkarmasına engel olmak için (örneğin bir hata ayıklayıcı iliştirerek) ardalan süreci set-group-id nogroup olarak kurulmuştur. Bu, tüm normal kullanıcıların (sen de dahil olmak üzere) parolaları <application>kdesud</application> sürecinden almasına engel olmalıdır. Ayrıca, ardalan süreci <envar>DISPLAY</envar> çevre değişkenini başlatıldığındaki değere geri ayarlar. Bir deşicinin yapabileceği tek şey ekranınızda bir program yürütmek olabilir.

source: One weak spot in this scheme is that the programs you execute are probably not written with security in mind (like setuid <systemitem class="username">root</systemitem> programs). This means that they might have buffer overruns or other problems and a hacker could exploit those.
tr: Bu şemadaki bir olası zayıf nokta ise yürüttüğünüz programların güvenlik temel alınarak yazılmamış olmasıdır (setuid <systemitem class="username">yönetici</systemitem> programları gibi). Bu, önbellek taşmaları veya başka sorunların olabileceği ve bir deşicinin bunları kullanabileceği anlamına gelir.

source: The use of the password keeping feature is a tradeoff between security and comfort. I encourage you to think it over and decide for yourself if you want to use it or not.
tr: Parola tutma özelliği güvenlik ve konfor arasında bir feragattir. Buna göre kullanmak isteyip istemediğinizi bir düşünün.

source: Author
tr: Yazar

source: Copyright 2000 &Geert.Jansen;
tr: Telif hakkı 2000 &Geert.Jansen;

source: &kdesu; is written by &Geert.Jansen;. It is somewhat based on Pietro Iglio's &kdesu;, version 0.3. Pietro and I agreed that I will maintain this program in the future.
tr: &kdesu;, &Geert.Jansen; tarafından yazılmıştır. Pietro Iglio’nun &kdesu; 0.3 sürümü temellidir. Pietro ve ben, bu programın bakımını bundan sonra benim yapacağım konusunda anlaştık.

source: The author can be reached through email at &Geert.Jansen.mail;. Please report any bugs you find to me so that I can fix them. If you have a suggestion, feel free to contact me.
tr: Yazara &Geert.Jansen.mail; üzerinden ulaşabilirsiniz. Bulduğunuz tüm hataları bana bildirin ki onları düzeltebileyim. Sorunuz varsa sormaktan çekinmeyin.

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
