Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kdevelop.po
Languages: tr

source: You can see that data members are converted into Qt properties, with accessor functions and the Q_PROPERTY macros. Arguments to setter functions are even passed by const-reference, where appropriate. Additionally, a private class is declared, and a private pointer created with Q_DECLARE_PRIVATE. All this is done by the template, choosing a different template in the first step could completely change the output.
tr: Veri üyelerinin, erişimci işlevler ve Q_PROPERTY makroları ile Qt özelliklerine dönüştürüldüğünü görebilirsiniz. Hatta ayarlayıcı işlevlerine argümanlar, uygun olan yerlerde const-reference ile aktarılır. Ek olarak, özel bir sınıf bildirilir ve Q_DECLARE_PRIVATE ile özel bir işaretçi oluşturulur. Bütün bunlar şablon tarafından yapılır, ilk adımda farklı bir şablon seçmek çıktıyı tümüyle değiştirebilir.

source: Creating a new unit test
tr: Yeni bir birim testi oluşturmak

source: Even though most testing frameworks require each test to also be a class, &kdevelop; includes a method to simplify the creation of unit tests. To create a new test, right click on a project folder and choose <guilabel>Create from Template...</guilabel>. In the template selection page, choose <filename>Test</filename> as the category, then choose your programming language and template and click <guilabel>Next</guilabel>.
tr: Çoğu test çatıları, her testin aynı zamanda bir sınıf olmasını gerektirse de, &kdevelop; birim testlerinin oluşturulmasını basitleştirmek için bir yöntem içerir. Yeni bir test oluşturmak için bir proje klasörüne sağ tıklayın ve <guilabel>Şablondan Oluştur…</guilabel> seçeneğini seçin. Şablon seçim sayfasında, kategori olarak <filename>Test</filename> seçin, ardından programlama dilinizi ve şablonunuzu belirledikten sonra <guilabel>Sonraki</guilabel> düğmesine tıklayın.

source: You will be prompted for the test name and a list of test cases. For the test cases, you only have to specify a list of names. Some unit testing frameworks, such as PyUnit and PHPUnit, require that test cases start with a special prefix. In &kdevelop;, the template is responsible for adding the prefix, so you do not have to prefix the test cases here. After clicking <guilabel>Next</guilabel>, specify the license and output locations for the generated files, and the test will be created.
tr: Test adı ve test senaryolarının bir listesi istenecektir. Test senaryoları için yalnızca bir ad listesi belirtmeniz gerekir. PyUnit ve PHPUnit gibi bazı birim test çerçeveleri, test senaryolarının özel bir önekle başlamasını gerektirir. &kdevelop; içinde, şablon öneki eklemekten sorumludur, bu nedenle burada test senaryolarına önek eklemeniz gerekmez. <guilabel>Sonraki</guilabel> düğmesine tıkladıktan sonra, üretilen dosyalar için lisans ve çıktı konumlarını belirtin ve test oluşturulacaktır.

source: Unit tests created this way will not be added to any target automatically. If you are using CTest or some other testing framework, make sure to add the new files to a target.
tr: Bu şekilde oluşturulan birim testleri kendiliğinden herhangi bir hedefe eklenmeyecektir. CTest veya başka bir test çatısı kullanıyorsanız yeni dosyaları bir hedefe eklediğinizden emin olun.

source: Other files
tr: Diğer dosyalar

source: While classes and unit tests receive special attention when generating code from templates, the same method can be used for any kind of source code files. For example, one could use a template for a CMake Find module or a .desktop file. This can be done by choosing <guilabel>Create from Template...</guilabel>, and selecting the wanted category and template. If the selected category is neither <filename>Class</filename> nor <filename>Test</filename>, you will only have the option of choosing the license, any custom options specified by the template, and the output file locations. As with classes and tests, finishing the assistant will generate the files and open them in the editor.
tr: Şablonlardan kod üretirken sınıflar ve birim testleri özel ilgi görse de, aynı yöntem her türlü kaynak kod dosyası için kullanılabilir. Örneğin, bir CMake Find modülü veya bir .desktop dosyası için bir şablon kullanılabilir. Bu, <guilabel>Şablondan Oluştur…</guilabel> seçilerek ve istenen kategori ve şablon seçilerek yapılabilir. Seçilen kategori ne <filename>Sınıf</filename> ne de <filename>Test</filename> ise yalnızca lisansı, şablon tarafından belirtilen özel seçenekleri ve çıktı dosyası konumlarını seçme seçeneğiniz olacaktır. Sınıflar ve testlerde olduğu gibi, yardımcıyı tamamlamak dosyaları oluşturacak ve düzenleyicide açacaktır.

source: Managing templates
tr: Şablonları yönetmek

source: From the <menuchoice><guimenu>File</guimenu><guimenuitem>New from Template...</guimenuitem></menuchoice> assistant, you can also download additional file templates by clicking the <guilabel>Get more Templates...</guilabel> button. This opens a Get Hot New Stuff dialog, where you can install additional templates, as well as update or remove them. There is also a configuration module for templates, which can be reached by clicking <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure &kdevelop;</guisubmenu><guimenuitem>Templates</guimenuitem></menuchoice>. From there, you can manage both file templates (explained above) and project templates (used for creating new projects).
tr: <menuchoice><guimenu>Dosya</guimenu><guimenuitem>Şablondan Yeni…</guimenuitem></menuchoice> yardımcısından, <guilabel>Daha Fazla Şablon Al…</guilabel> düğmesine tıklayarak ek dosya şablonları da indirebilirsiniz. Bu, ek şablonları kurabileceğiniz, güncelleyebileceğiniz veya kaldırabileceğiniz bir Yeni Şeyler Al iletişim kutusunu açar. Ayrıca şablonlar için <menuchoice><guimenu>Ayarlar</guimenu><guisubmenu>&kdevelop; Uygulamasını Yapılandır</guisubmenu><guimenuitem>Şablonlar</guimenuitem></menuchoice> düğmesine tıklayarak ulaşabileceğiniz bir yapılandırma modülü de bulunmaktadır. Buradan hem dosya şablonlarını (yukarıda açıklanmıştır) hem de proje şablonlarını (yeni projeler oluşturmak için kullanılır) yönetebilirsiniz.

source: Of course, if none of the available template suit your project, you can always create new ones. The easiest way is probably to copy and modify an existing template, while a short <ulink url="https://techbase.kde.org/Development/Tutorials/KDevelop/Creating_a_class_template">tutorial</ulink> and a longer <ulink url="https://techbase.kde.org/Projects/KDevelop4/File_template_specification">specification document</ulink> are there to help you. To copy an installed template, open the template manager by clicking <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure KDevelop...</guisubmenu><guimenuitem>Templates</guimenuitem></menuchoice>, select the template you wish to copy, then click the <guilabel>Extract Template</guilabel> button. Select a destination folder, then click <guilabel>OK</guilabel>, and the contents of the template will be extracted into the selected folder. Now you can edit the template by opening the extracted files and modifying them. After you are done, you can import your new template into &kdevelop; by opening the template manager, activating the appropriate tab (either <guilabel>Project Templates</guilabel> or <guilabel>File Templates</guilabel>) and clicking <guilabel>Load Template</guilabel>. Open the template description file, which is the one with the suffix either <varname>.kdevtemplate</varname> or <varname>.desktop</varname>. &kdevelop; will compress the files into a template archive and import the template.
tr: Elbette, kullanılabilir şablonlardan hiçbiri projenize uygun değilse her zaman yenilerini oluşturabilirsiniz. En kolay yol büyük olasılıkla var olan bir şablonu kopyalayıp değiştirmektir; ancak kısa bir <ulink url="https://techbase.kde.org/Development/Tutorials/KDevelop/Creating_a_class_template">öğretici</ulink> ve daha uzun bir <ulink url="https://techbase.kde.org/Projects/KDevelop4/File_template_specification">belirtim belgesi</ulink> size yardımcı olmak için oradadır. Kurulu bir şablonu kopyalamak için <menuchoice><guimenu>Ayarlar</guimenu><guisubmenu>K Geliştir Uygulamasını Yapılandır…</guisubmenu><guimenuitem>Şablonlar</guimenuitem></menuchoice> ögesine tıklayarak şablon yöneticisini açın, kopyalamak istediğiniz şablonu seçin ve ardından <guilabel>Şablonu Çıkar</guilabel> düğmesine tıklayın. Bir hedef klasör seçin, ardından <guilabel>Tamam</guilabel> düğmesine tıklayın; şablonun içeriği seçilen klasöre çıkarılacaktır. Artık çıkarılan dosyaları açıp değiştirerek şablonu düzenleyebilirsiniz. İşiniz bittikten sonra, şablon yöneticisini açıp uygun sekmeyi (<guilabel>Proje Şablonları</guilabel> veya <guilabel>Dosya Şablonları</guilabel>) etkinleştirerek ve <guilabel>Şablonu Yükle</guilabel> seçeneğine tıklayarak yeni şablonunuzu &kdevelop; uygulamasına aktarabilirsiniz. <varname>.kdevtemplate</varname> veya <varname>.desktop</varname> sonekine sahip olan şablon açıklama dosyasını açın. &kdevelop; dosyaları bir şablon arşivine sıkıştıracak ve şablonu içe aktaracaktır.

source: When copying an existing template, make sure you rename it before importing it again. Otherwise, you will either overwrite the old template, or will end up with two templates with identical names. To rename a template, rename the description file to something unique (but keep the suffix), and change the <filename>Name</filename> entry in the description file.
tr: Var olan bir şablonu kopyalarken, yeniden içe aktarmadan önce yeniden adlandırdığınızdan emin olun. Aksi takdirde, ya eski şablonun üzerine yazarsınız ya da aynı ada sahip iki şablon elde edersiniz. Bir şablonu yeniden adlandırmak için açıklama dosyasını benzersiz bir adla yeniden adlandırın (ancak soneki koruyun) ve açıklama dosyasındaki <filename>Ad</filename> girişini değiştirin.

source: If you want to write a template from scratch, you can start with a sample C++ class template by <link linkend="creating-projects-from-scratch">creating a new project</link> and selecting the <filename>C++ Class Template</filename> project in category <filename>KDevelop</filename>.
tr: Sıfırdan bir şablon yazmak istiyorsanız <link linkend="creating-projects-from-scratch">yeni bir proje</link> oluşturarak ve <filename>K Geliştir</filename> kategorisindeki <filename>C++ Sınıfı Şablonu</filename> projesini seçerek örnek bir C++ sınıfı şablonuyla başlayabilirsiniz.

source: Building (compiling) projects with custom Makefiles
tr: Özel Makefiles ile proje yapmak (derlemek)

source: Many projects describe how source files have to be compiled (and which files have to be recompiled once a source or header file changes) using Makefiles that are interpreted by the <guilabel>make</guilabel> program (see, for example, <ulink url="https://www.gnu.org/software/make/">GNU make</ulink>). For simple projects, it is often very easy to set up such a file by hand. Larger projects often integrate their Makefiles with the <guilabel>GNU autotools</guilabel> (autoconf, autoheader, automake). In this section, let us simply assume that you have a Makefile for your project and you want to teach &kdevelop; how to interact with it.
tr: Birçok proje, <guilabel>make</guilabel> programı tarafından yorumlanan Make dosyalarını kullanarak kaynak dosyalarının nasıl derlenmesi gerektiğini (ve bir kaynak veya üstbilgi dosyası değiştiğinde hangi dosyaların yeniden derlenmesi gerektiğini) açıklar (örneğin, bkz. <ulink url="https://www.gnu.org/software/make/">GNU make</ulink>). Basit projeler için böyle bir dosyayı elle oluşturmak genellikle çok kolaydır. Daha büyük projeler genellikle Make dosyalarını <guilabel>GNU autotools</guilabel> (autoconf, autoheader, automake) ile tümleştirirler. Bu bölümde, projeniz için bir Makefile olduğunu ve &kdevelop; yazılımına bununla nasıl etkileşimde bulunacağını öğretmek istediğinizi varsayalım.

source: &kdevelop; 4.x doesn't know about the <guilabel>GNU autotools</guilabel> at the time this section is written. If your project uses them, you will have to run <varname>./configure</varname> or any of the other related commands by hand on a command line. If you want to do this within &kdevelop;, open the <guilabel>Konsole</guilabel> tool (if necessary add it to the perimeter of the main window using the menu <menuchoice><guimenu>Windows</guimenu><guimenuitem>Add tool view</guimenuitem></menuchoice>) that gives you a shell window view and run <varname>./configure</varname> from the command line in this view.
tr: &kdevelop; 4.x, bu bölüm yazıldığı sırada <guilabel>GNU autotools</guilabel> hakkında bilgi sahibi değildir. Eğer projeniz bunları kullanıyorsa <varname>./configure</varname> veya diğer ilgili komutları komut satırında elle çalıştırmanız gerekecektir. Bunu &kdevelop; içinde yapmak istiyorsanız size bir kabuk penceresi görünümü veren <guilabel>Konsole</guilabel> aracını açın (gerekirse <menuchoice><guimenu>Pencereler</guimenu><guimenuitem>Araç Görünümü Ekle</guimenuitem></menuchoice> menüsünü kullanarak ana pencerenin çevresine ekleyin) ve bu görünümde komut satırından <varname>./configure</varname> komutunu çalıştırın.

source: The first step is to teach &kdevelop; about targets in your Makefiles. There are two ways to do that: selecting individual Makefile targets, and choosing a set of targets you may want to build frequently. For both approaches, open the <guilabel>Projects</guilabel> tool by clicking on the <guilabel>Projects</guilabel> button on the perimeter of &kdevelop;'s main window (if you don't have this button see above how to add a tool's button there). The <guilabel>Projects</guilabel> tool window has two parts: the top half &mdash; titled <guilabel>Projects</guilabel> &mdash; lists all of your projects and let's you expand the underlying directory trees. The bottom half &mdash; titled <guilabel>Project Selection</guilabel> &mdash; lists a subset of those projects that will be built if you choose the menu item <menuchoice><guimenu>Project</guimenu><guimenuitem>Build selection</guimenuitem></menuchoice> or hit <keycap>F8</keycap>; we'll come back to this part below.
tr: İlk adım &kdevelop; yazılımına, Makefile dosyalarınızdaki hedefleri öğretmektir. Bunu yapmanın iki yolu vardır: Makefile hedeflerini tek tek seçmek ve sık sık oluşturmak isteyebileceğiniz bir hedef kümesi seçmek. Her iki yaklaşım için de, &kdevelop; yazılımının ana penceresinin çevresindeki <guilabel>Projeler</guilabel> düğmesine tıklayarak <guilabel>Projeler</guilabel> aracını açın (bu düğmeye sahip değilseniz yukarıda bir aracın düğmesini nasıl ekleyeceğinize bakın). <guilabel>Projeler</guilabel> araç penceresi iki bölümden oluşur: <guilabel>Projeler</guilabel> &mdash; başlıklı üst yarı&mdash; tüm projelerinizi listeler ve altta yatan dizin ağaçlarını genişletmenize izin verir. <guilabel>Proje Seçimi</guilabel> &mdash; başlıklı alt yarı, <menuchoice><guimenu>Proje</guimenu><guimenuitem>Seçimi Yap</guimenuitem></menuchoice> menü ögesini seçerseniz veya <keycap>F8</keycap> düğmesine basarsanız yapılacak projelerin bir alt kümesini listeler; bu kısma aşağıda geri döneceğiz.

source: Building individual Makefile targets
tr: Bireysel Makefile hedeflerini yapmak

source: In the top part of the project view, expand the sub-tree for one project, let's say the one for which you want to run a particular Makefile target. This will give you icons for (i) directories under this project, (ii) files in the top-level directory for this project, (iii) Makefile targets &kdevelop; can identify. These categories are shown in the picture at right. Note that &kdevelop; <emphasis>understands</emphasis> Makefile syntax to a certain degree and therefore can offer you targets defined in this Makefile (though this understanding has its limits if targets are composed or implicit).
tr: Proje görünümünün üst kısmında, bir proje için diyelim ki belirli bir Makefile hedefini çalıştırmak istediğiniz proje için alt ağacı genişletin. Bu size (i) bu proje altındaki dizinler, (ii) bu proje için üst düzey dizindeki dosyalar, (iii) &kdevelop; yazılımının tanımlayabileceği Makefile hedefleri için simgeler verecektir. Bu kategoriler sağdaki resimde gösterilmektedir. Unutmayın ki &kdevelop;, <emphasis>Makefile sözdizimini belirli bir dereceye kadar anlar</emphasis> ve bu nedenle size bu Makefile içinde tanımlanan hedefleri sunabilir (ancak hedefler oluşturulmuşsa veya örtükse bu anlayışın sınırları vardır).

source: To build any of the targets listed there, click on it with the right mouse button and select <guilabel>Build</guilabel>. For example, doing this with the <quote>clean</quote> target will simply execute <quote>make clean</quote>. You can see this happening in the subwindow titled <guilabel>Build</guilabel> that opens up, showing the command and the output. (This window corresponds to the <guilabel>Build</guilabel> tool, so you can close and later re-open the window using the <guilabel>Build</guilabel> tool button on the perimeter of the main window. It is shown at the bottom right of the picture.)
tr: Burada listelenen hedeflerden herhangi birini yapmak için farenin sağ düğmesiyle üzerine tıklayın ve <guilabel>Yap</guilabel> seçeneğini seçin. Örneğin, bunu <quote>clean</quote> hedefi ile yapmak basitçe <quote>make clean</quote> komutunu çalıştıracaktır. Bunun gerçekleştiğini açılan ve komutu ve çıktıyı gösteren <guilabel>Yap</guilabel> başlıklı alt pencerede görebilirsiniz. (Bu pencere <guilabel>Yap</guilabel> aracına karşılık gelir, bu nedenle ana pencerenin çevresindeki <guilabel>Yap</guilabel> araç düğmesini kullanarak pencereyi kapatabilir ve daha sonra yeniden açabilirsiniz. Resmin sağ alt kısmında gösterilmektedir).

source: Selecting a collection of Makefile targets for repeated building
tr: Sürekli yapı için bir Makefile hedefleri koleksiyonu seçmek

source: Right-clicking on individual Makefile targets every time you want to build something will quickly get old. Rather, we'd like to have individual targets for one or more of the projects in the session that we can repeatedly build without much mouse work. This is where the concept of <quote>Build target selections</quote> comes in: it is a collection of Makefile targets that are built one-after-the-other whenever you hit the <guilabel>Build selection</guilabel> button in the button list at the top, select the <menuchoice><guimenu>Project</guimenu><guimenuitem>Build selection</guimenuitem></menuchoice> menu item, or hit the <keycap>F8</keycap> function key.
tr: Bir şey yapmak istediğiniz her zaman tek tek Makefile hedeflerine sağ tıklamak sizi yoracaktır. Bunun yerine, oturumdaki bir veya daha fazla proje için çok fazla fare çalışması yapmadan sürekli olarak oluşturabileceğimiz bireysel hedeflere sahip olmak isteriz. İşte bu noktada <quote>Hedef Seçimlerini Yap</quote> kavramı devreye girer: Üstteki düğme listesinde <guilabel>Seçimi Yap</guilabel> düğmesine bastığınızda, <menuchoice><guimenu>Proje</guimenu><guimenuitem>Seçimi Yap</guimenuitem></menuchoice> menü ögesini seçtiğinizde veya <keycap>F8</keycap> işlev tuşuna bastığınızda birbiri ardına oluşturulan Makefile hedeflerinin bir koleksiyonudur.

source: The list of selected Makefile targets is shown in the bottom half of the <guilabel>Projects</guilabel> tool view.
tr: Seçili Makefile hedeflerinin listesi <guilabel>Projeler</guilabel> araç görünümünün alt yarısında gösterilir.

source: By default, the selection contains all projects, but you can change that. For example, if your list of projects contains three projects (a base library L and two applications A and B), but you're currently only working on project A, then you may want to remove project B from the selection by highlighting it in the selection and hitting the <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-remove.png" format="PNG"/> </imageobject> </inlinemediaobject> button. Furthermore, you probably want to make sure that the library L is built before project A by moving entries in the selection up and down using the buttons to the right of the list. You can also get a particular Makefile target into the selection by right-clicking onto it and selecting <guilabel>Add to buildset</guilabel>, or just highlighting it and hitting the <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject> button just above the list of selected targets.
tr: Öntanımlı olarak seçim tüm projeleri içerir; ancak bunu değiştirebilirsiniz. Örneğin, proje listeniz üç proje içeriyorsa (bir temel kitaplık L ve iki uygulama A ve B), ancak şu anda yalnızca A projesi üzerinde çalışıyorsanız B projesini seçimde vurgulayarak ve <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-remove.png" format="PNG"/> </imageobject> </inlinemediaobject> düğmesine basarak seçimden kaldırmak isteyebilirsiniz. Ayrıca, büyük olasılıkla listenin sağındaki düğmeleri kullanarak seçimdeki girdileri yukarı ve aşağı hareket ettirerek L kütüphanesinin A projesinden önce yapıldığından emin olmak istersiniz. Ayrıca, belirli bir Makefile hedefine sağ tıklayıp <guilabel>Yapı Kümesine Ekle</guilabel> seçeneğini seçerek veya yalnızca vurgulayıp <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject> düğmesine basarak seçimde içerebilirsiniz.

source: &kdevelop; allows you to configure what to do whenever you build the selection. To this end, use the menu item <menuchoice><guimenu>Project</guimenu><guimenuitem>Open configuration</guimenuitem></menuchoice>. There, you can for example select the number of simultaneous jobs <quote>make</quote> should execute &mdash; if your computer has, say, 8 processor cores, then entering 8 in this field would be a useful choice. In this dialog, the <guilabel>Default make target</guilabel> is a Makefile target used for <emphasis>all</emphasis> targets in the selection.
tr: &kdevelop; seçimi oluşturduğunuzda ne yapacağınızı yapılandırmanıza olanak tanır. Bu amaçla, <menuchoice><guimenu>Proje</guimenu><guimenuitem>Yapılandırmayı Aç</guimenuitem></menuchoice> menü ögesini kullanın. Burada; örneğin <quote>make</quote>komutunun yürütmesi gereken eşzamanlı iş sayısını seçebilirsiniz &mdash; bilgisayarınızda örneğin 8 işlemci çekirdeği varsa, bu alana 8 girmek yararlı bir seçim olacaktır. Bu iletişim kutusunda, <guilabel>Öntanımlı make hedefi</guilabel>, seçimdeki <emphasis>tüm</emphasis> hedefler için kullanılan bir Makefile hedefidir.

source: What to do with error messages
tr: Hata iletileri ile ne yapmalı

source: If the compiler encounters an error message, simply click on the line with the error message and the editor will jump to the line (and if available column) where the error was reported. Depending on the error message, &kdevelop; may also offer you several possible actions to fix the error, for example by declaring a previously undeclared variable if an unknown symbol was found.
tr: Derleyici bir hata iletisiyle karşılaşırsa hata iletisinin bulunduğu satıra tıklamanız yeterlidir; düzenleyici, hatanın rapor edildiği satıra (ve varsa sütuna) atlayacaktır. Hata iletisine bağlı olarak &kdevelop;, size hatayı düzeltmek için birkaç olası eylem de sunabilir; örneğin bilinmeyen bir sembol bulunursa daha önce bildirilmemiş bir değişkeni bildirerek.

source: Running programs in &kdevelop;
tr: &kdevelop; içinde programlar çalıştırmak
