Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kdevelop.po
Languages: tr

source: If you only edited a single file, you can also get the <guilabel>Subversion</guilabel> menu for this file by simply right clicking on the corresponding file name in the project view. Even simpler, just right clicking into the <guilabel>Editor</guilabel> view in which you have opened this file will also give you this menu option.
tr: Yalnızca tek bir dosyayı düzenlediyseniz proje görünümünde ilgili dosya adına sağ tıklayarak bu dosya için <guilabel>Subversion</guilabel> menüsünü de elde edebilirsiniz. Daha da basit olarak, bu dosyayı açtığınız <guilabel>Düzenleyici</guilabel> görünümüne sağ tıklamak da size bu menü seçeneğini verecektir.

source: If you want to check in one or more edited files, right click either on an individual file, subdirectory, or whole project and select <menuchoice><guimenu>Subversion</guimenu><guimenuitem>Commit</guimenuitem></menuchoice>. This will get you into <guilabel>Review</guilabel> mode, the third mode besides <guilabel>Code</guilabel> and <guilabel>Debug</guilabel> as you can see in the top right corner of the &kdevelop; main window. The picture on the right shows you how this looks. In <guilabel>Review</guilabel> mode, the top part shows you diffs for the entire subdirectory/project and each individual changed file with changes highlighted (see the various tabs on this part of the window). By default, all changed files are in the changeset you are about to commit, but you can unselect some of the files if their modifications are unrelated to what you want to commit. For example, in the example on the right I have unselected <varname>step-32.cc</varname> and <varname>step-32.prm</varname> because the changes in these files have nothing to do with the other ones I made to this project and I don't yet want to check them in yet (I may later want to do so in a separate commit). After reviewing the changes you can enter a commit message into the text box and hit <guilabel>Commit</guilabel> on the right to send things off.
tr: Düzenlenmiş bir veya daha fazla dosyayı denetlemek istiyorsanız tek bir dosyaya, alt dizine veya tüm projeye sağ tıklayın ve <menuchoice><guimenu>Subversion</guimenu><guimenuitem>İşle</guimenuitem></menuchoice> ögesini seçin. Bu sizi &kdevelop; ana penceresinin sağ üst köşesinde görebileceğiniz gibi <guilabel>Kod</guilabel> ve <guilabel>Hata Ayıkla</guilabel> kiplerinin yanındaki üçüncü kip olan <guilabel>Gözden Geçir</guilabel> kipine geçirecektir. Sağdaki resim size bunun nasıl göründüğünü göstermektedir. <guilabel>Gözden Geçir</guilabel> kipinde, üst kısım size tüm alt dizin/proje ve değişiklikleri vurgulanmış her bir değiştirilmiş dosya için farkları gösterir (pencerenin bu kısmındaki çeşitli sekmelere bakın). Öntanımlı olarak, değiştirilen tüm dosyalar işlemek üzere olduğunuz değişiklik kümesinde yer alır; ancak değişiklikleri işlemek istediğiniz şeyle ilgisizse bazı dosyaların seçimini kaldırabilirsiniz. Örneğin, sağdaki örnekte <varname>step-32.cc</varname> ve <varname>step-32.prm</varname> dosyalarının seçimini kaldırdım; çünkü bu dosyalardaki değişikliklerin bu projede yaptığım diğer değişikliklerle hiçbir ilgisi yok ve bunları henüz denetlemek istemiyorum (daha sonra bunu ayrı bir işleme ile yapmak isteyebilirim). Değişiklikleri gözden geçirdikten sonra metin kutusuna bir işleme iletisi girebilir ve sağdaki <guilabel>İşle</guilabel> düğmesine basarak işleyebilirsiniz.

source: As with seeing differences, if you want to check in a single file you can also just right click into the editor window to get the <menuchoice><guimenu>Subversion</guimenu><guimenuitem>Commit</guimenuitem></menuchoice> menu item.
tr: Farklılıkları görmede olduğu gibi, tek bir dosyayı denetlemek istiyorsanız <menuchoice><guimenu>Subversion</guimenu><guimenuitem>İşle</guimenuitem></menuchoice> menü ögesini almak için düzenleyici penceresine sağ tıklayabilirsiniz.

source: Customizing &kdevelop;
tr: &kdevelop; yazılımını özelleştirmek

source: There are times when you want to change the default appearance or behavior of &kdevelop;, for example because you are used to different keyboard shortcuts or because your project requires a different indenting style for source code. In the following sections, we briefly discuss the various ways how &kdevelop; can be customized for these needs.
tr: Örneğin farklı klavye kısayollarına alışkın olduğunuz için veya projeniz kaynak kod için farklı bir girinti biçemi gerektirdiği için &kdevelop; yazılımının öntanımlı görünüşünü veya davranışını değiştirmek istediğiniz zamanlar olabilir. Aşağıdaki bölümlerde, &kdevelop; yazılımının bu tür gereksinimler için nasıl özelleştirilebileceğinin çeşitli yollarını kısaca açıklıyoruz.

source: Customizing the editor
tr: Düzenleyiciyi özelleştirmek

source: There are a number of useful things one can configure in and around &kdevelop;'s built-in editor. Of more universal use is to switch on line numbering using the menu entry <menuchoice><guimenu>Editor</guimenu><guisubmenu>View</guisubmenu><guimenuitem>Show line numbers</guimenuitem></menuchoice>, making it easier to match compiler error messages or debug messages with locations in the code. In the same submenu you may also want to switch on the <emphasis>Icon border</emphasis> - a column to the left of your code in which &kdevelop; will show icons such as whether there is a breakpoint on the current line.
tr: &kdevelop; uygulamasının yerleşik düzenleyicisi içinde ve çevresinde yapılandırılabilecek bir dizi yararlı şey vardır. Daha evrensel kullanım için <menuchoice><guimenu>Düzenleyici</guimenu><guisubmenu>Görünüm</guisubmenu><guimenuitem>Satır Numaralarını Göster</guimenuitem></menuchoice> menü girdisini kullanarak satır numaralandırmayı açmak, derleyici hata iletilerini veya hata ayıklama iletilerini koddaki konumlarla eşleştirmeyi kolaylaştırır. Aynı alt menüde <emphasis>Simge Kenarlığı</emphasis> özelliğini de açmak isteyebilirsiniz — &kdevelop;, kodunuzun solunda, geçerli satırda bir kesme noktası olup olmadığı gibi simgeleri gösterecek bir sütun gösterir.

source: Customizing code indentation
tr: Kod girintilemesini özelleştirmek

source: Many of us like code formatted in a particular way. Many projects also enforce a particular indentation style. Neither may match &kdevelop;'s default indentation style. However, this can be customized: Go to the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Customize &kdevelop;</guimenuitem></menuchoice> menu item, then click on <guilabel>Source Formatter</guilabel> on the left. You can choose one of the predefined indentation styles that are widely in use, or define your own one by adding a new style and then editing it. There may not be a way to exactly re-create the style in which your project's sources have been indented in the past, but you can come close by using the settings for a new style; an example is shown in the two pictures below.
tr: Çoğumuz kodun belirli bir şekilde biçimlendirilmesini isteriz. Birçok proje de belirli bir girinti biçemini zorunlu kılar. Her ikisi de &kdevelop; uygulamasının girintileme biçemiyle eşleşmeyebilir. Ancak, bu özelleştirilebilirdir: <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>&kdevelop; Uygulamasını Özelleştir</guimenuitem></menuchoice> menü ögesine gidin, ardından soldaki <guilabel>Kaynak Biçimlendiricisi</guilabel> ögesine tıklayın. Yaygın olarak kullanılan önceden tanımlanmış girintileme biçemlerinden birini seçebilir veya yeni bir biçem ekleyip düzenleyerek kendi biçeminizi tanımlayabilirsiniz. Projenizin kaynaklarının geçmişte girintilendiği biçemi tam olarak yeniden oluşturmanın bir yolu olmayabilir; ancak yeni bir biçem için ayarları kullanarak yaklaşabilirsiniz; aşağıdaki iki resimde bir örnek gösterilmektedir.

source: With <guilabel>&kdevelop; 4.2.2</guilabel>, you can create a new style for a particular mimetype (&eg; for C++ header files) but this style does not show up among the list of possible styles for other mimetypes (&eg; for C++ source files) although it would of course be useful to use the same style for both kinds of files. You will therefore have to define the style twice, once for header and once for source files. This has been reported as <ulink url="https://bugs.kde.org/show_bug.cgi?id=272335">&kdevelop; bug 272335</ulink>.
tr: <guilabel>&kdevelop; 4.2.2</guilabel> ile belirli bir MIME türü için yeni bir biçem oluşturabilirsiniz (&eg; C++ başlık dosyaları için); ancak bu biçem diğer MIME türleri için olası biçemler listesinde görünmez (&eg; C++ kaynak dosyaları için); ancak elbette her iki dosya türü için de aynı biçemi kullanmak yararlı olacaktır. Bu nedenle, biçemi bir kez üstbilgi ve bir kez de kaynak dosyaları için olmak üzere iki kez tanımlamanız gerekecektir. Bu durum <ulink url="https://bugs.kde.org/show_bug.cgi?id=272335">272335 numaralı</ulink> hata raporunda bildirilmiştir.

source: Customizing keyboard shortcuts
tr: Klavye kısayollarını özelleştirmek

source: &kdevelop; has an almost boundless list of keyboard shortcuts (some of them are listed in the <quote>Useful keyboard shortcuts sections</quote> of several chapters in this manual) that can be changed to your taste through the menu <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Shortcuts</guimenuitem></menuchoice>. At the top of the dialog you can enter a searchword and it only shows those commands that match; you can then edit which key combination is bound to this command.
tr: &kdevelop;, <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Kısayolları Yapılandır</guimenuitem></menuchoice> menüsü aracılığıyla zevkinize göre değiştirebileceğiniz neredeyse sınırsız bir klavye kısayolları listesine sahiptir (bazıları bu kılavuzdaki çeşitli bölümlerin <quote>Kullanışlı klavye kısayolları</quote> bölümünde listelenmiştir). İletişim kutusunun üst kısmında bir arama sözcüğü girebilirsiniz ve yalnızca eşleşen komutları gösterir; daha sonra bu komuta hangi düğme kombinasyonunun bağlı olduğunu düzenleyebilirsiniz.

source: Two that have been found to be very useful to change are to set <guilabel>Align</guilabel> to the &Tab; key (many people don't usually enter tabs by hand and rather prefer if the editor chooses the layout of code; with the changed shortcut, hitting &Tab; makes &kdevelop; indent/outdent/align the code). The second one is putting <guilabel>Toggle Breakpoint</guilabel> on <keycombo>&Ctrl;<keycap>B</keycap></keycombo> since this is quite a frequent operation.
tr: Değiştirilmesi çok faydalı bulunan iki tanesi <guilabel>Hizala</guilabel> özelliğini &Tab; düğmesine ayarlamaktır (birçok kişi genellikle sekmeleri elle girmez ve düzenleyicinin kodun yerleşimini seçmesini tercih eder; değiştirilen kısayolla, &Tab; düğmesine basmak &kdevelop; kodunu girintili/çıkıntılı/hizalı hale getirir). İkincisi ise <keycombo>&Ctrl;<keycap>B</keycap></keycombo> üzerine <guilabel>Kesme Noktasını Aç/Kapat</guilabel> koymaktır; çünkü bu oldukça sık yapılan bir işlemdir.

source: Customizing code auto-completion
tr: Kodu kendiliğinden tamamlamayı özelleştirmek

source: Code completion is discussed in <link linkend="auto-completion">this manual's section on writing source code</link>. In &kdevelop;, it comes from two sources: the editor, and the parse engine. The editor (&kate;) is a component of the larger KDE environment and offers auto-completion based on words it has already seen in other parts of the same document. Such auto-completions can be identified in the tooltip by the icon that precedes it:
tr: Kod tamamlama <link linkend="auto-completion">bu kılavuzun kaynak kodu yazma bölümünde ele alınmıştır</link>. &kdevelop; yazılımında bu, iki kaynaktan gelir: Düzenleyici ve ayrıştırma işletkesi. Düzenleyici (&kate;) daha geniş KDE ortamının bir bileşenidir ve aynı belgenin diğer bölümlerinde daha önce gördüğü sözcüklere dayalı kendiliğinden tamamlama sunar. Bu tür kendiliğinden tamamlamalar araç ipucunda kendisinden önce gelen simge ile tanımlanabilir:

source: The editor's code completion can be customized via <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure Editor</guisubmenu><guimenuitem>Editing</guimenuitem><guimenuitem>Auto Completion</guimenuitem></menuchoice>. In particular, you can select how many characters you need to type in a word before auto-completion kicks in.
tr: Düzenleyicinin kod tamamlama özelliği <menuchoice><guimenu>Ayarlar</guimenu><guisubmenu>Düzenleyiciyi Yapılandır</guisubmenu><guimenuitem>Düzenleme</guimenuitem><guimenuitem>Kendiliğinden Tamamlama</guimenuitem></menuchoice> aracılığıyla özelleştirilebilir. Özellikle, kendiliğinden tamamlama devreye girmeden önce bir sözcükte kaç karakter yazmanız gerektiğini seçebilirsiniz.

source: On the other hand, &kdevelop;'s own auto-completion is much more powerful as it takes into account semantic information about the context. For example, it knows which member functions to offer when you type <varname>object.</varname>, &etc;, as shown here:
tr: Öte yandan, &kdevelop; yazılımının öz kendiliğinden tamamlaması, bağlamla ilgili anlamsal bilgileri dikkate aldığı için çok daha güçlüdür. Örneğin, burada gösterildiği gibi <varname>object.</varname>, &etc; yazdığınızda hangi üye işlevleri sunacağını bilir:

source: This context information comes from various language support plugins, which can be used after a given file has been saved (so it can check the filetype and use the correct language support).
tr: Bu bağlam bilgisi, belirli bir dosya kaydedildikten sonra kullanılabilen çeşitli dil desteği eklentilerinden gelir (böylece dosya türünü denetlenebilir ve doğru dil desteğini kullanabilir).

source: &kdevelop;'s completion is set to appear as you type, right away, pretty much everywhere that it could possibly complete something. This is configurable in <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure &kdevelop;</guisubmenu><guimenuitem>Language Support</guimenuitem></menuchoice>. If it isn't already set (as it should, by default), make sure <guilabel>Enable Automatic Invocation</guilabel> is set.
tr: &kdevelop; yazılımının tamamlanması, bir şeyi tamamlayabileceği hemen hemen her yerde, siz yazarken görünecek şekilde ayarlanmıştır. Bu, <menuchoice><guimenu>Ayarlar</guimenu><guisubmenu>&kdevelop; Uygulamasını Yapılandır</guisubmenu><guimenuitem>Dil Desteği</guimenuitem></menuchoice> içinde yapılandırılabilir. Halihazırda ayarlanmamışsa (öntanımlı olarak olması gerektiği gibi) <guilabel>Kendiliğinden Çağırmayı Etkinleştir</guilabel> seçeneğinin ayarlandığından emin olun.

source: &kdevelop; has two ways to show a completion: <guilabel>Minimal Automatic Completion</guilabel> shows just the basic information in completion tooltips (&ie; the namespace, class, function, or variable name). This will look similar to &kate; completion (except for the icons).
tr: &kdevelop; içinde bir tamamlamayı göstermenin iki yolu vardır: <guilabel>Minimal Kendiliğinden Tamamlama</guilabel> tamamlama araç ipuçlarında yalnızca temel bilgileri gösterir (&ie; ad alanı, sınıf, işlev veya değişken adı). Bu, &kate; tamamlamasına benzer görünecektir (simgeler dışında).

source: On the other hand, <guilabel>Full completion</guilabel> will additionally show the type for each entry, and in the case of functions, also the arguments they take. Also, if you are currently filling in the arguments to a function, full completion will have an additional info-box above the cursor that will show you the current argument you are working on.
tr: Öte yandan <guilabel>Tam Tamamlama</guilabel>, ek olarak her girdinin türünü ve işlevler söz konusu olduğunda aldıkları argümanları da gösterecektir. Ayrıca, o anda bir işlevin argümanlarını dolduruyorsanız tam tamamlama imlecin üzerinde üzerinde çalıştığınız geçerli argümanı gösteren ek bir bilgi kutusuna sahip olacaktır.

source: &kdevelop;'s code completion should also bring-to-top and highlight in green any completion items that match the currently expected type in both minimal and full completion, known as <quote>best-matches</quote>.
tr: &kdevelop; yazılımının kod tamamlaması ayrıca <quote>en iyi eşleşmeler</quote> olarak bilinen, hem minimal hem de tam tamamlamada o anda beklenen türle eşleşen tamamlama ögelerini en üste getirmeli ve yeşil renkle vurgulamalıdır.

source: The three possible choices for the completion level in the configuration dialog are:
tr: Yapılandırma iletişim kutusundaki tamamlama düzeyi için üç olası seçenek vardır:

source: <guilabel>Always minimal completion</guilabel>: Never show <quote>Full Completion</quote>
tr: <guilabel>Her zaman minimal tamamlama</guilabel>: Hiçbir zaman <quote>tam tamamlamayı</quote> gösterme

source: <guilabel>Minimal automatic completion</guilabel>: Only show <quote>Full Completion</quote> when auto-completion has been triggered manually (&ie;, whenever you hit <keycombo>&Ctrl;<keycap>Space</keycap></keycombo>)
tr: <guilabel>Minimal kendiliğinden tamamlama</guilabel>: <quote>Tam tamamlamayı</quote> yalnızca kendiliğinden tamamlama elle tetiklendiğinde göster (&ie;, <keycombo>&Ctrl;<keycap>Boşluk</keycap></keycombo> kombinasyonunu kullandığınızda)

source: <guilabel>Always full completion</guilabel>: Always show <quote>Full Completion</quote>
tr: <guilabel>Her zaman tam tamamlma</guilabel>: Her zaman <quote>tam tamamlamayı</quote> göster

source: Credits and License
tr: Emeği Geçenler ve Lisanslar

source: Documentation Copyright see the UserBase <ulink url="https://userbase.kde.org/index.php?title=KDevelop4/Manual&amp;action=history">KDevelop4/Manual page history</ulink>
tr: Belgelendirme telif hakkı için UserBase <ulink url="https://userbase.kde.org/index.php?title=KDevelop4/Manual&amp;action=history">KDevelop4/Kılavuz</ulink> sayfası geçmişine bakın.

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
