Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kdevelop.po
Languages: tr

source: Your project is now created, so you can try building or installing it. Some templates will include comments within the code, or even a separate README file, and it is recommended that you read those first. Then, you can start working on your project, by adding whatever features you want.
tr: Projeniz artık oluşturuldu, bu yüzden onu yapmayı veya kurmayı deneyebilirsiniz. Bazı şablonlar kod içinde yorumlar veya hatta ayrı bir README dosyası içerecektir ve bunları önce okumanız önerilir. Ardından, istediğiniz özellikleri ekleyerek projeniz üzerinde çalışmaya başlayabilirsiniz.

source: Working with source code
tr: Kaynak kodu ile çalışmak

source: Besides debugging, reading through and writing source code is what you will spend the most time with when developing software. To this end, &kdevelop; offers you many many different ways to explore source codes and to make writing it more productive. As discussed in more detail in the following sections, &kdevelop; is not just a source editor &mdash; rather, it is a source management system that gives you different views of extracted information on the files that collectively make up your session's source code.
tr: Hata ayıklamanın yanı sıra, kaynak kodunu okumak ve yazmak, yazılım geliştirirken en çok zaman harcayacağınız şeydir. Bu amaçla, &kdevelop; size kaynak kodlarını keşfetmeniz ve yazmayı daha üretken hale getirmeniz için birçok farklı yol sunar. Aşağıdaki bölümlerde daha ayrıntılı olarak açıklandığı üzere, &kdevelop; yalnızca bir kaynak düzenleyicisi değildir &mdash; bunun yerine, oturumunuzun kaynak kodunu toplu olarak oluşturan dosyalardaki çıkarılan bilgilerin farklı görünümlerini size sunan bir kaynak yönetim sistemidir.

source: Tools and views
tr: Araçlar ve görünümler

source: In order to work with projects, &kdevelop; has the concept of <emphasis>tools</emphasis>. A tool provides a particular view of the source, or an action that can be taken with it. Tools are represented by buttons around the perimeter of your window (in vertical text along the left and right margins, or horizontally along the bottom margin). If you click on them, they expand to a subwindow &mdash; a <emphasis>view</emphasis> &mdash; within the main window; if you click on the tool button again, the subwindow disappears again.
tr: Projelerle çalışmak için &kdevelop; <emphasis>araçlar</emphasis> kavramını kullanır. Bir araç, kaynağın belirli bir görünümünü veya onunla gerçekleştirilebilecek bir eylemi sağlar. Araçlar, pencerenizin çevresi etrafındaki düğmelerle temsil edilir (sol ve sağ kenar boşlukları boyunca dikey metinde veya alt kenar boşluğu boyunca yatay olarak). Üzerilerine tıklarsanız ana pencere içinde bir alt pencereye genişlerler, bir <emphasis>görünüm</emphasis> de diyebilirsiniz; araç düğmesine yeniden tıklarsanız alt pencere bir kez daha kaybolur.

source: To make a subwindow disappear, you can also click at the <guilabel>x</guilabel> at the top right of the subwindow
tr: Bir alt pencereyi yok etmek için alt pencerenin sağ üst köşesindeki <guilabel>x</guilabel> işaretine de tıklayabilirsiniz.

source: The picture above shows a particular selection of tools, aligned on the left and right margins; in the picture, the <guilabel>Classes</guilabel> tool is open on the left and the <guilabel>Snippets</guilabel> tool on the right, along with an editor for a source file in the middle. In practice, most of the time you will probably only have the editor and maybe the <guilabel>Classes</guilabel> or <guilabel>Code Browser</guilabel> tool open at the left. Other tool view will likely only be open temporarily as you use the tool, leaving more space for the editor most of the time.
tr: Yukarıdaki resimde, sol ve sağ kenarlara hizalanmış belirli bir araç seçimi gösterilmektedir; resimde, solda <guilabel>Sınıflar</guilabel> aracı, sağda <guilabel>Kod Parçacıkları</guilabel> aracı açıktır ve ortada bir kaynak dosyası düzenleyicisi vardır. Pratikte, çoğu zaman muhtemelen sadece düzenleyiciniz ve belki de <guilabel>Sınıflar</guilabel> veya <guilabel>Kod Tarayıcısı</guilabel> aracınız solda açık olacaktır. Diğer araç görünümü, büyük olasılıka aracı kullandığınızda yalnızca geçici olarak açık olacaktır ve bu da çoğu zaman düzenleyici için daha fazla alan bırakacaktır.

source: When you run &kdevelop; the first time, you should already have the <guilabel>Projects</guilabel> tool button. Click on it: it will open a subwindow that shows the projects you have added to the session at the bottom, and a file system view of the directories of your projects at the top.
tr: &kdevelop; yazılımını ilk kez çalıştırdığınızda, <guilabel>Projeler</guilabel> araç düğmesine halihazırda sahip olmalısınız. Üzerine tıklayın: Altta oturuma eklediğiniz projeleri gösteren bir alt pencere ve üstte projelerinizin dizinlerinin bir dosya sistemi görünümü açılacaktır.

source: There are many other tools you can use with &kdevelop;, not all of which are initially present as buttons on the perimeter. To add some, go to the <menuchoice><guimenu>Windows</guimenu><guimenuitem>Add tool view</guimenuitem></menuchoice> menu entry. Here are some that you will likely find useful:
tr: &kdevelop; ile kullanabileceğiniz birçok başka araç vardır; ancak bunların hepsi başlangıçta ortamda düğmeler olarak kullanılabilir değildir. Birkaç tane eklemek için <menuchoice><guimenu>Pencereler</guimenu><guimenuitem>Araç Görünümü Ekle</guimenuitem></menuchoice> menü girdisini kullanın. Aşağıda belki işinize yarayabilecek birkaç tanesini bulacaksınız:

source: <guilabel>Classes</guilabel>: A complete list of all classes that are defined in one of the projects or your session with all of their member functions and variables. Clicking on any of the members opens a source editor window at the location of the item you clicked on.
tr: <guilabel>Sınıflar</guilabel>: Projelerinizden birinde veya oturumunuzda tanımlanmış tüm sınıfların, tüm üye işlevleri ve değişkenleriyle birlikte tam listesi. Üyelerden herhangi birine tıklamak, tıkladığınız ögenin konumunda bir kaynak düzenleyicisi penceresi açar.

source: <guilabel>Documents</guilabel>: Lists some of the more recently visited files, by kind (&eg; source files, patch files, plain text documents).
tr: <guilabel>Belgeler</guilabel>: Son zamanlarda açılan dosyaların bazılarını türlerine göre listeler (örneğin kaynak, yama, düz metin dosyaları).

source: <guilabel>Code Browser</guilabel>: Depending on your cursor position in a file, this tool shows things that are related. For example, if you are on an <varname>#include</varname> line, it shows information about the file you are including such as what classes are declared in that file; if you are on an empty line at file scope, it shows the classes and functions declared and defined in the current file (all as links: clicking on them brings you to the point in the file where the declaration or definition actually is); if you are in a function definition, it shows where the declaration is and offers a list of places where the function is used.
tr: <guilabel>Kod Tarayıcısı</guilabel>: Dosyadaki imleç konumunuza bağlı olarak bu araç, ilişkili olan şeyleri gösterir. Örneğin, bir <varname>#include</varname> satırındaysanız içerdiğiniz dosya hakkında bilgi gösterir, örneğin o dosyada hangi sınıfların beyan edildiği gibi; dosya kapsamında boş bir satırdaysanız geçerli dosyada beyan edilen ve tanımlanan sınıfları ve işlevleri gösterir (tümünü bağlantı olarak; bunlara tıklamak sizi dosyada beyanın veya tanımın gerçekte bulunduğu noktaya götürür); bir işlev tanımındaysanız beyanın nerede olduğunu gösterir ve işlevin kullanıldığı yerlerin bir listesini sunar.

source: <guilabel>File system</guilabel>: Shows you a tree view of the file system.
tr: <guilabel>Dosya Sistemi</guilabel>: Dosya sisteminin ağaç görünümünü gösterir.

source: <guilabel>Documentation</guilabel>: Allows you to search for man pages and other help documents.
tr: <guilabel>Belgelendirme</guilabel>: Kılavuz sayfalarında ve diğer yardım belgelerinde arama yapmanıza olanak tanır.

source: <guilabel>Snippets</guilabel>: This provides sequences of text that one uses over an over and doesn't want to write every time. For example, in the project from which the picture above was created, there is a frequent need to write code like
tr: <guilabel>Kod Parçaları</guilabel>: Bu, sürekli yeniden kullanılan ve her kerede yazmak istemeyeceğiniz metin dizileri sağlar. Örneğin, yukarıdaki resmin oluşturulduğu projede, şöyle kod yazmaya sıklıkla gereksinim duyulur:

source: This is an awkward expression but it will look almost exactly like this every time you need such a loop &mdash; which would make it a good candidate for a snippet.
tr: Bu garip bir ifadedir; ancak böyle bir döngüye her gereksinim duyduğunuzda neredeyse tam olarak buna benzeyecektir &mdash; bu da onu bir kod parçası için iyi bir aday yapar.

source: <guilabel>Konsole</guilabel>: Opens a command line window inside &kdevelop;'s main window, for the occasional command you may want to enter (&eg; to run <varname>./configure</varname>).
tr: <guilabel>Konsol</guilabel>: Arada sırada girmek isteyebileceğiniz komutlar için &kdevelop; ana penceresinde bir komut satırı penceresi açar (örneğin <varname>./configure</varname> çalıştırmak için).

source: A complete list of tools and views is given <ulink url="https://userbase.kde.org/Special:myLanguage/KDevelop4/Manual/Tool list">here</ulink>.
tr: Araçların ve görünümlerin tam bir listesine <ulink url="https://userbase.kde.org/Special:myLanguage/KDevelop4/Manual/Tool list">buradan</ulink> ulaşabilirsiniz.

source: For many programmers, vertical screen space is the most important. To this end, you can arrange your tool views at the left and right margin of the window: to move a tool, click on its symbol with the right mouse button and select a new position for it.
tr: Birçok programcı için dikey ekran alanı en önemlisidir. Bu amaçla, araç görünümlerinizi pencerenin sol ve sağ kenarına yerleştirebilirsiniz: Bir aracı taşımak için sağ fare düğmesiyle sembolüne tıklayın ve yeni bir konum seçin.

source: Exploring source code
tr: Kaynak koda göz atmak

source: Local information
tr: Yerel bilgi

source: &kdevelop; <emphasis>understands</emphasis> source code, and as a consequence it is really good at providing you information about variables or functions that may appear in your program. For example, here is a snapshot of working with a piece of code and hovering the mouse over the symbol <varname>cell</varname> in line 1316 (if you are working keyboard oriented, you can achieve the same effect by holding down the &Alt; key for a while):
tr: &kdevelop; kaynak kodlarını <emphasis>anlar</emphasis> ve bunun bir sonucu olarak, programınızda olan değişkenler ve işlevler hakkında size bilgi sağlamada pek iyidir. Örneğin, bir kod parçasıyla çalışırken 1316. satırdaki <varname>cell</varname> simgesinin üzerine fareyi getirdiğinizde ne olacağını aşağıda görebilirsiniz (klavye odaklı çalışıyorsanız, &Alt; düğmesini bir süre basılı tutarak aynı etkiyi elde edebilirsiniz):

source: &kdevelop; shows me a tooltip that includes the type of the variable (here: <varname>DoFHandler&lt;dim&gt;active_cell_iterator</varname>), where this variable is declared (the <emphasis>container</emphasis>, which here is the surrounding function <varname>get_maximal_velocity</varname> since it is a local variable), what it is (a variable, not a function, class or namespace) and where it is declared (in line 1314, just a few lines up in the code).
tr: &kdevelop;, değişkenin türünü içeren bir araç ipucu, (burada: <varname>DoFHandler&lt;dim&gt;active_cell_iterator</varname>), bu değişkenin nerede beyan edildiğini, (<emphasis>kapsayıcısını</emphasis>, burada bu bir yerel değişken olduğundan kapsayan <varname>get_maximal_velocity</varname> işlevidir), ne olduğunu (bir değişken; bir işlev, sınıf veya ad alanı değil) ve nerede beyan edildiğini (az yukarıda, 1314. satırda) gösterir.

source: In the current context, the symbol over which the mouse was hovering has no associated documentation. In this example, had the mouse hovered over the symbol <varname>get_this_mpi_process</varname> in line 1318, the outcome would have been this:
tr: Geçerli bağlamda, farenin üzerinde gezindiği sembolün ilişkili bir belgelendirmesi yoktur. Bu örnekte fare, 1318. satırdaki <varname>get_this_mpi_process</varname> sembolünün üzerine gelseydi, sonuç şu olurdu:

source: Here, &kdevelop; has cross-referenced the declaration from an entirely different file (<filename>utilities.h</filename>, which in fact even resides in a different project of the same session) together with the doxygen-style comment that accompanies the declaration there.
tr: Burada &kdevelop;, tümüyle farklı bir dosyadaki (<filename>utilities.h</filename>, ki bu dosya aslında aynı oturumun farklı bir projesinde yer almaktadır) beyana, beyana eşlik eden doxygen tarzı yorumla birlikte çapraz başvurmuştur.

source: What makes these tooltips even more useful is that they are dynamic: I can click on the container to get information about the context in which the variable is declared (&ie; about the namespace <varname>System</varname>, such as where it is declared, defined, used, or what its documentation is) and I can click on the blue links that will reset the cursor position to the location of the declaration of the Symbol (&eg; in <varname>utilities.h</varname>, line 289) or give me a list of places where this symbol is used in the current file or throughout all the projects of the current session. The latter is often useful if you want to explore how, for example, a particular function is used in a large code basis.
tr: Bu araç ipuçlarını daha da kullanışlı kılan şey devingen olmalarıdır: Değişkenin beyan edildiği bağlam hakkında bilgi almak için kapsayıcıya tıklayabilirim (&ie; <varname>Sistem</varname> ad alanı; örneğin nerede beyan edildiği, kullanıldığı veya belgelendirmesinin nerede olduğu hakkında) ve imleç konumunu sembolün beyan edildiği konuma sıfırlayacak mavi bağlantılara tıklayabilirim (örneğin, <varname>utilities.h</varname>, 289. satır) veya bana bu sembolün geçerli dosyada veya geçerli oturumun tüm projelerinde kullanıldığı yerlerin bir listesini alabilirim. İkincisi örneğin, belirli bir işlevin büyük bir kod tabanında nasıl kullanıldığını keşfetmek istiyorsanız genellikle yararlıdır.

source: The information in a tooltip is fleeting &mdash; it depends on you holding the &Alt; key down or hovering your mouse. If you want a more permanent place for it, open the <guilabel>Code Browser</guilabel> tool view in one of the sub-windows. For example, here the cursor is on the same function as in the example above, and the tool view on the left presents the same kind of information as in the tooltip before:
tr: Bir araç ipucundaki bilgiler geçicidir &mdash; &Alt; düğmesine basılı tutmanıza veya farenizi üzerinde gezdirmenize bağlıdır. Bunun için daha kalıcı bir yer istiyorsanız alt pencerelerden birinde <guilabel>Kod Tarayıcısı</guilabel> araç görünümünü açın. Örneğin, burada imleç yukarıdaki örnektekiyle aynı işlevin üzerindedir ve soldaki araç görünümü, önceki araç ipucundakiyle aynı türde bilgileri sunar:

source: Moving the cursor around on the right changes the information presented on the left. What's more, clicking on the <guilabel>Lock current view</guilabel> button at the top right allows you to lock this information, making it independent of the cursor movement while you explore the information presented there.
tr: İmleci sağda hareket ettirmek, solda sunulan bilgileri değiştirir. Dahası, sağ üstteki <guilabel>Geçerli Görünümü Kilitle</guilabel> düğmesine tıklamak, bu bilgileri kilitlemenizi ve orada sunulan bilgileri incelerken imleç hareketinden bağımsız hale getirmenizi sağlar.

source: This sort of context information is available in many other places in &kdevelop;, not just in the source editor. For example, holding down the &Alt; key in a completion list (&eg; when doing a quick-open) also yields context information about the current symbol.
tr: Bu tür bağlam bilgileri &kdevelop; yazılımında yalnızca kaynak düzenleyicisinde değil, birçok başka yerde de bulunur. Örneğin, bir tamamlama listesinde &Alt; düğmesine basılı tutmak (&eg; tez aç yaparken) geçerli sembol hakkındaki bağlam bilgilerini de verir.

source: File scope information
tr: Dosya kapsamı bilgisi

source: The next level up is to obtain information about the entire source file you are currently working on. To this end, position the cursor at file scope in the current file and look at the what the <guilabel>Code Browser</guilabel> tool view shows:
tr: Bir sonraki düzey, şu anda üzerinde çalıştığınız tüm kaynak dosyası hakkında bilgi edinmektir. Bu amaçla, imleci geçerli dosyadaki dosya kapsamına yerleştirin ve <guilabel>Kod Tarayıcısı</guilabel> aracının görünümünün ne gösterdiğine bakın:

source: Here, it shows a list of namespaces, classes and functions declared or defined in the current file, giving you an overview of what's happening in this file and a means to jump directly to any of these declarations or definitions without scrolling up and down in the file or searching for a particular symbol.
tr: Burada, geçerli dosyada bildirilen veya beyan edilen ad alanlarının, sınıfların ve işlevlerin bir listesi gösterilir ve bu dosyada neler olup bittiğine dair genel bir bakış sunulur ve dosyada yukarı aşağı sarma yapmadan veya belirli bir sembolü aramadan doğrudan bu beyanlardan veya tanımlardan herhangi birine gitmenize olanak tanır.

source: The information shown for file scope is the same as presented in the <quote>Outline</quote> mode discussed below for navigating source code; the difference is that outline mode is only a temporary tooltip.
tr: Dosya kapsamı için gösterilen bilgiler, aşağıda kaynak kodunda gezinme konusunda açıklanan <quote>Ana Hat</quote> kipinde sunulan bilgilerle aynıdır; fark, ana hat kipinin yalnızca geçici bir araç ipucu olmasıdır.

source: Project and session scope information
tr: Proje ve oturum kapsamı bilgisi

source: There are many ways to obtain information about an entire project (or, in fact, about all projects in a session). This sort of information is typically provided through various tool views. For example, the <guilabel>Classes</guilabel> tool view provides a tree structure of all classes and surrounding namespaces for all projects in a session, together with the member functions and variables of each of these classes:
tr: Bir projenin tümü (veya aslında bir oturumdaki tüm projeler) hakkında bilgi edinmenin birçok yolu vardır. Bu tür bilgiler genellikle çeşitli araç görünümleri aracılığıyla sağlanır. Örneğin, <guilabel>Sınıflar</guilabel> araç görünümü, bir oturumdaki tüm projeler için tüm sınıfların ve çevreleyen ad alanlarının bir ağaç yapısını, bu sınıfların her birinin üye işlevleri ve değişkenleriyle birlikte sağlar:

source: Hovering over an entry provides again information about the symbol, its location of declaration and definition, and its uses. Double-clicking on an entry in this tree view opens an editor window at the location where the symbol is declared or defined.
tr: Bir girdinin üzerine gelindiğinde sembol, beyan ve tanım konumu ve kullanımları hakkında yeniden bilgi sağlanır. Bu ağaç görünümünde bir girdiye çift tıklandığında sembolün beyan edildiği veya tanımlandığı konumda bir düzenleyici penceresi açılır.

source: But there are other ways of looking at global information. For example, the <guilabel>Documents</guilabel> tool provides a view of a project in terms of the kinds of files or other documents this project is comprised of:
tr: Ancak global bilgilere bakmanın başka yolları da vardır. Örneğin, <guilabel>Belgeler</guilabel> aracı, bir projenin, bu projenin hangi tür dosyalardan veya diğer belgelerden oluştuğu açısından bir görünüm sağlar:

source: Rainbow color highlighting explained
tr: Gökkuşağı renkli vurgulamanın açıklaması

source: <application>KDevelop</application> uses a variety of colors to highlight different objects in source code. If you know what the different colors mean, you can very quickly extract a lot of information from source code just by looking at the colors, without reading a single character. The highlighting rules are as follows:
tr: <application>K Geliştir</application>, kaynak kodundaki farklı nesneleri vurgulamak için çeşitli renkler kullanır. Farklı renklerin ne anlama geldiğini biliyorsanız tek bir karakter okumadan, yalnızca renklere bakarak kaynak kodundan tez çok fazla bilgi çıkarabilirsiniz. Vurgulama kuralları aşağıdaki gibidir:

source: Objects of type Class / Struct, Enum (the values and the type), (global) functions, and class members each have their own color assigned (classes are green, enums are dark red, and members are dark yellow or violet, (global) functions are always violet).
tr: Sınıf/Yapı türündeki nesnelerin, enümerasyonların (değerler ve tür), (global) işlevlerin ve sınıf üyelerinin her birinin kendine ait bir rengi vardır (sınıflar yeşil, enümerasyonlar koyu kırmızı ve üyeler koyu sarı veya mor, (global) işlevler her zaman mor renktedir).

source: All global variables are colored in dark green.
tr: Tüm global değişkenler koyu yeşil renkle gösterilir.

source: Identifiers which are typedefs for another type are colored in teal.
tr: Başka bir türün tür tanımı olan tanımlayıcılar mavi–yeşil renktedir.

source: All declarations and definitions of objects are in bold.
tr: Nesnelerin tüm beyanları ve tanımları kalın yazıyla gösterilmiştir.

source: If a member is accessed from within the context where it is defined (base or derived class) it appears in yellow, otherwise it appears in violet.
tr: Bir üyeye tanımlandığı bağlamın (temel veya türetilmiş sınıf) içinden erişiliyorsa üye sarı renkte, aksi takdirde mor renkte görünür.

source: If a member is private or protected, it gets colored in a slightly darker color when used.
tr: Eğer bir üye özel veya korumalı ise kullanıldığında biraz daha koyu bir renge bürünür.

source: For variables local to a function body scope, rainbow colors are picked based on a hash of the identifier. This includes the parameters to the function. An identifier always will have the same color within its scope (but the same identifier will get a different color if it represents a different object, &ie; if it is redefined in a more nested scope), and you will usually get the same color for the same identifier name in different scopes. Thus, if you have multiple functions taking parameters with the same names, the arguments will all look the same color-wise. These rainbow colors can be turned off separately from the global coloring in the settings dialog.
tr: Bir işlev gövdesi kapsamına yerel değişkenler için gökkuşağı renkleri tanımlayıcının bir karmasına göre seçilir. Bu, işleve ait parametreleri içerir. Bir tanımlayıcı, kapsamı içinde her zaman aynı renge sahip olacaktır (ancak aynı tanımlayıcı, farklı bir nesneyi temsil ediyorsa yani daha iç içe geçmiş bir kapsamda yeniden tanımlanıyorsa farklı bir renk alacaktır) ve genellikle farklı kapsamlarda aynı tanımlayıcı adı için aynı rengi alırsınız. Bu nedenle, aynı adlara sahip parametreler alan birden fazla işleviniz varsa argümanların hepsi aynı renk açısından görünecektir. Bu gökkuşağı renkleri, ayarlar iletişim kutusundaki global renklendirmeden ayrı olarak kapatılabilir.

source: Identifiers for which &kdevelop; could not determine the corresponding declaration are colored in white. This can sometimes be caused by missing <varname>#include</varname> directives.
tr: &kdevelop; yazılımının karşılık gelen beyanı belirleyemediği tanımlayıcılar beyaz renkle gösterilir. Bu bazen eksik <varname>#include</varname> yönergelerinden kaynaklanabilir.
