Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kdevelop.po
Languages: tr

source: Once you have built a program, you will want to run it. To do this, need to configure <emphasis>Launches</emphasis> for your projects. A <emphasis>Launch</emphasis> consists of the name of an executable, a set of command line parameters, and an execution environment (such as <quote>run this program in a shell</quote>, or <quote>run this program in the debugger</quote>).
tr: Bir program yaptıktan sonra, onu çalıştırmak isteyeceksiniz. Bunu yapmak üzere projeleriniz için <emphasis>Başlatmalar</emphasis> seçeneğini yapılandırmanız gerekir. Bir <emphasis>Başlat</emphasis>, bir yürütülebilir dosyanın adı, bir dizi komut satırı parametresi ve bir yürütme ortamından (<quote>bu programı bir kabukta çalıştır</quote> veya <quote>bu programı hata ayıklayıcısında çalıştır</quote> gibi) oluşur.

source: Setting up launches in &kdevelop;
tr: &kdevelop; içinde başlatmaları ayarlamak

source: To set this up go to menu item <menuchoice><guimenu>Run</guimenu><guimenuitem>Configure launches</guimenuitem></menuchoice>, highlight the project you want to add a launch for, and click on the <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject> button. Then enter the name of the executable, and the path where you want to run the program. If running the executable depends on building the executable and/or other libraries first, then you may want to add them to the list at the bottom: select <guilabel>Build</guilabel> from the dropdown menu, then hit the <inlinemediaobject> <imageobject> <imagedata fileref="Icon-folder.png" format="PNG"/> </imageobject> </inlinemediaobject> symbol to the right of the textbox and select whatever target you want to have built. In the example above, I have selected the target <guilabel>all</guilabel> from project <replaceable>1.deal.II</replaceable> and <replaceable>step-32</replaceable> from project <replaceable>1.step-32</replaceable> to make sure both the base library and the application program have been compiled and are up to date before the program is actually executed. While you're there, you may as well also configure a debug launch by clicking on the <guilabel>Debug</guilabel> symbol and adding the name of the debugger program; if this is the system's default debugger (&eg; <application>gdb</application> on &Linux;), then you don't need to do this step.
tr: Bunu ayarlamak için <menuchoice><guimenu>Çalıştır</guimenu><guimenuitem>Başlatmaları Yapılandır</guimenuitem></menuchoice> menü ögesine gidin, başlatma eklemek istediğiniz projeyi vurgulayın ve <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject> düğmesine tıklayın. Ardından yürütülebilir dosyanın adını ve programı çalıştırmak istediğiniz yolu girin. Yürütülebilir dosyanın çalıştırılması önce yürütülebilir dosyanın ve/veya diğer kitaplıklarıtn yapılmasına bağlıysa bunları alttaki listeye eklemek isteyebilirsiniz: Açılır menüden <guilabel>Yap</guilabel> ögesini seçin, ardından metin kutusunun sağındaki <inlinemediaobject> <imageobject> <imagedata fileref="Icon-folder.png" format="PNG"/> </imageobject> </inlinemediaobject> simgesine basın ve yapılmasını istediğiniz hedefi seçin. Yukarıdaki örnekte, program gerçekten çalıştırılmadan önce hem temel kitaplığın hem de uygulama programının derlendiğinden ve güncel olduğundan emin olmak için <replaceable>1.deal.II</replaceable> projesinden <guilabel>tümü</guilabel> ve <replaceable>1.step-32</replaceable> projesinden <replaceable>step-32</replaceable> hedeflerini seçtim. Hazır oradayken, <guilabel>Hata Ayıkla</guilabel> sembolüne tıklayarak ve hata ayıklayıcısı programın adını ekleyerek bir hata ayıklama başlatması da yapılandırabilirsiniz; bu sistemin öntanımlı hata ayıklayıcısıysa (&eg; &Linux; üzerinde <application>gdb</application>), bu adımı atmanıza gerek yoktur.

source: You can now try to run the program: Select <menuchoice><guimenu>Run</guimenu><guimenuitem>Execute Launch</guimenuitem></menuchoice> from &kdevelop;'s main window menu (or hit <keycombo>&Shift;<keycap>F9</keycap></keycombo>) and your program should run in a separate subwindow of &kdevelop;. The picture above shows the result: The new <guilabel>Run</guilabel> tool subwindow at the bottom shows the output of the program that is being run, in this case of the <replaceable>step-32</replaceable> program.
tr: Şimdi programı çalıştırmayı deneyebilirsiniz: &kdevelop; yazılımının ana pencere menüsünden <menuchoice><guimenu>Çalıştır</guimenu><guimenuitem>Başlatmayı Yürüt</guimenuitem></menuchoice> seçeneğini seçin (veya <keycombo>&Shift;<keycap>F9</keycap></keycombo>) ve programınız &kdevelop; içindeki ayrı bir alt pencerede çalışacaktır. Yukarıdaki resim sonucu gösterir: Yeni <guilabel>Çalıştır</guilabel> araç alt penceresi, çalıştırılan programın çıktısını (bu durumda <replaceable>step-32</replaceable>) gösterir.

source: If you have configured multiple launches, you can choose which one should run when you hit <keycombo>&Shift;<keycap>F9</keycap></keycombo> by going to <menuchoice><guimenu>Run</guimenu><guimenuitem>Current Launch Configuration</guimenuitem></menuchoice>. There is a non-obvious way to edit the name of a configuration, however: in the dialog box you get when you select <menuchoice><guimenu>Run</guimenu><guimenuitem>Current Launch Configuration</guimenuitem></menuchoice>, double-click on the name of the configuration in the tree view on the left, which will allow you to edit the configuration's name.
tr: Birden fazla başlatma yapılandırdıysanız <keycombo>&Shift;<keycap>F9</keycap></keycombo> düğmesine bastığınızda hangisinin çalışacağını <menuchoice><guimenu>Çalıştır</guimenu><guimenuitem>Geçerli Başlatma Yapılandırması</guimenuitem></menuchoice> seçeneğine giderek seçebilirsiniz. Bununla birlikte, bir yapılandırmanın adını düzenlemenin açık olmayan bir yolu vardır: <menuchoice><guimenu>Çalıştır</guimenu><guimenuitem>Geçerli Başlatma Yapılandırması</guimenuitem></menuchoice> ögesini seçtiğinizde aldığınız iletişim kutusunda, soldaki ağaç görünümünde yapılandırmanın adına çift tıklayın, bu da yapılandırmanın adını düzenlemenize olanak tanır.

source: Running a program
tr: Bir program çalıştırmak

source: Build (call make)
tr: Yap (make programını çağır)

source: <entry>Run</entry>
tr: <entry>Çalıştır</entry>

source: Run program in the debugger; you may want to set breakpoints beforehand, for example by right-clicking with the mouse on a particular line in the source code
tr: Programı hata ayıklayıcısında çalıştırın; önceden kesme noktaları ayarlamak isteyebilirsiniz; örneğin kaynak koddaki belirli bir satıra fareyle sağ tıklayarak.

source: Debugging programs in &kdevelop;
tr: &kdevelop; içinde programlarda hata ayıklamak

source: Running a program in the debugger
tr: Bir programı hata ayıklayıcısında çalıştırmak

source: Once you have a launch configured (see <link linkend="running-programs-in-kdevelop">Running programs</link>), you can also run it in a debugger: Select the menu item <menuchoice><guimenu>Run</guimenu><guimenuitem>Debug Launch</guimenuitem></menuchoice>, or hit <keycombo>&Alt;<keycap>F9</keycap></keycombo>. If you are familiar with <application>gdb</application>, the effect is the same as starting <application>gdb</application> with the executable specified in the launch configuration and then saying <varname>Run</varname>. This means that if the program calls <varname>abort()</varname> somewhere (&eg; when you run onto a failing assertion) or if there is a segmentation fault, then the debugger will stop. On the other hand, if the program runs to the end (with or without doing the right thing) then the debugger will not stop by itself before the program is finished. In the latter case, you will want to set a breakpoint on all those lines of your code base where you want the debugger to stop before you run the debug launch. You can do that by moving the cursor on such a line and selecting the menu item <menuchoice><guimenu>Run</guimenu><guimenuitem>Toggle breakpoint</guimenuitem></menuchoice>, or right-clicking on a line and selecting <guilabel>Toggle Breakpoint</guilabel> from the context menu.
tr: Bir başlatmayı yapılandırdığınızda (bkz. <link linkend="running-programs-in-kdevelop">Programlar Çalıştırmak</link>), aynı zamanda onu bir hata ayıklayıcısında da çalıştırabilirsiniz: <menuchoice><guimenu>Çalıştır</guimenu><guimenuitem>Başlatma Hatalarını Ayıkla</guimenuitem></menuchoice> seçin veya <keycombo>&Alt;<keycap>F9</keycap></keycombo> kısayolunu kullanın. <application>gdb</application> uygulamasına aşinaysanız bu, <application>gdb</application> uygulamasını yapılandırmada belirtilen yürütülebilirle başlatmakla ve <varname>Çalıştır</varname> yapmakla aynı şeydir. Bu, program bir yerde <varname>abort()</varname> çağrısı yaparsa (&eg; başarısız bir doğrulamaya denk gelirseniz) veya bir segmentasyon hatası varsa hata ayıklayıcısının duracağı anlamına gelir. Öte yandan, program sonuna kadar çalışırsa (doğru şeyi yaparak veya yapmadan), hata ayıklayıcı program bitmeden kendi kendine durmayacaktır. İkinci durumda, hata ayıklama başlatmasını çalıştırmadan önce hata ayıklayıcısının durmasını istediğiniz kod tabanınızın tüm satırlarında bir kesme noktası ayarlamak isteyeceksiniz. Bunu, imleci böyle bir satırın üzerine getirip <menuchoice><guimenu>Çalıştır</guimenu><guimenuitem>Kesme Noktasını Aç/Kapat</guimenuitem></menuchoice> menü ögesini seçerek veya bir satıra sağ tıklayıp bağlam menüsünden <guilabel>Kesme Noktasını Aç/Kapat</guilabel> ile yapabilirsiniz.

source: Running a program in the debugger will put &kdevelop; in a different mode: it will replace all the <quote>Tool</quote> buttons on the perimeter of the main window by ones that are appropriate for debugging, rather than for editing. You can see which of the mode you are in by looking at the top right of the window: there are tabs named <guilabel>Review</guilabel>, <guilabel>Debug</guilabel>, and <guilabel>Code</guilabel>; clicking on them allows you to switch back and forth between the three modes; each mode has a set of tool views of its own, which you can configure in the same way as we configured the <guilabel>Code</guilabel> tools in the section <link linkend="tools-and-views">Tools and views</link>.
tr: Bir programı hata ayıklayıcısında çalıştırmak &kdevelop; yazılımını farklı bir kipe sokacaktır: Ana pencerenin çevresindeki tüm <quote>Araç</quote> düğmelerini düzenleme kipi yerine hata ayıklama için uygun olanlarla değiştirecektir. Pencerenin sağ üst kısmına bakarak hangi kipte olduğunuzu görebilirsiniz: <guilabel>Gözden Geçir</guilabel>, <guilabel>Hata Ayıkla</guilabel> ve <guilabel>Kod</guilabel> adında sekmeler vardır; bunlara tıklamak üç kip arasında geçiş yapmanızı sağlar; her kipin kendine ait bir dizi araç görünümü vardır ve bunları <link linkend="tools-and-views">Araçlar ve Görünümler</link> bölümünde <guilabel>Kod</guilabel> araçlarını yapılandırdığımız şekilde yapılandırabilirsiniz.

source: Once the debugger stops (at a breakpoint, or a point where <varname>abort()</varname> is called) you can inspect a variety of information about your program. For example, in the image above, we have selected the <guilabel>Frame Stack</guilabel> tool at the bottom (roughly equivalent to <application>gdb</application>'s <quote>backtrace</quote> and <quote>info threads</quote> commands) that shows the various threads that are currently running in your program at the left (here a total of 8) and how execution got to the current stopping point at the right (here: <varname>main()</varname> called <varname>run()</varname>; the list would be longer had we stopped in a function called by <varname>run()</varname> itself). On the left, we can inspect local variables including the current object (the object pointed to by the <varname>this</varname> variable).
tr: Hata ayıklayıcısı durduğunda (bir kesme noktasında veya <varname>abort()</varname> yönteminin çağrıldığı bir noktada) programınız hakkında çeşitli bilgileri inceleyebilirsiniz. Örneğin, yukarıdaki resimde, altta <guilabel>Çerçeve Yığını</guilabel> aracını seçtik (kabaca <application>gdb</application> uygulamasının <quote>backtrace</quote> ve <quote>info threads</quote> komutlarına eşdeğerdir), bu araç solda programınızda o anda çalışmakta olan çeşitli iş parçacıklarını (burada toplam 8) ve sağda yürütmenin geçerli durma noktasına nasıl geldiğini gösterir (burada: <varname>main()</varname> <varname>run()</varname> yöntemini çağırdı; <varname>run()</varname> yönteminin kendisi tarafından çağrılan bir işlevde dursaydık liste daha uzun olurdu). Sol tarafta, geçerli nesne (<varname>this</varname> değişkeninin işaret ettiği nesne) dahil olmak üzere yerel değişkenleri inceleyebiliriz.

source: From here, there are various possibilities you can do: You can execute the current line (<keycap>F10</keycap>, <application>gdb</application>'s <quote>next</quote> command), step into the functions (<keycap>F11</keycap>, <application>gdb</application>'s <quote>step</quote> command), or run to the end of the function (<keycap>F12</keycap>, <application>gdb</application>'s <quote>finish</quote> command). At every stage, &kdevelop; updates the variables shown at the left to their current values. You can also hover the mouse over a symbol in your code, &eg; a variable; &kdevelop; will then show the current value of that symbol and offer to stop the program during execution the next time this variable's value changes. If you know <application>gdb</application>, you can also click on the <guilabel>GDB</guilabel> tool button at the bottom and have the possibility to enter <application>gdb</application> commands, for example in order to change the value of a variable (for which there doesn't currently seem to be another way).
tr: Buradan itibaren yapabileceğiniz çeşitli olasılıklar vardır: Geçerli satırı yürütebilir (<keycap>F10</keycap>, <application>gdb</application> uygulamasının <quote>next</quote> komutu), işlevlere adım atabilir (<keycap>F11</keycap>, <application>gdb</application> uygulamasının <quote>step</quote> komutu) veya işlevi sonuna kadar çalıştırabilirsiniz (<keycap>F12</keycap>, <application>gdb</application> uygulamasının <quote>finish</quote> komutu). Her aşamada, &kdevelop; solda gösterilen değişkenleri geçerli değerlerine günceller. Ayrıca fareyi kodunuzdaki bir sembolün üzerine getirebilirsiniz, &eg; bir değişken; &kdevelop; daha sonra bu sembolün geçerli değerini gösterecek ve bu değişkenin değeri bir dahaki zamnda değiştiğinde programı yürütme sırasında durdurmayı teklif edecektir. Eğer <application>gdb</application> biliyorsanız alttaki <guilabel>GDB</guilabel> araç düğmesine de tıklayabilir ve örneğin bir değişkenin değerini değiştirmek için <application>gdb</application> komutlarını girme olanağına sahip olabilirsiniz (bunun için şu anda başka bir yol yok gibi görünüyor).

source: Attaching the debugger to a running process
tr: Hata ayıklayıcısını çalışan bir sürece iliştirmek

source: Sometimes, one wants to debug a program that's already running. One scenario for this is debugging parallel programs using <ulink url="https://computing.llnl.gov/tutorials/mpi/">MPI</ulink>, or for debugging a long running background process. To do this, go to the menu entry <menuchoice><guimenu>Run</guimenu><guimenuitem>Attach to Process</guimenuitem></menuchoice>, which will open a window like the one above. You will want to select the program that matches your currently open project in &kdevelop; - in my case that would be the step-32 program.
tr: Bazen, halihazırda çalışmakta olan bir programda hata ayıklamak istenebilir. Bunun için bir senaryo, <ulink url="https://computing.llnl.gov/tutorials/mpi/">MPI</ulink> kullanarak paralel programlarda hata ayıklamak veya uzun süredir çalışan bir arka plan işleminde hata ayıklamaktır. Bunu yapmak için <menuchoice><guimenu>Çalıştır</guimenu><guimenuitem>Sürece İliştir</guimenuitem></menuchoice> menü girdisine gidin, bu da yukarıdaki gibi bir pencere açacaktır. Şu anda &kdevelop; içinde açık olan projenizle eşleşen programı seçmek isteyeceksiniz — benim durumumda bu step-32 programı olacaktır.

source: This list of programs can be confusing because it is often long as in the case shown here. You can make your life a bit easier by going to the dropdown box at the top right of the window. The default value is <guilabel>User processes</guilabel>, &ie; all programs that are run by any of the users currently logged into this machine (if this is your desktop or laptop, you're probably the only such user, apart from root and various service accounts); the list doesn't include processes run by the root user, however. You can limit the list by either choosing <guilabel>Own processes</guilabel>, removing all the programs run by other users. Or better still: Select <guilabel>Programs only</guilabel>, which removes a lot of processes that are formally running under your name but that you don't usually interact with, such as the window manager, background tasks and so on that are unlikely candidates for debugging.
tr: Bu program listesi kafa karıştırıcı olabilir; çünkü burada gösterilen durumda olduğu gibi genellikle uzundur. Pencerenin sağ üst köşesindeki açılır kutuya giderek hayatınızı biraz daha kolaylaştırabilirsiniz. Öntanımlı değer <guilabel>Kullanıcı Süreçleri</guilabel>, &ie; bu makinede oturum açmış olan herhangi bir kullanıcı tarafından çalıştırılan tüm programlar (bu sizin masaüstü veya dizüstü bilgisayarınızsa, root ve çeşitli hizmet hesapları dışında büyük olasılıkla tek kullanıcı sizsiniz); ancak liste root kullanıcısı tarafından çalıştırılan süreçleri içermez. <guilabel>Öz Süreçler</guilabel> seçeneğini seçerek listeyi sınırlayabilir ve diğer kullanıcılar tarafından çalıştırılan tüm programları kaldırabilirsiniz. Ya da daha iyisi: <guilabel>Yalnızca Programlar</guilabel> seçeneğini seçerek resmi olarak sizin adınız altında çalışan; ancak pencere yöneticisi, arka plan görevleri gibi genellikle etkileşimde bulunmadığınız ve hata ayıklama için olası adaylar olmayan birçok işlemi kaldırabilirsiniz.

source: Once you have selected a process, attaching to it will get you into &kdevelop;'s debug mode, open all the usual debugger tool views and stop the program at the position where it happened to be when you attached to it. You may then want to set breakpoints, viewpoints, or whatever else is necessary and continue program execution by going to the menu item <menuchoice><guimenu>Run</guimenu><guimenuitem>Continue</guimenuitem></menuchoice>.
tr: Bir süreci seçtikten sonra, ona bağlanmak sizi &kdevelop; uygulamasının hata ayıklama kipine sokacak, tüm olağan hata ayıklayıcısı araç görünümlerini açacak ve programı ona bağlandığınızda olduğu konumda durduracaktır. Daha sonra kesme noktaları, görünüm noktaları ya da gerekli olan her şeyi ayarlamak ve <menuchoice><guimenu>Çalıştır</guimenu><guimenuitem>Sürdür</guimenuitem></menuchoice> menü ögesine giderek programı yürütmeyı sürdürmek isteyebilirsiniz.

source: Debugging
tr: Hata ayıklamak

source: Step over (gdb's <quote>next</quote>)
tr: Üzerinden atla (gdb’nin <quote>next</quote> işlevi)

source: Step into (gdb's <quote>step</quote>)
tr: İçeri adım (gdb’nin <quote>step</quote> işlevi)

source: Step out of (gdb's <quote>finish</quote>)
tr: Dışarı adım (gdb’s <quote>finish</quote> işlevi)

source: Working with version control systems
tr: Sürüm denetim sistemi ile çalışmak

source: If you are working with larger projects, chances are that the source code is managed by a version control system such as <ulink url="https://subversion.apache.org/">subversion</ulink> or <ulink url="https://git-scm.com/">git</ulink>. The following description is written with <guilabel>subversion</guilabel> in view but will be equally true if you use <guilabel>git</guilabel> or any other supported version control system.
tr: Daha büyük projelerle çalışıyorsanız kaynak kodun <ulink url="https://subversion.apache.org/">subversion</ulink> veya <ulink url="https://git-scm.com/">git</ulink> gibi bir sürüm denetim sistemi tarafından yönetiliyor olması olasıdır. Aşağıdaki açıklama <guilabel>subversion</guilabel> göz önünde bulundurularak yazılmıştır; ancak <guilabel>git</guilabel> veya desteklenen başka bir sürüm denetim sistemi kullanıyorsanız da aynı şekilde geçerli olacaktır.

source: First not that if the directory in which a project is located is under version control, &kdevelop; will automatically notice. In other words: It is not necessary that you tell &kdevelop; to check out a copy itself when setting up your project; it is ok to point &kdevelop; at a directory into which you have previously checked out a copy from the repository. If you have such a directory under version control, open the <guilabel>Projects</guilabel> tool view. There are then a number of things you can do:
tr: İlk olarak, bir projenin bulunduğu dizin sürüm denetimi altındaysa &kdevelop; bunu kendiliğinden fark edecektir. Başka bir deyişle: Projenizi kurarken &kdevelop; uygulamasına bir kopyasını kendisinin denetlemesini söylemenize gerek yoktur; &kdevelop; uygulamasını daha önce depodan bir kopyasını çıkış yaptığınız bir dizine yönlendirmenizde bir sakınca yoktur. Sürüm denetimi altında böyle bir dizininiz varsa <guilabel>Projeler</guilabel> araç görünümünü açın. Daha sonra yapabileceğiniz birkaç şey vardır:

source: If your directory has become outdated, you can update it from the repository: Click on the project name with the right mouse button, go to the menu <guilabel>Subversion</guilabel> and select <guilabel>Update</guilabel>. This will bring all files that belong to this project up to date with respect to the repository.
tr: Dizininiz güncelliğini yitirmişse depodan güncelleyebilirsiniz: Farenin sağ düğmesiyle proje adına tıklayın, <guilabel>Subversion</guilabel> menüsüne gidin ve <guilabel>Güncelle</guilabel> seçeneğini seçin. Bu, bu projeye ait tüm dosyaları depoya göre güncel hale getirecektir

source: If you want to restrict this action to individual subdirectories or files, then expand the tree view of this project to the level you want and right click on a subdirectory or file name, then do the same as above.
tr: Bu eylemi tek tek alt dizinlerle veya dosyalarla sınırlamak istiyorsanız bu projenin ağaç görünümünü istediğiniz düzeye genişletin ve bir alt dizine veya dosya adına sağ tıklayın, ardından yukarıdaki işlemin aynısını yapın.

source: If you've edited one or more files, expand the view of this project to the directory in which these files are located and right click on the directory. This gives you a menu item <guilabel>Subversion</guilabel> that offers you different choices. Choose <guilabel>Compare to base</guilabel> to see the differences between the version you have edited and the version in the repository you had previously checked out (the revision <quote>base</quote>). The resulting view will show the <quote>diffs</quote> for all files in this directory.
tr: Bir veya daha fazla dosyayı düzenlediyseniz bu projenin görünümünü bu dosyaların bulunduğu dizine genişletin ve dizine sağ tıklayın. Bu size farklı seçenekler sunan <guilabel>Subversion</guilabel> menü ögesini verir. Düzenlediğiniz sürüm ile daha önce çıkış yaptığınız depodaki sürüm (<quote>base</quote> revizyonu) arasındaki farkları görmek için <guilabel>Taban ile Karşılaştır</guilabel> ögesini seçin. Ortaya çıkan görünüm bu dizindeki tüm dosyalar için <quote>farkları</quote> gösterecektir.
