Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kdevelop.po
Languages: tr

source: In addition to that coloring, the normal editor syntax highlighting will be applied, as known from &kate;. &kdevelop;'s semantic highlighting will always override the editor highlighting if there is a conflict.
tr: Bu renklendirmeye ek olarak, &kate;’den bilindiği gibi normal düzenleyici sözdizim vurgulaması uygulanacaktır. Bir çakışma olması durumunda &kdevelop; yazılımının anlamsal vurgulaması her zaman düzenleyici vurgulamasını geçersiz kılacaktır.

source: Navigating in source code
tr: Kaynak kodda dolaşmak

source: In the previous section, we have discussed exploring source code, &ie; getting information about symbols, files and projects. The next step is then to jump around your source base, &ie; to navigate in it. There are again various levels at which this is possible: local, within a file, and within a project.
tr: Önceki bölümde kaynak kodunu keşfetmeyi; yani semboller, dosyalar ve projeler hakkında bilgi edinmeyi ele aldık. Sonraki adım kaynak tabanınızda, yani içinde dolaşmaktır. Bunun olanaklı olduğu çeşitli düzeyler vardır: Yerel, bir dosya içinde ve bir proje içinde.

source: Many of the ways to navigate through code are accessible from the <guilabel>Navigate</guilabel> menu in the &kdevelop; main window.
tr: Kodda dolaşmanın birçok yoluna &kdevelop; ana penceresindeki <guilabel>Dolaşım</guilabel> menüsünden erişilebilir.

source: Local navigation
tr: Yerel dolaşım

source: &kdevelop; is much more than an editor, but it is <emphasis>also</emphasis> a source editor. As such, you can of course move the cursor up, down, left or right in a source file. You can also use the <keycap>PageUp</keycap> and <keycap>PageDown</keycap> keys, and all the other commands you are used from any useful editor.
tr: &kdevelop; bir düzenleyiciden çok daha fazlasıdır; ancak <emphasis>aynı zamanda</emphasis> bir kod düzenleyicisidir de. Doğal olarak, bir kaynak kodu dosyasında imleci yukarı, aşağı, sağa ve sola hareket ettirebilirsiniz. Ayrıca, <keycap>Sayfa Yukarı</keycap> ve <keycap>Sayfa Aşağı</keycap> düğmelerini ve herhangi başka kullanışlı bir düzenleyiciden alışık olduğunuz diğer tüm komutları kullanabilirsiniz.

source: File scope navigation and outline mode
tr: Dosya kapsamı dolaşımı ve ana hat kipi

source: At the file scope, &kdevelop; offers many possible ways to navigate through source code. For example:
tr: Dosya temelinde &kdevelop;, kaynak kodunda dolaşım için birçok olası yol sunmaktadır. Örneğin:

source: <guilabel>Outline</guilabel>: You can get an outline of what's in the current file in at least three different ways:
tr: <guilabel>Ana Hat</guilabel>: Geçerli dosyada ne olduğunu en az üç farklı şekilde ana hatlarıyla öğrenebilirsiniz:

source: Clicking into the <guilabel>Outline</guilabel> textbox at the top right of the main window, or hitting <keycombo>&Alt;&Ctrl;<keycap>N</keycap></keycombo> opens a drop-down menu that lists all function and class declarations: <screenshot> <screeninfo></screeninfo> <mediaobject> <imageobject> <imagedata fileref="kdevelop-19.png" format="PNG"/> </imageobject> <textobject> <phrase></phrase> </textobject> <caption> <para></para> </caption> </mediaobject> </screenshot> You can then just select which one to jump to, or &mdash; if there are a lot &mdash; start typing any text that may appear in the names shown; in that case, as you keep typing, the list becomes smaller and smaller as names are removed that don't match the text already typed until you are ready to select one of the choices.
tr: Ana pencerenin sağ üst köşesindeki <guilabel>Ana Hat</guilabel> metin kutusuna tıklamak veya <keycombo>&Alt;&Ctrl;<keycap>N</keycap></keycombo> düğme kombinasyonunu kullanmak, tüm işlev ve sınıf beyanlarını listeleyen bir açılır menü açar: <screenshot> <screeninfo></screeninfo> <mediaobject> <imageobject> <imagedata fileref="kdevelop-19.png" format="PNG"/> </imageobject> <textobject> <phrase></phrase> </textobject> <caption> <para></para> </caption> </mediaobject> </screenshot> Daha sonra hangisine atlayacağınızı seçebilirsiniz veya &mdash;eğer çok sayıda varsa&mdash; gösterilen adlarda görünebilecek herhangi bir metni yazmaya başlayabilirsiniz; bu durumda, yazmayı sürdürdükçe, daha önce yazılmış metinle uyuşmayan adlar kaldırılacağı için liste giderek küçülür ve siz seçimlerden birini çok daha rahat kullanabilirsiniz.

source: Positioning the cursor at file scope (&ie; outside any function or class declarations or definitions) and having the <guilabel>Code Browser</guilabel> tool open: <screenshot> <screeninfo></screeninfo> <mediaobject> <imageobject> <imagedata fileref="kdevelop-16.png" format="PNG"/> </imageobject> <textobject> <phrase></phrase> </textobject> <caption> <para></para> </caption> </mediaobject> </screenshot> This also provides you an outline of what is happening in the current file, and allows you to select where you want to jump to.
tr: İmleci dosya kapsamında konumlandırmak (&ie; herhangi bir işlev/sınıf beyanının veya tanımının dışında konumlandırmak) ve <guilabel>Kod Tarayıcısı</guilabel> aracını açmak: <screenshot> <screeninfo></screeninfo> <mediaobject> <imageobject> <imagedata fileref="kdevelop-16.png" format="PNG"/> </imageobject> <textobject> <phrase></phrase> </textobject> <caption> <para></para> </caption> </mediaobject> </screenshot> Bu ayrıca, size geçerli dosyada neler olup bittiğine dair bir ana hat sunar ve nereye atlamak istediğinizi seçmenize olanak tanır.

source: Hovering the mouse over the tab for one of the open files also yields an outline of the file in that tab.
tr: Açık dosyalardan birinin sekmesinin üzerine fareyi getirdiğinizde, o sekmedeki dosyanın ana hatları da görüntülenir.

source: Source files are organized as a list of function declarations or definitions. Hitting <keycombo>&Alt;&Ctrl;<keycap>PgUp</keycap></keycombo> and <keycombo>&Alt;&Ctrl;<keycap>PgDown</keycap></keycombo> jumps to the previous or next function definition in this file.
tr: Kaynak dosyaları, işlev beyanları veya tanımlarının bir listesi olarak düzenlenir. <keycombo>&Alt;&Ctrl;<keycap>Sayfa Yukarı</keycap></keycombo> ve <keycombo>&Alt;&Ctrl;<keycap>Sayfa Aşağı</keycap></keycombo> düğmelerine basmak, bu dosyadaki önceki veya sonraki işlev tanımına atlar.

source: Project and session scope navigation: Semantic navigation
tr: Proje ve oturum kapsamında dolaşım: Anlamsal dolaşım

source: As mentioned in other places, &kdevelop; does not usually consider individual source files but rather looks at projects as a whole (or, rather, at all projects that are part of the current session). As a consequence, it offers many possibilities for navigating through entire projects. Some of these are derived from what we have already discussed in the section on <link linkend="exploring-source-code">Exploring source code</link> while others are genuinely different. The common theme is that these navigation features are based on a <emphasis>semantic understanding</emphasis> of the code, &ie; they offer you something that requires parsing entire projects and connecting data. The following list shows some ways how to navigate through source code that is scattered throughout a potentially very large number of files:
tr: Diğer yerlerde belirtildiği gibi, &kdevelop; genellikle tek tek kaynak dosyalarını dikkate almaz, bunun yerine projeleri bir bütün olarak (veya daha doğrusu, geçerli oturumun parçası olan tüm projeleri) ele alır. Sonuç olarak, tüm projelerde dolaşmak için birçok olasılık sunar. Bunlardan bazıları <link linkend="exploring-source-code">kaynak koda göz atmak</link> bölümünde daha önce açıkladığımız şeylerden türetilmiştir, diğerleri ise gerçekten farklıdır. Ortak tema, bu gezinme özelliklerinin kodun <emphasis>anlamsal anlayışına</emphasis> dayanmasıdır; yani size tüm projeleri ayrıştırmayı ve verileri bağlamayı gerektiren bir şey sunarlar. Aşağıdaki liste, potansiyel olarak çok sayıda dosyaya dağılmış kaynak kodunda gezinmenin bazı yollarını gösterir:

source: As seen in the section on <link linkend="exploring-source-code">Exploring source code</link>, you can get a tooltip explaining individual namespace, class, function or variable names by hovering your mouse over it or keeping the &Alt; key pressed for a while. Here is an example: <screenshot> <screeninfo></screeninfo> <mediaobject> <imageobject> <imagedata fileref="kdevelop-14.png" format="PNG"/> </imageobject> <textobject> <phrase></phrase> </textobject> </mediaobject> </screenshot> Clicking on the links for the declaration of a symbol or expanding the list of uses allows you to jump to these locations, if necessary opening the respective file and placing the cursor at the corresponding location. A similar effect can be achieved by using the <guilabel>Code Browser</guilabel> tool view also discussed previously.
tr: <link linkend="exploring-source-code">Kaynak koda göz atmak</link> bölümünde görüldüğü üzere, fareyle üzerine gelerek veya &Alt; düğmesini bir süre basılı tutarak bireysel ad alanları, sınıf, işlev veya değişken adlarını açıklayan bir araç ipucu gösterebilirsiniz. Bir örnek için: <screenshot> <screeninfo></screeninfo> <mediaobject> <imageobject> <imagedata fileref="kdevelop-14.png" format="PNG"/> </imageobject> <textobject> <phrase></phrase> </textobject> </mediaobject> </screenshot> Bir sembolün beyanı için bağlantılara tıklamak veya kullanım listesini genişletmek, gerekirse ilgili dosyayı açıp imleci ilgili konuma yerleştirmek suretiyle bu konumlara atlamanızı sağlar. Benzer bir etki, daha önce tartışılan <guilabel>Kod Tarayıcısı</guilabel> araç görünümü kullanılarak da elde edilebilir.

source: A quicker way to jump to the declaration of a symbol without having to click on the links in the tooltip is to temporary enabling <guilabel>Source Browse Mode</guilabel> by holding down the &Alt; or &Ctrl; key. In this mode, it is possible to directly click on any symbol in the editor to jump to its declaration.
tr: Araç ipucundaki bağlantılara tıklamak zorunda kalmadan bir sembolün beyanına atlamanın daha tez bir yolu da <guilabel>Kaynak Tarama Kipi</guilabel> kipini &Alt; veya &Ctrl; düğmelerine basılı tutarak geçici olarak etkinleştirmektir. Bu kipte, bir sembolün beyanına doğrudan atlamak için üzerine tıklamak yeterlidir.

source: <guilabel>Quick open</guilabel>: A very powerful way of jumping to other files or locations is to use the various <emphasis>quick open</emphasis> methods in &kdevelop;. There are four versions of these:
tr: <guilabel>Tez Aç</guilabel>: Diğer dosyalara veya konumlara atlamanın çok güçlü bir yolu, &kdevelop; yazılımındaki çeşitli <emphasis>tez aç</emphasis> yöntemlerini kullanmaktır. Bunların dört sürümü vardır:

source: <guilabel>Quick open class</guilabel> (<menuchoice><guimenu>Navigate</guimenu><guimenuitem>Quick open class</guimenuitem></menuchoice> or <keycombo>&Alt;&Ctrl;<keycap>C</keycap></keycombo>): You will get a list of all classes in this session. Start typing (a part of) the name of a class and the list will continue to whittle down to only those that actually match what you've typed so far. If the list is short enough, select an element using the up and down keys and &kdevelop; will get you to the place where the class is declared.
tr: <guilabel>Tez Sınıf Aç</guilabel> (<menuchoice><guimenu>Dolaşım</guimenu><guimenuitem>Tez Sınıf Aç</guimenuitem></menuchoice> veya <keycombo>&Alt;&Ctrl;<keycap>C</keycap></keycombo>): Bu oturumda tüm sınıfların bir listesini alırsınız. Bir sınıfın adını (bir kısmını) yazmaya başlayın ve liste yalnızca şu ana kadar yazdıklarınızla gerçekten eşleşenlere doğru azalmayı sürdürecektir. Liste yeterince kısaysa yukarı ve aşağı düğmelerini kullanarak bir öge seçin ve &kdevelop; sizi sınıfın beyan edildiği yere götürecektir.

source: <guilabel>Quick open function</guilabel> (<menuchoice><guimenu>Navigate</guimenu><guimenuitem>Quick open function</guimenuitem></menuchoice> or <keycombo>&Alt;&Ctrl;<keycap>M</keycap></keycombo>): You will get a list of all (member) functions that are part of the projects in the current session, and you can select from it in the same way as above. Note that this list may include both function declarations and definitions.
tr: <guilabel>Tez İşlev aç</guilabel> (<menuchoice><guimenu>Dolaşım</guimenu><guimenuitem>Tez İşlev Aç</guimenuitem></menuchoice> veya <keycombo>&Alt;&Ctrl;<keycap>M</keycap></keycombo>): Geçerli oturumdaki projelerin parçası olan tüm (üye) işlevlerin bir listesini alırsınız ve yukarıdakiyle aynı biçimde seçim yapabilirsiniz. Bu listenin hem işlev beyanlarını hem de tanımlarını içerebileceğini unutmayın.

source: <guilabel>Quick open file</guilabel> (<menuchoice><guimenu>Navigate</guimenu><guimenuitem>Quick open file</guimenuitem></menuchoice> or <keycombo>&Alt;&Ctrl;<keycap>O</keycap></keycombo>): You will get a list of all files that are part of the projects in the current session, and you can select from it in the same way as above.
tr: <guilabel>Tez Dosya Aç</guilabel> (<menuchoice><guimenu>Dolaşım</guimenu><guimenuitem>Tez Dosya Aç</guimenuitem></menuchoice> veya <keycombo>&Alt;&Ctrl;<keycap>O</keycap></keycombo>): Geçerli oturumdaki projelerin parçası olan tüm dosyaların bir listesini alırsınız ve yukarıda belirtildiği gibi bunlardan seçim yapabilirsiniz.

source: <guilabel>Universal quick open</guilabel> (<menuchoice><guimenu>Navigate</guimenu><guimenuitem>Quick open</guimenuitem></menuchoice> or <keycombo>&Alt;&Ctrl;<keycap>Q</keycap></keycombo>): If you forget which key combination is bound to which of the above commands, this is the universal swiss army knife &mdash; it simply presents you with a combined list of all files, functions, classes, and other things from which you can select.
tr: <guilabel>Evrensel Tez Aç</guilabel> (<menuchoice><guimenu>Dolaşım</guimenu><guimenuitem>Tez Aç</guimenuitem></menuchoice> veya <keycombo>&Alt;&Ctrl;<keycap>Q</keycap></keycombo>): Yukarıdaki komutlardan hangisinin hangi düğme inasyonuna bağlı olduğunu unutursanız bu bir evrensel İsviçre çakısıdır &mdash; size seçebileceğiniz tüm dosyaların, işlevlerin, sınıfların ve diğer şeylerin birleştirilmiş bir listesini sunar.

source: <guilabel>Jump to declaration/definition</guilabel>: When implementing a (member) function, one often needs to switch back to the point where a function is declared, for example to keep the list of function arguments synchronised between declaration and definition, or to update the documentation. To do so, place the cursor onto the function name and select <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Jump to declaration</guimenuitem></menuchoice> (or hit <keycombo>&Ctrl;<keycap>.</keycap></keycombo>) to get to the place where the function is declared. There are multiple ways to get back to the original place:
tr: <guilabel>Beyana/Tanıma Git</guilabel>: Bir (üye) işlevi uygularken; örneğin işlev argümanlarının listesini beyan ve tanım arasında eşzamanlı tutmak veya belgelendirmeyi güncellemek için sıklıkla işlevin beyan edildiği noktaya geri dönmek gerekir. Bunu yapmak için imleci işlev adına yerleştirin ve işlevin beyan edildiği yere atlamak için <menuchoice><guimenu>Dolaşım</guimenu><guimenuitem>Beyana Git</guimenuitem></menuchoice> ögesini seçin (veya <keycombo>&Ctrl;<keycap>.</keycap></keycombo> kombinasyonunu kullanın). Özgün konuma geri gitmek için birçok yol vardır:

source: Selecting <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Jump to definition</guimenuitem></menuchoice> (or hitting <keycombo>&Ctrl;<keycap>,</keycap></keycombo>).
tr: <menuchoice><guimenu>Dolaşım</guimenu><guimenuitem>Tanıma Git</guimenuitem></menuchoice> (veya <keycombo>&Ctrl;<keycap>,</keycap></keycombo> kombinasyonunu kullanın).

source: Selecting <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Previous visited context</guimenuitem></menuchoice> (or hit <keycombo><keycap>Meta</keycap><keycap>Left</keycap></keycombo>), as described below.
tr: <menuchoice><guimenu>Dolaşım</guimenu><guimenuitem>Önceki Bakılan Bağlam</guimenuitem></menuchoice> (veya <keycombo><keycap>Meta</keycap><keycap>Sol Ok Düğmesi</keycap></keycombo>), aşağıda açıklandığı üzere.

source: Jumping to the declaration of a symbol is something that does not only work when placing the cursor on the name of the function you are currently implementing. Rather, it also works for other symbols: Putting the cursor on a (local, global, or member) variable and jumping to its declaration also transports you to its location of declaration. Similarly, you can place the cursor on the name of a class, for example in a variable of function declaration, and jump to the location of its declaration.
tr: Bir sembolün beyanına atlamak, yalnızca imleci şu anda uyguladığınız işlevin adına yerleştirdiğinizde işe yarayan bir şey değildir. Aksine, diğer semboller için de işe yarar: İmleci bir (yerel, global veya üye) değişkenin üzerine koymak ve beyanına atlamak sizi beyanın konumuna da götürür. Benzer şekilde, imleci bir sınıfın adına, örneğin bir işlev beyanının değişkenine yerleştirebilir ve beyanın konumuna atlayabilirsiniz.

source: <guilabel>Switch between declaration/definition</guilabel>: In the example above, to jump to the site of the declaration of the current function, you need to first place the cursor on the function name. To avoid this step, you can select <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Switch definition/declaration</guimenuitem></menuchoice> (or hit <keycombo>&Shift;&Ctrl;<keycap>C</keycap></keycombo>) to jump to the declaration of the function within which the cursor currently is. Selecting the same menu entry a second time transports you back to the place where the function is defined.
tr: <guilabel>Şuna Geç: Tanım/Beyan</guilabel>: Yukarıdaki örnekte, geçerli işlevin beyanının yapıldığı yere gitmek için öncelikle imleci işlev adının üzerine getirmeniz gerekmektedir. Bu adımdan kaçınmak için imlecin üzerinde olduğu işlevin beyanına atlamak üzere <menuchoice><guimenu>Dolaşım</guimenu><guimenuitem>Şuna Geç: Tanım/Beyan</guimenuitem></menuchoice> ögesini seçebilirsiniz (veya <keycombo>&Shift;&Ctrl;<keycap>C</keycap></keycombo> kombinasyonunu kullanın). Aynı menü girdisini ikinci kez seçtiğinizde işlevin tanımlandığı yere geri dönersiniz.

source: <guilabel>Previous/Next use</guilabel>: Placing the cursor on the name of a local variable and selecting <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Next use</guimenuitem></menuchoice> (or hitting <keycombo><keycap>Meta</keycap>&Shift;<keycap>Right</keycap></keycombo>) transports you to the next use of this variable in the code. (Note that this doesn't just search for the next occurrence of the variable name but in fact takes into account that variables with the same name but in different scopes are different.) The same works for the use of function names. Selecting <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Previous use</guimenuitem></menuchoice> (or hitting <keycombo><keycap>Meta</keycap>&Shift;<keycap>Left</keycap></keycombo>) transports you to the previous use of a symbol.
tr: <guilabel>Önceki/Sonraki Kullanım</guilabel>: İmleci bir yerel değişkenin adının üzerine koymak ve <menuchoice><guimenu>Dolaşım</guimenu><guimenuitem>Sonraki Kullanım</guimenuitem></menuchoice> ögesini seçmek (veya <keycombo><keycap>Meta</keycap>&Shift;<keycap>Sağ Ok Düğmesi</keycap></keycombo>) sizi bu değişkenin koddaki sonraki kullanımına götürür (Bunun yalnızca değişken adının bir sonraki oluşunu aramadığını, aynı ada sahip; ancak farklı kapsamlardaki değişkenlerin farklı olduğunu da hesaba kattığını unutmayın). Aynısı işlev adları için de geçerlidir. <menuchoice><guimenu>Dolaşım</guimenu><guimenuitem>Önceki Kullanım</guimenuitem></menuchoice> (veya <keycombo><keycap>Meta</keycap>&Shift;<keycap>Sol Ok Düğmesi</keycap></keycombo>) sizi bu değişkenin koddaki önceki kullanımına götürür.

source: To see the list of all uses of a name through which these commands cycle, place the cursor onto it and open the <guilabel>Code Browser</guilabel> tool view or press and hold the &Alt; button. This is explained in more detail in the section on <link linkend="file-scope-information">Exploring code</link>.
tr: Bu komutların döngü içinde geçtiği tüm ad kullanımlarının listesini görmek için imleci üzerine getirin ve <guilabel>Kod Tarayıcısı</guilabel> araç görünümünü açın veya &Alt; düğmesine basılı tutun. Bu, <link linkend="file-scope-information">Koda göz atmak</link> bölümünde ayrıntılı olarak açıklanmıştır.

source: The <guilabel>context list</guilabel>: Web browsers have this feature where you can go backward and forward in the list of most recently visited web pages. &kdevelop; has the same kind of features, except that instead of web pages you visit <emphasis>contexts</emphasis>. A context is the current location of the cursor, and you change it by navigating away from it using anything but cursor commands &mdash; for example, by clicking on a location provided by a tooltip, in the <guilabel>Code Browser</guilabel> tool view, one of the options given in the <guilabel>Navigation</guilabel> menu, or any other navigation command. Using the <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Previous Visited Context</guimenuitem></menuchoice> (<keycombo><keycap>Meta</keycap><keycap>Left</keycap></keycombo>) and <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Next Visited Context</guimenuitem></menuchoice> (<keycombo><keycap>Meta</keycap><keycap>Right</keycap></keycombo>) transports you along this list of visited contexts just like the <guilabel>back</guilabel> and <guilabel>forward</guilabel> buttons of a browser transports you to the previous or next webpage in the list of visited pages.
tr: <guilabel>Bağlam Listesi</guilabel>: Web tarayıcılarında en son ziyaret edilen web sayfalarının listesinde ileri ve geri gidebilmenizi sağlayan bir özellik bulunmaktadır. &kdevelop; yazılımında da aynı özellik bulunur; ancak web siteleri yerine <emphasis>bağlamları</emphasis> ziyaret edersiniz. Bağlam, imlecin geçerli konumudur ve imleç komutları dışında herhangi bir şey kullanarak imleci uzaklaştırarak onu değiştirebilirsiniz; örneğin, <guilabel>Kod Tarayıcısı</guilabel> araç görünümünde, <guilabel>Dolaşım</guilabel> menüsünde verilen seçeneklerden birinde veya başka herhangi bir dolaşım komutunda bir araç ipucu tarafından sağlanan bir konuma tıklayarak. <menuchoice><guimenu>Dolaşım</guimenu><guimenuitem>Önceki Bakılan Bağlam</guimenuitem></menuchoice> (<keycombo><keycap>Meta</keycap><keycap>Sol Ok Düğmesi</keycap></keycombo>) ve <menuchoice><guimenu>Dolaşım</guimenu><guimenuitem>Sonraki Bakılan Bağlam</guimenuitem></menuchoice> (<keycombo><keycap>Meta</keycap><keycap>Sağ Ok Düğmesi</keycap></keycombo>) sizi aynı web tarayıcılarının <guilabel>ileri</guilabel> ve <guilabel>geri</guilabel> düğmelerini tıkladığınızda yaptığı gibi bağlamlar arasında getirir ve götürür.
