Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kdevelop.po
Languages: tr

source: &kdevelop; Handbook
tr: &kdevelop; El Kitabı

source: <firstname>This documentation was converted from the KDE UserBase <ulink url=" https://userbase.kde.org/KDevelop4/Manual">KDevelop4/Manual</ulink> page.</firstname> <surname></surname>
tr: <firstname>Bu belgelendirme, KDE UserBase <ulink url=" https://userbase.kde.org/KDevelop4/Manual">KDevelop4/El Kitabı</ulink> sayfasından dönüştürülmüştür.</firstname> <surname></surname>

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: &kdevelop; is an Integrated Development Environment to be used for a wide variety of programming tasks.
tr: &kdevelop;, çok çeşitli programlama görevlerinde kullanılan bir tümleşik geliştirme ortamıdır.

source: KDevelop
tr: K Geliştir

source: development
tr: geliştirme

source: programming
tr: programlama

source: What is &kdevelop;?
tr: &kdevelop; nedir?

source: <ulink url="https://www.kdevelop.org/">&kdevelop;</ulink> is a modern integrated development environment (IDE) for C++ (and other languages) that is one of many <ulink url="https://kde.org/applications/">KDE applications</ulink>. As such it runs on &Linux; (even if you run one of the other desktops, such as GNOME) but it is also available for most other variants of &UNIX; and for Windows as well.
tr: <ulink url="https://www.kdevelop.org/">&kdevelop;</ulink>, C++ (ve diğer başka diller) için <ulink url="https://kde.org/applications/">KDE</ulink> tarafından geliştirilen bir tümleşik geliştirme ortamıdır. &Linux; üzerinde çalışır (örneğin, GNOME gibi başka masaüstü ortamlarını kullansanız bile); ancak başka &UNIX; varyantlarında ve Windows üzerinde de kullanabilirsiniz.

source: &kdevelop; offers all amenities of modern IDEs. For large projects and applications, the most important feature is that &kdevelop; <emphasis>understands C++</emphasis>: it parses the entire source base and remembers which classes have which member functions, where variables are defined, what their types are, and many other things about your code. For example, let's say one of your project's header files declares a class
tr: &kdevelop;, tüm çağdaş tümleşik geliştirme ortamlarının kolaylıklarını sunar. Büyük proje ve uygulamalar için en önemli özelliklerinden biri ise &kdevelop; <emphasis>C++ anlar</emphasis>: Tüm kod tabanını ayrıştırır ve hangi sınıfların hangi üye işlevleri içerdiğini, değişkenlerin nerede tanımlandığını, türlerinin ne olduğunu ve kodunuz hakkında bunun gibi birçok şeyi bilir. Örneğin, projelerinizden bir tanesinin aşağıdaki gibi bir sınıf beyan ettiğini varsayalım:

source: and later on in your program you have
tr: ve sonrasında programınızda aşağıdaki kod parçasının olduğunu:

source: Car my_ride; // ...do something with this variable... std::string color = my_ride.ge
tr: Car my_ride; // bu değişkenle bir şeyler yap std::string color = my_ride.ge

source: it will have remembered that <varname>my_ride</varname> in the last line is a variable of type <varname>Car</varname> and offer you to complete <varname>ge</varname> as <varname>get_color()</varname> since this is the only member function of the <varname>Car</varname> class that starts like this. Instead of continuing to type you just hit &Enter; to get the full word; this saves typing, avoids typos, and doesn't require you to remember the exact names of the hundreds or thousands of functions and classes that make up large projects.
tr: Son satırdaki <varname>my_ride</varname> ögesinin <varname>Car</varname> türünün bir değişkeni olduğunu anımsar ve hem <varname>ge</varname> ögesini <varname>get_color()</varname> olarak tamamlamayı önerir; çünkü bu, <varname>Car</varname> sınıfında böyle başlayan tek değişkendir. Yazmayı sürdürmek yerine tam sözcüğü almak için yalnızca &Enter; düğmesine basın; bu size zaman kazandırır; yanlış yazımları önler ve büyük projelerdeki yüzlerce veya binlerce değişkeni veya sınıfı ezberlemekten sizi kurtarır.

source: As a second example, assume you have code like this:
tr: İkinci bir örnek olarak, aşağıdaki gibi bir kodunuz olduğunu varsayalım:

source: If you hover the mouse over the symbol <varname>var</varname> in function <varname>bar</varname> you get the option to see all uses of this symbol. Clicking on it will only show you the uses of this variable in function <varname>bar</varname> because &kdevelop; understands that the variable <varname>var</varname> in function <varname>foo</varname> has nothing to do with it. Similarly, right clicking on the variable name allows you to rename the variable; doing so will only touch the variable in <varname>bar</varname> but not the one with the same name in <varname>foo</varname>.
tr: <varname>bar</varname> işlevindeki <varname>var</varname> sembolünün üzerine fareyi getirirseniz bu sembolün tüm kullanımlarını görme seçeneğini elde edersiniz. Üzerine tıkladığınızda, yalnızca bu değişkenin <varname>bar</varname> işlevindeki kullanımları gösterilir; çünkü &kdevelop;, <varname>foo</varname> işlevindeki <varname>var</varname> değişkeninin bununla hiçbir ilgisi olmadığını anlar. Benzer şekilde, değişken adına sağ tıklamak, değişkeni yeniden adlandırmanıza olanak tanır; bunu yapmak yalnızca <varname>bar</varname> içindeki değişkene dokunur, <varname>foo</varname> içindeki aynı adlı değişkene dokunmaz.

source: But &kdevelop; is not just an intelligent code editor; there are other things &kdevelop; does well. Obviously, it highlights the source code in different colors; it has a customizable indenter; it has an integrated interface to the GNU debugger <application>gdb</application>; it can show you the documentation for a function if you hover the mouse over a use of this function; it can deal with different kinds of build environments and compilers (&eg; with <guilabel>make</guilabel> and <guilabel>cmake</guilabel>-based project), and many other neat things that are discussed in this manual.
tr: Ancak &kdevelop; yalnızca akıllı bir kod düzenleyicisi değildir; &kdevelop; yazılımının iyi yaptığı başka şeyler de vardır. Açıkça, kaynak kodunu farklı renklerle vurgular; özelleştirilebilir bir girintileme sistemine sahiptir; GNU hata ayıklayıcısı <application>gdb</application> için tümleşik bir arayüze sahiptir; fareyi bu işlevin bir kullanımının üzerine getirdiğinizde size bir işlevin belgelendirmesini gösterebilir; farklı türdeki yapı ortamları ve derleyicilerle (örneğin <guilabel>make</guilabel> ve <guilabel>cmake</guilabel> tabanlı projelerle) ve bu kılavuzda anlatılan birçok başka güzel şeyle bağlantı kurabilir.

source: Sessions and projects: The basics of &kdevelop;
tr: Oturumlar ve projeler: &kdevelop; temelleri

source: In this section, we will go over some of the terminology of how &kdevelop; sees the world and how it structures work. In particular, we introduce the concept of <emphasis>sessions</emphasis> and <emphasis>projects</emphasis> and explain how you can set up the projects you want to work on in &kdevelop;.
tr: Bu bölümde, &kdevelop; yazılımının dünyayı nasıl gördüğüne ve işi nasıl yapılandırdığına dair bazı terminolojileri ele alacağız. Özellikle, <emphasis>oturumlar</emphasis> ve <emphasis>projeler</emphasis> kavramlarını tanıtacağız ve &kdevelop; yazılımında üzerinde çalışmak istediğiniz projeleri nasıl ayarlayabileceğinizi açıklayacağız.

source: Terminology
tr: Terminoloji

source: &kdevelop; has the concept of <emphasis>sessions</emphasis> and <emphasis>projects</emphasis>. A session contains all projects that have something to do with each other. For the examples that follow, assume you are the developer of both a library and an application that uses it. You can think of the core KDE libraries as the former and &kdevelop; as the latter. Another example: Let's say you are a &Linux; kernel hacker but you are also working on a device driver for &Linux; that hasn't been merged into the kernel tree yet.
tr: &kdevelop;, <emphasis>oturumlar</emphasis> ve <emphasis>projeler</emphasis> kavramlarını kullanır. Bir oturum, birbirleriyle ilgisi olan tüm projeleri içerir. Aşağıdaki örnekler için hem bir kitaplığın hem de onu kullanan bir uygulamanın geliştiricisi olduğunuzu varsayalım. Çekirdek KDE kitaplıklarının birincisi, &kdevelop; yazılımını ise ikincisi olarak düşünebilirsiniz. Başka bir örnek: Diyelim ki bir &Linux; çekirdeği geliştiricisisiniz; ancak henüz çekirdek ağacına eklenmemiş bir &Linux; aygıt sürücüsü üzerinde çalışıyorsunuz.

source: So taking the latter as an example, you would have a session in &kdevelop; that has two projects: the &Linux; kernel and the device driver. You will want to group them into a single session (rather than having two sessions with a single project each) because it will be useful to be able to see the kernel functions and data structures in &kdevelop; whenever you write source code for the driver &mdash; for example so that you can get kernel function and variable names auto-expanded, or so that you can see kernel function documentation while hacking on the device driver.
tr: Yani ikincisini örnek olarak alırsak, &kdevelop; üzerinde iki projeye sahip bir oturumunuz olurdu: &Linux; çekirdeği ve aygıt sürücüsü. Bunları tek bir oturumda gruplamak isteyeceksiniz (her biri tek bir projeye sahip iki oturum yerine) çünkü sürücü için kaynak kodu yazdığınızda &kdevelop; üzerinde çekirdek işlevlerini ve veri yapılarını görebilmek faydalı olacaktır &mdash; örneğin çekirdek işlevi ve değişken adlarının kendiliğinden genişletilmesini sağlayabilmeniz veya aygıt sürücüsünde çalışırken çekirdek işlevi belgelendirmesini görebilmeniz için.

source: Now imagine you also happen to be a KDE developer. Then you would have a second session that contains KDE as a project. You could in principle have just one session for all of this, but there is no real reason for this: in your KDE work, you don't need to access kernel or device driver functions; and you don't want KDE class names autoexpanded while working on the &Linux; kernel. Finally, building some of the KDE libraries is independent of re-compiling the &Linux; kernel (whereas whenever you compile the device driver it would also be good to re-compile the &Linux; kernel if some of the kernel header files have changed).
tr: Şimdi sizin de bir KDE geliştiricisi olduğunuzu düşünelim. O zaman KDE’yi bir proje olarak içeren ikinci bir oturumunuz olurdu. Prensipte tüm bunlar için sadece bir oturumunuz olabilirdi; ancak bunun gerçek bir nedeni yoktur: KDE çalışmanızda çekirdek veya aygıt sürücüsü işlevlerine erişmeniz gerekmez; ve &Linux; çekirdeği üzerinde çalışırken KDE sınıf adlarının kendiliğinden genişletilmesini istemezsiniz. Son olarak, KDE kitaplıklarından bazılarını derlemek, &Linux; çekirdeğini yeniden derlemekten bağımsızdır (oysa aygıt sürücüsünü derlediğinizde, çekirdek üstbilgi dosyalarından bazıları değişmişse &Linux; çekirdeğini yeniden derlemek de iyi olur).

source: Finally, another use for sessions is if you work both on the current development version of a project, as well as on a branch: in that case, you don't want &kdevelop; to confuse classes that belong to mainline and the branch, so you'd have two sessions, with the same set of projects but from different directories (corresponding to different development branches).
tr: Son olarak, oturumların bir diğer kullanımı da hem projenin geçerli geliştirme sürümünde hem de bir dalda çalışmanız durumunda gerçekleşir: bu durumda, &kdevelop; yazılımının ana dalda ve dala ait sınıfları karıştırmasını istemezsiniz; böylece aynı proje kümesine sahip ancak farklı dizinlerden (farklı geliştirme dallarına karşılık gelen) iki oturumunuz olur.

source: Setting up a session and importing an existing project
tr: Bir oturum açmak ve var olan bir projeyi içe aktarmak

source: Let's stick with the &Linux; kernel and device driver example &mdash; you may want to substitute your own set of libraries or projects for these two examples. To create a new session that contains these two projects go to the <menuchoice><guimenu>Session</guimenu><guimenuitem>Start new session</guimenuitem></menuchoice> menu at the top left (or, if this is the first time you use &kdevelop;: simply use the default session you get on first use, which is empty).
tr: Şimdilik &Linux; çekirdeği ve aygıt sürücüsü örneğimizle sürdürelim &mdash; kendi projeleriniz yerine bu iki örneği kullanmak isteyebilirsiniz. Bu iki örneği içeren iki projeyle yeni bir oturum oluşturmak için sol üstteki <menuchoice><guimenu>Oturum</guimenu><guimenuitem>Yeni Oturum Başlat</guimenuitem></menuchoice> menü ögesini (veya bu &kdevelop; yazılımını ilk kullanımınızsa ilk açılıştaki boş oturumu) kullanın.

source: We next want to populate this session with projects that for the moment we assume already exist somewhere (the case of starting projects from scratch is discussed elsewhere in this manual). For this, there are essentially two methods, depending on whether the project already is somewhere on your hard drive or whether it needs to be downloaded from a server.
tr: Şimdi bu oturumu, şu an için bir yerde halihazırda var olduğunu varsaydığımız projelerle doldurmak istiyoruz (projeleri sıfırdan başlatma durumu bu kılavuzun başka bir yerinde ele alınmıştır). Bunun için projenin sabit diskinizde bir yerde olup olmamasına veya bir sunucudan indirilmesi gerekip gerekmediğine bağlı olarak özünde iki yöntem vardır.

source: Option 1: Importing a project from a version control system server
tr: 1. seçenek: Bir sürüm denetim sistemi sunucusundan bir proje içe aktarmak

source: Let's first assume that the project we want to set up &mdash; the &Linux; kernel &mdash; resides in some version control system on a server, but that you haven't checked it out to your local hard drive yet. In this case, go to the <guilabel>Project</guilabel> menu to create the &Linux; kernel as a project inside the current session and then follow these steps:
tr: Öncelikle kurmak istediğimiz projenin &mdash;&Linux; çekirdeğinin&mdash; bir sunucudaki bir sürüm denetim sisteminde bulunduğunu; ancak henüz yerel sabit diskinize çıkış yapmadığınızı varsayalım. Bu durumda, <guilabel>Proje</guilabel> menüsüne giderek &Linux; çekirdeğini geçerli oturum içinde bir proje olarak oluşturun ve ardından şu adımları izleyin:

source: Go to <menuchoice><guimenu>Project</guimenu><guimenuitem>Fetch Project</guimenuitem></menuchoice> to import a project
tr: Bir proje içe aktarmak için <menuchoice><guimenu>Proje</guimenu><guimenuitem>Proje Getir</guimenuitem></menuchoice> menü seçeneğini kullanın.

source: You then have multiple options to start a new project in the current session, depending on where the source files should come from: You can just point &kdevelop; at an existing directory (see option 2 below), or you can ask &kdevelop; to get the sources from a repository.
tr: Daha sonra, kaynak dosyalarının nereden gelmesi gerektiğine bağlı olarak, geçerli oturumda yeni bir proje başlatmak için birden fazla seçeneğiniz olur: &kdevelop; yazılımını var olan bir dizine yönlendirebilirsiniz (aşağıdaki 2. seçeneğe bakın) veya &kdevelop; yazılımının kaynakları bir depodan almasını isteyebilirsiniz.

source: Assuming you don't already have a version checked out:
tr: Daha önceden çıkışını yaptığınız bir sürüm olmadığını varsayarsak:

source: In the dialog box, under <guilabel>Select Source</guilabel>, choose to use <guilabel>From File System</guilabel>, <guilabel>Subversion</guilabel>, <guilabel>Git</guilabel>, <guilabel>GitHub</guilabel>, or <guilabel>KDE</guilabel>
tr: İletişim kutusunda <guilabel>Kaynak Seç</guilabel> altında <guilabel>Dosya Sisteminden</guilabel>, <guilabel>Subversion</guilabel>, <guilabel>Git</guilabel>, <guilabel>GitHub</guilabel> veya <guilabel>KDE</guilabel> seçeneklerinden birini seçin.

source: Choose a working directory as destination into which the sources should be checked out
tr: Kaynakların çıkış yapılacağı hedef olarak bir çalışma dizini seçin.

source: Choose an URL for the location of the repository where the source files can be obtained
tr: Kaynak dosyalarının edinilebileceği deponun konumunu belirten bir URL seçin.

source: Hit <guilabel>Get</guilabel>. This can take quite a long while; depending on the speed of your connection and the size of the project. Unfortunately, in &kdevelop; 4.2.x the progress bar does not actually show anything, but you can track progress by periodically looking at the output of the command line command <screen>du -sk <replaceable>/path/to/&kdevelop;/project</replaceable></screen> to see how much data has already been downloaded.
tr: <guilabel>Al</guilabel> düğmesine tıklayın. Bağlantınızın hızına ve projenin büyüklüğüne bağlı olarak bu biraz vakit alabilir. Ne yazık ki, &kdevelop; 4.2.x sürümünde ilerleme çubuğu bir şey bildirmez; ancak <screen>du -sk <replaceable>/projeye/olan/&kdevelop;/yolu</replaceable></screen> komutunun çıktısına bakarak ne kadar verinin indirildiğine bakabilirsiniz.

source: The problem with the progress bar has been reported as <ulink url="https://bugs.kde.org/show_bug.cgi?id=256832">&kdevelop; bug 256832</ulink>.
tr: İlerleme çubuğuyla ilgili olan sorun <ulink url="https://bugs.kde.org/show_bug.cgi?id=256832">&kdevelop; 256832 numaralı hata kaydında</ulink> bildirildi.

source: In this process, I also get the error message <emphasis>You need to specify a valid location for the project</emphasis> which can be safely ignored.
tr: Bu süreçte ayrıca <emphasis>proje için geçerli bir konum belirtmeniz gerekiyor</emphasis> hata iletisini da alıyorum, ancak bu ileti yok sayılabilir.

source: It asks you to select a &kdevelop; project file in this directory. Since you probably don't have one yet, simply hit <guilabel>Next</guilabel>
tr: Bu dizinde bir &kdevelop; proje dosyası seçmenizi ister. Büyük olasılıkla henüz bir tane olmadığından, yalnızca <guilabel>Sonraki</guilabel> düğmesine basın.

source: Hit <guilabel>Next</guilabel> again
tr: Bir kez daha <guilabel>Sonraki</guilabel> düğmesine tıklayın.

source: &kdevelop; will then ask you to choose a project manager. If this project uses standard &UNIX; make files, choose the custom makefile project manager
tr: &kdevelop; şimdi bir proje yöneticisi seçmenizi isteyecek. Bu proje standart &UNIX; make dosyalarını kullanıyorsa özel makefile proje yöneticisini seçin.

source: &kdevelop; will then start to parse the entire project. Again, it will take quite a while to go through all files and index classes &etc; At the bottom right of the main window, there is a progress bar that shows how long this process has come along. (If you have several processor cores, you can accelerate this process by going to the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kdevelop;</guimenuitem></menuchoice> menu item, then selecting <guilabel>Background parser</guilabel> on the left, and increasing the number of threads for background parsing on the right.)
tr: &kdevelop; daha sonra tüm projeyi ayrıştırmaya başlayacaktır. Yine, tüm dosyaları ve dizin sınıflarını vb. incelemek oldukça uzun sürecektir. Ana pencerenin sağ alt kısmında, bu sürecin ne kadar sürdüğünü gösteren bir ilerleme çubuğu vardır (Birden çok işlemci çekirdeğiniz varsa bu süreci <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>&kdevelop; Uygulamasını Yapılandır</guimenuitem></menuchoice> menü ögesini seçip sonrasında solda <guilabel>Arka Plan Ayrıştırıcısı</guilabel> seçeneğinden arka planda ayrıştırma için kullanılacak iş parçacığı sayısını artırarark ivmelendirebilirsiniz).

source: Option 2: Importing a project that is already on your hard drive
tr: Seçenek 2: Halihazırda sabit diskinizde bulunan bir projeyi içe aktarmak

source: Alternatively, if the project you want to work with already exists on your hard drive (for example, because you have downloaded it as a tar file from an FTP server, because you already checked out a version of the project from a version control system, or because it is your own project that exists <emphasis>only</emphasis> on your own hard drive), then use <menuchoice><guimenu>Projects</guimenu><guimenuitem>Open/Import project</guimenuitem></menuchoice> and in the dialog box choose the directory in which your project resides.
tr: Alternatif olarak, üzerinde çalışmak istediğiniz proje sabit diskinizde halihazırda bulunuyorsa (örneğin, internetten bir tar arşivi indirmiş olabilirsiniz, bir sürüm denetim sisteminden çıkış yapmış olabilirsiniz veya <emphasis>yalnızca</emphasis> sizin sabit diskinizde bulunan bir proje de olabilir) o zaman <menuchoice><guimenu>Projeler</guimenu><guimenuitem>Proje Aç/İçe Aktar</guimenuitem></menuchoice> menü seçeneğini kullanın ve iletişim kutusundan projenizin bulunduğu dizini seçin.

source: Setting up an application as a second project
tr: İkinci bir proje olarak bir uygulamayı ayarlamak

source: The next thing you want to do is set up other projects in the same session. In the example above, you would want to add the device driver as the second project, which you can do using exactly the same steps.
tr: Yapmak isteyeceğiniz bir sonraki şey aynı oturumda diğer projeleri ayarlamaktır. Yukarıdaki örnekte, aygıt sürücüsünü ikinci proje olarak eklemek isteyebilirsiniz, bunu da tam olarak aynı adımları kullanarak yapabilirsiniz.

source: If you have multiple applications or libraries, simply repeat the steps to add more and more projects to your session.
tr: Birden fazla uygulamanız veya kitaplığınız varsa oturumunuza daha fazla proje eklemek için adımları yinelemeniz yeterlidir.

source: Creating projects from scratch
tr: En baştan proje oluşturmak

source: There is of course also the possibility that you want to start a new project from scratch. This can be done using the <menuchoice><guimenu>Projects</guimenu><guimenuitem>New from Template...</guimenuitem></menuchoice> menu item, which presents you with a template selection dialog. Some project templates are provided with &kdevelop;, but even more are available by installing the <application>KAppTemplate</application> application. Choose the project type and programming language from the dialog, enter a name and location for you project, and click <guilabel>Next</guilabel>.
tr: Elbette sıfırdan yeni bir projeye başlama olasılığınız da vardır. Bunu, size bir şablon seçim iletişim kutusu sağlayacak <menuchoice><guimenu>Projeler</guimenu><guimenuitem>Şablondan Yeni…</guimenuitem></menuchoice> menü ögesiyle yapabilirsiniz. Bazı proje şablonları &kdevelop; ile verilir; daha fazlasını <application>K Uygulama Şablonu</application> uygulamasını kurarak edinebilirsiniz. İletişim kutusundan proje türünü ve programlama dilini seçin, projeniz için bir ad ve konum girip <guilabel>Sonraki</guilabel> düğmesine tıklayın.

source: The second page of the dialog allows you to set up a version control system. Choose the system you wish the use, and fill in the system-specific configuration if needed. If you do not wish to use a version control system, or want to set it up manually later, choose <guilabel>None</guilabel>. When you are happy with your choice, press <guilabel>Finish</guilabel>.
tr: İletişim kutusunun ikinci sayfası bir sürüm denetim sistemi kurmanıza olanak tanır. Kullanmak istediğiniz sistemi seçin ve gerekirse sisteme özgü yapılandırmayı doldurun. Bir sürüm denetim sistemi kullanmak istemiyorsanız veya daha sonra elle ayarlamak isterseniz <guilabel>Yok</guilabel> seçeneğini seçin. Seçiminizden memnunsanız <guilabel>Bitir</guilabel> düğmesine tıklayın.
