Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kdevelop.po
Languages: tr

source: Both these problems can be solved by moving the cursor on any of the occurrences of the name of the function and selecting <menuchoice><guimenu>Code</guimenu><guimenuitem>Rename declaration</guimenuitem></menuchoice> (or right clicking on the name and selecting <guilabel>Rename Bus::remove_students</guilabel>). This brings up a dialog box where you can enter the new name of the function and where you can also see all the places where the function is actually used:
tr: Bu iki sorun da, imleci işlevin adının herhangi bir oluşuna taşıyıp <menuchoice><guimenu>Kod</guimenu><guimenuitem>Beyanı Yeniden Adlandır</guimenuitem></menuchoice> seçerek (veya ada sağ tıklayarak veya <guilabel>Yeniden Adlandır: Bus::remove_students</guilabel>) çözülebilir. Bu, işlevin yeni adını girebileceğiniz ve işlevin gerçekten kullanıldığı tüm yerleri görebileceğiniz bir iletişim kutusu getirir:

source: Code snippets
tr: Kod parçacıkları

source: Most projects have pieces of code that one frequently has to write in source code. Examples are: for compiler writers, a loop over all instructions; for user interface writers, checks that user input is valid and if not to open an error box; in the project of the author of these lines, it would be code of the kind
tr: Çoğu projede kaynak kodda sıklıkla yazılması gereken kod parçaları vardır. Örnekler şunlardır: Derleyici yazarları için tüm komutlar üzerinde bir döngü; kullanıcı arayüzü yazarları için kullanıcı girdisinin geçerli olup olmadığını denetlemek ve değilse bir hata kutusu açmak; bu satırların yazarının projesinde ise aşağıdaki türden bir kod olacaktır:

source: for (typename Triangulation::active_cell_iterator cell = triangulation.begin_active(); cell != triangulation.end(); ++cell) ... do something with the cell ...
tr: for (typename Triangulation::active_cell_iterator cell = triangulation.begin_active(); cell != triangulation.end(); ++cell) … cell ile bir şeyler yap …

source: Rather than typing this kind of text over and over again (with all the concomitant typos one introduces), the <guilabel>Snippets</guilabel> tool of &kdevelop; can help here. To this end, open the tool view (see <link linkend="tools-and-views">Tools and views</link> if the corresponding button isn't already on the perimeter of your window). Then click on the <quote>Add repository</quote> button (a slight misnomer &mdash; it allows you to create a named collection of snippets for source codes of a particular kind, &eg; C++ sources) and create an empty repository. Then click <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject> to add a snippet, to get a dialog like the following:
tr: Bu tür bir metni sürekli baştan yazmak yerine (bu tür şeylerde yanlış yazmak pek kolaydır), &kdevelop; yazılımının <guilabel>Kod Parçacıkları</guilabel> aracını kullanmak yardımcı olabilir. Bunu yapmak için araç görünümünü açın (ilgili düğme görünümünüzde yoksa <link linkend="tools-and-views">Araçlar ve Görünümler</link> bölümüne bakın). Sonrasında <quote>Depo Ekle</quote> düğmesine tıklayın (adı biraz garip gelebilir &mdash; bu, belirli bir tür kaynak dosyalar için; örneğin C++ kaynakları için belirli bir tür parçacık kataloğu eklemenize izin verir) ve boş bir depo oluşturun. Sonrasında bir parçacık eklemek için <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject> düğmesine tıklayın ve şöyle bir iletişim kutusu göreceksiniz:

source: The name of a snippet may not have spaces or other special characters because it must look like a normal function or variable name (for reasons that will become clear in the next paragraph).
tr: Bir kod parçacığı adında boşluk veya diğer özel karakterler bulunmayabilir; çünkü normal bir işlev veya değişken adı gibi görünmelidir (bir sonraki paragrafta açıklığa kavuşacak nedenlerden dolayı).

source: To use a snippet so defined, when you are editing code, you can just type the name of the snippet like you would any other function or variable name. This name will become available for auto-completion &mdash; which means that there is no harm in using a long and descriptive name for a snippet such as the one above &mdash; and when you accept the suggestion of the auto-completion tooltip (for example by just hitting &Enter;), the already entered part of the snippets' name will be replaced by the full expansion of the snippet and will be properly indented:
tr: Bu şekilde tanımlanmış bir kod parçacığını kullanmak için kodu düzenlerken, herhangi bir işlev veya değişken adını yazdığınız gibi kod parçacığının adını yazabilirsiniz. Bu ad, kendiliğinden tamamlama için kullanılabilir hale gelecektir &mdash;yani yukarıdaki gibi bir kod parçacığı için uzun ve açıklayıcı bir ad kullanmanın hiçbir zararı yoktur&mdash; ve kendiliğinden tamamlama araç ipucunun önerisini kabul ettiğinizde (örneğin yalnızca &Enter; düğmesine basarak), kod parçacığı adının önceden girilmiş kısmı parçacığın tam açılımı ile değiştirilecek ve düzgün bir şekilde girintilenecektir:

source: Note that for this to work, the <guilabel>Snippets</guilabel> tool view need not be open or visible: you only ever need the tool view to define new snippets. An alternative, if less convenient, way to expand a snippet is to simply click on it in the respective tool view.
tr: Bunun çalışması için <guilabel>Kod Parçacıkları</guilabel> araç görünümünün açık veya görünür olması gerekmediğini unutmayın: araç görünümüne yalnızca yeni kod parçacıkları tanımlamak için gereksinim duyarsınız. Bir parçacığı genişletmenin daha az kullanışlı olsa da alternatif bir yolu, ilgili araç görünümünde üzerine tıklamaktır.

source: Snippets are much more powerful than just explained. For a full description of what you can do with them, see the <ulink url="https://userbase.kde.org/Special:myLanguage/KDevelop4/Manual/Tool_list/Snippets">detailed documentation of the Snippets tool</ulink>.
tr: Kod parçacıkları, burada anlatılanlardan çok daha güçlüdür. Onlarla yapabileceklerinizin tam bir listesi için <ulink url="https://userbase.kde.org/Special:myLanguage/KDevelop4/Manual/Tool_list/Snippets">ayrıntılı belgelendirmeye</ulink> bir göz atın.

source: Modes and working sets
tr: Kipler ve çalışma kümeleri

source: If you've gotten this far, take a look at the upper right of the &kdevelop; main window: As shown in the picture, you will see that there are three <guilabel>modes</guilabel> &kdevelop; can be in: <guilabel>Code</guilabel> (the mode we discuss in the current chapter on working with source code), <guilabel>Debug</guilabel> (see <link linkend="debugging-programs-in-kdevelop">Debugging programs</link>) and <guilabel>Review</guilabel> (see <link linkend="working-with-version-control-systems">Working with version control systems</link>).
tr: Buraya kadar geldiyseniz &kdevelop; ana penceresinin sağ üst kısmına bir göz atın: Resimde gösterildiği üzere, &kdevelop; yazılımının içinde olabileceği üç <guilabel>kip</guilabel> vardır: <guilabel>Kod</guilabel> (kaynak kodu ile çalışma konusunda geçerli bölümde tartıştığımız kip), <guilabel>Hata Ayıkla</guilabel> (<link linkend="debugging-programs-in-kdevelop">Programlarda hata ayıklamak</link> bölümüne bakın) ve <guilabel>Gözden Geçir</guilabel> (<link linkend="working-with-version-control-systems">Sürüm denetim sistemleriyle çalışmak</link> bölümüne bakın).

source: Each mode has its own set of tools that are stacked around the perimeter, and each mode also has a <emphasis>working set</emphasis> of currently open files and documents. Furthermore, each such working set is associated with a current session, &ie; we have the relationship shown above. Note that the files in the working set come from the same session, but they may come from different projects that are part of the same session.
tr: Her kipin çevresinde yığılmış kendi araç kümeleri vardır ve her kip aynı zamanda o anda açık olan dosya ve belgelerden oluşan bir <emphasis>çalışma kümesine</emphasis> sahiptir. Ayrıca, bu çalışma kümelerinin her biri geçerli bir oturumla ilişkilidir; &ie; yukarıda gösterilen ilişkiye sahibiz. Çalışma kümesindeki dosyaların aynı oturumdan geldiğini; ancak aynı oturumun parçası olan farklı projelerden gelebileceğini unutmayın.

source: If you open &kdevelop; the first time, the working set is empty &mdash; there are no open files. But as you open files for editing (or debugging, or reviewing in the other modes) your working set grows. The fact that your working set is non-empty is indicated by a symbol in the tab, as shown below. You will notice that whenever you close &kdevelop; and later start it again, the working set is saved and restored, &ie; you get the same set of open files.
tr: Eğer &kdevelop; programını ilk kez açıyorsanız çalışma kümesi boştur &mdash; açık dosya yoktur. Ancak düzenleme (veya hata ayıklama veya diğer kiplerde gözden geçirme) için dosya açtıkça çalışma kümeniz büyür. Çalışma kümenizin boş olmadığı, aşağıda gösterildiği gibi sekmede bir sembolle gösterilir. Ne zaman &kdevelop; programını kapatıp daha sonra yeniden başlatırsanız çalışma kümesinin kaydedildiğini ve geri yüklendiğini fark edeceksiniz; &ie; aynı açık dosya kümesine sahip olursunuz.

source: If you hover your mouse over the symbol for the working set, you get a tooltip that shows you which files are currently open in this working set (here: the <varname>step-32.cc</varname> and <varname>step-1.cc</varname> files). Clicking on the red minus sign closes the tab for the corresponding file. Maybe more importantly, clicking on the correspondingly named button allows you to <guilabel>close</guilabel> the entire working set at once (&ie; to close all currently open files). The point about closing a working set, however, is that it doesn't just close all files, it actually saves the working set and opens a new, still empty one. You can see this here:
tr: Farenizi çalışma kümesi sembolünün üzerine getirirseniz bu çalışma kümesinde o anda hangi dosyaların açık olduğunu gösteren bir araç ipucu alırsınız (burada: <varname>step-32.cc</varname> ve <varname>step-1.cc</varname> dosyaları). Kırmızı eksi işaretine tıklandığında ilgili dosyanın sekmesi kapatılır. Belki daha da önemlisi, ilgili düğmeye tıklamak, tüm çalışma kümesini bir kerede <guilabel>kapatmanıza</guilabel> olanak tanır (&ie; o anda açık olan tüm dosyaları kapatmak için). Bununla birlikte, bir çalışma kümesini kapatmak, yalnızca tüm dosyaları kapatmakla kalmaz, aslında çalışma kümesini kaydeder ve yeni, henüz boş olan bir tane açar. Bunu şurada görebilirsiniz:

source: Note the two symbols to the left of the three mode tabs (the heart and the unidentifiable symbol to its left). Each of these two symbols represents a saved working set, in addition to the currently open working set. If you hover your mouse over the heart symbol, you'll get something like this:
tr: Üç kip sekmesinin solundaki iki sembole dikkat edin (kalp ve solundaki tanımlanamayan sembol). Bu iki sembolün her biri, o anda açık olan çalışma kümesine ek olarak kaydedilmiş bir çalışma kümesini temsil eder. Farenizi kalp sembolünün üzerine getirirseniz buna benzer bir şey görürsünüz:

source: It shows you that the corresponding working set contains two files and their corresponding project names: <varname>Makefile</varname> and <varname>changes.h</varname>. Clicking <guilabel>Load</guilabel> will close and save the current working set (which as shown here has the files <varname>tria.h</varname> and <varname>tria.cc</varname> open) and instead open the selected working set. You can also permanently delete a working set, which removes it from the set of saved working sets.
tr: İlgili çalışma kümesinin iki dosya ve bunlara karşılık gelen proje adlarını içerdiğini gösterir: <varname>Makefile</varname> ve <varname>changes.h</varname>. <guilabel>Yükle</guilabel> seçeneğine tıklamak geçerli çalışma kümesini (burada gösterildiği gibi <varname>tria.h</varname> ve <varname>tria.cc</varname> dosyaları açıktır) kapatıp kaydedecek ve bunun yerine seçilen çalışma kümesini açacaktır. Ayrıca bir çalışma kümesini kalıcı olarak silebilirsiniz, bu da onu kayıtlı çalışma kümelerinden kaldırır.

source: Some useful keyboard shortcuts
tr: Bazı kullanışlı klavye kısayolları

source: &kdevelop;'s editor follows the standard keyboard shortcuts for all usual editing operations. However, it also supports a number of more advanced operations when editing source code, some of which are bound to particular key combinations. The following are frequently particularly helpful:
tr: &kdevelop; programının düzenleyicisi, tüm olağan düzenleme işlemleri için standart klavye kısayollarını takip eder. Bununla birlikte, kaynak kodu düzenlerken bazıları belirli düğme kombinasyonlarına bağlı olan bir dizi daha gelişmiş işlemi de destekler. Aşağıdakiler sıklıkla özellikle yararlıdır:

source: Jumping around in code
tr: Kodda gezinmek

source: Quick open file: enter part of a filename and select among all the files in the current session's projects' directory trees that match the string; the file will then be opened
tr: Tez Dosya Aç: Bir dosya adının bir kısmını girin ve geçerli oturumun projelerinin dizin ağaçlarında diziyle eşleşen tüm dosyalar arasından seçim yapın; dosya daha sonra açılacaktır.

source: Quick open class: enter part of a class name and select among all class names that match; the cursor will then jump to the class declaration
tr: Tez Sınıf Aç: Bir sınıf adının bir kısmını girin ve eşleşen tüm sınıf adları arasından seçim yapın; imleç daha sonra sınıf beyanına atlayacaktır.

source: Quick open function: enter part of a (member) function name and select among all names that match; note that the list shows both declarations and definitions and the cursor will then jump to the selected item
tr: Tez İşlev Aç: Bir (üye) işlev adının bir kısmını girin ve eşleşen tüm adlar arasından seçim yapın; listenin hem beyanları hem de tanımları gösterdiğine ve imlecin seçilen ögeye atlayacağına dikkat edin.

source: Universal quick open: type anything (file name, class name, function name) and get a list of anything that matches to select from
tr: Evrensel Tez Aç: Herhangi bir şey yazın (dosya adı, sınıf adı, işlev adı) ve aralarından seçim yapabileceğiniz eşleşenlerin bir listesini alın.

source: Outline: Provide a list of all things that are happening in this file, &eg; class declarations and function definitions
tr: Ana Hat: Bu dosyada olan her şeyin bir listesini sağlar; örneğin sınıf beyanları ve işlev tanımları.

source: Jump to definition of a function if the cursor is currently on a function declaration
tr: İmleç o anda bir işlev beyanı üzerindeyse işlevin tanımına atlar.

source: Jump to declaration of a function or variable if the cursor is currently in a function definition
tr: İmleç o anda bir işlev tanımındaysa bir işlevin veya değişkenin beyanına atlayın.

source: &Ctrl;&Alt;<keycap>PageDown</keycap>
tr: &Ctrl;&Alt;<keycap>Sayfa Aşağı</keycap>

source: Jump to next function
tr: Sonraki işleve atla

source: &Ctrl;&Alt;<keycap>PageUp</keycap>
tr: &Ctrl;&Alt;<keycap>Sayfa Yukarı</keycap>

source: Jump to previous function
tr: Önceki işleve atla

source: Goto line
tr: Satıra git

source: Searching and replacing
tr: Ara ve değiştir

source: Find
tr: Bul

source: Find next
tr: Sonrakini bul

source: Replace
tr: Değiştir

source: Find-Replace in multiple files
tr: Birden çok dosyada bul ve değiştir

source: Other things
tr: Diğer şeyler

source: Collapse one level: remove this block from view, for example if you want to focus on the bigger picture within a function
tr: Bir düzey daralt: Örneğin bir işlev içindeki büyük resme odaklanmak istiyorsanız bu bloğu görünümden kaldırın.

source: Expand one level: undo the collapsing
tr: Bir düzey genişlet: Daraltmayı geri alın.

source: Comment out selected text or current line
tr: Seçili metni veya geçerli satırı yorum yapın.

source: Comment in selected text or current line
tr: Seçilen metindeki veya geçerli satırdaki yorumu kaldırın.

source: Document the current function. If the cursor is on a function or class declaration then hitting this key will create a doxygen-style comment pre-populated with a listing of all parameters, return values, &etc;
tr: Geçerli işlevi belgelendirin. İmleç bir işlev veya sınıf beyanı üzerindeyse bu düğmeye basıldığında tüm parametrelerin, dönüş değerlerinin vb. listesiyle önceden doldurulmuş doxygen tarzı bir yorum oluşturulur;

source: Transpose the current and the previous character
tr: İmlecin üzerindeki ve bir önceki karakterin yerini değiştirin.

source: Delete the current line (note: this is not just emacs' <quote>delete from here to the end of the line</quote>)
tr: Geçerli satırı silin (not: bu yalnızca emacs’in <quote>buradan satır sonuna kadar silme işlemi</quote> değildir).

source: Code generation with templates
tr: Şablonlar ile kod üretimi

source: &kdevelop; uses templates for generating source code files and to avoid writing repeatable code.
tr: &kdevelop; kaynak kodu dosyaları oluşturmak ve aynı kod sürekli yazmaktan kaçınmak için şablonlar kullanır.

source: Creating a new class
tr: Yeni bir sınıf oluşturmak

source: The most common use for code generation is probably writing new classes. To create a new class in an existing project, right click on a project folder and choose <guilabel>Create from Template...</guilabel>. The same dialog can be started from the menu by clicking <menuchoice><guimenu>File</guimenu><guimenuitem>New from Template...</guimenuitem></menuchoice>, but using a project folder has the benefit of setting a base URL for the output files. Choose <filename>Class</filename> in the category selection view, and the desired language and template in the other two views. After you have selected a class template, you will have to specify the details of the new class.
tr: Kod üretimi için en yaygın kullanım büyük olasılıkla yeni sınıflar yazmaktır. Var olan bir projede yeni bir sınıf oluşturmak için bir proje klasörüne sağ tıklayın ve <guilabel>Şablondan Oluştur…</guilabel> ögesini seçin. Aynı iletişim kutusu <menuchoice><guimenu>Dosya</guimenu><guimenuitem>Şablondan Yeni…</guimenuitem></menuchoice> ile de çağrılabilir; ancak bir proje klasörü kullanmanın yararı, çıktı dosyaları için bir taban URL belirleyebilmektir. Kategori seçimi görünümünde <filename>Sınıf</filename> seçimini yapın ve sonraki iki görünümde istenen dili ve şablonu seçin. Bir sınıf şablonu seçtikten sonra yeni sınıfın ayrıntılarını belirtmeniz gerekir.

source: First you have to specify an identifier for the new class. This can be a simple name (like <varname>Bus</varname>) or a complete identifier with namespaces (like <varname>Transportation::Bus</varname>). In the latter case, &kdevelop; will parse the identifier and correctly separate the namespaces from the actual name. On the same page, you can add base classes for the new class. You may notice that some templates choose a base class on their own, you are free to remove it and/or add other bases. You should write the full inheritance statement here, which is language-dependent, such as <varname>public QObject</varname> for C++, <varname>extends SomeClass</varname> for PHP or simply the name of the class for Python.
tr: Öncelikle yeni sınıf için bir tanımlayıcı belirtmeniz gerekir. Bu basit bir ad (<varname>Bus</varname> gibi) veya ad alanlarıyla birlikte tam bir tanımlayıcı (<varname>Transportation::Bus</varname> gibi) olabilir. İkinci durumda, &kdevelop; tanımlayıcıyı ayrıştıracak ve ad alanlarını gerçek addan doğru bir biçimde ayıracaktır. Aynı sayfada, yeni sınıf için temel sınıflar ekleyebilirsiniz. Bazı şablonların kendi başlarına bir temel sınıf seçtiklerini fark edebilirsiniz, bunu kaldırmakta ve/veya başka temel sınıflar eklemekte özgürsünüz. C++ için <varname>public QObject</varname>, PHP için <varname>extends SomeClass</varname> veya Python için yalnızca sınıfın adı gibi dile bağlı olan tam kalıtım ifadesini buraya yazmalısınız.

source: In the next page, you are offered a selection of virtual methods from all inherited classes, as well as some default constructors, destructors and operators. Checking the check box next to a method signature will implement this method in the new class.
tr: Bir sonraki sayfada, miras alınan tüm sınıflardan sanal yöntemlerin yanı sıra bazı öntanımlı kurucular, yıkıcılar ve işleçleren oluşan bir seçki sunulur. Bir yöntem imzasının yanındaki onay kutusunu işaretlemek, bu yöntemi yeni sınıfta uygulayacaktır.

source: Clicking <guilabel>Next</guilabel> brings up a page where you can add members to a class. Depending on the selected template, these may appear in the new class as member variables, or the template may create properties with setters and getters for them. In a language where variable types have to be declared, such as C++, you have to specify both the type and the name of the member, such as <varname>int number</varname> or <varname>QString name</varname>. In other languages, you may leave out the type, but it is good practice to enter it anyway, because the selected template could still make some use of it.
tr: <guilabel>Sonraki</guilabel> düğmesine tıkladığınızda, sınıfa üye ekleyebileceğiniz bir sayfa açılır. Seçilen şablona bağlı olarak, bunlar yeni sınıfta üye değişkenler olarak görünebilir veya şablon bunlar için ayarlayıcıları ve alıcıları olan özellikler oluşturabilir. C++ gibi değişken türlerinin bildirilmesi gereken bir dilde, üyenin hem türünü hem de adını belirtmeniz gerekir, örneğin <varname>int number</varname> veya <varname>QString name</varname> gibi. Diğer dillerde, türü belirtmeyebilirsiniz; ancak yine de girmek iyi bir uygulamadır; çünkü seçilen şablon yine de bunu kullanabilir.

source: In the following pages, you can choose a license for you new class, set any custom options required by the selected template, and configure output locations for all the generated files. By clicking <guilabel>Finish</guilabel>, you complete the assistant and create the new class. The generated files will be opened in the editor, so you can start adding code right away.
tr: İlerleyen sayfalarda, yeni sınıfınız için bir lisans seçebilir, seçili şablonun gerektirdiği özel seçenekleri ayarlayabilir ve oluşturulan tüm dosyalar için çıktı konumlarını yapılandırabilirsiniz. <guilabel>Bitir</guilabel> seçeneğine tıklayarak yardımcıyı tamamlar ve yeni sınıfı oluşturursunuz. Üretilen dosyalar düzenleyicide açılacaktır, böylece hemen kod eklemeye başlayabilirsiniz.

source: After creating a new C++ class, you will be given an option of adding the class to a project target. Choose a target from the dialog page, or dismiss the page and add the files to a target manually.
tr: Yeni bir C++ sınıfı oluşturduktan sonra, sınıfı bir proje hedefine ekleme seçeneği sunulacaktır. İletişim sayfasından bir hedef seçin veya sayfayı kapatın ve dosyaları elle bir hedefe ekleyin.

source: If you chose the <filename>Qt Object</filename> template, checked some of the default methods, and added two member variables, the output should look like on the following picture.
tr: <filename>Qt Nesnesi</filename> şablonunu seçtiyseniz öntanımlı yöntemlerden bazılarını işaretlediyseniz ve iki üye değişken eklediyseniz çıktı aşağıdaki resimdeki gibi görünmelidir.
