Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kdevelop.po
Languages: tr

source: Finally, there are tool views that allow you to navigate to different places in your code base. For example, the <guilabel>Classes</guilabel> tool provides you with a list of all namespaces and classes in all projects of the current session, and allows you to expand it to see member functions and variables of each of these classes: <screenshot> <screeninfo></screeninfo> <mediaobject> <imageobject> <imagedata fileref="kdevelop-17.png" format="PNG"/> </imageobject> <textobject> <phrase></phrase> </textobject> <caption> <para></para> </caption> </mediaobject> </screenshot> Double-clicking on an item (or going through the context menu using the right mouse button) allows you to jump to the location of the declaration of the item. Other tools allow similar things; for example, the <guilabel>Projects</guilabel> tool view provides a list of files that are part of a session: <screenshot> <screeninfo></screeninfo> <mediaobject> <imageobject> <imagedata fileref="kdevelop-13.png" format="PNG"/> </imageobject> <textobject> <phrase></phrase> </textobject> <caption> <para></para> </caption> </mediaobject> </screenshot> Again, double-clicking on a file opens it.
tr: Son olarak, kod tabanınızdaki farklı yerlere gitmenize olanak tanıyan araç görünümleri vardır. Örneğin, <guilabel>Sınıflar</guilabel> aracı size geçerli oturumun tüm projelerinde bulunan tüm ad alanlarının ve sınıfların bir listesini sağlar ve bu listeyi genişleterek bu sınıfların her birinin üye işlevlerini ve değişkenlerini görmenize olanak tanır: <screenshot> <screeninfo></screeninfo> <mediaobject> <imageobject> <imagedata fileref="kdevelop-17.png" format="PNG"/> </imageobject> <textobject> <phrase></phrase> </textobject> <caption> <para></para> </caption> </mediaobject> </screenshot> Bir ögeye çift tıklamak (veya sağ fare düğmesiyle bağlam menüsünde dolanmak) ögenin beyanının konumuna atlamanıza olanak tanır. Diğer araçlar da benzer şeylere olanak tanırlar; örneğin, <guilabel>Projeler</guilabel> araç görünümü, bir oturumun parçası olan dosyaların bir listesini sağlar: <screenshot> <screeninfo></screeninfo> <mediaobject> <imageobject> <imagedata fileref="kdevelop-13.png" format="PNG"/> </imageobject> <textobject> <phrase></phrase> </textobject> <caption> <para></para> </caption> </mediaobject> </screenshot> Yine, bir dosyaya çift tıklamak onu açar.

source: Writing source code
tr: Kaynak kodu yazmak

source: Because &kdevelop; understands your projects' source code, it can assist in writing more code. The following outlines some of the ways in which it does that.
tr: &kdevelop; projelerinizin kaynak kodunu anladığı için daha fazla kod yazmanıza yardımcı olabilir. Aşağıda bunu yapmanın bazı yolları özetlenmektedir.

source: Auto-completion
tr: Kendiliğinden tamamlama

source: Probably the most useful of all features in writing new code is auto-completion. Consider, for example, the following piece of code:
tr: Büyük olasılıkla yeni kod yazarken tüm özellikler arasında en kullanışlı olanı kendiliğinden tamamlamadır. Örneğin, aşağıdaki kod parçasını düşünün:

source: class Car { // ... public: std::string get_color () const; }; void foo() { Car my_ride; // ...do something with this variable... std::string color = my_ride.ge
tr: class Car { // … public: std::string get_color () const; }; void foo() { Car my_ride; // bu değişkenle bir şeyler yap std::string color = my_ride.ge

source: In the last line, &kdevelop; will remember that the variable <varname>my_ride</varname> is of type <varname>Car</varname>, and will automatically offer to complete the name of the member function <varname>ge</varname> as <varname>get_color</varname>. In fact, all you have to do is to keep typing until the auto-completion feature has reduced the number of matches to one, and then hit the &Enter; key:
tr: Son satırdaki <varname>my_ride</varname> ögesinin <varname>Car</varname> türünün bir değişkeni olduğunu anımsar ve hem <varname>ge</varname> ögesini <varname>get_color()</varname> olarak tamamlamayı önerir; çünkü bu, <varname>Car</varname> sınıfında böyle başlayan tek değişkendir. Yazmayı sürdürmek yerine tam sözcüğü almak için yalnızca &Enter; düğmesine basın; bu size zaman kazandırır; yanlış yazımları önler ve büyük projelerdeki yüzlerce veya binlerce değişkeni veya sınıfı ezberlemekten sizi kurtarır.

source: Note that you can click on the tool-tip to get more information about the function apart from its return type and whether it is public:
tr: Dönüş türü ve genel olup olmadığı dışında işlev hakkında daha fazla bilgi almak için araç ipucuna tıklayabileceğinizi unutmayın:

source: Auto-completion can save you a lot of typing if your project uses long variable and function names; furthermore, it avoids mis-spelling names (and the resulting compiler errors) and it makes it much simpler to remember the exact names of functions; for example, if all of your getters start with <varname>get_</varname>, then the auto-completion feature will be able to only present you a list of possible getters when you have typed the first four letters, likely reminding you in the process which of the functions is the correct one. Note that for auto-completion to work, neither the declaration of the <varname>Car</varname> class nor of the <varname>my_ride</varname> variable need to be in the same file as where you are currently writing code. &kdevelop; simply has to know that these classes and variables are connected, &ie; the files in which these connections are made need to be part of the project you are currently working on.
tr: Kendiliğinden tamamlama özelliği, projenizde uzun değişken ve işlev adları kullanıyorsanız sizi çok fazla yazmaktan kurtarabilir; ayrıca, adların yanlış yazılmasını (ve bunun sonucunda derleyici hatalarını) önler ve işlevlerin tam adlarını hatırlamayı çok daha basit hale getirir; örneğin, tüm alıcılarınız <varname>get_</varname> ile başlıyorsa kendiliğinden tamamlama özelliği yalnızca ilk dört harfi yazdığınızda size olası alıcıların bir listesini sunabilir ve büyük olasılıkla bu süreçte size hangi işlevin doğru olduğunu hatırlatır. Kendiliğinden tamamlamanın çalışması için ne <varname>Car</varname> sınıfının ne de <varname>my_ride</varname> değişkeninin bildiriminin şu anda kod yazdığınız yerle aynı dosyada olması gerekmediğini unutmayın. &kdevelop; yalnızca bu sınıfların ve değişkenlerin bağlantılı olduğunu bilmelidir; &ie; bu bağlantıların yapıldığı dosyaların şu anda üzerinde çalıştığınız projenin bir parçası olması gerekir.

source: &kdevelop; doesn't always know when to assist you in completing code. If the auto-completion tooltip doesn't automatically open, hit <keycombo>&Ctrl;<keycap>Space</keycap></keycombo> to open a list of completions manually. In general, in order for auto-completion to work, &kdevelop; needs to parse your source files. This happens in the background for all files that are part of the projects of the current session after you start &kdevelop;, as well as while after you stop typing for a fraction of a second (the delay can be configured).
tr: &kdevelop; kod tamamlama konusunda size ne zaman yardımcı olacağını her zaman bilemez. Kendiliğinden tamamlama araç ipucu kendiliğinden açılmazsa tamamlamaların listesini elle açmak için <keycombo>&Ctrl;<keycap>Space</keycap></keycombo> düğmelerine basın. Genel olarak, kendiliğinden tamamlamanın çalışması için &kdevelop; yazılımının kaynak dosyalarınızı ayrıştırması gerekir. Bu, &kdevelop; yazılımını başlattıktan sonra geçerli oturumun projelerinin bir parçası olan tüm dosyalar için arka planda ve ayrıca bir saniyenin bir kısmı için yazmayı bıraktıktan sonra gerçekleşir (gecikme yapılandırılabilir).

source: &kdevelop; only parses files that it considers source code, as determined by the MIME-type of the file. This type isn't set before the first time a file is saved; consequently, creating a new file and starting to write code in it will not trigger parsing for auto-completion until after it is saved for the first time.
tr: &kdevelop;, yalnızca dosyanın MIME türüne göre kaynak kod olarak kabul ettiği dosyaları ayrıştırır. Bu tür, bir dosya ilk kez kaydedilmeden önce ayarlanmaz; sonuç olarak, yeni bir dosya oluşturmak ve içine kod yazmaya başlamak, ilk kez kaydedilene kadar kendiliğinden tamamlama için ayrıştırmayı tetiklemeyecektir.

source: As in the previous note, for auto-completion to work, &kdevelop; must be able to find declarations in header files. For this, it searches in a number of default paths. If it doesn't automatically find a header file, it will underline the name of a header file in red; in that case, right click on it to tell &kdevelop; explicitly where to find these files and the information they provide.
tr: Önceki notta olduğu gibi, kendiliğinden tamamlamanın çalışması için &kdevelop; üstbilgi dosyalarındaki bildirimleri bulabilmelidir. Bunun için bir dizi öntanımlı yolda arama yapar. Kendiliğinden bir üstbilgi dosyası bulamazsa bir üstbilgi dosyasının adının altını kırmızıyla çizecektir; bu durumda, &kdevelop; yazılımına bu dosyaları ve sağladıkları bilgileri nerede bulacağını açıkça söylemek için üzerine sağ tıklayın.

source: Configuring auto-completion is discussed in <link linkend="customizing-code-auto-completion">this section of this manual</link>.
tr: Kendiliğinden tamamlamayı yapılandırma hakkında bilgiyi <link linkend="customizing-code-auto-completion">kılavuzun bu bölümünde</link> bulabilirsiniz.

source: Adding new classes and implementing member functions
tr: Yeni sınıflar eklemek ve üye işlevler gerçeklemek

source: &kdevelop; has an assistant for adding new classes. The procedure is described in <link linkend="creating-a-new-class">Creating a new class</link>. A simple C++ class can be created by choosing the Basic C++ template from the <filename>Class</filename> category. In the assistant, we can choose some predefined member functions, for example an empty constructor, a copy constructor and a destructor.
tr: &kdevelop;, yeni sınıflar eklemek için bir yardımcıya sahiptir. Prosedür, <link linkend="creating-a-new-class">Yeni bir sınıf oluşturmak</link> bölümünde açıklanmıştır. <filename>Class</filename> kategorisinden Temel C++ şablonu seçilerek basit bir C++ sınıfı oluşturulabilir. Yardımcıda, önceden tanımlanmış bazı üye işlevleri seçebiliriz; örneğin, boş bir yapıcı, bir kopya yapıcısı ve bir yıkıcı.

source: After completing the assistant, the new files are created and opened in the editor. The header file already has include guards and the new class has all the member functions we selected. The next two steps would be to document the class and its member functions and to implement them. We will discuss aids for documenting classes and functions below. To implement the special functions already added, simply go to the <guilabel>bus.cpp</guilabel> tab where the skeleton of functions are already provided:
tr: Yardımcıyı tamamladıktan sonra, yeni dosyalar oluşturulur ve düzenleyicide açılır. Üstbilgi dosyası halihazırda include korumalarına sahiptir ve yeni sınıf seçtiğimiz tüm üye işlevlere sahiptir. Sonraki iki adım, sınıfı ve üye işlevleri belgelemek ve bunları uygulamak olacaktır. Sınıfları ve işlevleri belgelendirmeye yönelik yardımcıları aşağıda tartışacağız. Eklenmiş olan özel işlevleri uygulamak için işlevlerin iskeletinin zaten sağlanmış olduğu <guilabel>bus.cpp</guilabel> sekmesine gitmeniz yeterlidir:

source: To add new member functions, go back to the <guilabel>bus.h</guilabel> tab and add the name of a function. For example, let us add this:
tr: Yeni üye işlevler eklemek için <guilabel>bus.h</guilabel> sekmesine geri dönün ve bir işlevin adını ekleyin. Örneğin, şunu ekleyelim:

source: Note how I have already started with the implementation. However, in many coding styles, the function shouldn't be implemented in the header file but rather in the corresponding .cpp file. To this end, locate the cursor on the name of the function and select <menuchoice><guimenu>Code</guimenu><guimenuitem>Move to source</guimenuitem></menuchoice> or hit <keycombo>&Ctrl;&Alt;<keycap>S</keycap></keycombo>. This remove the code between curly braces from the header file (and replaces it by a semicolon as necessary to terminate the function declaration) and moves it into the source file:
tr: Uygulamaya nasıl başladığıma dikkat edin. Ancak, birçok kodlama tarzında, işlev üstbilgi dosyasında değil, ilgili .cpp dosyasında uygulanmalıdır. Bu amaçla, imleci işlevin adının üzerine getirin ve <menuchoice><guimenu>Kod</guimenu><guimenuitem>Kaynağa Taşı</guimenuitem></menuchoice> seçeneğini seçin veya <keycombo>&Ctrl;&Alt;<keycap>S</keycap></keycombo> düğmelerine basın. Bu, süslü ayraçlar arasındaki kodu üstbilgi dosyasından kaldırır (ve işlev beyanını sonlandırmak için gerektiği şekilde noktalı virgülle değiştirir) ve kaynak dosyaya taşır:

source: Note how I have just started typing and that I meant to imply that the <varname>students</varname> variable should probably be a member variable of class <varname>Bus</varname> but that I haven't yet added it. Note also how &kdevelop; underlines it to make clear that it doesn't know anything about the variable. But this problem can be solved: Clicking on the variable name yields the following tooltip:
tr: Yazmaya nasıl başladığıma ve <varname>students</varname> değişkeninin büyük olasılıkla <varname>Bus</varname> sınıfının bir üye değişkeni olması gerektiğini; ancak henüz eklemediğimi ima etmek istediğime dikkat edin. Ayrıca &kdevelop; yazılımının değişken hakkında hiçbir şey bilmediğini açıkça belirtmek için nasıl altını çizdiğine dikkat edin. Ancak bu sorun çözülebilir: Değişken adına tıklandığında aşağıdaki araç ipucu görüntülenir:

source: (The same can be achieved by right clicking on it and selecting <guilabel>Solve: Declare As</guilabel>.) Let me select <quote>3 - private unsigned int</quote> (either by mouse, or by hitting <keycombo>&Alt;<keycap>3</keycap></keycombo>) and then see how it comes out in the header file:
tr: (Aynısı üzerine sağ tıklayarak veya <guilabel>Çöz: Şöyle Beyan Et</guilabel> seçilerek yapılabilir.) <quote>3 — private unsigned int</quote> seçmeme (ya fareyle ya da <keycombo>&Alt;<keycap>3</keycap></keycombo> düğmelerine basarak) ve üstbilgi dosyasında nasıl olduğuna bakmama izin verin:

source: It is worth noting that &kdevelop; extracts the type of the variable to be declared from the expression used to initialize it. For example, if we had written the addition in the following rather dubious way, it would had suggested to declare the variable as type <varname>double</varname>:
tr: Şunu belirtmek gerekir ki &kdevelop; beyan edilecek değişkenin türünü, onu ilklendirmek için kullanılan ifadeden çıkarır. Örneğin, eklemeyi aşağıdaki oldukça şüpheli şekilde yazmış olsaydık, değişkeni <varname>double</varname> türünde bildirmeyi önerecekti:

source: As a final point: The method using <menuchoice><guimenu>Code</guimenu><guimenuitem>Move to source</guimenuitem></menuchoice> does not always insert the new member function where you may want it. For example, you may want it to be marked as <varname>inline</varname> and place it at the bottom of the header file. In a case like this, write the declaration and the start writing the definition of the function like this:
tr: Son bir nokta olarak: <menuchoice><guimenu>Kod</guimenu><guimenuitem>Kaynağa Taşı</guimenuitem></menuchoice> kullanan yöntem, yeni üye işlevi her zaman istediğiniz yere yerleştirmez. Örneğin, <varname>inline</varname> olarak imlenmesini ve üstbilgi dosyasının en altına yerleştirilmesini isteyebilirsiniz. Böyle bir durumda, beyanı yapın ve işlevin tanımını yazmaya şu şekilde başlayın:

source: &kdevelop; automatically offers all possible completions of what might come here. Selecting one of the two <varname>add_students</varname> entries yields the following code that already fills in the complete argument list:
tr: &kdevelop; buraya gelebilecek tüm olası tamamlamaları kendiliğinden sunar. İki <varname>add_students</varname> girdisinden biri seçildiğinde, argüman listesinin tamamını dolduran aşağıdaki kod ortaya çıkar:

source: In the example, accepting one of the choices the auto-completion tool offers yields the correct signature but unfortunately deletes the <varname>inline</varname> marker already written. This has been reported as <ulink url="https://bugs.kde.org/show_bug.cgi?id=274245">&kdevelop; Bug 274245</ulink>.
tr: Örnekte, kendiliğinden tamamlama aracının sunduğu seçeneklerden birini kabul etmek doğru imzayı verir; ancak ne yazık ki zaten yazılmış olan <varname>inline</varname> imleyicisini siler. Bu, <ulink url="https://bugs.kde.org/show_bug.cgi?id=274245">&kdevelop; 274245</ulink> numaralı hatada bildirilmiştir.

source: Documenting declarations
tr: Beyanları belgelendirmek

source: Good code is well documented, both at the level of the implementation of algorithms within in functions as well as at the level of the interface &mdash; &ie;, classes, (member and global) functions, and (member or global) variables need to be documented to explain their intent, possible values of arguments, pre- and postconditions, &etc; As far as documenting the interface is concerned, <ulink url="http://www.doxygen.org">doxygen</ulink> has become the de facto standard for formatting comments that can then be extracted and displayed on searchable webpages.
tr: İyi kod, hem işlevlerdeki algoritmaların uygulanması düzeyinde hem de arayüz düzeyinde iyi belgelendirilmiş koddur &mdash; yani sınıflar, (üye ve global) işlevler ve (üye veya global) değişkenler, amaçlarını, argümanların olası değerlerini, ön ve son koşullarını açıklamak için belgelendirilmelidir. Arayüzün belgelendirilmesi söz konusu olduğunda, <ulink url="http://www.doxygen.org">doxygen</ulink>, daha sonra çıkarılabilen ve aranabilir web sayfalarında görüntülenebilen yorumları biçimlendirmek için fiili standart haline gelmiştir.

source: &kdevelop; supports this style of comments by providing a short cut to generate the framework of comments that document a class or member function. For example, assume you have already written this code:
tr: &kdevelop;, bir sınıfı veya üye işlevi belgelendiren yorumların çerçevesini oluşturmak için kısa bir yol sağlayarak bu tarz yorumları destekler. Örneğin, bu kodu halihazırda yazdığınızı varsayalım:

source: You now want to add documentation to both the class and the member function. To this end, move the cursor onto the first line and select <menuchoice><guimenu>Code</guimenu><guimenuitem>Document Declaration</guimenuitem></menuchoice> or hit <keycombo>&Alt;&Shift;<keycap>D</keycap></keycombo>. &kdevelop; will respond with the following:
tr: Şimdi hem sınıfa hem de üye işleve belgelendirme eklemek istersiniz. Bu amaçla, imleci ilk satıra getirin ve <menuchoice><guimenu>Kod</guimenu><guimenuitem>Beyanı Belgelendir</guimenuitem></menuchoice> seçeneğini kullanın veya <keycombo>&Alt;&Shift;<keycap>D</keycap></keycombo> düğmelerine basın. &kdevelop; aşağıdakiyle yanıt verecektir:

source: The cursor is already in the grayed out area for you to fill in the short description (after the doxygen keyword <varname>@brief</varname>) of this class. You can then continue to add documentation to this comment that gives a more detailed overview of what the class does:
tr: İmleç, bu sınıfın kısa açıklamasını (<varname>@brief</varname> doxygen anahtar sözcüğünden sonra) doldurmanız için halihazırda gri renkli alandadır. Daha sonra bu bölüme sınıfın ne yaptığına dair daha ayrıntılı bir genel bakış sağlayan belgelendirme eklemeyi sürdürebilirsiniz:

source: While the editor is inside the comment, the comment text is highlighted in green (the highlighting disappears once you move the cursor out of the comment). When you get to the end of a line, hit &Enter; and &kdevelop; will automatically start a new line that starts with an asterisk and place the cursor one character indented.
tr: Düzenleyici yorumun içindeyken, yorum metni yeşil renkte vurgulanır (imleci yorumun dışına taşıdığınızda vurgulama kaybolur). Bir satırın sonuna geldiğinizde, &Enter; düğmesine basın ve &kdevelop; kendiliğinden yıldız işaretiyle başlayan yeni bir satır başlatacak ve imleci bir karakter girintili olarak yerleştirecektir.

source: Now let's document the member function, again by putting the cursor on the line of the declaration and selecting <menuchoice><guimenu>Code</guimenu><guimenuitem>Document Declaration</guimenuitem></menuchoice> or hitting <keycombo>&Alt;&Shift;<keycap>D</keycap></keycombo>:
tr: Şimdi işlevi beyanın olduğu satıra koyup <menuchoice><guimenu>Kod</guimenu><guimenuitem>Beyanı Belgelendir</guimenuitem></menuchoice> seçerek veya <keycombo>&Alt;&Shift;<keycap>D</keycap></keycombo> düğmelerine basarak üye işlevi belgelendirelim:

source: Again, &kdevelop; automatically generates the skeleton of a comment, including documentation for the function itself, as well as its return type. In the current case, the name of the function is pretty much self-explanatory, but oftentimes function arguments may not be and should be documented individually. To illustrate this, let's consider a slightly more interesting function and the comment &kdevelop; automatically generates:
tr: Yine &kdevelop;, işlevin kendisi için belgelendirmenin yanı sıra geri dönüş türünü de içeren bir yorumun iskeletini kendiliğinden oluşturur. Geçerli durumda, işlevin adı hemen hemen kendini açıklayıcıdır; ancak çoğu zaman işlev argümanları olmayabilir ve ayrı ayrı belgelendirilmelidir. Bunu göstermek için biraz daha ilginç bir işlevin ve &kdevelop; yazılımının kendiliğinden oluşturduğu yorumu ele alalım:

source: Here, the suggested comment already contains all the Doxygen fields for the individual parameters, for example.
tr: Burada, önerilen yorum, örneğin bireysel parametreler için tüm doxygen alanlarını halihazırda içerir.

source: Renaming variables, functions and classes
tr: Değişkenleri, işlevleri ve sınıfları yeniden adlandırmak

source: Sometimes, one wants to rename a function, class or variable. For example, let's say we already have this:
tr: Bazen bir işlevi, sınıfı veya değişkeni yeniden adlandırmak isteyebilirsiniz. Örneğin, halihazırda şöyle bir kodumuz olduğunu varsayalım:

source: We then realize that we're unhappy with the name <varname>remove_students</varname> and would have rather called it, say, <varname>throw_out_students</varname>. We could do a search-replace for the name, but this has two drawbacks:
tr: Daha sonra <varname>remove_students</varname> adından memnun olmadığımızı ve örneğin <varname>throw_out_students</varname> demeyi tercih ettiğimizi fark ederiz. Ad için bir arama–değiştirme yapabiliriz; ancak bunun iki dezavantajı vardır:

source: The function may be used in more than one file.
tr: İşlev birden fazla dosyada kullanılabilir.

source: We really only want to rename this function and not touch functions that may have the same name but are declared in other classes or namespaces.
tr: Özünde yalnızca bu işlevi yeniden adlandırmak istiyoruz ve aynı ada sahip olabilecek; ancak başka sınıflarda veya ad alanlarında bildirilmiş işlevlere dokunmuyoruz.
