Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kdf.po
Languages: tr

source: The &kdiskfree; Handbook
tr: &kdiskfree; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Applications 16.08
tr: Uygulamalar 16.08

source: &kdiskfree; displays available file devices, along with information about them.
tr: &kdiskfree;, kullanılabilir aygıtları ve onların bilgilerini gösterir.

source: disks
tr: diskler

source: devices
tr: aygıtlar

source: mount
tr: bağla

source: unmount
tr: ayır

source: Introduction
tr: Giriş

source: &kdiskfree; displays the available file devices (hard drive partitions, floppy and &CD; drives, USB sticks &etc;) along with information on their capacity, free space, type and mount point. It also allows you to mount and unmount drives and view them in a file manager.
tr: &kdiskfree; kullanılabilir dosya aygıtlarını (sabit sürücü bölüntüleri, disket ve &CD; sürücüleri, USB bellekler &etc;) sığa, boş alan, tür ve bağlama noktası hakkında bilgileriyle birlikte görüntüler. Ayrıca sürücüleri bağlamanıza ve çıkarmanıza; bir dosya yöneticisinde görüntülemenize olanak tanır.

source: &kdiskfree; is similar to the &systemsettings; Storage Devices module, but takes up less screen space. It is useful if you want to keep a &kdiskfree; window available at all times.
tr: &kdiskfree;, &systemsettings;’nın Depolama Aygıtları modülüne benzerdir, ancak daha az ekran alanı kullanır. &kdiskfree; penceresini hep açık tutmak istediğinizde oldukça kullanışlıdır.

source: Using &kdiskfree;
tr: &kdiskfree; Kullanımı

source: Starting &kdiskfree;
tr: &kdiskfree;’ı Başlatmak

source: Type <userinput><command>kdf</command></userinput> at a command prompt or select <guimenuitem>KDiskFree</guimenuitem> from the <guisubmenu>System</guisubmenu> group in the application launcher. The standard &Qt; and &kde; command options are available, and can be listed by entering <userinput><command>kdf</command> <option>--help</option></userinput> at the command prompt.
tr: Bir komut isteminde <userinput><command>kdf</command></userinput> yazın veya uygulama başlatıcısındaki <guisubmenu>Sistem</guisubmenu> alt grubundan <guimenuitem>K Boş Alan</guimenuitem>’ı seçin. Standart &Qt; ve &kde; komut seçenekleri kullanılabilirdir ve komut isteminde <userinput><command>kdf</command> <option>--help</option></userinput> yazarak listelenebilirler.

source: To run the application as an applet in the systemtray, use <menuchoice><guisubmenu>System</guisubmenu><guimenuitem>KwikDisk</guimenuitem></menuchoice> in application launcher.
tr: Uygulamayı sistem tepsisindeki bir uygulamacık olarak çalıştırmak için uygulama başlatıcısındaki <menuchoice><guisubmenu>Sistem</guisubmenu><guimenuitem>KwikDisk</guimenuitem></menuchoice> ögesini kullanın.

source: The features of &kdiskfree; are also available in the &systemsettings; module <guilabel>Storage Devices</guilabel>.
tr: &kdiskfree; özelliklerine aynı zamanda <guilabel>Depolama Aygıtları</guilabel> &systemsettings; modülünden de erişilebilir.

source: The Main window
tr: Ana pencere

source: The main &kdiskfree; window displays the available file devices.
tr: &kdiskfree; ana penceresi, kullanılabilir aygıtları görüntüler.

source: Normally, the following pieces of information are included:
tr: Normalde, aşağıdaki bilgileri içerilir:

source: <screeninfo>&kdiskfree; Screen</screeninfo>
tr: <screeninfo>&kdiskfree; Ekranı</screeninfo>

source: <phrase>&kdiskfree; Screen</phrase>
tr: <phrase>&kdiskfree; Ekranı</phrase>

source: an icon depicting the type of storage
tr: depolama türünü gösteren bir simge

source: device name
tr: aygıt adı

source: filesystem type
tr: dosya sistemi türü

source: total size
tr: toplam boyut

source: mount point
tr: bağlama noktası

source: free disk space
tr: boş disk alanı

source: the percentage of space used as a number and as a graph.
tr: kullanılan alanın yüzdesinin sayısı ve grafiği.

source: <mousebutton>Left</mousebutton> clicking on the header of a particular column sorts the devices according to that variable. A second <mousebutton>left</mousebutton> click sorts in the opposite order.
tr: Belirli bir sütunun başlığına <mousebutton>sol</mousebutton> fare düğmesi ile tıklamak, aygıtları o değişkene göre sıralır. İkinci bir <mousebutton>sol</mousebutton> tıklama, tersi sırada sıralar.

source: Clicking with the &RMB; on a row pops up a menu. If that device is not currently mounted, the <guimenuitem>Mount Device</guimenuitem> option is available. If the device is mounted, it can be unmounted by choosing <guimenuitem>Unmount Device</guimenuitem>. Selecting <guimenuitem>Open in File Manager</guimenuitem> opens a new window with a graphical view of the files on that device.
tr: Bir satıra &RMB; ile tıklamak bir menü açar. Belirtilen aygıt şu anda bağlı değilse <guimenuitem>Aygıtı Bağla</guimenuitem> seçeneği kullanılabilirdir. Aygıt bağlıysa <guimenuitem>Aygıtın Bağlantısını Kes</guimenuitem> seçeneğiyle bağlantı kesilebilir. <guimenuitem>Dosya Yöneticisinde Aç</guimenuitem> seçeneği, o aygıttaki dosyaların grafiksel bir görünümünü sunan yeni bir pencere açar.

source: The setting for the file manager used by &kdiskfree; is independent from the choice in the &systemsettings; module <guilabel>Default Applications</guilabel>.
tr: &kdiskfree; tarafından kullanılan dosya yöneticisi ayarı, <guilabel>Öntanımlı Uygulamalar</guilabel> &systemsettings; modülündeki seçenekten bağımsızdır.

source: Menu Bar and Configuration
tr: Menü Çubuğu ve Yapılandırma

source: The File Menu
tr: Dosya Menüsü

source: <shortcut><keycap>F5</keycap></shortcut> <guimenu>File</guimenu> <guimenuitem>Update</guimenuitem>
tr: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Güncelle</guimenuitem>

source: Immediately updates the display to reflect the current status
tr: Güncel durumu yansıtacak biçimde görüntüyü anında günceller

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Çık</guimenuitem>

source: <action>Closes</action> &kdiskfree;
tr: &kdiskfree;’ı <action>kapatır</action>

source: Additionally &kdiskfree; has some common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/menus.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/menus.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
tr: Ek olarak &kdiskfree;, bazı &kde; <guimenu>Ayarlar</guimenu> ve <guimenu>Yardım</guimenu> menü ögelerine sahiptir; daha fazla bilgi için &kde; Temelleri"nin <ulink url="help:/fundamentals/menus.html#menus-settings">Ayarlar Menüsü</ulink> ve <ulink url="help:/fundamentals/menus.html#menus-help">Yardım Menüsü</ulink> bölümlerini okuyun.

source: The Settings Dialog
tr: Ayarlar İletişim Kutusu

source: <screeninfo>Configure &kdiskfree; Screen</screeninfo>
tr: <screeninfo>&kdiskfree; Ekranını Yapılandır</screeninfo>

source: <phrase>Configure &kdiskfree; Screen</phrase>
tr: <phrase>&kdiskfree; Ekranını Yapılandır</phrase>

source: This dialog has two tabbed windows, <guilabel>General Settings</guilabel> and <guilabel>Mount Commands</guilabel>
tr: Bu iletişim kutusunun iki adet sekmeli penceresi vardır, <guilabel>Genel Ayarlar</guilabel> ve <guilabel>Bağlama Komutları</guilabel>

source: General Settings
tr: Genel Ayarlar

source: Click on the word <guilabel>visible</guilabel> or <guilabel>hidden</guilabel> to turn display of an data field on or off.
tr: Bir veri alanının görünümünü açıp kapatmak için <guilabel>görünür</guilabel> veya <guilabel>gizli</guilabel> sözcüklerine tıklayın.

source: Change the update frequency by editing the value. The value in the box is the interval (in seconds) between updates of the &kdiskfree; display to reflect the current status.
tr: Değeri düzenleyerek güncelleme sıklığını değiştirin. Kutudaki değer, geçerli durumu yansıtacak biçimde &kdiskfree; ekranın güncellemeleri arasındaki aralıktır (saniye olarak).

source: The <guilabel>File Manager</guilabel> setting controls the command executed when the <guimenuitem>Open Filemanager</guimenuitem> popup menu item is selected.
tr: <guilabel>Dosya Yöneticisi</guilabel> ayarı, <guimenuitem>Dosya Yöneticisini Aç</guimenuitem> açılır menüsü seçildiğinde, çalıştırılacak olan komutu denetler.

source: There are also two check boxes. One controls if a file manager window will be automatically opened when a device is mounted. The other causes an alert window to pop up if a disk gets critically full.
tr: İki onay kutusu vardır. Bir aygıt bağlandığında, bir dosya yöneticisi penceresinin kendiliğinden açılıp açılmayacağını denetler. Diğeriyse bir disk kritik bir biçimde dolduğunda bir uyarı penceresinin açılmasına neden olur.

source: Mount Commands
tr: Bağlama Komutları

source: Allows the user to specify the mount and unmount commands for a given device, as well as the icon used to represent it. More information on these commands can be found on the man page for <application>mount</application> (type <userinput><command>man</command> <option>mount</option></userinput> at the command prompt).
tr: Kullanıcının, belirli bir aygıta ait bağlama ve kaldırma komutlarını ve onu temsil etmek için kullanılan simgeyi belirtmesine izin verir. Bu komutlarla ilgili daha fazla bilgiyi <application>mount</application> için man sayfasında bulabilirsiniz. (komut isteminde <userinput><command>man</command> <option>mount</option></userinput> yazın).

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Program Copyright &copy; 1998-2000 &Michael.Kropfberger; &Michael.Kropfberger.mail;
tr: Program Telif Hakkı &copy; 1998–2000 &Michael.Kropfberger; &Michael.Kropfberger.mail;

source: Documentation Copyright &copy; 2000 &Jonathan.Singer; &Jonathan.Singer.mail;
tr: Belgelendirme Telif Hakkı &copy; 2000 &Jonathan.Singer; &Jonathan.Singer.mail;

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviren Kaan Özdinçer <email>kaanozdincer@gmail.com</email></para>
