Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/keditbookmarks_man-kbookmarkmerger.1.po
Languages: tr

source: kbookmarkmerger User's Manual
tr: kbookmarkmerger Kullanıcı Kılavuzu

source: Applications 16.12
tr: Uygulamalar 16.12

source: KDE Applications
tr: KDE Uygulamaları

source: A program for merging a given set of bookmarks into the user's list of bookmarks.
tr: Belirli bir yer imi kümesini kullanıcının yer imi listesinde birleştiren bir program.

source: &kbookmarkmerger; <arg choice="req">directory</arg>
tr: &kbookmarkmerger; <arg choice="req">dizini</arg>

source: Description
tr: Açıklama

source: &kbookmarkmerger; is a program for merging a given set of bookmarks into the user's set of bookmarks; if the user doesn't have any bookmarks created yet, a new bookmark list is created and the given bookmarks are inserted into it. While doing this, &kbookmarkmerger; keeps track of which files were merged in a previous run already, so no bookmark will get installed to the user's bookmarks more than once.
tr: &kbookmarkmerger; belirli bir yer işareti kümesini, kullanıcının yer imi kümesinde birleştirmek için kullanılan bir programdır; kullanıcı henüz oluşturulmuş yer imlerine sahip değilse yeni bir yer imi listesi oluşturulur ve yer imlerine eklenir. Bunu yaparken &kbookmarkmerger;, hangi dosyaların bir önceki çalışmada zaten birleştirildiğini izler; dolayısıyla hiç yer imi, kullanıcının yer imlerine birden fazla kez eklenmez.

source: The traditionally used approach to achieve something like this was to use carefully crafted skeleton home directories when creating a new user account, to provide the user with a standard set of bookmarks. The problem with this approach is that after the user account has been created, no new bookmarks can be propagated.
tr: Böyle bir şeye ulaşmak için geleneksel olarak kullanılan yaklaşım, kullanıcıya yeni bir kullanıcı hesabı oluştururken, kullanıcıya standart yer imi takımı sağlamak için dikkatle hazırlanmış ev dizinleri kullanmaktır. Bu yaklaşımla ilgili sorun, kullanıcı hesabı oluşturulduktan sonra hiçbir yeni yer iminin çoğaltılamaz olmasıdır.

source: This mechanism is useful for system administrators who want to propagate a bookmark pointing to a certain document (for instance, important notes about the system) to all users. Distributors might find it useful as well, for instance by augmenting the software packages they supply with bookmark files which &kbookmarkmerger; merges into the user's bookmark list when the package is installed. That way, documentation shipped with a software package is easily and visibly accessible right after the package has been installed.
tr: Bu mekanizma, belirli bir belgeye işaret eden bir yer imi (örneğin, sistemle ilgili önemli notlar) yaymak isteyen sistem yöneticileri için ve tüm kullanıcılar için yararlıdır. Dağıtıcılar, örneğin, paketin kurulu olduğu sırada &kbookmarkmerger;’ın kullanıcının yer imi listesine eklediği yer imi dosyasıyla sağladıkları yazılım paketlerini genişleterek de kullanabilirler. Bu yolla, bir yazılım paketiyle gönderilen belgeler, paket kurulduktan hemen sonra kolayca ve gözle görülür şekilde erişilebilir olacaktır.

source: The only parameter required by &kbookmarkmerger; is the name of a directory which shall be scanned for bookmark files. All files in the given directory will be considered for being merged into the user's setup. The files in the given directory should be valid <acronym>XBEL</acronym> files.
tr: &kbookmarkmerger; tarafından gereken tek parametre, yer imi dosyaları için taranacak bir dizinin adıdır. Verilen dizindeki tüm dosyalar, kullanıcının kurulumunda birleştirilmek üzere değerlendirilecektir. Verilen dizindeki dosyalar geçerli <acronym>XBEL</acronym> dosyaları olmalıdır.

source: See Also
tr: Ayrıca Bakınız

source: &konqueror; manual
tr: &konqueror; kılavuzu

source: qt6options(7)
tr: kf6options(7)

source: Examples
tr: Örnekler

source: joe@hal9000:~> <command>kbookmarkmerger <filename>/usr/local/extra-bookmarks</filename></command>
tr: yamtar@kde9000:~> <command>kbookmarkmerger <filename>/usr/local/extra-bookmarks</filename></command>

source: Merges all bookmark files stored in <filename>/usr/local/extra-bookmarks</filename> into joe's list of bookmarks.
tr: <filename>/usr/local/extra-bookmarks</filename> içinde depolanmış tüm yer imi dosyalarını Yamtar’ın yer imleri listesiyle birleştirir.

source: Standards
tr: Standartlar

source: <acronym>XBEL</acronym> specification
tr: <acronym>XBEL</acronym> belirtimi

source: Restrictions
tr: Kısıtlamalar

source: When determining whether a given bookmark file has been merged into the user's bookmarks already or not, &kbookmarkmerger; merely looks at the filename of the bookmark file - the contents are not checked at all. This means that changing a bookmark file which was already merged into a user's bookmarks will not trigger merging it once again.
tr: Belirli bir yer imi dosyasının kullanıcının yer imlerine zaten birleştirilip birleştirilmediğini belirlerken &kbookmarkmerger;, yalnızca yer imi dosyasının adına bakar — içerikler hiç denetlenmez. Bu, zaten bir kullanıcının yer imlerine birleştirilen bir yer imi dosyasını değiştirmesinin, onu bir kez daha birleştirmeye başlamayacağı anlamına gelmektedir.

source: Also note that in case a user modifies a bookmark which was merged into his setup, the original bookmark file will be left unmodified.
tr: Ayrıca bir kullanıcının kurulumunda birleştirilen bir yer imini değiştirmesi durumunda, özgün yer imi dosyasının değiştirilmeyeceğini unutmayın.

source: Author
tr: Yazar
