Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kfind_man-kfind.1.po
Languages: tr

source: kfind User's Manual
tr: kfind Kullanıcı El Kitabı

source: Applications 16.12
tr: Uygulamalar 16.12

source: KDE Applications
tr: KDE Uygulamaları

source: file find utility by &kde;
tr: &kde; için dosya bulma aracı

source: <command>kfind</command> <group choice="opt"><option>searchpath</option></group> <arg choice="opt">options</arg>
tr: <command>kfind</command> <group choice="opt"><option>aramayolu</option></group> <arg choice="opt">seçenekler</arg>

source: Description
tr: Açıklama

source: The Find Files tool is a useful method of searching for specific files on your computer, or for searching for files that match a pattern. An example of this could include searching for files of a particular type or with certain letters in the filename, or that contain a certain piece of text in their contents.
tr: Dosyaları Bul aracı, bilgisayarınızdaki belirli dosyaları aramak veya bir desenle eşleşen dosyaları aramak için kullanışlı bir yöntemdir. Bunun bir örneği, belirli bir türe ait dosyaları, dosya adındaki bazı harfleri veya içeriklerinde belirli bir metin parçasını içeren dosyaları aramaktır.

source: &kfind; is a graphical tool, and not normally run from the command line.
tr: &kfind; bir grafik aracıdır ve normal şekilde komut satırından çalışmaz.

source: Options
tr: Seçenekler

source: searchpath
tr: aramyolu

source: You may optionally supply a path to prefill the dialog where to start the search.
tr: İsteğe bağlı olarak, aramayı başlatacağınız yeri önceden doldurmak için bir yol da belirtebilirsiniz.

source: See Also
tr: Ayrıca Bakınız

source: More detailed user documentation is available from <ulink url="help:/kfind">help:/kfind</ulink> (either enter this <acronym>URL</acronym> into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>help:/kfind</parameter></userinput>).
tr: Ayrıntılı kullanıcı belgelendirmesine <ulink url="help:/kfind">help:/kfind</ulink> bölümünden ulaşabilirsiniz (ya da bu <acronym>URL</acronym>’yi &konqueror; adres çubuğuna girin, veya <userinput><command>khelpcenter</command> <parameter>help:/kfind</parameter></userinput> komutunu çalıştırın).

source: Authors
tr: Yazarlar

source: A list of contributors is available in the complete user manual available in khelpcenter.
tr: Katkıda bulunanların bir listesi, khelpcenter içinde bulunan tam kullanım kılavuzunda mevcuttur.

source: This documentation was prepared by &Lauri.Watts; &Lauri.Watts.mail;
tr: Bu belge, &Lauri.Watts; &Lauri.Watts.mail; tarafafından hazırlanmıştır
