Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kfontview.po
Languages: tr

source: Font Viewer
tr: Yazıtipi Görüntüleyicisi

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: fontview
tr: yazıtipi görünümü

source: fonts
tr: yazıtipleri

source: &kfontview; is an application to view and install different types of fonts:
tr: &kfontview;, değişik türdeki yazıtiplerini görüntülemek ve kurmak için bir uygulamadır:

source: &PostScript; type 1 (file extension on &Windows; &amp; OS/2 <filename class="extension">.pfb</filename>/<filename class="extension">.pfm</filename>; on &UNIX;/&Linux; <filename class="extension">.pfa</filename>/<filename class="extension">.afm</filename>)
tr: &PostScript; type 1 (&Windows; &amp; OS/2 üzerinde <filename class="extension">.pfb</filename>/<filename class="extension">.pfm</filename>; on &UNIX;/&Linux; <filename class="extension">.pfa</filename>/<filename class="extension">.afm</filename>)

source: BDF (Bitmap Distribution Format, file extension <filename class="extension">.bdf</filename>)
tr: BDF (Bitmap Distribution Format, dosya uzantısı <filename class="extension">.bdf</filename>)

source: PCF (Portable Compiled Format, file extension <filename class="extension">.pcf</filename>)
tr: PCF (Portable Compiled Format, dosya uzantısı<filename class="extension">.pcf</filename>)

source: You can use it as standalone program to preview and install a font downloaded from the Internet. In the preview you can check that the font has all characters you need.
tr: İnternetten indirilen bir yazıtipini önizlemek ve yüklemek için bağımsız bir program olarak kullanabilirsiniz. Önizlemede, yazıtipinin gereksiniminiz olan tüm karakterlere sahip olup olmadığını denetleyebilirsiniz.

source: Additionally &kfontview; can be launched from the &systemsettings; module <ulink url="help:/kcontrol/fontinst/index.html"> <guilabel>Font Management</guilabel></ulink> to use the extended preview capabilities of &kfontview;.
tr: Ek olarak &kfontview;, &systemsettings; <ulink url="help:/kcontrol/fontinst/index.html"> <guilabel>Yazıtipi Yönetimi </guilabel></ulink> modülünden de başlatılabilir. Buradan, &kfontview; yazılımının geniş önizleme yeteneklerinden yararlanabilirsiniz.

source: Alternatively you can use the <guilabel>Font Management</guilabel> module to install, remove, preview and manage all fonts on your system.
tr: Alternatif olarak, <guilabel>Yazıtipi Yönetimi</guilabel> modülünü kullanarak sisteminize yeni yazıtipleri kurabilir, kaldırabilr, onları önizleyebilir ve tümünü yönetebilirsiniz.

source: <screeninfo>&kfontview; application</screeninfo>
tr: <screeninfo>&kfontview; uygulaması</screeninfo>

source: <phrase>&kfontview; application</phrase>
tr: <phrase>&kfontview; uygulaması</phrase>

source: &kfontview;'s <guilabel>Standard Preview</guilabel> displays your font in several different sizes using a pangram (a sentence using every letter of the alphabet at least once). So you can get a good idea of what it will look like. From the drop down box in the toolbar you can choose additional preview types:
tr: &kfontview; yazılımının <guilabel>Standart Önizleme</guilabel> özelliği, yazıtipinizi bir pangram (alfabenin her harfini en az bir kez kullanan bir tümce) kullanarak birkaç farklı boyutta görüntüler. Böylece nasıl görüneceği hakkında iyi bir fikir edinebilirsiniz. Araç çubuğundaki açılır kutudan ek önizleme türleri seçebilirsiniz:

source: <guilabel>All Characters</guilabel> displays all characters provided by the font in one size.
tr: <guilabel>Tüm Karakterler</guilabel>, yazıtipi tarafından sağlanan tüm karakterleri tek bir boyutta görüntüler.

source: Unicode Block: The Unicode standard arranges groups of characters together in blocks
tr: Unicode Bloku: Unicode standardı, karakterleri bloklar halinde düzenler

source: Unicode Script: In Unicode, a script is a collection of letters and other written signs used to represent textual information in one or more writing systems
tr: Unicode Yazısı: Unicode’da bir yazı, bir veya daha fazla yazı sisteminde bulunan metinsel bilgileri temsil etmek için kullanılan harfler ve diğer yazılı işaretler topluluğudur

source: <guibutton>Change Text</guibutton>: Using this button opens the <guilabel>Preview String</guilabel> dialog where you can insert a user defined text. This feature enables you to check that a font supports the characters you need.
tr: <guibutton>Metni Değiştir</guibutton>: Bu düğmeyi kullanmak, bir kullanıcı tanımlı metni girebileceğiniz <guilabel>Diziyi Önizle</guilabel> iletişim kutusunu açar. Bu özellik, bir yazıtipinin gereksinim duyduğunuz karakterleri içerip içermediğini denetleyebilmenizi sağlar.

source: You can use the zoom buttons or the mousewheel to change the font size in all preview types.
tr: Tüm önizleme türlerinde yazıtipi puntosunu değiştirmek için yakınlaştırma düğmelerini veya fare tekerleğini kullanabilirsiniz.

source: In <guilabel>Unicode Block</guilabel> and <guilabel>Unicode Script</guilabel> preview mode additional tooltip info's are displayed hovering a character with the mouse pointer: The character's Unicode <guilabel>Category</guilabel> and the value in <guilabel> UCS-4</guilabel>, <guilabel>UTF-16</guilabel>, <guilabel>UTF-8</guilabel> and as <guilabel>XML Decimal Entity</guilabel>.
tr: <guilabel>Unicode Bloku</guilabel> ve <guilabel>Unicode Yazısı</guilabel> önizleme kiplerinde bir karakterin üzerine fare işaretçisiyle geldiğinizde ek bir bilgi araç ipucu görüntülenir: Karakterin Unicode <guilabel>Kategori</guilabel>’si ve <guilabel> UCS-4</guilabel>, <guilabel>UTF-16</guilabel>, <guilabel>UTF-8</guilabel> ve<guilabel>XML Ondalık Varlığı</guilabel> türünden değerleri içerilir.

source: To install a font you downloaded from the Internet, click the <guibutton>Install</guibutton> button in the lower-right corner.
tr: İnternetten indirdiğiniz bir yazıtipini kurman için sağ alt köşedeki <guibutton>Kur</guibutton> düğmesine tıklayın.

source: You can install the font for personal us only available to you or system-wide available for all users, the latter will require administrator privileges.
tr: Yazıtipini yalnızca sizin için kullanılabilir olan kişisel veya sistem genelinde tüm kullanıcılar için kurabilirsiniz; ikincisi yönetici ayrıcalıkları gerektirecektir.

source: Fonts are often provided in an archive format like <literal role="extension">zip</literal>. Open these archives with &ark; which provides a simple previewer for fonts. To make use of the extended capabilities of &kfontview; extract the fonts and open them in &kfontview;.
tr: Yazıtipleri genellikle <literal role="extension">zip</literal> gibi bir arşiv biçiminde sağlanır. Bu arşivleri, yazıtipleri için basit bir önizleyici sağlayan &ark; ile açın. &kfontview; yazılımının genişletilmiş özelliklerinden yararlanmak için yazıtiplerini çıkarın ve &kfontview; ile açın.

source: Applications need to be restarted to use of the newly installed fonts.
tr: Yeni kurulan yazıtiplerini kullanabilmeleri için uygulamaların yeniden başlatılması gerekir.
