Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kgpg.po
Languages: tr

source: Here you can configure which gpg binary and which <guilabel>configuration file</guilabel> and home folder are used. These values are autodetected on first start and should already work.
tr: Burada hangi gpg ikilisinin ve hangi <guilabel>yapılandırma dosyasının</guilabel> ve ana klasörün kullanıldığını yapılandırabilirsiniz. Bu değerler ilk açılışta kendiliğinden algılandıklarından halihazırda çalışıyor olmalıdırlar.

source: Using the <ulink url="man:gpg-agent">GnuPG agent</ulink> makes work with GnuPG more comfortable as you do not need to type in your password for every action. It is cached in memory for a while so any operation that would require a password can immediately be done. Note that this may allow other people to use your private keys if you leave your session accessible to them.
tr: <ulink url="man:gpg-agent">GnuPG aracısı</ulink> ile çalışmak her eylem için parolanızı yazmanız gereksinimini kaldırdığından GnuPG ile çalışmayı daha rahat duruma getirir. Bir süre bellekte önbelleğe alınır böylece parola isteyen tüm işlemler anında yapılabilir. Bunun oturumunuzu açık bırakırsanız başkalarının özel anahtarlarınıza erişmesine sebep olabileceğini unutmayın.

source: Key Servers
tr: Anahtar Sunucuları

source: Here you can create a list of keyservers that are shown to you when you open the <link linkend="keyserver">key server dialog</link>. If you run GnuPG from the command line only the key server you set as default here will be used.
tr: Burada <link linkend="keyserver">anahtar sunucusu iletişim kutusunu</link> açtığınızda size gösterilmesini istediğiniz anahtar sunucusu listesini oluşturabilirsiniz. GnuPG’yi komut satırından çalıştırırsanız burada öntanımlı olarak ayarladığınız anahtar sunucusu kullanılır.

source: The protocol used for communication with the key servers is based on &HTTP;, so it makes sense in some environments to <guilabel>honor the &HTTP; proxy when available</guilabel>.
tr: Anahtarlarla iletişimde kullanılan iletişim kuralı &HTTP; tabanlıdır, yani bazı ortamlarda <guilabel>&HTTP; vekiline uymak</guilabel> mantıklıdır.

source: Misc
tr: Çeşitli

source: This section allows the setting of some different features that do not fit into the other sections. You can configure for example to <guilabel>start KGpg automatically at login</guilabel>. The option <guilabel>use mouse selection instead of clipboard</guilabel> changes if selection happens by mouse and pasting by middle mouse button or if all operations are done by keyboard shortcuts.
tr: Bu kısım diğer kısımlara pek uymaya bazı değişik özelliklerin ayarlanmasını sağlar. Örneğin <guilabel>girişte K GPG’nin kendiliğinden başlatılmasını</guilabel> yapılandırabilirsiniz. <guilabel>Pano yerine fare seçimini kullan</guilabel> seçeneği, seçimin fare ile yapılması ve orta fare düğmesi ile yapıştırma veya tüm işlemlerin klavye kısayollarıyla yapılmasını açar/kapatır.

source: You can also change if the systray icon of &kgpg; is shown or not and what action happens if the icon is clicked with the &LMB;. If the systray icon is shown closing the &kgpg; window will minimize the application to tray. If the systray icon is not shown &kgpg; will exit when all windows are closed.
tr: Ayrıca &kgpg;’nin sistem tepsisi simgesinin gösterilip gösterilmeyeceğini ve &LMB; ile tıklanınca ne yapacağını da değiştirebilirsiniz. Sistem tepsisi simgesi gösteriliyorsa &kgpg; penceresini kapatmak uygulamayı tepsiye küçültür. Sistem tepsisi simgesi gösterilmiyorsa &kgpg; tüm pencereler kapatıldığında çıkılır.

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Program copyright &copy; 2002-2003 Jean-Baptiste Mardelle <email>bj@altern.org</email>.
tr: Program telif hakkı &copy; 2002–2003 Jean-Baptiste Mardelle <email>bj@altern.org</email>.

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: İşbaran Akçayır <email>isbaran@gmail.com</email></para><para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
