Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kgpg.po
Languages: tr

source: This value indicates how much you trust the owner of this key to correctly verify the identity of the keys he signs. Taking the owner trust into account gpg creates your own web of trust. You trust the keys you signed. If you assign owner trust to these persons you will also trust the keys they have signed without the need that you first have to sign their keys too.
tr: Bu değer, imzaladığı anahtarların kimliğini doğru şekilde onaylayabilmek için bu anahtarın sahibine ne kadar güvendiğinizi gösterir. Sahip güvenini hesaba katarak gpg kendi güven ağınızı oluşturur. İmzaladığınız anahtarlara güvenirsiniz. Sahip güvenini bu insanlara atarsanız onların imzaladığı anahtarlara da kendiniz imzalamadan güvenebilirsiniz.

source: Signing keys
tr: Anahtarları imzalamak

source: When you sign a key of someone else (let's call her Alice) you announce that you are sure that this key really belongs to that person and the key can be trusted. Of course you really should have checked that. This usually means that you have to meet Alice, check at least one identity card and get the full key fingerprint or a copy of her key. Then you go home and sign that key. Usually you will later upload the newly signed key to a <link linkend="keyserver">key server</link> so everyone knows you have checked that key and the owner may be trusted. Alice will likely do the same so you both will have your keys signed by the other one. If one of you has no identity card at hand it's no problem if the signing happens in only direction.
tr: Başka birisinin anahtarını imzaladığınızda (Ayça diyelim) bu anahtarın gerçekten bu kişiye ait olduğundan ve anahtara güvenilebileceğinden emin olduğunuzu belirtmiş olursunuz. Tabii bunu gerçekten denetlemelisiniz. Bunun anlamı da Ayça ile buluşmanız, en azından kimlik kartına bakmanız ve tam anahtar parmak izini veya anahtarın bir kopyasını almanız demektir. Ardından eve gider ve bu anahtarı imzalarsınız. Ardından genellikle imzalanmış anahtarı bir <link linkend="keyserver">anahtar sunucusuna</link> yükleyerek herkese anahtarı denetlediğinizi ve sahibinin güvenilir olduğunu ilan edersiniz. Ayça da büyük olasılıkla aynısını sizin için yapacaktır; böylecek iki anahtar da ikiniz tarafından imzalanmış olur. Birinizin kimlik kartı yoksa imzalamayı tek yönlü olarak da yapabilirsiniz.

source: But think about what happens if Alice lives on the other end of the world. You communicate with her regularly but there is no chance you will see her anytime soon. How do you trust her key?
tr: Peki Ayça dünyanın diğer ucunda yaşıyorsa n’olacak? Sık sık iletişime geçiyorsunuz; ancak yakın zamanda görüşme olasılığınız yok. Anahtarına nasıl güveneceksiniz?

source: When you select her key and then choose <guimenuitem>Sign Key...</guimenuitem> you will get the dialog that allows you to choose the options how you would like to sign that key.
tr: Bir anahtar seçip <guimenuitem>Anahtarı İmzala…</guimenuitem> ögesine tıkladığınızda, anahtarı nasıl imzalamak istediğinizle ilgili seçeneklerin olduğu iletişim kutusu açılır.

source: Selecting a Secret Key for Signing
tr: İmza için gizli anahtar seçmek

source: First you can choose the key you will use to sign the key. Then you can enter how carefully you checked that she really is the person she pretends to be. This information will be stored together with the signature so it is a guidance for everyone else who might need that signature (more on this below). And then comes the option that would help you if you can't meet Alice in person: <guilabel>Local signature (cannot be exported)</guilabel>. When you activate that option a special version of a signature will be created that can never even by accident leave you keyring.
tr: Önce anahtarı imzalamak için kullanacağınız anahtarı seçebilirsiniz. Ardından gerçekten olduğunu iddia ettiği kişi olup olmadığını ne kadar dikkatli denetlediğinizi. Bu bilgi imzayla birlikte kaydedilir; böylece bu imzaya gereksinim duyan başkaları için yol gösterici olur (aşağıda anlatılacak). Ardından Ayça ile yüz yüze buluşamamanız durumunda size yardımcı olacak seçenek gelir: <guilabel>Yerel imza (dışa aktarılamaz)</guilabel>. Bu seçeneği etkinleştirdiğinizde bir imzanın kazayla bile anahtar halkanızı terk edemeyecek özel bir sürümü oluşturulur.

source: But why is it important how carefully you checked Alice's identity? Who should care? There is a different way to solve your problem with the identity of Alice. If you can't visit Alice anytime soon just think of Trent. You know Trent has a keypair, too. And Trent is a globetrotter, being on a different continent at least twice a month. If you are lucky he will fly close to Alice soon. So you will go and meet with Trent to sign keys. Then you will drop Alice a note that Trent will be at her place soon and ask her if she can meet with him too to sign keys. After all this has happened you know that Trent's key can be trusted and Trent knows that Alice's key can be trusted. If you trust Trent that he has carefully checked Alice's identity then you can also trust her key.
tr: Peki Ayça’nın kimliğini ne kadar dikkatli denetlediğiniz neden önemli? Kimin umrunda olmalı? Ayça’nın kimliğiyle ilgili sorununuzu çözmenin başka bir yolu var. Ayça’yı yakın zamanda ziyaret edemeyecekseniz Bilge’yi kullanmayı düşünürsünüz. Bilge’de de bir anahtar çifti olduğunu biliyorsunuz. Ayrıca Bilge, dünyayı dolaşan, her ay iki farklı kıtada olan bir arkadaş. Şanslıysanız yakın zamanda Ayça’nın yanına uçacaktır. Böylece siz de Bilge ile buluşarak anahtarları imzalarsınız. Ardından Ayça’ya bir not düşerek Bilge’nin yakın zamanda yanına geleceğini, onunla buluşup anahtarları imzalayıp imzalayamayacağını sorarsınız. Tüm bunlar olduktan sonra Bilge’nin anahtarının güvenilir olduğunu ve Bilge’nin Ayça’nın anahtarının güvenilir olduğunu bildiğini bilirsiniz. Bilge’ye Ayça’nın kimliğini denetleme konusunda güveniyorsanız anahtarına da güvenebilirsiniz.

source: These relationships between keys and their owners form a so called web of trust. Within that web there are some important values that define how trustworthy a particular key is. The first thing is how carefully the identity of the key owner was checked. That is the value you have seen above in the secret key selection window. For example you will likely know how to verify your local countries identity card but one from a completely different country may be hard to verify. So you could say that you have very carefully checked Trent's identity because you have seen his identity card and it looks very much the same as yours. But Trent, although he has seen both Alice's identity card and driver license might say he has only done casual checking of her identity as he is not absolutely sure about the documents from that part of the world.
tr: Anahtarlar ve kişiler arasındaki bu ilişkiler bir çeşit güven ağı oluşturur. Bu ağda belirli bir anahtarın ne kadar güvenilir olduğunu belirleyen bazı önemli değerler vardır. İlki, anahtar sahibinin kimliğinin ne kadar dikkatli denetlendiğidir. Bu özel anahtar seçim penceresinde gördüğünüz değerdir. Örneğin ülkenizin kimlik kartını nasıl doğrulayacağınızı büyük olasılıkla bilirsiniz; ancak tümüyle farklı bir ülkeden bir kimlik kartını doğrulamak zor olabilir. Yani Bilge’nin kimliğini dikkatlice denetlediğinizi; çünkü kimlik kartını gördüğünüzü ve sizinkiyle oldukça aynı göründüğünü söyleyebilirsiniz. Ancak Bilge, hem Ayça’nın kimlik kartını hem de sürücü belgesini gördüğü halde dünyanın bu kısmındaki belgelerle ilgili tümüyle emin olmadığını bu yüzden sıradan bir denetim yaptığını söyleyebilir.

source: The next important value is how much you trust the other person to verify documents. You know Trent is good at that. But George for example is no one you would call smart. He barely looked at your id card when you met him for key signing. You are sure that George is the person he pretends to be as you checked his documents carefully. But he doesn't seem to really care if he checks other people so you will have a high trust in the key of George but a very low trust in the signatures of George. If you open the <link linkend="keyproperties">properties</link> of a key you will find the field <guilabel>Owner Trust</guilabel>. This is how much you trust the key owner when he signs keys. This value will not be exported, it is completely up to your personal preference.
tr: İkinci önemli değer, diğer kişinin belgeleri onaylamasına ne kadar güvendiğinizdir. Bilge’nin bu işte iyi olduğunu biliyorsunuz. Ancak Ebubekir örneğin pek aklı başında biri değil. Anahtar imzalamak için buluştuğunuzda gözünün ucuyla kimlik kartınıza baktı. Siz Ebubekir’in belgelerini dikkatle incelediğinizden söylediği kişi olduğundan eminsiniz. Ancak kendisi diğer insanları gerçekten denetleyebilecek biri değil; demek oluyor ki Ebubekir’in anahtarına yüksek güven duyuyorsunuz; ancak imzalarına pek güvenmiyorsunuz. Bir anahtarın <link linkend="keyproperties">özelliklerini</link> açtığınızda <guilabel>Sahip güvenilirliği</guilabel> diye bir alan bulursunuz. Bu anahtar sahibi bir anahtarı imzaladığında buna ne kadar güveneceğinizi belirler. Bu değer dışa aktarılmaz, tümüyle kişisel tercihinizdir.

source: Now you should have an idea how the web of trust is built, what the owner and key trust values are for, and why you always should be very careful when checking identities: other people might rely on you. But one element in the process is still unverified: the email addresses in the keys you signed. Creating a new user identity in your key with the email address of Alice or Trent will only take a few mouse clicks. You have verified that Trent really owns his key. But noone has checked until now that Trent really controls the email addresses of his user identities.
tr: Artık güven ağının nasıl örüldüğünü, sahip ve anahtar güven değerlerinin ne için olduğunu ve kimlikleri denetlerken neden her zaman çok dikkatli olmanız gerektiğini biliyor olmalısınız. Başkaları size güveniyor olabilir; ancak süreçteki bir öge hâlâ doğrulanmadı: İmzaladığınız anahtarlardaki e-posta adresleri. Anahtarınızda Ayça veya Bilge’nin e-posta adresleri ile yeni bir kimlik oluşturmak normalde yalnızca birkaç fare tıklaması alır. Bilge’nin gerçekten anahtarına sahip olduğunu doğruladınız. Ancak şimdiye kadar kimsenin aklına Bilge’nin kullanıcı kimliklerindeki e-posta adresine erişimi olup olmadığını denetlemek gelmedi.

source: If you choose <guimenuitem>Sign and Mail User ID...</guimenuitem> from the menu instead you can close that gap. The idea is that you will sign the key as usual and afterwards it will be split into pieces. Every piece will only contain one user identity of Trent's key and your signature to it. This will be encrypted with Trent's key and sent only to the email address given in that identity. Only if Trent can receive this mail and decrypt the message he will be able to import that signature into his key ring. You will not upload your signatures, this is entirely up to him. If your signature will show up on a key server you can be sure that Trent really controls both his key as well as the email address you signed. The signatures you make in this process will also be not part of your keyring. So right after you signed Trent's key it will still be shown as untrusted in your keyring. Once Trent has received your mail and imported your signature into his keyring he can upload them to a keyserver. When you refresh his key from a keyserver you will get the new signatures. While that may sound inconvenient first it makes sure that you will not by accident see one of his identities as trusted that he does not control. Only the signatures that show up on a keyserver are those where everyone, including you, can be sure that he really controls the corresponding email addresses.
tr: Menüden <guimenuitem>Kullanıcı Kimliğini İmzala ve Postala…</guimenuitem> ögesini seçerseniz bu açığı kapatabilirsiniz. Buradaki amaç, anahtarı normal bir biçimde imzalamanızın ardından parçalara bölmek üzerinedir. Her parça Bilge’nin anahtarının yalnızca bir kullanıcı kimliğini ve sizin ona imzanızı içerecektir. Bu, Bilge’nin anahtarıyla şifrelenecek ve yalnızca bu kimliğe verilen e-posta adresine gönderilecektir. Bilge, yalnızca bu postayı alıp iletinin şifresini açabilirse bu imzayı anahtar halkasına ekleyebilecektir. Siz imzalarınızı yüklemeyeceksiniz, bu tümüyle ona bağlıdır. Eğer imzanız bir anahtar sunucusunda görünürse Bilge’nin hem anahtarını hem de imzaladığınız e-posta adresini gerçekten denetlediğinden emin olabilirsiniz. Bu süreçte yaptığınız imzalar da anahtar halkanızın bir parçası olmayacaktır. Yani Bilge’nin anahtarını imzaladıktan sonra sizin anahtar halkanızda güvenilmez olarak görünmeyi sürdürecektir. Bilge postanızı aldıktan ve imzanızı kendi anahtar halkasına içe aktardıktan sonra onları bir anahtar sunucusuna yükleyebilir. Onun anahtarını bir anahtar sunucusundan güncellediğinizde yeni imzaları alırsınız. Yalnızca bir anahtar sunucusundaki imzalar herkesin, siz de dahil, gerçekten e-posta adreslerini denetlediğini anlamasını sağlar.

source: Working with key servers
tr: Anahtar sunucularıyla çalışmak

source: Communication with key servers
tr: Anahtar sunucularıyla iletişim

source: The public part of a key pair is usually stored on a key server. These servers allow anyone to search for a key belonging to a specific person or mail address. The signatures are also stored on these servers.
tr: Bir anahtar çiftinin genel olan kısmı genellikle bir anahtar sunucusunda saklanır. Bu sunucular, herkesin aradığı bir anahtarın belirli bir kişiye veya posta adresine ait olduğunu bilmesini sağlar. İmzalar da bu sunucularda saklanır.

source: Here's a screen shot of keyserver window.
tr: İşte bir anahtar sunucusu penceresinin ekran görüntüsü.

source: This dialog gives you access to the keyservers. You can search and import keys from a keyserver as well as export keys to a server. An example of searching and importing is when you want to write a mail to someone new. If you would like to encrypt your mail to your contact you can search if he or she has a public key on the key servers. If you have created a new key pair or have signed someone else's key you might want to export the public key (possibly with new signatures) to a keyserver.
tr: Bu iletişim kutusu, anahtar sunucularına erişim verir. Bir sunucuda anahtar araması yapıp anahtarları indirebileceğiniz gibi sunucuya dışa da aktarabilirsiniz. Arama ve içe aktrama örneğini yeni birine posta yazarken görebilirsiniz. Yazdığınız postayı iletişim kurduğunuz kişiye şifrelemek isterseniz anahtar sunucularında bir genel anahtarı olup olmadığını denetlersiniz. Yeni bir anahtar çifti oluşturduysanız veya başka birinin anahtarını imzaladıysanız genel anahtarı (büyük olasılıkla yeni imzalarla) anahtar sunucusuna dışa aktarabilirsiniz.

source: Most keyservers synchronize their data between each others so you will get similar search results regardless which server you use. Since there are exceptions of this rule you can choose the keyserver to use in this dialog. It's usually a good idea to choose a default keyserver that is located close to you (i.e. in your country or on your continent) as they usually respond faster to your queries.
tr: Çoğu anahtar sunucusu verisini birbiriyle eşler; böylece kullandığınız sunucudan bağımsız olarak benzer sonuçlar alırsınız. Bu kurala istisnalar olduğundan kullanılacak anahtar sunucusunu bu iletişim kutusundan seçebilirsiniz. Size yakın bir öntanımlı anahtar sunucusu seçmek genellikle iyi bir fikirdir (örneğin ülkenizde ya da kıtanızda); çünkü bunlar sorguları daha hızlı yanıtlar.

source: Please note that everything you upload to a keyserver usually stays there forever. This is one reason you should usually limit the lifetime of your keys. Also note that the keyservers are sometimes scanned by spammers for email addresses.
tr: Bir anahtar sunucusuna yüklediğiniz şeylerin genellikle hep orada kaldığını unutmayın. Bu da anahtarlarınız için bir yaşam süresi vermeniz için bir gerekçedir. Anahtar sunucularının bazen istenmeyen posta atanlar tarafından tarandığını da aklınızda bulundurun.

source: Key server search results
tr: Anahtar sunucusu arama sonuçları

source: This is an example of the results of a keyserver search.
tr: Bu, bir anahtar sunucusu araması sonucu örneğidir.

source: All results of a search are displayed in this window. This picture shows a search for &quot;@kde.org&quot; addresses which showed up 244 results. Using the search field the displayed list was reduced to a single key. This key has two matches: the primary user id itself matches the search string as well as one of the other user ids.
tr: Bir aramanın tüm sonuçları bu pencerede görüntülenir. Bu resim 244 sonuç görüntüleyen bir “@kde.org” adresi araması gösteriyor. Arama alanını kullanarak görüntülenen liste tek bir anahtara indirilmiş. Bu anahtarın iki eşleşmesi var: Birincil kullanıcı kimliği arama karakter dizisiyle ve diğer kullanıcı kimliklerinden biriyle eşleşiyor.

source: You can select one or more keys to import. The ids of those keys are shown in the <guilabel>Keys to import</guilabel> field at the bottom of the window. When you click on <guibutton>Import</guibutton> the key server is contacted again and the keys are fetched into your keyring.
tr: İçe aktarmak için bir veya daha çok anahtar seçebilirsiniz. Bu anahtarların kimlikleri pencerenin altındaki <guilabel>İçe aktarılacak anahtarlar</guilabel> alanında gösterilir. <guibutton>İçe aktar</guibutton> düğmesine tıkladığınızda anahtar sunucusuna yeniden erişilir ve anahtarlar anahtar halkanıza getirilir.

source: Configuring &kgpg;
tr: &kgpg; yapılandırması

source: Configuration is accessible through the &kgpg; applet menu (&RMB; click on the applet) or through the main menu ( <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure KGpg</guimenuitem></menuchoice>). You can set default parameters for encryption, decryption, user interface and applet. Most encryption options are directly related to gpg and are documented in it's <ulink url="man:gpg">man page</ulink>.
tr: Yapılandırmaya &kgpg; uygulamacığı menüsünden (uygulamacığa &RMB; ile tıklayın) veya ana menüden (<menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>K GPG Uygulamasını Yapılandır</guimenuitem></menuchoice>) ögesinden ulaşılabilir. Şifreleme, şifre çözme, kullanıcı arayüzü ve uygulamacık için öntanımlı parametreler ayarlayabilirsiniz. Çoğu şifreleme seçeneği doğrudan gpg ile ilintilidir ve onun <ulink url="man:gpg">man sayfasında</ulink> belgelendirilmiştir.

source: Encryption
tr: Şifreleme

source: A screen shot of the option dialog with encryption tab opened
tr: Şifreleme sekmesi açık bir seçenek iletişim kutusu ekran görüntüsü

source: Here you can configure special options to be passed to GnuPG to change the encryption behavior. For detailed description please have a look at the GnuPG manual.
tr: Burada şifreleme davranışını değiştirmek için GnuPG’ye verilecek özel seçenekleri yapılandırabilirsiniz. Ayrıntılı açıklamalar için lütfen GnuPG kılavuzuna göz atın.

source: <guilabel>ASCII armored encryption</guilabel>: this causes encrypted files to be stored in a format that uses only printable ASCII characters and has short lines. Files stored this way are bigger than the files in binary format but are easier to send &eg; by email.
tr: <guilabel>ASCII zırhlı şifreleme</guilabel>: Bu ,şifrelenmiş dosyaların yalnızca yazdırılabilir ASCII karakterleriyle ve kısa satırlarla kaydedildiği bir biçimde olmasını sağlar. Bu yolla saklanan dosyalar ikilik biçimdekilerden daha büyüktür; ancak &eg; e-posta ile gönderilmeleri daha kolaydır.

source: <guilabel>Allow encryption with untrusted keys</guilabel>: this allows you to encrypt files with keys that are not trusted by you.
tr: <guilabel>Güvenilmeyen anahtarlarla şifrelemeye izin ver</guilabel>: Bu, sizin tarafınızdan güvenilir olmayan anahtarlarla dosya şifrelemenize izin verir.

source: <guilabel>PGP 6 compatibility</guilabel>: encrypted files are compatible with the older PGP6 standard. This disables certain features so you should only use this if really needed.
tr: <guilabel>PGP 6 uyumluluğu</guilabel>: Şifrelenmiş dosyalar eski PGP6 standardıyla uyumlu olur. Bu bazı özellikleri kapatır; yani yalnızca gerçekten gerekliyse kullanmalısınız.

source: <guilabel>Hide user id</guilabel>: this removes all evidence of the receiver from the encrypted file. In case the transmission is intercepted noone could gain information about the recipient from the file. If the receiver has multiple keys he needs to try which one was used.
tr: <guilabel>Kullanıcı kimliğini gizle</guilabel>: Bu, alıcının tüm bilgisini şifreli dosyadan kaldırır. Eğer aktarım bölünürse kimse dosyadan alıcıyla ilgili bilgi bulamaz. Alıcının birden fazla anahtarı varsa hangisinin kullanıldığını deneyerek öğrenebilir.

source: <guilabel>Always encrypt with</guilabel>: all encryptions are additionally encrypted with this key. If you set this to one of your private keys this makes sure you can read all data you encrypted by the price of bigger messages.
tr: <guilabel>Her zaman şununla şifrele</guilabel>: Tüm şifrelemeler ek olarak bu anahtarla şifrelenir. Bunu özel anahtarlarınızdan birine ayarlarsanız şifrelediğiniz tüm verileri okuyabilmenizi sağlar; ancak iletilerin boyutu büyür.

source: <guilabel>Encrypt files with</guilabel>: behaves like <guilabel>Always encrypt with</guilabel> for file encryption.
tr: <guilabel>Dosyaları şununla şifrele</guilabel>: Dosya şifreleme için <guilabel>Her zaman şununla şifrele</guilabel> gibi davranır.

source: <guilabel>Custom encryption command</guilabel>: if you need to pass some unusual options to GnuPG you can specify the command line here. Most users will not need this.
tr: <guilabel>Özel şifreleme komutu</guilabel>: GnuPG’ye olağan dışı seçenekler vermeniz gerekiyorsa komut satırını buradan belirtebilirsiniz. Çoğu kullanıcının buna gereksinimi olmayacaktır.

source: <guilabel>Use *.pgp extension for encrypted files</guilabel>: if you check this option encrypted files will be named as the input file with the extension <literal role="extension">.pgp</literal> added, otherwise the extension <literal role="extension">.gpg</literal> is used.
tr: <guilabel>Şifrelenmiş dosyalar için *.pgp uzantısını kullan</guilabel>: Bu seçeneği işaretlerseniz şifrelenmiş dosyalar girdi dosyasının adında ve <literal role="extension">.pgp</literal> uzantısıyla adlandırılır; aksi halde <literal role="extension">.gpg</literal> uzantısı kullanılır.

source: Decryption
tr: Şifre çözme

source: Here you can specify a custom decryption command. This option is seldomly needed and only useful for advanced users that know of GnuPGs command line options.
tr: Burada özel şifre çözme komutu belirtebilirsiniz. Bu seçenek genellikle pek sık kullanılmaz ve yalnızca GnuPG’nin komut satırı seçeneklerini bilen gelişmiş kullanıcılar içindir.

source: Appearance
tr: Görünüş

source: Here you can configure the way &kgpg; looks to you. Possible settings are the colors that reflect the different levels of key trust in the <link linkend="keymanager">key manager</link> and the font settings for the <link linkend="editor">editor</link>.
tr: Burada &kgpg;’nin görünüşünü yapılandırabilirsiniz. Olası ayarlar <link linkend="keymanager">anahtar yöneticisinde</link> değişik anahtar güven düzeylerini gösteren renkler ve <link linkend="editor">düzenleyici</link> için yazıtipi ayarlarıdır.

source: GnuPG Settings
tr: GnuPG Ayarları
