Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kgpg.po
Languages: tr

source: The &kgpg; Handbook
tr: &kgpg; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>İşbaran</firstname><surname>Akçayır</surname><affiliation><address><email>isbaran@gmail.com</email></address></affiliation><contrib>-</contrib></othercredit> <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>-</contrib></othercredit>

source: Applications 16.12
tr: Uygulamalar 16.12

source: &kgpg; is a simple graphical interface for GnuPG (<ulink url="https://gnupg.org">https://gnupg.org</ulink>).
tr: &kgpg;, GnuPG için basit bir grafik arayüzdür (<ulink url="https://gnupg.org">https://gnupg.org</ulink>).

source: encryption
tr: şifreleme

source: security
tr: güvenlik

source: Introduction
tr: Giriş

source: &kgpg; is a simple interface for GnuPG, a powerful encryption utility. GnuPG (also known as gpg) is included in most distributions and should be installed on your system. You can get the latest version on <ulink url="https://gnupg.org">https://gnupg.org</ulink>.
tr: &kgpg;; güçlü bir şifreleme izlencesi olan GnuPG için basit bir arayüzdür. GnuPG (gpg olarak da bilinir), çoğu dağıtımda içerilir ve sisteminizde kurulu olmalıdır. Güncel sürümü <ulink url="https://gnupg.org">https://gnupg.org</ulink> adresinden alabilirsiniz.

source: With &kgpg; you will be able to encrypt and decrypt your files and emails, allowing much more secure communications. A mini howto on encryption with gpg is available on <ulink url="https://www.gnupg.org/documentation/howtos.en.html">GnuPG's web site</ulink>.
tr: &kgpg; ile, dosyalarınızı ve e-postalarınızı şifreleyip şifrelerini çözebilirsiniz. Bu, çok daha güvenli iletişim sağlar. gpg ile şifrelemeye giriş için yararlı bir öğreticiyi <ulink url="https://www.gnupg.org/documentation/howtos.en.html">GnuPG’nin web sayfasında</ulink> bulabilirsiniz.

source: With &kgpg;, you don't need to remember gpg's command lines and options. Almost everything can be done with a few mouse clicks.
tr: &kgpg; ile gpg’nin komut satırlarını ve seçeneklerini hatırlamanıza gerek kalmaz. Tümü birkaç fare tıklamasıyla yapılabilir.

source: Getting Started
tr: Başlangıç

source: Here is a list of &kgpg;'s main components:
tr: &kgpg; ana bileşenlerinin bir listesi:

source: System Tray Icon
tr: Sistem Tepsisi Simgesi

source: &kgpg; system tray applet
tr: &kgpg; sistem tepsisi uygulamacığı

source: When you start &kgpg;, a system tray icon will appear. A &LMB; click will open the Key Manager window, while a &RMB; click will open a menu allowing quick access to some important features. If you prefer other options you can change the &LMB; action to show the editor or completely disable the system tray icon using the <link linkend="conf-misc">settings dialog</link>.
tr: &kgpg;’yi başlattığınızda, bir sistem tepsisi simgesi belirir. &LMB; ile tıklamak Anahtar Yöneticisi penceresini açar, &RMB; ile tıklamak bazı önemli seçeneklere tez erişim sağlayan bir menü açar. Başka seçenekleri tercih ederseniz &LMB; ile tıklama eylemini düzenleyiciyi gösterecek şekilde değiştirebilir veya sistem tepsisi simgesini <link linkend="conf-misc">ayarlar iletişim kutusunu</link> kullanarak toptan kapatabilirsiniz.

source: Please note that the system tray icon of &kgpg; is marked as &quot;inactive&quot; basically all the time. Since the system tray applet will usually hide inactive icons the one of &kgpg; will not be shown until you explicitly request it. For details please have a look at the &plasma; documentation.
tr: Lütfen &kgpg; sistem tepsisi simgesinin temelde her zaman “pasif” olarak imlendiğine dikkat edin. Sistem tepsisi uygulamacığı genellikle &kgpg; simgesi gibi pasif simgeleri gizlediğinden, siz özellikle istemeden görüntülemeyecektir. Ayrıntılar için &plasma; belgelendirmesine göz atın.

source: Key Manager Window
tr: Anahtar Yöneticisi Penceresi

source: Key manager window
tr: Anahtar yöneticisi penceresi

source: That's the central place to manage your keys. To open the <link linkend="keymanager">Key Manager window</link>, click with the &LMB; on &kgpg;'s applet. You can import, export, sign and edit your keys. Most actions can be performed with a &RMB; click on a key.
tr: Bu anahtarlarınızı yönetmek için merkezi bir yerdir. <link linkend="keymanager">Anahtar Yöneticisi penceresini</link> açmak için &kgpg; uygulamacığına &LMB; ile tıklayın. Anahtarlarınızı içe ve dışa aktarabilir, imzalayabilir ve düzenleyebilirsiniz. Çoğu eylem bir anahtara &RMB; ile tıklanarak yapılabilir.

source: Editor Window
tr: Düzenleyici Penceresi

source: Editor window
tr: Düzenleyici penceresi

source: It's a simple text editor, where you can type or paste text to encrypt/decrypt it. To open the <link linkend="editor">editor</link>, click with the &RMB; on &kgpg;'s applet.
tr: Bu şifreleme/şifre çözmek için metin yazabileceğiniz veya yapıştırabileceğiniz basit bir metin düzenleyicisidir. <link linkend="editor">Düzenleyici</link>’yi açmak için &kgpg; uygulama parçacığına &RMB; ile tıklayın.

source: File manager integration
tr: Dosya yöneticisi tümleştirmesi

source: &kgpg; is integrated in &konqueror; and &dolphin;. It means that when you right click on a file, you can choose <menuchoice><guimenu>Actions</guimenu><guimenuitem>Encrypt File</guimenuitem></menuchoice> to encrypt a file. You can decrypt a file with a &LMB; click.
tr: &kgpg;, &konqueror; ve &dolphin; içine tümleştirilmiştir. Bu demek olur ki, bir dosyaya sağ tıkladığınızda, <menuchoice><guimenu>Eylemler</guimenu><guimenuitem>Dosyayı Şifrele</guimenuitem></menuchoice> ögesini seçerek dosyayı şifreleyebilir ve dosyaya &LMB; ile tıklayarak açabilirsiniz.

source: Using &kgpg;
tr: &kgpg; Kullanımı

source: There are two ways to encrypt your data:
tr: Verinizi şifrelemenin iki yolu bulunur:

source: Symmetrical encryption: your data is just encrypted with a password. Anybody who has a computer with gpg can decrypt your message if you give him/her the password. To perform a symmetrical encryption, choose "symmetrical encryption" in the options box when asked to choose an encryption key.
tr: Simetrik şifreleme: Veriniz yalnızca bir parola ile şifrelenir. gpg’li bir bilgisayarı olan herhangi biri, ona şifreyi verirseniz iletinizin şifresini çözebilir. Simetrik şifreleme gerçekleştirmek için bir şifreleme anahtarı seçmeniz istendiğinde seçenekler kutusunda "simetrik şifreleme"yi seçin.

source: Key encryption: you must first create your key pair (secret key and public key) and give a passphrase. Keep your secret key in a safe place, and exchange your public key with your friends. Then, if you want to send an encrypted message to Alex, you must encrypt the message with Alex's public key. To decrypt the message, the recipient will need Alex's secret key and passphrase.
tr: Anahtar şifreleme: Öncelikle anahtar çiftinizi (gizli anahtar ve genel anahtar) oluşturmalı ve bir parola vermelisiniz. Gizli anahtarınızı güvenli bir yerde saklayın ve ortak anahtarınızı arkadaşlarınızla paylaşın. Daha sonra Gökhan’a şifreli bir ileti göndermek istiyorsanız iletiyi Gökhan’ın ortak anahtarıyla şifrelemelisiniz. İletinin şifresini çözmek için alıcının Gökhan’ın gizli anahtarına ve parolasına gereksinimi olacaktır.

source: Key encryption is a bit more complicated (you must exchange keys with your friends) but safer. Remember that if you encrypt a message with someone else's key, you will not be able to decrypt it. You can only decrypt messages that have been encrypted with your public key.
tr: Anahtar şifreleme biraz daha karmaşıktır (anahtarları arkadaşlarınızla değiştirmelisiniz); ancak daha güvenlidir. Bir iletiyi başka birinin anahtarıyla şifrelerseniz şifresini çözemeyeceğinizi unutmayın. Yalnızca ortak anahtarınızla şifrelenmiş iletilerin şifresini çözebilirsiniz.

source: Generating a key
tr: Bir anahtar üretmek

source: If you don't have a key, &kgpg; will automatically pop up the key generation dialog at the first startup. You can also access it in the Key Manager from <menuchoice><guimenu>Keys</guimenu><guimenuitem>Generate Key Pair</guimenuitem></menuchoice>.
tr: Bir anahtarınız yoksa &kgpg; ilk başlangıçta kendiliğinden anahtar üretme iletişim kutusunu açar. Buna ayrıca anahtar yöneticisinde <menuchoice><guimenu>Anahtarlar</guimenu><guimenuitem>Anahtar Çifti Oluştur</guimenuitem></menuchoice> bölümünden de erişebilirsiniz.

source: Key generation dialog
tr: Anahtar üretme iletişim kutusu

source: Simply enter your name, Email address and click <guibutton>Ok</guibutton>. This will generate a standard gpg key. If you want more options, you can click on the <guibutton>Expert Mode</guibutton> button, which will bring up a &konsole; window with all of gpg's options.
tr: Yalnızca adınızı, e-posta adresinizi girin ve <guibutton>Tamam</guibutton>’a tıklayın. Bu, standart bir gpg anahtarı üretir. Daha fazla seçenek istiyorsanız <guibutton>Uzman Kipi</guibutton> düğmesine tıklayabilirsiniz. Bu, bir &konsole; penceresi açıp tüm gpg özelliklerini getirir.

source: Many people play around with their first key, generate bad user ids, add comments they later regret or simply forget their passphrase. To avoid such keys to stay valid forever it's usually a good idea to limit the lifetime to some 12 month. You can modify the lifetime of your secret keys later using the <link linkend="keyproperties">key properties window</link>.
tr: Birçok kişi ilk anahtarlarıyla oynar, kötü kullanıcı kimlikleri oluşturur, sonradan pişman olacakları açıklamalar yazar veya parolalarını unutur. Bu tür anahtarların sonsuza kadar geçerli kalmasını önlemek için kullanım ömrünü yaklaşık 12 ay ile sınırlamak genellikle iyi bir fikirdir. Gizli anahtarlarınızın ömrünü daha sonra <link linkend="keyproperties">anahtar özellikleri penceresini</link> kullanarak değiştirebilirsiniz.

source: Revoking a key
tr: Bir anahtarı yürürlükten kaldırmak

source: A key pair that has expired can be brought back into an operational state as long as you have access to the private key and the passphrase. To reliably render a key unusable you need to revoke it. Revoking is done by adding a special revocation signature to the key.
tr: Süresi dolmuş bir anahtar çifti, özel anahtara ve parolaya erişiminiz olduğu sürece yeniden çalışır duruma getirilebilir. Bir anahtarı güvenilir bir şekilde kullanılamaz hale getirmek için onu yürürlükten kaldırmanız gerekir. Yürürlükten kaldırma, anahtara özel bir yürürlükten kaldırma imzası eklenerek yapılır.

source: This revocation signature can be created together with the key. In this case it is stored in a separate file. This file can later be imported into the keyring and is then attached to the key rendering it unusable. Please note that to import this signature to the key no password is required. Therefore you should store this revocation signature in a safe place, usually one that is different from you key pair. It is a good advise to use a place that is detached from your computer, either copy it to an external storage device like an USB stick or print it out.
tr: Bu yürürlükten kaldırma imzası anahtarla birlikte oluşturulabilir. Bu durumda ayrı bir dosyada saklanır. Bu dosya daha sonra anahtarlığa aktarılabilir ve anahtara eklenerek kullanılamaz hale getirilebilir. Bu imzayı anahtara aktarmak için şifre gerekmediğini lütfen unutmayın. Bu nedenle bu yürürlükten kaldırma imzasını güvenli bir yerde, genellikle anahtar çiftinizden farklı bir yerde saklamanız gerekir. Bilgisayarınızdan ayrı bir yer kullanmanız, USB bellek gibi dış bir depolama aygıtına kopyalamanız veya çıktı almanız önerilir.

source: If you have not created such a detached revocation on key creation you can create such a revocation signature at any time choosing <menuchoice><guimenu>Keys</guimenu> <guimenuitem>Revoke key</guimenuitem></menuchoice>, optionally importing it to your keyring immediately.
tr: Anahtar oluşturma sırasında böyle ayrık bir yürürlükten kaldırma oluşturmadıysanız istediğiniz zaman <menuchoice><guimenu>Anahtarlar</guimenu> <guimenuitem>Anahtarı Yürürlükten Kaldır…</guimenuitem></menuchoice> ögesini seçerek bir yürürlükten kaldırma imzası oluşturabilirsiniz. İsteğe bağlı olarak bunu anahtar zincirinize içe aktarabilirsiniz.

source: Encrypting Your Data
tr: Verinizi Şifrelemek

source: Encrypting a file from &konqueror; or Dolphin
tr: Bir dosyayı &konqueror; veya Dolphin ile şifrelemek

source: Click on the file you want to encrypt with the &RMB;. Choose <menuchoice><guimenu>Actions</guimenu><guimenuitem>Encrypt File</guimenuitem></menuchoice> in the pop up menu. You will then be prompted with the Public key selection dialog. Choose the key of the recipient and click <guibutton>Encrypt</guibutton>. The encrypted file will be saved with a <literal role="extension">.asc</literal> or <literal role="extension">.gpg</literal> extension depending on whether you chose <guilabel>ASCII armored encryption</guilabel> or not. ASCII encrypted files only use readable characters to represent the data resulting in files that are more robust when copied around or sent by mail but are one third larger.
tr: Şifrelemek istediğiniz dosyanın üzerine &RMB; ile tıklayın. Açılır menüde <menuchoice><guimenu>Eylemler</guimenu><guimenuitem>Dosyayı Şifrele</guimenuitem></menuchoice> ögesini seçin. Ardından genel anahtar seçim iletişim kutusu karşınıza çıkar. Alıcının anahtarını seçin ve <guibutton>Şifrele</guibutton> düğmesine tıklayın. Şifrelenen dosya <guilabel>ASCII zırhlı şifreleme</guilabel> seçip seçmediğinize göre <literal role="extension">.asc</literal> veya <literal role="extension">.gpg</literal> uzantısıyla kaydedilir. ASCII şifreli dosyalar veriyi temsil etmek için yalnızca okunabilir karakterler kullanarak posta ile gönderimde veya bir yerden bir yere kopyalamada daha sağlam sonuç verirler; ancak üçte bir oranında daha büyüktürler.

source: Here is a screen shot of the key selection window
tr: Burada anahtar seçim penceresinin ekran görüntüsünü görebilirsiniz

source: Encrypting a text with &kgpg;'s applet
tr: Bir metni &kgpg;’nin uygulamacığıyla şifrelemek

source: You can encrypt the contents of the clipboard by selecting the <guimenuitem>Encrypt clipboard</guimenuitem> item in applet menu. When you choose <guimenuitem>Sign clipboard</guimenuitem> then the text will be signed instead. Both actions will import the current clipboard contents into an <link linkend="editor">editor window</link>, perform the requested action and paste the contents back into the editor.
tr: Uygulamacık menüsünde <guimenuitem>Panoyu Şifrele</guimenuitem> öğesini seçerek panonun içeriğini şifreleyebilirsiniz. <guimenuitem>Panoyu imzala</guimenuitem> ögesini seçtiğinizde bunun yerine metin imzalanır. Her iki eylem de geçerli pano içeriğini bir <link linkend="editor">düzenleyici penceresine</link> aktarır, istenen eylemi gerçekleştirir ve içeriği düzenleyiciye geri yapıştırır.

source: Encrypting text from &kgpg;'s editor
tr: &kgpg;’nin düzenleyicisinden metin şifrelemek

source: This is as simple as clicking on the <guibutton>Encrypt</guibutton> button. You will then be prompted with the Public key selection dialog. Choose your key and click <guibutton>Ok</guibutton>. The encrypted message will appear in the editor window.
tr: Bu, <guibutton>Şifrele</guibutton> düğmesine tıklamak kadar basittir. Bastığınızda, genel anahtar seçim iletişim kutusu karşınıza gelir. Anahtarınızı seçin ve <guibutton>Tamam</guibutton> düğmesine tıklayın. Şifrelenen ileti düzenleyici penceresinde belirecektir.

source: Usually you can only encrypt files with keys that are trusted by you. Since you sometimes want to just send a confident note to some random people you are aware of having a GPG key you can set the option <guilabel>Allow encryption with untrusted keys</guilabel>.
tr: Genellikle dosyaları yalnızca güvendiğiniz anahtarlarla şifreleyebilirsiniz. Bazen GPG anahtarına sahip olduğunu bildiğiniz bazı kişilere güvenli bir not göndermek istediğinizde, <guilabel>Güvenilmeyen anahtarlarla şifrelemeye izin ver</guilabel> seçeneğini ayarlayabilirsiniz.

source: To make sure that you can decrypt every file you have encrypted even if they are encrypted with someone else's key you can use the options <guilabel>Always encrypt with</guilabel> and <guilabel>Encrypt files with</guilabel> which are available in the <link linkend="conf-encryption">KGpg configuration</link>.
tr: Şifrelediğiniz her dosyayı başka birinin anahtarıyla şifrelenmiş olsalar bile açabileceğinizden emin olmak için <link linkend="conf-encryption">K GPG yapılandırmasındaki</link> <guilabel>Her zaman şununla şifrele</guilabel> ve <guilabel>Dosyaları şununla şifrele</guilabel> seçeneklerini kullanabilirsiniz.

source: For more information on the encryption options <guilabel>ASCII armor</guilabel>, <guilabel>Allow encryption with untrusted keys</guilabel> and <guilabel>Symmetrical encryption</guilabel>, please refer to gpg's documentation or <ulink url="man:gpg">man pages</ulink>.
tr: <guilabel>ASCII zırhı</guilabel>, <guilabel>Güvenilmeyen anahtarlarla şifrelemeye izin ver</guilabel> ve <guilabel>Simetrik şifreleme</guilabel> şifreleme seçenekleriyle ilgili daha fazla bilgi için lütfen gpg’nin belgelendirmesine veya <ulink url="man:gpg">man sayfalarına</ulink> göz atın.

source: Decrypting Your Data
tr: Verinizin Şifresini Çözmek

source: Decrypting a file from &konqueror; or &dolphin;
tr: Bir dosyanın şifresini &konqueror; veya &dolphin; ile çözmek

source: <mousebutton>Left</mousebutton> click on the file you want to decrypt. Enter your passphrase and it will be decrypted. You can also drag an encrypted text file and drop it into &kgpg;'s editor window. It will then ask the passphrase and open the decrypted text in &kgpg;'s editor. You can even drop remote files ! You can also use the <menuchoice><guimenu>File</guimenu><guimenuitem>Decrypt File</guimenuitem></menuchoice> and choose a file to decrypt.
tr: Şifresini açmak istediğiniz dosyaya <mousebutton>sol</mousebutton> fare düğmesi ile tıklayın. Parolanızı girdiğinizde şifre çözülür. Ayrıca şifrelenmiş bir metin dosyasını &kgpg;’nin düzenleyici penceresine sürükleyip bırakabilirsiniz. Parolanız sorulur ve şifresi çözülmüş metin &kgpg;’nin düzenleyicisinde belirir. Uzak konumlardaki dosyaları bile bırakabilirsiniz! Ayrıca <menuchoice><guimenu>Dosya</guimenu><guimenuitem>Dosyanın Şifresini Çöz</guimenuitem></menuchoice> seçeneğini kullanıp dosya seçerek de şifre çözmek olanaklıdır.

source: Decrypting text with &kgpg;'s applet
tr: &kgpg;’nin uygulamacığıyla metin şifresi çözmek

source: You can also decrypt the contents of the clipboard with the <guimenuitem>Decrypt Clipboard</guimenuitem> menu entry of the &kgpg; applet. An <link linkend="editor">editor window</link> will show up with the decrypted text.
tr: Pano içeriğinin şifresini ayrıca &kgpg; uygulama programının <guimenuitem>Pano Şifresini Çöz</guimenuitem> menü ögesiyle de çözebilirsiniz. <link linkend="editor">Düzenleyici penceresi</link>, şifresi çözülmüş metni gösterir.

source: Decrypting a text from the editor
tr: Düzenleyici ile metin şifresi çözmek

source: Copy or Drag and Drop the text you want to decrypt, and click on the <guibutton>Decrypt</guibutton> button. You will be prompted for the passphrase.
tr: Şifresini çözmek istediğiniz metni kopyalayın veya sürükleyip bırakın, ardından <guibutton>Şifreyi Çöz</guibutton> düğmesine tıklayın. Parola sorulacaktır.

source: Key Management
tr: Anahtar Yönetimi

source: All basic key management options can be performed through &kgpg;. To open the key management window click the &LMB; on &kgpg;'s applet. Most options are available with a <mousebutton>right</mousebutton> click on a key. To import/export public keys, you can use drag and drop or the Copy/Paste keyboard shortcuts.
tr: Tüm basit anahtar yönetim seçenekleri &kgpg; üzerinden yapılabilir. Anahtar yönetim penceresini açmak için &kgpg; uygulamacığına &LMB; tıklayın. Bir anahtara <mousebutton>sağ</mousebutton> fare düğmesi ile tıklayarak çoğu seçeneğe erişebilirsiniz. Açık anahtarları içe/dışa aktarmak için sürükleyip bırakabilir veya Kopyala/Yapıştır klavye kısayollarını kullanabilirsiniz.

source: You can export a public key via email, to the clipboard, to a keyserver or to a local file. Use the options in the export dialog to export everything, export without attributes (photo ids) or export a clean key &ie; the key itself including its subkeys, but excluding all signatures.
tr: Bir genel anahtarı e-posta ile gönderebilir; panoya, anahtar sunucusuna veya yerel bir dosyaya dışa aktarabilirsiniz. Her şeyi dışa aktarmak, öznitelikler olmadan dışa aktarmak (fotoğraf kimlikler) veya temiz bir anahtarı dışa aktarmak için dışa aktarma iletişim kutusundaki seçenekleri kullanın &ie; alt anahtarları dahil olmak üzere anahtarın kendisi; ancak tüm imzalar hariç.

source: Key Manager
tr: Anahtar Yöneticisi

source: Here's a screen shot of key management
tr: Anahtar yönetiminin bir ekran görüntüsü

source: In this example you see a key group containing two keys, two key pairs and three public keys. The third column shows the trust you have in the keys. The first key pair is ultimately trusted and is also set as the default key (bold font) while the second one has expired. Two of the public keys are fully trusted while the trust of the last key is marginal. The last key is expanded, showing it's ElGamal subkey, an additional user id, both also with marginal trust, and some of it's signatures.
tr: Bu örnekte iki anahtar, iki anahtar çifti ve üç genel anahtar içeren bir anahtar grubu görüyorsunuz. Üçüncü sütun anahtarlara olan güveninizi gösterir. İlk anahtar çiftine tamamen güveniliyor ve öntanımlı anahtar olarak ayarlanmış (koyu yazıtipi) ikincisinin süresi dolmuş. İki genel anahtara tamamen güveniliyor ve son anahtarın güveni uç düzeyde. Son anahtar genişletilmiş, ElGamal alt anahtarı görünüyor, ek bir kullanıcı kimliği, ikisine de uç noktalarda güven var, bazı imzaları da görünüyor.

source: Signatures allow navigating through your keyring. Double clicking on a signature or a key shown as member of a group will jump directly to the corresponding primary key.
tr: İmzalar anahtar halkanız üzerinde dolaşmanızı sağlar. Bir grubun üyesi olarak görünen bir imzaya veya anahtara çift tıklamak ilişkili birincil anahtara atlayacaktır.

source: Key properties
tr: Anahtar özellikleri

source: The key properties window
tr: Anahtar özellikleri penceresi

source: While the key manager allows you to do general actions with one or multiple keys, key groups or signatures, the key properties window gives you access to a single key. You can reach it by pressing enter in the key manager or double clicking the key.
tr: Anahtar yöneticisi bir veya daha çok anahtarla, anahtar gruplarıyla veya imzalarla genel eylemleri gerçekleştirmenizi sağlar; anahtar özellikleri penceresi tek bir anahtara erişim verir. Anahtar yöneticisine Giriş düğmesine basarak veya anahtara çift tıklayarak erişebilirsiniz.

source: In this window you can change the key passphrase and expiration of your secret keys. For all keys you can also set the owner trust value.
tr: Bu pencerede anahtar parolasını ve özel anahtarlarınızın zaman aşımı tarihlerini değiştirebilirsiniz. Tüm anahtarlar için ayrıca sahip güven değerini ayarlayabilirsiniz.
