Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/khelpcenter.po
Languages: tr

source: The &khelpcenter;
tr: &khelpcenter;

source: The &kde; Team
tr: &kde; Takımı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>-</contrib></othercredit>

source: Applications 16.04
tr: Uygulamalar 16.04

source: &kde; is an international technology team that creates <ulink url="https://www.gnu.org/philosophy/free-sw.html">Free Software</ulink> for desktop and portable computing. Among &kde;&apos;s products are a modern desktop system for &Linux; and &UNIX; platforms, comprehensive office productivity and groupware suites and hundreds of software titles in many categories including Internet and web applications, multimedia, entertainment, educational, graphics and software development.
tr: &kde;, masaüstü ve taşınabilir bilgisayarlar için <ulink url="https://www.gnu.org/philosophy/free-sw.html"> Özgür Yazılımlar</ulink> yaratan uluslararası bir teknoloji takımıdır. &kde;’nin ürünleri arasında &Linux; ve &UNIX; platformları için çağdaş bir masaüstü sistemi, kapsamlı ofis üretkenliği ve grup yazılımı paketleri ve İnternet ve web uygulamaları, çoklu ortam, eğlence, eğitim, grafik ve yazılım geliştirme dahil olmak üzere birçok kategoride yüzlerce yazılım başlığı bulunmaktadır.

source: khelpcenter
tr: k yardım merkezi

source: kdehelp
tr: kde yardımı

source: help
tr: yardım

source: help center
tr: yardım merkezi

source: KDE help center
tr: KDE yardım merkezi

source: &kde; Help System Handbook
tr: &kde; Yardım Sistemi El Kitabı

source: Help System
tr: Yardım Sistemi

source: The help system is designed to make accessing the common &UNIX; help systems (<application>man</application> and <application>info</application>) simple, as well as the user documentation of applications including &plasma-workspaces; from the &kde; community (&XML;).
tr: Bu yardım sistemi, ortak &UNIX; yardım sistemlerine (<application>man</application>, <application>info</application>) basitçe erişmek ve aynı zamanda &kde; topluluğunun &plasma-workspaces; dahil olmak üzere uygulamaların kullanıcı belgelerine erişmek için tasarlanmıştır (&XML;).

source: All applications (including &plasma-workspaces;) from the &kde; community come fully documented, thanks to the efforts of the Documentation team. If you are interested in helping with the documentation efforts, join the <ulink url="https://mail.kde.org/mailman/listinfo/kde-doc-english">mailing list</ulink> and write to the team at <email>kde-doc-english@kde.org</email>. No experience is required, just enthusiasm and patience.
tr: &kde; üzerindeki tüm uygulamalar (&plasma-workspaces; dahil), belgelendirme takımının çabalarıyla topluluk tarafından belgelendirilmiştir. Belgelendirmeye yardımcı olmak istiyorsanız <ulink url="https://mail.kde.org/mailman/listinfo/kde-doc-english">e-posta listesine</ulink> katılın ve <email>kde-doc-english@kde.org</email> takımına bir ileti gönderin. Hiçbir deneyim gerekmez, yalnızca coşku ve sabır yeterlidir.

source: If you would like to help translating &kde; documentation to your native language, review the information, including coordinators for each language team, on the <ulink url="https://l10n.kde.org/">Localization web site</ulink>.
tr: &kde; belgelendirmesini ana dilinize çevirmeye yardımcı olmak isterseniz her bir dil ekibi için koordinatörleri de içeren bilgilere <ulink url="http://l10n.kde.org">yerelleştirme web sitesi</ulink> üzerinden göz atın.

source: Invoking Help
tr: Yardımı Çağırmak

source: &khelpcenter; can be called in several ways:
tr: &khelpcenter; bir kaç farklı yolla başlatılabilir:

source: From the <guimenu>Help</guimenu> menu
tr: <guimenu>Yardım</guimenu> menüsünden

source: The most common will probably be from within an application. Choose <menuchoice> <shortcut> <keycombo action="simul"><keycap>F1</keycap></keycombo> </shortcut> <guimenu>Help</guimenu> <guimenuitem><replaceable>Application</replaceable> Handbook</guimenuitem></menuchoice> to open that application's handbook.
tr: En yaygını genelde uygulamanın içinden olandır. Uygulamanın el kitabını açmak için <menuchoice> <shortcut> <keycombo action="simul"><keycap>F1</keycap></keycombo> </shortcut> <guimenu>Yardım</guimenu> <guimenuitem><replaceable>Uygulama</replaceable> El Kitabı</guimenuitem></menuchoice> menü ögesini kullanın.

source: From the Application Launcher
tr: Uygulama Başlatıcısından

source: Choose the big <guiicon>K</guiicon> in your panel, and select <guimenuitem>Help</guimenuitem> from the <guimenuitem>Applications</guimenuitem> tab or type <userinput>help</userinput> followed by selecting <guimenuitem>Help</guimenuitem>. This will open &khelpcenter; with the default start page.
tr: Panelinizdeki <guiicon>Plasma</guiicon> simgesine tıklayın ve <guimenuitem>Uygulamalar</guimenuitem> sekmesinden <guimenuitem>Yardım</guimenuitem>’ı seçin veya <userinput>help</userinput> yazıp <guimenuitem>Yardım</guimenuitem>’ı seçin. Bu, öntanımlı başlangıç sayfasıyla &khelpcenter; uygulamasını açar.

source: From the command line
tr: Komut satırından

source: &khelpcenter; may be started using a &URL; to display a file. &URL;s have been added for <command>info</command> and <command>man</command> pages also. You can use them as follows:
tr: &khelpcenter;, bir dosyayı görüntülemek için bir &URL; kullanılarak başlatılabilir. &URL;’ler aynı zamanda <command>info</command> ve <command>man</command> sayfalarına da eklenmiştir. Onları şöyle kullanabilirsiniz:

source: An application help file
tr: Bir uygulama yardım dosyası

source: Opens the &kwrite; help file, at the contents page.
tr: İçindekiler sayfasında &kwrite; yardım dosyasını açar.

source: A local &URL;
tr: Yerel bir &URL;

source: A Man page
tr: Bir man sayfası

source: An Info page
tr: Bir info sayfası

source: Invoking <command>khelpcenter</command> with no parameters opens the default start page.
tr: <command>khelpcenter</command> uygulamasını bir parametre olmadan çağırmak, öntanımlı başlangıç sayfasını açar.

source: The &khelpcenter; interface
tr: &khelpcenter; arayüzü

source: The &khelpcenter; interface consists of two panes of information.
tr: &khelpcenter; arayüzü, iki adet bilgi bölmesinden oluşur.

source: The toolbar and menus are explained further in <xref linkend="menu-and-toolbar-ref"/>.
tr: Araç çubukları ve menüler ayrıntılı olarak <xref linkend="menu-and-toolbar-ref"/> adresinde açıklanmıştır.

source: Documents contain their own navigation tools, enabling you to move either sequentially through a document, using <guilabel>Next</guilabel>, <guilabel>Previous</guilabel>, and <guilabel>Contents</guilabel> links, or to move around in a less structured manner, using hyperlinks.
tr: Belgeler, <guilabel>Sonraki</guilabel>, <guilabel>Önceki</guilabel> ve <guilabel>İçindekiler</guilabel> bağlantılarından ulaşılabilen kendi dolaşım araçlarını içerir; böylece bir belge içinde bu bağlantılarla veya diğer köprülerle kolaylıkla dolaşabilirsiniz.

source: Links can take you to other parts of the same document, or to a different document, and you can use the <guiicon>Back</guiicon> (Left pointing arrow) or <guiicon>Forward</guiicon> (Right pointing arrow) icons on the toolbar to move through the documents you have viewed in this session.
tr: Bağlantılar sizi aynı belgenin başka kısımlarına veya başka bir belgeye götürebilir. Aynı oturumda görüntülediğiniz belgeler arasında, araç çubuğundaki <guiicon>Geri</guiicon> (sol ok) veya <guiicon>İleri</guiicon> (sağ ok) simgelerini kullanarak dolaşabilirsiniz.

source: The two panes display the contents of the help system, and the help files themselves, on the left and right respectively.
tr: İki panel, sırasıyla solda ve sağda yardım sisteminin içeriğini ve yardım dosyalarının kendisini görüntüler.

source: The Contents Pane
tr: İçindekiler Bölmesi

source: The contents pane in &khelpcenter; is displayed on the left hand side of the window. As you might expect, you can move the splitter bar, to make sure you can comfortably read the contents of either pane.
tr: &khelpcenter; içindekiler bölmesi pencerenin sol tarafında görüntülenir. Tahmin edebileceğiniz gibi, her iki bölmenin içeriğini rahatça okuyabildiğinizden emin olmak için ayırma çubuğunu hareket ettirebilirsiniz.

source: The contents pane is further divided into three tabs, one containing a <link linkend="contents-tab">tree view</link> showing all the help information &khelpcenter; is aware of, and the other contains the &kde; <link linkend="kde-glossary">glossary</link> of terms. On the third tab you can configure the <guilabel>Search Options</guilabel>.
tr: İçindekiler bölmesi, üç ek sekmeye ayrılmıştır; bunlardan biri, tüm yardım bilgisini ve &khelpcenter; uygulamasını gösteren bir <link linkend="contents-tab">ağaç görünümü</link>, diğeriyse &kde; terimler <link linkend="kde-glossary">sözlüğüdür</link>. Üçüncü sekmedeyse <guilabel>Arama Seçenekleri</guilabel>’ni yapılandırabilirsiniz.

source: The Contents Tab
tr: İçindekiler Sekmesi

source: The <guilabel>Contents</guilabel> tab contains the following default top level entries in the tree view:
tr: <guilabel>İçindekiler</guilabel> sekmesi, ağaç görünümünde aşağıdaki öntanımlı üst düzey girdileri içerir:

source: Fundamentals
tr: Temel Bilgiler

source: The Fundamentals introduce you to the many features of the &plasma-workspaces; and &applications; and describe many common tasks you can perform in all &applications;.
tr: Temel Bilgiler, size &plasma-workspaces; ve &applications; ögelerinin birçok özelliği ile ilgili bilgilendirecek ve &applications; içinde yapabileceğiniz birçok şeyi anlatacaktır.

source: Plasma Manual
tr: Plasma Kılavuzu

source: The &plasma; Manual is the documentation for the &plasma-workspaces;.
tr: &plasma; kılavuzu, &plasma-workspaces; belgelendirmesidir.

source: Online Help
tr: Çevrimiçi Yardım

source: A page with links to online help and additional information provided by the &kde; community.
tr: &kde; topluluğu tarafından sağlanan çevrimiçi yardıma ve ek bilgilere bağlantılar içeren bir sayfa.

source: Application Manuals
tr: Uygulama Kılavuzları

source: Native &kde; application documentation. All &kde; applications have documentation in &XML; format, which are converted to <acronym>HTML</acronym> when you view them. This section lists all the &kde; applications with a brief description and a link to the full application documentation.
tr: Yerel &kde; uygulamaları belgelendirmeleri. Tüm &kde; uygulamalarının &XML; biçiminde belgelendirmesi vardır ve bunlar görüntülenirken <acronym>HTML</acronym>’ye dönüştürülür. Bu bölüm, kısa bir açıklama ve tam uygulama belgelerine bir bağlantıyla tüm &kde; uygulamalarını listeler.

source: The applications are displayed in a tree structure that echoes the default structure of the <guimenu>K</guimenu> menu, making it easy to find the application you are looking for.
tr: Uygulamalar, aradığınız uygulamayı bulmayı kolaylaştıran <guimenu>Plasma</guimenu> menüsünün öntanımlı yapısını yansıtan bir ağaç yapısında görüntülenir.

source: <guilabel>Settings Modules</guilabel> entities
tr: <guilabel>Ayarlar Modülü</guilabel> varlıkları

source: Provide a list of links to various modules in the &systemsettings; application or to modules for &konqueror;, Filemanager or Browser.
tr: &systemsettings; uygulamasındaki çeşitli modüllere veya &konqueror;, Dosya Yöneticisi veya Tarayıcı modüllerine bağlantılar listesi sağlar.

source: KInfoCenter Modules
tr: K Bilgi Merkezi Modülleri

source: Contains a list of links to various KInfocenter modules documentation.
tr: Çeşitli K Bilgi Merkezi modülleri belgelendirmesine bağlantılar listesi içerir.

source: KIO Workers
tr: KIO İşçileri

source: Contains a list of links to various <acronym>KIO</acronym> modules documentation.
tr: Çeşitli <acronym>KIO</acronym> modülleri belgelendirmelerine bağlantılar listesi içerir.

source: &UNIX; manual pages
tr: &UNIX; kılavuz sayfaları

source: &UNIX; man pages are the traditional on-line documentation format for &UNIX; systems. Most programs on your system will have a man page. In addition, man pages exist for programming functions and file formats.
tr: &UNIX; kılavuz sayfaları, &UNIX; sistemlerinin geleneksel belgelendirme biçimidir. Sisteminizdeki çoğu programın bir kılavuz sayfası vardır. Buna ek olarak, programlama işlevleri ve dosya biçimleri için de kılavuz sayfaları vardır.

source: Additional non-&kde; documentation installed on your system.
tr: Sisteminizde kurulu olan &kde; dışı programların ek belgelendirmeleri.

source: Browse Info Pages
tr: Bilgi Sayfalarına Göz At

source: TeXinfo documentation is used by many &GNU; applications, including <command>gcc</command> (the C/C++ compiler), <command>emacs</command>, and many others.
tr: TeXinfo belgeleri; <command>gcc</command> (C/C++ derleyicisi), <command>emacs</command> ve diğerlerini içeren birçok &GNU; uygulaması tarafından kullanılır.

source: The <guilabel>Search Options</guilabel> tab
tr: <guilabel>Arama Seçenekleri</guilabel> sekmesi

source: Searching the help files is fairly intuitive, enter the word(s) you wish to search for in the text box, choose your options (if any), and press <guibutton>Search</guibutton>. The results display in the viewer pane to the right.
tr: Yardım dosyalarını aramak oldukça basittir, aramak istediğiniz sözcükleri metin kutusuna girin, seçeneklerinizi seçin (varsa) ve <guibutton>Ara</guibutton> düğmesine basın. Sonuçlar sağdaki görüntüleyici bölmesinde görüntülenir.

source: Search is not case sensitive, &ie; uppercase and lowercase characters are considered the same. For example, if you search for <quote>Shortcut</quote>, results that contain <quote>shortcut</quote> will be returned as well.
tr: Arama, BÜYÜK/küçük harf duyarlı değildir; &ie; büyük ve küçük harf karakterleri aynı kabul edilir. Örneğin, <quote>Kısayol</quote> için arama yaparsanız, <quote>kısayol</quote> içeren sonuçlar da döndürülür.

source: The options available are:
tr: Kullanılabilir seçenekler şunlardır:

source: Method
tr: Yöntem

source: Choose how to search for multiple words. If you choose <guilabel>and</guilabel>, results are returned only if all your search terms are included in the page. <guilabel>or</guilabel> returns results if <emphasis>any</emphasis> of the search terms are found.
tr: Birden çok sözcüğü nasıl arayacağınızı seçin. <guilabel>ve</guilabel> seçerseniz yalnızca tüm arama terimleriniz sayfaya dahil edildiğinde sonuçlar döndürülür. <guilabel>veya</guilabel>, arama terimlerinin <emphasis>herhangi biri</emphasis> bulunduğu takdirde sonuçları döndürür.

source: If your searches are not returning the results you expect, check carefully you haven't excluded the wrong search term with an erroneous setting.
tr: Aramalarınız beklediğiniz sonuçları getirmiyorsa hatalı bir ayarla yanlış arama terimini dışlamadığınızı dikkatlice denetleyin.

source: Max. results
tr: En çok sonuç sayısı

source: Determines the maximum number of results returned from your search.
tr: Aramanızdan döndürülen en çok sonuç sayısını belirler.

source: Scope selection
tr: Kapsam seçimi

source: This is used to select the sections where the search will be done. The available options quickly select the most common option, while <guimenuitem>Custom</guimenuitem> allows one to select single sections.
tr: Bu, aramanın yapılacağı bölümleri seçmek için kullanılır. Kullanılabilir seçenekler tez en yaygın seçeneği, <guimenuitem>Özel</guimenuitem> ise tek bir bölüm seçilmesine olanak tanır.

source: The <application>Man</application> and <application>Info</application> sections
tr: <application>Man</application> ve <application>Info</application> bölümleri

source: Man pages are the standard &UNIX; manual pages, and have been in use for many years on many operating systems. They are extremely thorough, and are the very best place to get information about most &UNIX; commands and applications. When people say <quote>RTFM</quote>, the Manual they are referring to is very often the man page.
tr: Man sayfaları standart &UNIX; kılavuz sayfalarıdır ve uzun yıllardır birçok işletim sisteminde kullanılmaktadır. Bunlar son derece kapsamlıdır ve çoğu &UNIX; komut ve uygulaması hakkında bilgi almak için en iyi yerdir. İnsanlar <quote>RTFM</quote> (Siktiğimin Kılavuz Sayfasını Oku) derken, genellikle kılavuz sayfalarını kastederler.

source: The man pages are not perfect. They tend to be in depth, but also extremely technical, often written by developers, and for developers. In some cases this makes them somewhat unfriendly, if not downright impossible for many users to understand. They are, however, the best source of solid information on most command line applications, and very often the only source.
tr: Man sayfaları mükemmel değillerdir. Genellikle geliştiriciler tarafından ve geliştiriciler için yazılan, derinlemesine; ancak aynı zamanda son derece teknik olma eğilimindedirler. Bazı durumlarda bu, çoğu kullanıcının anlamasını tümüyle olanaksız olmasa da, onları olabildiğince güç kılar. Ancak bunlar çoğu komut satırı uygulaması için en sağlam ve genellikle tek bilgi kaynaklarıdırlar.

source: If you've ever wondered what the number is when people write things like man(1) it means which section of the manual the item is in. You will see &khelpcenter; uses the numbers to divide the very many man pages into their own sections, making it easier for you to find the information you're looking for, if you're just browsing.
tr: İnsanlar man(1) gibi şeyler yazdıklarında sayının ne olduğunu merak ederseniz bu o ögenin kılavuzun hangi bölümünde olduğu anlamına gelir. &khelpcenter; çok sayıda kılavuz sayfasını kendi bölümlerine bölmek için sayıları kullanır, yalnızca göz atıyorsanız aradığınız bilgiyi bulmanızı kolaylaştırır.

source: Also available are the Info pages, intended to be a replacement for the man pages. The maintainer of some applications no longer update the man pages, so if there is both a man page and an info page available, the info page is probably the most recent. Most applications have one or the other though. If the application you are looking for help on is a &GNU; utility, you will most likely find it has an info page, not a man page.
tr: Ayrıca man sayfalarının yerini alması amaçlanan info sayfaları da kullanılabilirdir. Bazı uygulamaların bakımcıları artık man sayfalarını güncellememektedir, dolayısıyla hem man sayfası hem de bilgi sayfası varsa bilgi sayfası büyük olasılıkla en yeni olanıdır. Çoğu uygulamada biri veya diğeri vardır. Yardım aradığınız uygulama bir &GNU; izlencesiyse büyük olasılıkla bu uygulamanın bir man sayfası değil, bir info sayfası olduğunu göreceksiniz.

source: Navigating inside the <application>Info</application> pages
tr: <application>Info</application> sayfalarında dolaşmak

source: Info documents are arranged hierarchically with each page called a node. All info documents have a <guilabel>Top</guilabel> node, &ie; the opening page. You can return to the <guilabel>Top</guilabel> of an info document by pressing <guilabel>Top</guilabel>.
tr: Info belgeleri, her birine düğüm adı verilen sayfalarla oluşturulmuşlardır. Tüm info belgelerinin bir <guilabel>Üst</guilabel> düğümü; &ie; açılış sayfası vardır. Bir info belgesinin <guilabel>Üst</guilabel> bölümüne <guilabel>Üst</guilabel>’e basarak gidebilirsiniz.

source: <guibutton>Prev</guibutton> &amp; <guibutton>Next</guibutton> are used to move to the previous/next page at the current level of the hierarchy.
tr: <guibutton>Önceki</guibutton> ve <guibutton>Sonraki</guibutton> düğmeleri, hiyerarşinin güncel düzeyinde önceki/sonraki sayfaya gitmek için kullanılır.

source: Clicking on a menu item within a document moves you to a lower level in the hierarchy. You may move up the hierarchy by pressing <guibutton>Up</guibutton>.
tr: Bir belge içindeki bir menü ögesine tıklamak, sizi hiyerarşideki daha düşük bir düzeye taşır. <guibutton>Yukarı</guibutton> düğmesine basarak hiyerarşide yukarı çıkabilirsiniz.

source: Man is treated similarly to info, with the section index being the Top node and each man page on the level below. Man entries are one page long.
tr: man de info’ya benzer şekilde ele alınır; bölüm dizini üst düğümdür ve her man sayfası bir alt düzeydedir. man girdileri bir sayfa uzunluğundadır.

source: The &kde; glossary
tr: &kde; kavram dizini

source: The glossary provides a quick reference point, where you can look up the definitions of words that may be unfamiliar to you. These range from &kde; specific applications and technologies, through to general &UNIX; computing terms.
tr: Kavram dizini, size tanıdık gelmeyen sözcüklerin tanımlarını arayabileceğiniz tez bir başvuru noktası sağlar. Bunlar &kde;’ye özgü uygulama ve teknolojilerden genel &UNIX; bilgi işlem terimlerine kadar uzanır.

source: In the left hand pane you will see a tree view, with two choices: <guilabel>Alphabetically</guilabel> or <guilabel>By Topic</guilabel>. Both contain the same entries, sorted differently, to allow you to quickly find the item of interest.
tr: Sol bölmede, iki seçenekten oluşan bir ağaç görünümü göreceksiniz: <guilabel>Abecesel</guilabel> veya <guilabel>Konuya Göre</guilabel>. Her ikisi de, ilgili ögeyi tez bulmanıza izin vermek için farklı girdilere sahip aynı girdileri içerir.

source: Navigate down the tree views to the left, and items you select will be displayed on the right.
tr: Ağaç görünümlerinde sola doğru ilerleyin; seçtiğiniz ögeler sağda görüntülenecektir.

source: The menus and toolbar
tr: Menüler ve araç çubukları

source: &khelpcenter; has a very minimal interface, allowing you to concentrate on getting help rather than learning how to use the help browser.
tr: &khelpcenter;, yardım tarayıcısını nasıl kullanacağınızı öğrenmek yerine yardım almaya konsantre olmanızı sağlayan çok minimal bir arayüze sahiptir.

source: The icons available to you in the toolbar are as follows:
tr: Araç çubuğunda bulunan simgeler şunlardır:

source: Toolbar Icons
tr: Araç Çubuğu Simgeleri

source: Table of Contents
tr: İçindekiler

source: Go to the main start page of &khelpcenter;.
tr: &khelpcenter; başlangıç sayfasına gidin.

source: Back
tr: Geri

source: Go to the previous page you viewed. Click the check mark right to the icon. This displays a list of previously viewed pages. Selecting one will take you directly back to that page.
tr: Görüntülediğiniz önceki sayfaya gidin. Simgenin sağındaki onay işaretine tıklayın. Bu, daha önce görüntülenen sayfaların bir listesini görüntüler. Birini seçtiğinizde doğrudan o sayfaya geri dönersiniz.

source: Forward
tr: İleri

source: Go forward one page. This icon is only active if you have already used the <guiicon>Back</guiicon> icon.
tr: Bir sayfa ileri gidin. Bu simge yalnızca halihazırda <guiicon>Geri</guiicon> simgesini kullandıysanız etkindir.

source: Copy
tr: Kopyala

source: Copy text to the clipboard to be pasted in another application.
tr: Metni başka bir uygulamaya yapıştırabilmek için panoya kopyalayın.

source: Find
tr: Bul

source: Find a word or words within the currently visible page.
tr: Şu anda görünen sayfadaki bir sözcüğü veya sözcükleri bulun.

source: Increase Font Sizes
tr: Yazıtipi Puntosunu Büyüt

source: Increase the size of the text in the viewer pane.
tr: Görüntüleyici bölmesindeki metnin boyutunu artırın.

source: Decrease Font Sizes
tr: Yazıtipi Puntosunu Küçült

source: Decrease the size of the text in the viewer pane. This icon is only enabled if you have previously enlarged the text.
tr: Görüntüleyici bölmesindeki metnin boyutunu azaltın. Bu simge yalnızca metni daha önce büyüttüyseniz etkinleştirilir.

source: The menus contain the following entries:
tr: Menüler aşağıdaki girdileri içerir:

source: File
tr: Dosya
