Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/khelpcenter.po
Languages: tr

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Print</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Yazdır</guimenuitem>

source: Print the contents of the currently visible page. Handbooks in <acronym>PDF</acronym> format you find on the <ulink url="https://docs.kde.org/index.php?language=en"> &kde; Documentation Server</ulink>.
tr: Şu anda görünür olan sayfanın içeriğini yazdırın. El kitaplarını <acronym>PDF</acronym> biçiminde <ulink url="https://docs.kde.org/index.php?language=en"> &kde; Belgelendirme Sunucusu</ulink>’nda bulabilirsiniz.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Çık</guimenuitem>

source: Close and exit &khelpcenter;
tr: &khelpcenter; uygulamasını kapat ve çık

source: Edit
tr: Düzen

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu><guimenuitem>Copy</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu><guimenuitem>Kopyala</guimenuitem>

source: Copy the selected text to the clipboard.
tr: Seçili metni panoya kopyalayın.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Select All</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Tümünü Seç</guimenuitem>

source: Select all the text in the current page.
tr: Geçerli sayfadaki tüm metni seçin.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Bul…</guimenuitem>

source: Find a word or words in the currently visible page.
tr: Şu anda görünen sayfadaki bir sözcüğü veya sözcükleri bulun.

source: View
tr: Görünüm

source: <guimenu>View</guimenu> <guisubmenu>Set Encoding</guisubmenu>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Kodlamayı Ayarla</guisubmenu>

source: Change the encoding of the current page. Normally, the default setting of <guimenuitem>Default</guimenuitem> should be sufficient, but if you are having problems viewing pages written in languages other than English, you may need to choose a specific encoding in this menu.
tr: Geçerli sayfanın kodlamasını değiştirin. Normalde <guimenuitem>Öntanımlı</guimenuitem> ayarı yeterli olmalıdır; ancak İngilizce dışındaki dillerde yazılmış sayfaları görüntülemekte sorun yaşıyorsanız bu menüde belirli bir kodlama seçmeniz gerekebilir.

source: <guimenu>View</guimenu> <guisubmenu>Full Screen Mode</guisubmenu>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Tam Ekran Kipi</guisubmenu>

source: Changes &khelpcenter; to full screen mode, in which the &khelpcenter; window takes up the whole screen, and does not have the usual window decorations. To exit full screen mode, press <keycombo action="simul">&Ctrl;&Shift; <keycap>F</keycap></keycombo>.
tr: &khelpcenter; uygulamasını tam ekran kipine geçirir. Bu kipte, &khelpcenter; tüm ekranı kaplar ve pencere dekorasyonları görünmez. Tam ekran kipinden çıkmak için <keycombo action="simul">&Ctrl;&Shift; <keycap>F</keycap></keycombo> kısayolunu kullanın.

source: <guimenu>Go</guimenu>
tr: <guimenu>Git</guimenu>

source: <shortcut> <keycombo action="simul">&Alt;<keycap>Home</keycap></keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>Table of Contents</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;<keycap>Baş</keycap></keycombo></shortcut> <guimenu>Git</guimenu> <guimenuitem>İçindekiler</guimenuitem>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>PgUp</keycap></keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>Previous Page</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Sayfa Yukarı</keycap></keycombo></shortcut> <guimenu>Git</guimenu> <guimenuitem>Önceki Sayfa</guimenuitem>

source: Go to the previous page of the current documentation.
tr: Geçerli belgelendirmenin önceki sayfasına gidin.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>PgDown</keycap></keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>Next Page</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Sayfa Aşağı</keycap></keycombo></shortcut> <guimenu>Git</guimenu> <guimenuitem>Sonraki Sayfa</guimenuitem>

source: Go to the next page of the current documentation.
tr: Geçerli belgelendirmenin sonraki sayfasına gidin.

source: <shortcut> <keycombo action="simul">&Alt;<keysym>Left</keysym></keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>Back</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;<keysym>Sol</keysym></keycombo></shortcut> <guimenu>Git</guimenu> <guimenuitem>Geri</guimenuitem>

source: Go back to the previous page you were viewing.
tr: Görüntülediğiniz önceki sayfaya geri dönün.

source: <shortcut> <keycombo action="simul">&Alt;<keysym>Right</keysym></keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>Forward</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;<keysym>Sağ</keysym></keycombo></shortcut> <guimenu>Git</guimenu> <guimenuitem>İleri</guimenuitem>

source: If you have previously moved back with the back icon or menu entry, you can work your way forward again with this menu entry.
tr: Daha önce geri simgesiyle veya menü girdisiyle geri döndüyseniz bu menü girdisiyle yeniden ileri doğru ilerleyebilirsiniz.

source: Bookmarks
tr: Yer İmleri

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo></shortcut> <guimenu>Bookmarks</guimenu> <guimenuitem>Add Bookmark</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo></shortcut> <guimenu>Yer İmleri</guimenu> <guimenuitem>Yer İmi Koy</guimenuitem>

source: Add a bookmark for the current page, the title of the pages is appended to the bookmarks menu. Use the action <guimenuitem>Delete Bookmark</guimenuitem> in the context menu of an item to remove it from the menu.
tr: Geçerli sayfa için bir yer imi ekleyin; sayfaların başlığı yer imleri menüsüne eklenir. Bir ögeyi menüden kaldırmak için bağlam menüsündeki <guimenuitem>Yer İmini Sil</guimenuitem> ögesini kullanın.

source: <guimenu>Bookmarks</guimenu> <guimenuitem>New Bookmarks Folder</guimenuitem>
tr: <guimenu>Yer İmleri</guimenu> <guimenuitem>Yeni Yer İmleri Klasörü</guimenuitem>

source: Open the <guilabel>New Folder</guilabel> dialog where you can add new submenuitems to the bookmarks menu.
tr: Yer imleri menüsüne yeni alt menü ögeleri ekleyebileceğiniz <guilabel>Yeni Klasör</guilabel> iletişim kutusunu açın.

source: Settings
tr: Ayarlar

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Fonts...</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Yazıtiplerini Yapılandır…</guimenuitem>

source: Allows you to configure the font family and size used by &khelpcenter;.
tr: &khelpcenter; tarafından kullanılan yazıtipi ailesini ve boyutunu yapılandırmanıza izin verir.

source: Additionally &khelpcenter; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/menus.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/menus.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
tr: Ek olarak &khelpcenter;, temel &kde; <guimenu>Ayarlar</guimenu> ve <guimenu>Yardım</guimenu> menü ögelerine sahiptir; daha fazla bilgi için &kde; Temelleri’nin <ulink url="help:/fundamentals/menus.html#menus-settings">Ayarlar Menüsü</ulink> ve <ulink url="help:/fundamentals/menus.html#menus-help">Yardım Menüsü</ulink> bölümlerine bakın.

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Originally developed by &Matthias.Elter; &Matthias.Elter.mail;
tr: Özgün olarak &Matthias.Elter; &Matthias.Elter.mail; tarafından geliştirilmiştir.

source: The current maintainer is &Cornelius.Schumacher; &Cornelius.Schumacher.mail;
tr: Şu anki bakımcı: &Cornelius.Schumacher; &Cornelius.Schumacher.mail;

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
