Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kinfocenter.po
Languages: tr

source: An <acronym>IRQ</acronym> is a hardware line used in a <acronym>PC</acronym> by (<acronym>ISA</acronym> bus) devices like keyboards, modems, sound cards, &etc;, to send interrupt signals to the processor to tell it that the device is ready to send or accept data. Unfortunately, there are only sixteen <acronym>IRQ</acronym>'s (0-15) available in the i386 (<acronym>PC</acronym>) architecture for sharing among the various <acronym>ISA</acronym> devices.
tr: <acronym>IRQ</acronym>, bir <acronym>Bilgisayarınızda</acronym> klavyeler, modemler, ses kartları vb. aygıtların veri göndermeye veya kabul etmeye hazır olduğunu söylemek için işlemciye sinyal gönderen donanım hattıdır. Ne yazık ki, çeşitli <acronym>ISA</acronym> aygıtları arasında paylaşım için i386 (<acronym>PC</acronym>) mimarisinde kullanılabilen yalnızca on altı <acronym>IRQ</acronym> (0–15) vardır.

source: Many hardware problems are the result of <acronym>IRQ</acronym> conflicts, when two devices try to use the same <acronym>IRQ</acronym>, or software is misconfigured to use a different <acronym>IRQ</acronym> from the one a device is actually configured for.
tr: Birçok donanım sorunu, iki aygıt aynı <acronym>IRQ</acronym>’yi kullanmaya çalıştığında veya yazılım bir aygıtın gerçekten yapılandırıldığı aygıttan farklı bir <acronym>IRQ</acronym> kullanmak üzere yanlış yapılandırıldığında <acronym>IRQ</acronym> çakışmalarının sonucudur.

source: The exact information displayed is system-dependent. On some systems, <acronym>IRQ</acronym> information cannot be displayed yet.
tr: Görüntülenen kesin bilgiler sisteme bağlıdır. Bazı sistemlerde <acronym>IRQ</acronym> bilgisini görüntülemek olanaklı değildir.

source: On &Linux;, this information is read from <filename class="directory">/proc/interrupts</filename>, which is only available if the <filename class="directory">/proc</filename> pseudo-filesystem is compiled into the kernel.
tr: &Linux;’ta bu bilgi, yalnızca <filename class="devicefile">/proc</filename> sözde dosya sistemi çekirdeğe derlendiğinde kullanılabilen <filename class="devicefile">/proc/interrupts</filename> adresinden okunur.

source: The first column, is the <acronym>IRQ</acronym> number. The second column, is the number of interrupts that have been received since the last reboot. The third column shows the type of interrupt. The fourth, identifies the device assigned to that interrupt.
tr: İlk sütun, <acronym>IRQ</acronym> numarasıdır. İkinci sütun, son yeniden başlatmadan bu yana alınan kesinti sayısıdır. Üçüncü sütun kesme türünü gösterir. Dördüncüsü, bu kesintiye atanan aygıtı tanımlar.

source: The user cannot modify any settings on this page.
tr: Kullanıcı bu sayfada gösterilen ayarları değiştiremez.

source: <acronym>DMA</acronym> Channel Information Module
tr: <acronym>DMA</acronym> Kanal Bilgisi Modülü

source: This page displays information about the <acronym>DMA</acronym> (Direct Memory Access) Channels. A <acronym>DMA</acronym> channel is a direct connection that allows devices to transfer data to and from memory without going through the processor. Typically, i386-architecture systems (<acronym>PC</acronym>'s) have eight <acronym>DMA</acronym> channels (0-7).
tr: Bu sayfa <acronym>DMA</acronym> (Direct Memory Access — Doğrudan Hafıza Erişimi) Kanalları hakkında bilgi verir. Bir <acronym>DMA</acronym> kanalı, aygıtların işlemciyi pas geçerek hafızayla bilgi alışverişlerini sağlayan bir doğrudan bağlantıdır. Tipik olarak, i386-mimarisi sistemleri (<acronym>PC</acronym>’ler —Personal Computer— Kişisel Bilgisayar) sekiz <acronym>DMA</acronym> Kanalına sahiptir (0–7).

source: The exact information displayed is system-dependent. On some systems, <acronym>DMA</acronym> Channel information cannot be displayed yet.
tr: Görüntülenen kesin bilgiler sisteme bağlıdır. Bazı sistemlerde <acronym>DMA</acronym> bilgisini görüntülemek olanaklı değildir.

source: On &Linux;, this information is read from <filename class="devicefile">/proc/dma</filename>, which is only available if the <filename class="directory">/proc</filename> pseudo-filesystem is compiled into the kernel.
tr: &Linux;’ta bu bilgi, yalnızca <filename class="devicefile">/proc</filename> sözde dosya sistemi çekirdeğe derlendiğinde kullanılabilen <filename class="devicefile">/proc/dma</filename> adresinden okunur.

source: A list of all currently-registered (<acronym>ISA</acronym> bus) <acronym>DMA</acronym> channels that are in use is shown. The first column shows the <acronym>DMA</acronym> channel, and the second column shows the device which uses that channel.
tr: Şu anda kayıtlı olan ve kullanımda olan tüm (<acronym>ISA</acronym> veri yolu) <acronym>DMA</acronym> kanallarının bir listesi gösterilir. İlk sütun <acronym>DMA</acronym> kanalını, ikinci sütun ise bu kanalı kullanan aygıtı gösterir.

source: Unused <acronym>DMA</acronym> channels are not listed.
tr: Kullanılmayan <acronym>DMA</acronym> kanalları listelenmez.

source: &USB; Controller/&USB; Devices Information Module
tr: &USB; Denetleyicisi/&USB; Devices Information Module

source: This module allows you to see the devices attached to your &USB; bus(es).
tr: Bu modül, &USB; veri yollarınıza bağlı aygıtları görmenizi sağlar.

source: This module is for information only, you cannot edit any information you see here.
tr: Bu modül yalnızca bilgilendirme amaçlıdır, burada gördüğünüz hiçbir bilgiyi düzenleyemezsiniz.

source: Input/Output Port Information Module
tr: Giriş/Çıkış Kapısı Bilgi Modülü

source: This page displays information about the I/O ports.
tr: Bu sayfa, G/Ç kapıları hakkında bilgi görüntüler.

source: I/O Ports are memory addresses used by the processor for direct communication with a device that has sent an interrupt signal to the processor.
tr: G/Ç Kapıları, işlemcilerin kendisine kesinti sinyali gönderen aygıtlarla doğrudan bağlantı kurduğu bellek adresleridir.

source: The exchange of commands or data between the processor and the device takes place through the I/O port address of the device, which is a hexadecimal number. No two devices can share the same I/O port. Many devices use multiple I/O port addresses, which are expressed as a range of hexadecimal numbers.
tr: İşlemci ile aygıt arasındaki komut veya veri alışverişi, aygıtın onaltılık bir sayı olan G/Ç kapısı adresi aracılığıyla gerçekleşir. İki aygıt aynı G/Ç kapısını paylaşamaz. Çoğu aygıt, bir onaltılık sayı aralığı olarak ifade edilen birden çok G/Ç bağlantı noktası adresi kullanır.

source: The exact information displayed is system-dependent. On some systems, I/O port information can not yet be displayed.
tr: Görüntülenen kesin bilgiler sisteme bağlıdır. Bazı sistemlerde G/Ç kapısı bilgisini görüntülemek olanaklı değildir.

source: On &Linux;, this information is read from <filename class="devicefile">/proc/ioports</filename> which is only available if the <filename class="devicefile">/proc</filename> pseudo-filesystem is compiled into the kernel. A list of all currently-registered I/O port regions that are in use is shown.
tr: &Linux;’ta bu bilgi, yalnızca <filename class="devicefile">/proc</filename> sözde dosya sistemi çekirdeğe derlendiğinde kullanılabilen <filename class="devicefile">/proc/ioports</filename> adresinden okunur. Şu anda kayıtlı olan ve kullanımda olan tüm G/Ç kapısı bölgelerinin bir listesi gösterilir.

source: The first column is the I/O port (or the range of I/O ports), the second column identifies the device that uses these I/O ports.
tr: İlk sütun, G/Ç kapısıdır (veya G/Ç kapıları aralığıdır); ikinci sütun, bu G/Ç kapılarını kullanan aygıtı tanımlar.

source: <acronym>PCI</acronym>-bus/Installed <acronym>PCI</acronym> Cards Information Module
tr: <acronym>PCI</acronym>-veri yolu/Kurulu <acronym>PCI</acronym> Kartları Bilgi Modülü

source: This page displays information about the <acronym>PCI</acronym>-bus and installed <acronym>PCI</acronym> cards, and other devices that use the Peripheral Component Interconnect (<acronym>PCI</acronym>) bus.
tr: Bu sayfa, <acronym>PCI</acronym> veri yolu ve takılı <acronym>PCI</acronym> kartları ve Çevresel Bileşen Bağlantısı (<acronym>PCI</acronym>) veri yolunu kullanan diğer aygıtlar hakkında bilgi görüntüler.

source: The exact information displayed is system-dependent. On some systems, <acronym>PCI</acronym>-information can not yet be displayed.
tr: Görüntülenen kesin bilgiler sisteme bağlıdır. Bazı sistemlerde <acronym>PCI</acronym> bilgisini görüntülemek olanaklı değildir.

source: On &Linux;, this information is read from <filename class="devicefile">/proc/pci</filename> which is only available if the <filename class="directory">/proc</filename> pseudo-filesystem is compiled into the kernel. A listing of all <acronym>PCI</acronym> devices found during kernel initialization, and their configuration, is shown.
tr: &Linux;’ta bu bilgi, yalnızca <filename class="devicefile">/proc</filename> sözde dosya sistemi çekirdeğe derlendiğinde kullanılabilen <filename class="devicefile">/proc/pci</filename> adresinden okunur. Çekirdek ilklendirme sırasında bulunan tüm <acronym>PCI</acronym> aygıtlarının ve bunların yapılandırmasının bir listesi gösterilir.

source: Each entry begins with a bus, device and function number.
tr: Her bir girdi, bir veri yolu, aygıt ve işlev numarası ile başlar.

source: Network Information Module
tr: Ağ Bilgisi Modülü

source: Network Interfaces Information Module
tr: Ağ Arayüzleri Bilgisi Modülü

source: This page displays information about the network interfaces installed in your computer.
tr: Bu sayfa, bilgisayarınızda takılı olan ağ arabirimleri hakkında bilgi görüntüler.

source: The exact information displayed is system-dependent. On some systems, this information can not yet be displayed.
tr: Görüntülenen kesin bilgiler sisteme bağlıdır. Bazı sistemlerde bu bilgiyi görüntülemek olanaklı değildir.

source: &Samba; Status Information Module
tr: &Samba; Durum Bilgisi Modülü

source: The &Samba; and &NFS; Status Monitor is a front end to the programs <command>smbstatus</command> and <command>showmount</command>. Smbstatus reports on current &Samba; connections, and is part of the suite of &Samba; tools, which implements the &SMB; (Server Message Block) protocol, also called the NetBIOS or LanManager protocol.
tr: &Samba; ve &NFS; Durum Monitörü, <command>smbstatus</command> ve <command>showmount</command> programlarının ön yüzüdür. Smbstatus, geçerli &Samba; bağlantıları hakkında rapor verir ve &SMB; protokolünü (Server Message Block — Sunucu İletisi Bloku) uygulayan &Samba; paketinin bir parçasıdır; NetBIOS veya LanManager protokolü olarak da adlandırılır.

source: This protocol can be used to provide printer sharing or drive sharing services on a network including machines running the various flavors of &Microsoft; &Windows;.
tr: Bu protokol,çeşitli &Microsoft; &Windows; sürümleri kurulu aygıtları da içeren ağdaki aygıtlar üzerinde yazıcı ve sürücü paylaşımı hizmetleri sağlamak için kullanılabilir.

source: <command>showmount</command> is part of the &NFS; software package. &NFS; stands for Network File System and is the traditional &UNIX; way to share folders over the network. In this case the output of <command>showmount</command> <option>-a localhost</option> is parsed. On some systems showmount is in <filename class="directory">/usr/sbin</filename>, check if you have showmount in your <envar>PATH</envar>.
tr: <command>showmount</command>, &NFS; yazılım paketinin bir parçasıdır. &NFS;, Network File System (Ağ Dosya Sistemi) kısaltmasıdır ve ağda klasötler paylaşmanın geleneksel &UNIX; yoludur. Bu durumda, <command>showmount</command> <option>-a localhost</option> komutunun çıktısı ayrıştırılır. Kimi sistemlerde, showmount <filename class="directory">/usr/sbin</filename> içindedir; showmount’un <envar>PATH</envar>’iniz içinde olup olmadığını denetleyin.

source: Exports
tr: Dışa Aktarmalar

source: On this page you can see a big list which shows the currently active connections to &Samba; shares and &NFS; exports of your machine. The first column shows you whether the resource is a &Samba; (&SMB;) share or a &NFS; export. The second column contains the name of the share, the third the name of the remote host, which accesses this share. The remaining columns have only a meaning for &Samba;-shares.
tr: Bu sayfada, şu anda etkin olan &Samba; paylaşımlarına ve makinenizin &NFS; dışa aktarmalarının bir büyükçe bir listesini görebilirsiniz. İlk sütun size özkaynağın bir &Samba; (&SMB;) paylaşımı veya bir &NFS; dışa aktarması olup olmadığını gösterir. İkinci sütun, paylaşımın adını, üçüncüsü ise bu paylaşıma erişen uzak ana bilgisayarın adını içerir. Kalan sütunlar yalnızca &Samba;-paylaşımları için vardır.

source: The fourth column contains the User <abbrev>ID</abbrev> of the user, who accesses this share. Note that this does not have to be equal to the &UNIX; user <abbrev>ID</abbrev> of this user. The same applies for the next column, which displays the group <abbrev>ID</abbrev> of the user.
tr: Dördüncü sütun, bu paylaşıma erişen kullanıcının <abbrev>kimliğini</abbrev> içerir. Bunun, bu kullanıcının &UNIX; kullanıcı <abbrev>kimliğiyle</abbrev> aynı olması gerekmemektedir. Aynısı, kullanıcının <abbrev>grup</abbrev> kimliğini görüntüleyen bir sonraki sütun için de geçerlidir.

source: Each connection to one of your shares is handled by a single process (<command>smbd</command>), the next column shows the process <abbrev>ID</abbrev> (<acronym>pid</acronym>) of this <command>smbd</command>. If you kill this process the connected user will be disconnected. If the remote user works from &Windows;, as soon as this process is killed a new one will be created, so he will almost not notice it.
tr: Paylaşımınıza kurulan her bağlantı bir tek işlem (<command>smbd</command>) tarafından yürütülür; bir sonraki sütun, <command>smbd</command>’nin <abbrev>kimlik</abbrev> (<acronym>pid</acronym>) işlemini gösterir. Eğer bu işlemi öldürürseniz (kapatırsanız) bağlı olan kullanıcı hattan düşer. Uzak kullanıcı &Windows; üzerinde çalışıyorsa bu işlem öldürülür öldürülmez bir yenisi yaratılır, böylece kullanıcı bunun farkına bile varmaz.

source: The last column shows how many files this user has currently open. Here you see only, how many files he has <emphasis>open</emphasis> just now, you don't see how many he copied or formerly opened &etc;
tr: Son sütun, bu kullanıcının şu anda kaç dosya açtığını gösterir. Burada yalnızca şu anda kaç tane <emphasis>açık</emphasis> olduğunu görürsünüz; kaç tanesini kopyaladığını veya önceden açtığını görmezsiniz.

source: Imports
tr: İçe Aktarmalar

source: Here you see which &Samba;- and &NFS;-shares from other hosts are mounted on your local system. The first column shows whether it is a &Samba;- or &NFS;-share, the second column displays the name of the share, and the third shows where it is mounted.
tr: Burada, diğer ana bilgisayarlardan hangi &Samba; ve &NFS; paylaşımlarının yerel sisteminize bağlandığını görürsünüz. İlk sütun, &Samba; veya &NFS; paylaşımı olup olmadığını gösterir, ikinci sütun paylaşımın adını görüntüler ve üçüncüsü, nereye bağlandığını gösterir.

source: The mounted &NFS;-shares you should see on &Linux; (this has been tested), and it should also work on &Solaris; (this has not been tested).
tr: Bağlı &NFS; paylaşımlarını &Linux; üzerinde görmelisiniz (bu sınanmıştır) ve ayrıca &Solaris; üzerinde de çalışmalıdır (bu sınanmamıştır).

source: <title>Log</title>
tr: <title>Günlük</title>

source: This page presents the contents of your local &Samba; log file in a nice way. If you open this page, the list will be empty. You have to press the <guibutton>Update</guibutton> button, then the &Samba; log file will be read and the results displayed. Check whether the &Samba; log file on your system is really at the location as specified in the input line. If it is somewhere else or if it has another name, correct it. After changing the file name you have to press <guibutton>Update</guibutton> again.
tr: Bu sayfa, &Samba; günlük dosyanızın içeriğini hoş bir biçimde sunar. Bu sayfayı açarsanız liste boş olacaktır. <guibutton>Güncelle</guibutton> düğmesine bastığınızda &Samba; günlük dosyası okunur ve sonuçlar görüntülenir. &Samba; günlük dosyasının gerçekten de sisteminizde girdi satırında belirtilen konumda olup olmadığını denetleyin. Başka bir yerdeyse veya başka bir adı varsa düzeltin. Dosya adını değiştirdikten sonra <guibutton>Güncelle</guibutton> düğmesine yeniden basmalısınız.

source: &Samba; logs its actions according to the log level (see <filename>smb.conf</filename>). If loglevel = 1, &Samba; logs only when somebody connects to your machine and when this connection is closed again. If log level = 2, it logs also if somebody opens a file and if he closes the file again. If the log level is higher than 2, yet more stuff is logged.
tr: &Samba; eylemlerini günlük düzeyine göre günlükler (bkz. <filename>smb.conf</filename>). Günlük düzeyi 1 ise &Samba; yalnızca birisi makinenize bağlandığında ve bu bağlantı kapatıldığında günlüğe yazar. Günlük düzeyi 2 ise birisi bir dosyayı açıp kapadığında da günlüğe yazar. Günlük düzeyi 2’den çoksa bayağı bir şeyler daha günlüğe yazılır.

source: If you are interested in who accesses your machine, and which files are accessed, you should set the log level to 2 and regularly create a new &Samba; log file (&eg; set up a <command>cron</command> task which once a week moves your current &Samba; log file into another folder or something like that). Otherwise your &Samba; log file may become very big.
tr: Makinenize kimin eriştiği ve hangi dosyalara erişildiği ile ilgileniyorsanız günlük düzeyini 2 olarak ayarlamalı ve düzenli olarak yeni bir &Samba; günlük dosyası (örn. var olan &Samba; günlük dosyanızı haftada bir başka bir klasöre veya buna benzer bir yere taşıyan bir <command>cron</command> görevi kurun). Aksi takdirde &Samba; günlük dosyası çok büyük olabilir.

source: With the four checkboxes below the big list you can decide, which events are displayed in the list. You have to press <guibutton>Update</guibutton> to see the results. If the log level of your &Samba; is too low, you won't see everything.
tr: Büyük listenin altındaki dört onay kutusuyla listede hangi olayların görüntüleneceğine karar verebilirsiniz. Sonuçları görmek için <guibutton>Güncelle</guibutton>’ye basmanız gerekir. &Samba; günlük düzeyiniz çok düşükse her şeyi göremezsiniz.

source: By clicking on the header of one column you can sort the list by this column.
tr: Bir sütunun başlığına tıklayarak listeyi bu sütuna göre sıralayabilirsiniz.

source: Statistics
tr: İstatistikler

source: On this page you can filter the contents of the third page for certain contents.
tr: Bu sayfada, belirli içerik için üçüncü sayfanın içeriğini süzebilirsiniz.

source: Let's say the <guilabel>Event</guilabel> field (not the one in the list) is set to <userinput>Connection</userinput>, <guilabel>Service/File</guilabel> is set to <userinput>*</userinput>, <guilabel>Host/User</guilabel> is set to <userinput>*</userinput>, <guilabel>Show expanded service info</guilabel> is disabled and <guilabel>Show expanded host info</guilabel> is disabled.
tr: Diyelim ki <guilabel>Olay</guilabel> alanı (listedeki değil) <userinput>Bağlantı</userinput> olarak, <guilabel>Hizmet/Dosya</guilabel> <userinput>*</userinput> olarak, <guilabel>Makine/Kullanıcı</guilabel> <userinput>*</userinput> olarak ve <guilabel>Genişletilmiş hizmet bilgisini göster</guilabel> ve <guilabel>Genişletilmiş makine bilgisini göster</guilabel> devre dışı.

source: If you press <guibutton>Update</guibutton> now, you will see how often a connection was opened to share <literal>*</literal> (&ie; to any share) from host <literal>*</literal> (&ie; from any host). Now enable <guilabel>Show expanded host info</guilabel> and press <guibutton>Update</guibutton> again. Now you will see for every host which matches the wildcard <literal>*</literal>, how many connections were opened by him.
tr: <guibutton>Güncelle</guibutton>’ye basarsanız <literal>*</literal> bilgisayarından <literal>*</literal> bilgisayarına hangi sıklıkla bağlantı kurulduğunu göreceksiniz. Şimdi <guilabel>Genişletilmiş bilgisayar bilgisini göster</guilabel>’i etkinleştirin ve <guibutton>Güncelle</guibutton>’ye yeniden basın. Şimdi <literal>*</literal> sembolü ile eşleşen her bilgisayarı göreceksiniz ve onunla kaç bağlantı kurulduğunu öğrenebileceksiniz.

source: Now press <guibutton>Clear Results</guibutton>.
tr: Şimdi <guibutton>Sonuçları Temizle</guibutton> düğmesine basın.

source: Now set the <guilabel>Event</guilabel> field to File Access and enable <guilabel>Show expanded service info</guilabel> and press <guibutton>Update</guibutton> again.
tr: Şimdi <guilabel>Olay</guilabel> alanını Dosya Erişimi’ne ayarlayıp,<guilabel>Genişletilmiş hizmet bilgisini göster</guilabel>’i etkinleştirin ve <guibutton>Güncelle</guibutton>’ye bir kez daha basın.

source: Now you will see how often every single file was accessed. If you enable <guilabel>Show expanded host info</guilabel> too, you will see how often every single user opened each file.
tr: Şimdi her dosyaya hangi sıklıkla ulaşıldığını görürsünüz. <guilabel>Genişletilmiş bilgisayar bilgisini göster</guilabel>’i de seçerseniz her kullanıcının her dosyayı hangi sıklıkla açtığını da görebileceksiniz.

source: In the input lines <guilabel>Service/File</guilabel> and <guilabel>Host/User</guilabel> you can use the wildcards <literal>*</literal> and <literal>?</literal> in the same way you use them at the command line. Regular expressions are not recognized.
tr: <guilabel>Hizmet/Dosya</guilabel> ve <guilabel>Makine/Kullanıcı</guilabel> girdi satırlarında <literal>*</literal> ve <literal>?</literal> sembollerini komut satırında kullandığınla aynı anlamlarla kullanabilirsiniz.

source: By clicking on the header of a column you can sort the list by this column. This way you can check out which file was opened most often, or which user opened the most files or whatever.
tr: Bir sütunun başlığına tıklayarak listeyi bu sütuna göre sıralayabilirsiniz. Bu şekilde, hangi dosyanın en sık açıldığını veya hangi kullanıcının en çok dosyayı açtığını denetleyebilirsiniz.

source: Section Author
tr: Bölüm Yazarı

source: Module copyright 2000: Michael Glauche and &Alexander.Neundorf; &Alexander.Neundorf.mail;
tr: Modül telif hakkı 2000: Michael Glauche ve &Alexander.Neundorf; &Alexander.Neundorf.mail;

source: Originally written by: Michael Glauche
tr: Özgün hali Michael Glauche tarafından yazılmıştır.

source: Currently maintained by: &Alexander.Neundorf; &Alexander.Neundorf.mail;
tr: Şu anki bakımcı: &Alexander.Neundorf; &Alexander.Neundorf.mail;

source: Contributors
tr: Katkıda Bulunanlar

source: Conversion to &kcontrol; applet:
tr: kcontrol uygulamacığına dönüşüm:

source: Use of <classname>K3Process</classname> instead of popen, and more error checking:
tr: popen yerine <classname>K3Process</classname> kullanımı ve ek hata denetlemeleri:

source: Conversion to kcmodule, added tab pages 2,3,4, bug fixed:
tr: kcmodule dönüşümü, 2, 3, 4. sekme sayfaları, hata düzeltmeleri:

source: Documentation copyright 2000 &Alexander.Neundorf; &Alexander.Neundorf.mail;
tr: Belgelendirme telif hakkı 2000 &Alexander.Neundorf; &Alexander.Neundorf.mail;

source: Documentation translated to docbook by &Mike.McBride; &Mike.McBride.mail;
tr: &Mike.McBride; &Mike.McBride.mail; tarafından docbook’a çevrilmiştir

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Engin ÇAĞATAY <email>engincagatay@yahoo.com</email></para><para>Çeviri: Volkan Gezer <email>volkangezer@gmail.com</email></para><para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>

source: Graphical Information Module
tr: Grafiksel Bilgi Modülü
