Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kinfocenter.po
Languages: tr

source: The &infocenter;
tr: &infocenter;

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Volkan</firstname><surname>Gezer</surname><affiliation><address><email>volkangezer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit> <othercredit role="translator"><firstname>Engin</firstname><surname>ÇAĞATAY</surname><affiliation><address><email>engincagatay@yahoo.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit> <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: This documentation describes &plasma;’s information center.
tr: Bu belgelendirme, &plasma; bilgi merkezi hakkında bilgi verir.

source: system
tr: sistem

source: information
tr: bilgi

source: module
tr: modül

source: The &infocenter; provides you with a centralized and convenient overview of your system and desktop environment.
tr: &infocenter; size sisteminiz ve masaüstü ortamınız hakkında merkezi ve kullanışlı bir genel görünüm sağlar.

source: The information center is made up of multiple modules. Each module is a separate application, but the information center organizes all of these programs into a convenient location.
tr: Bilgi merkezi birden çok modülden oluşur. Her modül ayrı bir uygulamadır; ancak bilgi merkezi tüm bu programları uygun bir yerde düzenler.

source: This next section details the use of the information center itself. For information on individual modules, please see <link linkend="module">Default &infocenter; Modules</link>.
tr: Bu sonraki bölüm, bilgi merkezinin kullanımının ayrıntılarını verir. Bireysel modüller hakkında bilgi için lütfen <link linkend="module">Öntanımlı &infocenter; Modülleri</link>’ne bakın.

source: Starting the &infocenter;
tr: &infocenter; Uygulamasını Başlatmak

source: The &infocenter; can be started in three ways:
tr: &infocenter;, üç yolla başlatılabilir:

source: By selecting <menuchoice><guimenu>Applications </guimenu><guisubmenu>System</guisubmenu><guimenuitem>&infocenter;</guimenuitem> </menuchoice> from the application launcher in the panel.
tr: Paneldeki uygulama başlatıcısından <menuchoice><guimenu>Uygulamalar </guimenu><guisubmenu>Sistem</guisubmenu><guimenuitem>&infocenter;</guimenuitem> </menuchoice> seçimini yaparak.

source: By pressing <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> or <keycombo action="simul">&Alt;&Space;</keycombo>. This will bring up &krunner;. Type <userinput><command>kinfocenter</command></userinput>, and press &Enter;.
tr: <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> veya <keycombo action="simul">&Alt;&Space;</keycombo> kısayollarını kullanarak. Bu, &krunner; uygulamasını çağırır. <userinput><command>kinfocenter</command></userinput> yazın ve &Enter;’e basın.

source: You can type <command>kinfocenter &amp;</command> at any command prompt.
tr: Herhangi bir komut satırında <command>kinfocenter &amp;</command> yazabilirsiniz.

source: All three of these methods are equivalent, and produce the same result.
tr: Tüm bu üç yol da eşittir ve aynı sonuca ulaştırır.

source: <title>The &infocenter; Screen</title>
tr: <title>&infocenter; Ekranı</title>

source: When you start the information center, you are presented with a window, which can be divided into three functional parts.
tr: Bilgi merkezini başlattığınızda, üç işlevsel bölüme ayrılabilen bir pencere sunulur.

source: The &infocenter; Screen.
tr: &infocenter; Ekranı

source: <phrase>The &infocenter; Screen</phrase>
tr: <phrase>&infocenter; Ekranı</phrase>

source: Across the top is a toolbar. The toolbar will provide you with quick access to most of &infocenter;’s features like get help on the current module and a help menu.
tr: En üstte bir araç çubuğu bulunur. Araç çubuğu, &infocenter; uygulamasının geçerli modül hakkında yardım alma ve bir yardım menüsü gibi özelliklerinin çoğuna tez erişim sağlayacaktır.

source: Along the left hand side, is a column with a filter field at the top. This is a where you choose which module to investigate. To navigate through the various <acronym>KCM</acronym> modules, left click on the module in the tree view. You can also use the arrow keys to scroll though the <acronym>KCM</acronym>'s and pressing &Enter; will select the module. The module will now appear of the main panel of the &infocenter; window. Some items within the tree view are categories, you can left click or again press &Enter; to expand and collapsed these items. This will show the modules under the category. You can right click on the module listing to show the following options:
tr: Sol tarafta, üstünde süzgeç alanı bulunan bir sütun bulunur. Bu, hangi modülü araştıracağınızı seçtiğiniz yerdir. Çeşitli <acronym>KCM</acronym> modülleri arasında gezinmek için ağaç görünümünde modüle sol tıklayın. Ayrıca <acronym>KCM</acronym>’ler arasında gezinmek için ok düğmelerini kullanabilir ve &Enter;’e basabilirsiniz; bu eylem modülü seçecektir. Modül şimdi &infocenter; uygulamasının ana panelinde görünecektir. Ağaç görünümündeki bazı ögeler kategorilerdir; bu ögeleri genişletmek ve daraltmak için sol tıklayabilir veya yeniden &Enter;’e basabilirsiniz. Bu, kategori altındaki modülleri gösterecektir. Aşağıdaki seçenekleri göstermek için modül listesine sağ tıklayabilirsiniz:

source: <guimenuitem>Collapse All Categories</guimenuitem>: Collapses the tree to show only top level modules and categories.
tr: <guimenuitem>Tüm Kategorileri Daralt</guimenuitem>: Ağacı yalnızca üst düzey modülleri ve kategorileri gösterecek şekilde daraltır.

source: <guimenuitem>Expand All Categories</guimenuitem>: Expands the tree to show modules.
tr: <guimenuitem>Tüm Kategorileri Genişlet</guimenuitem>: Modülleri göstermek için ağacı genişletir.

source: <guimenuitem>Clear Search</guimenuitem>: This will clear any filter you have applied on the module listing via the search box
tr: <guimenuitem>Aramayı Temizle</guimenuitem>: Arama kutusuyla modül listelemesinde uygulamış olduğunuz süzgeçleri temizler

source: The main panel shows you the system information about the selected module.
tr: Ana panel, seçili modül hakkında size bazı sistem bilgilerini gösterir.

source: The &infocenter; Toolbar
tr: &infocenter; Araç Çubuğu

source: This next section gives you a brief description of what each toolbar item does.
tr: Bu sonraki bölüm, her bir araç çubuğu ögesinin ne yaptığı ile ilgili kısa bir açıklama sunar.

source: Module Help button
tr: Modül Yardımı düğmesi

source: This button opens &khelpcenter; with the current help page for the information module.
tr: Bu düğme, bilgi modülü için geçerli yardım sayfasına giderek &khelpcenter; yazılımını açar.

source: Help Menu button
tr: Yardım Menüsü butonu

source: &kinfocenter; has the common &kde; <guimenu>Help</guimenu> menu items, for more information read the section about the <ulink url="help:/fundamentals/menus.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
tr: &kinfocenter; yazılımında ortak &kde; <guimenu>Yardım</guimenu> menü ögeleri vardır; daha fazla bilgi için &kde; Temelleri’nde <ulink url="help:/fundamentals/menus.html#menus-help">Yardım Menüsü</ulink> ile ilgili bölüme bakın.

source: Exiting The Information Center
tr: Bilgi Merkezi’nden Çıkış

source: You can exit the info center one of two ways:
tr: Bilgi merkezinden şu iki yoldan biriyle çıkabilirsiniz:

source: Type <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> on the keyboard.
tr: Klavyede <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> düğmelerine basın.

source: Click on the <guiicon>Close</guiicon> button on the frame surrounding the info center.
tr: Bilgi merkezini çevreleyen çerçeve üzerindeki <guiicon>Kapat</guiicon> düğmesine basın.

source: The Default &infocenter; Modules
tr: Öntanımlı &infocenter; Modülleri

source: About System Module
tr: Sistem Modülü Hakkında

source: This page shows a brief summary about your system, &ie; your distribution, <guilabel>KDE Plasma Version:</guilabel>, <guilabel>KDE Frameworks Version:</guilabel>, <guilabel>Qt Version:</guilabel>, <guilabel>Kernel Version:</guilabel> and <guilabel>OS Type:</guilabel>; and in the hardware section information about <guilabel>Processors:</guilabel>, <guilabel>Memory:</guilabel> and <guilabel>Graphics Processor:</guilabel>.
tr: Bu sayfa, sisteminiz hakkında kısa bir özet sunar; örneğin, dağıtımınız, <guilabel>KDE Plasma Sürümü</guilabel>, <guilabel>KDE Frameworks Sürümü</guilabel>, <guilabel>Qt Sürümü</guilabel>, <guilabel>Çekirdek Sürümü</guilabel> ve <guilabel>İS Türü</guilabel> ve donanım bölümünde <guilabel>İşlemciler</guilabel> ve <guilabel>Bellek</guilabel> hakkında bilgi vardır.

source: Use the information on this page if you ask for help in support channels or report a bug at <ulink url="https://bugs.kde.org">&kde;'s bugtracker</ulink>.
tr: Destek kanallarında yardım isterken veya <ulink url="https://bugs.kde.org">&kde;’nin hata izleyicisinde</ulink> bir hata kaydı açarken buradaki bilgiyi kullanın.

source: Memory Information Module
tr: Bellek Bilgisi Modülü

source: This module displays the current memory usage. It is updated constantly, and can be very useful for pinpointing bottlenecks when certain applications are executed.
tr: Bu modül, geçerli bellek kullanımını görüntüler. Sürekli olarak güncellenir ve belirli uygulamalar yürütülürken darboğazları belirlemek için çok yararlı olabilir.

source: Memory Types
tr: Bellek Türleri

source: The first thing you must understand, is there are two types of <quote>memory</quote>, available to the operating system and the programs that run within it.
tr: Anlamanız gereken ilk şey, işletim sistemi ve içinde çalışan programlar için kullanılabilen iki tür <quote>bellek</quote> olduğudur.

source: The first type, is called physical memory. This is the memory located within the memory chips, within your computer. This is the <acronym>RAM</acronym> (for Random Access Memory) you bought when you purchased your computer.
tr: İlk tür, fiziksel bellek olarak adlandırılır. Bu, bilgisayarınızın içindeki bellek yongalarında bulunan bellektir. Bu, bilgisayarınızı satın aldığınızda satın aldığınız <acronym>RAM</acronym>’dir (Rastgele Erişilen Bellek — Random Access Memory).

source: The second type of memory, is called virtual or swap memory. This block of memory, is actually space on the hard drive. The operating system reserves a space on the hard drive for <quote>swap space</quote>. The operating system can use this virtual memory (or swap space), if it runs out of physical memory. The reason this is called <quote>swap</quote> memory, is the operating system takes some data that it doesn't think you will want for a while, and saves that to disk in this reserved space. The operating system then loads the new data you need right now. It has <quote>swapped</quote> the not needed data, for the data you need right now. Virtual or swap memory is not as fast as physical memory, so operating systems try to keep data (especially often used data), in the physical memory.
tr: İkinci tür bellek, sanal veya takas belleği olarak adlandırılır. Bu bellek bloku, aslında sabit sürücüdeki boşluktur. İşletim sistemi, <quote>takas alanı</quote> için sabit sürücüde bir alan ayırır. Fiziksel belleğin bitmesi durumunda işletim sistemi bu sanal belleği (veya takas alanını) kullanabilir. Buna <quote>takas</quote> bellek denmesinin nedeni, işletim sisteminin bir süreliğine isteyemeyeceğini düşündüğü bazı verileri alıp bu ayrılmış alana diske kaydetmesidir. İşletim sistemi daha sonra şu anda gereksiniminiz olan yeni verileri yükler. Şu anda gereksiniminiz olan veriler için gerekli olmayan verileri <quote>takas etmiştir</quote>. Sanal veya takas bellek fiziksel bellek kadar hızlı değildir, bu nedenle işletim sistemleri verileri (özellikle sık kullanılan verileri) fiziksel bellekte tutmaya çalışır.

source: The total memory, is the combined total of physical memory and virtual memory.
tr: Toplam bellek, fiziksel bellek ve sanal belleğin birleşik toplamıdır.

source: This window is divided into a top and bottom section
tr: Bu pencere bir üst ve alt bölüme ayrılmıştır

source: The top section shows you the total physical memory, total free physical memory, shared memory, and buffered memory.
tr: Üst bölüm size toplam fiziksel belleği, toplam boş fiziksel belleği, paylaşılan belleği ve arabelleğe alınan belleği gösterir.

source: All four values are represented as the total number of bytes, and as the number of megabytes (1 megabyte = slightly more than 1,000,000 bytes)
tr: Dört değerin tümü, toplam bayt sayısı ve megabayt sayısı olarak temsil edilir (1 megabayt = 1.000.000 bayttan biraz fazla)

source: The bottom section shows you three graphs:
tr: Alt bölüm size üç grafik gösterir:

source: <guilabel>Total Memory</guilabel> (this is the combination of physical and virtual memory).
tr: <guilabel>Toplam Bellek</guilabel> (bu, fiziksel ve sanal belleğin birleşimidir).

source: Physical Memory
tr: Fiziksel Bellek

source: Virtual memory, or <guilabel>Swap Space</guilabel>.
tr: Sanal bellek veya <guilabel>Takas Alanı</guilabel>.

source: The grey areas are free, and the blue and green areas are used.
tr: Gri alanlar boş olup mavi ve yeşil alanlar kullanılmaktadır.

source: The exact values of each type of memory are not critical, and they change regularly. When you evaluate this page, look at trends.
tr: Her bellek türünün kesin değerleri kritik değildir ve düzenli olarak değişirler. Bu sayfayı değerlendirirken eğilimlere bakın.

source: Does your computer have plenty of free space (grey areas)? If not, you can increase the swap size or increase the physical memory.
tr: Bilgisayarınızda bol miktarda boş alan (gri alanlar) var mı? Değilse takas boyutunu veya fiziksel belleği artırabilirsiniz.

source: Also, if your computer seems sluggish: is your physical memory full, and does the hard drive always seem to be running? This suggests that you do not have enough physical memory, and your computer is relying on the slower virtual memory for commonly used data. Increasing your physical memory will improve the responsiveness of your computer.
tr: Ayrıca, bilgisayarınız yavaş çalışıyorsa: Fiziksel belleğiniz dolu mu ve sabit sürücü her zaman çalışıyor gibi mi görünüyor? Bu, yeterli fiziksel belleğiniz olmadığını ve bilgisayarınızın yaygın olarak kullanılan veriler için daha yavaş olan sanal belleği kullandığını gösterir. Fiziksel belleğinizi artırmak, bilgisayarınızın yanıt verme hızını artıracaktır.

source: Energy Information Module
tr: Güç Bilgisi Modülü

source: This provides information about CPU wakeups, battery percentage and consumption over a user defined history and detailed information about the battery.
tr: Bu, CPU uyanmaları, pil yüzdesi ve kullanıcı tanımlı bir geçmiş üzerinden tüketim hakkında bilgi ve pil hakkında ayrıntılı bilgi sağlar.

source: Device Information Module
tr: Aygıt Bilgisi Modülü

source: Device Information is a device viewer module. It shows all relevant devices that are present within your <acronym>PC</acronym>. It has three sections, a device viewer, a information panel and a <acronym>UDI</acronym> listing for the currently selected device.
tr: Aygıt Bilgisi, bir aygıt görüntüleyicisi modülüdür. <acronym>Bilgisayarınız</acronym> içinde bulunan tüm ilgili aygıtları gösterir. Üç bölümü vardır: Bir aygıt görüntüleyicisi, bir bilgi paneli ve seçili aygıt için bir <acronym>UDI</acronym> listesi.

source: Device Viewer
tr: Aygıt Görüntüleyicisi

source: The device viewer displays all the current devices detected on your <acronym>PC</acronym> in a tree. The main topics at the beginning of the tree are the device categories, left click on a collapsed category to expand it and vice versa to collapse it. To display information about a device, left click on the device in the viewer, the information will display on the right side information panel. You can right click on the device viewer to show the following options:
tr: Aygıt görüntüleyicisi, <acronym>Bilgisayarınızda</acronym> algılanan geçerli tüm aygıtları bir ağaçta görüntüler. Ağacın başındaki ana konular aygıt kategorileridir, daraltılmış bir kategoriyi genişletmek için sol tıklayın ve daraltmak için tersini yapın. Bir aygıtla ilgili bilgiyi görüntülemek için görüntüleyicide aygıta sol tıklayın, bilgiler sağ taraftaki bilgi panelinde görüntülenecektir. Aşağıdaki seçenekleri göstermek için aygıt görüntüleyicisine sağ tıklayabilirsiniz:

source: <guimenuitem>Collapse All</guimenuitem>: Collapses the tree to show only the main categories.
tr: <guimenuitem>Tümünü Daralt</guimenuitem>: Yalnızca ana kategorileri göstermek için ağacı daraltır.

source: <guimenuitem>Expand All</guimenuitem>: Expands the tree to show all the children devices.
tr: <guimenuitem>Tümünü Genişlet</guimenuitem>: Tüm alt aygıtları göstermek için ağacı genişletir.

source: <guimenuitem>Show All Devices</guimenuitem>: Show all the categories no matter if devices are present in those categories
tr: <guimenuitem>Tüm Aygıtları Göster</guimenuitem>: Bu kategorilerde aygıt olup olmadığına bakmaksızın tüm kategorileri gösterir.

source: <guimenuitem>Show Relevant Devices</guimenuitem>: Only show categories that have devices present.
tr: <guimenuitem>İlgili Aygıtları Göster</guimenuitem>: Yalnızca aygıtların olduğu kategorileri gösterir.

source: The default display is to collapse all while showing only relevant devices. Please note that the devices shown in the device listing are not all devices within your PC, they are just devices that have been detected via the &solid;.
tr: Öntanımlı ekran, yalnızca ilgili aygıtları gösterirken tümünü daraltır. Lütfen aygıt listesinde gösterilen aygıtların bilgisayarınızdaki tüm aygıtlar olmadığını, yalnızca &solid; aracılığıyla algılanan aygıtlar olduğunu unutmayın.

source: The device viewer can show the following devices:
tr: Aygıt görüntüleyicisi, aşağıdaki aygıtları gösterebilir:

source: <guisubmenu>Processors:</guisubmenu> These are your computers <acronym>CPU</acronym>s ( Central Processing Units ).
tr: <guisubmenu>İşlemciler:</guisubmenu> Bunlar bilgisayarınızın <acronym>CPU</acronym>’larıdır (Merkezi İşlem Birimleri ).

source: <guisubmenu>Storage Drives:</guisubmenu> Devices that are used to store your <acronym>PC</acronym>s files and data.
tr: <guisubmenu>Depolama Sürücüleri:</guisubmenu> <acronym>Bilgisayarınızın</acronym> dosyalarını ve verisini depolamak için kullanılan aygıtlar.

source: <guisubmenu>Network Interfaces:</guisubmenu> Devices that allow you to connect to a network or to another <acronym>PC</acronym>.
tr: <guisubmenu>Ağ Arayüzleri:</guisubmenu> Sizi ağa veya başka bir <acronym>bilgisayara</acronym> bağlayan aygıtlar.

source: <guisubmenu>Audio Interfaces:</guisubmenu> Devices that allow your <acronym>PC</acronym> to play Sound. They are split into 2 categories, <acronym>ALSA</acronym> and <acronym>OSS</acronym> sound architectures.
tr: <guisubmenu>Ses Arayüzleri:</guisubmenu> <acronym>Bilgisayarınızın</acronym> ses çalmasını sağlayan aygıtlar. <acronym>ALSA</acronym> ve <acronym>OSS</acronym> ses mimarileri olarak iki kategoriye ayrılırlar.

source: <guisubmenu>Video Devices:</guisubmenu> Devices that allow you to stream live video.
tr: <guisubmenu>Video Aygıtları:</guisubmenu> Canlı video akışı yapmanızı sağlayan aygıtlar.

source: <guisubmenu>Serial Devices:</guisubmenu> Devices that are connected to your serial port in your PC.
tr: <guisubmenu>Seri Aygıtlar:</guisubmenu> Bilgisayarınızdaki seri kapıya bağlı aygıtlar.

source: <guisubmenu>Smart Card Devices:</guisubmenu> Devices that are smart card readers.
tr: <guisubmenu>Akıllı Kart Aygıtları:</guisubmenu> Akıllı kart okuyucuları.

source: <guisubmenu>Digital Video Broadcasting Devices:</guisubmenu> Devices that use the open standards for digital television.
tr: <guisubmenu>Sayısal Video Yayın Aygıtları:</guisubmenu> Sayısal televizyon için açık standartları kullanan aygıtlar.

source: <guisubmenu>Device Buttons:</guisubmenu> These are buttons that are present on your <acronym>PC</acronym> or external devices.
tr: <guisubmenu>Aygıt Düğmeleri:</guisubmenu> Bunlar, <acronym>bilgisayarınızda</acronym> veya dış aygıtlarınızda bulunan düğmelerdir.

source: <guisubmenu>Batteries:</guisubmenu> These are battery devices that are plugged into your laptop.
tr: <guisubmenu>Piller:</guisubmenu> Bunlar, dizüstü bilgisayarınıza takılan pillerdir.

source: <guisubmenu>AC Adapters:</guisubmenu> These devices will be present when you plug in your <acronym>AC</acronym> Adapter.
tr: <guisubmenu>AC Bağdaştırıcılar:</guisubmenu> Bu aygıtlar, <acronym>AC</acronym> bağdaştırıcınızı taktığınızda görünür.

source: <guisubmenu>Multimedia Players:</guisubmenu> Devices that play media files, like a music player.
tr: <guisubmenu>Çoklu Ortam Oynatıcıları:</guisubmenu> Müzik çalar gibi ortam dosyalarını çalan aygıtlar.

source: <guisubmenu>Camera Devices:</guisubmenu> These are digital camera that are connected to your <acronym>PC</acronym>.
tr: <guisubmenu>Kamera Aygıtları:</guisubmenu> Bunlar, <acronym>bilgisayarınıza</acronym> bağlı sayısal kameralardır.

source: Video devices do not include your video card adapter
tr: Video aygıtları, video kartı bağdaştırıcınızı içermez

source: Information Panel
tr: Bilgi Paneli

source: The information panel is where device information is shown when you select a device. The first two information topics are always:
tr: Bilgi paneli, bir aygıt seçtiğinizde aygıt bilgisinin gösterildiği yerdir. İlk iki bilgi konusu her zaman:

source: <guilabel>Product:</guilabel> The name of the device.
tr: <guilabel>Ürün:</guilabel> Aygıtın adı.

source: <guilabel>Vendor:</guilabel> The vendors name of the device.
tr: <guilabel>Satıcı:</guilabel> Aygıtın satıcısının adı.

source: The following information topics are dependent on the device chosen. They are labeled with easy to understand names. The information labels have the ability to be selected and copied from.
tr: Aşağıdaki bilgi konuları seçili aygıta bağlıdır. Kolay anlaşılır adlarla etiketlenirler. Bilgi etiketleri seçilebilir ve kopyalanabilir.

source: Processor <guilabel>Max Speed:</guilabel> and <guilabel>Supported Instruction sets:</guilabel> topics are usual not set by &solid;.
tr: İşlemcinin <guilabel>En Yüksek Hız:</guilabel> ve <guilabel>Desteklenen Yönerge Kümeleri:</guilabel> konuları genellikle &solid; tarafından belirlenmez.

source: Top categories in the device listing do not show any information.
tr: Aygıt listesindeki üst kategoriler herhangi bir bilgi göstermez.

source: <acronym>UDI</acronym> Information
tr: <acronym>UDI</acronym> Bilgisi

source: The bottom information panel shows the current selected devices <acronym>UDI</acronym>. This is the unique device identifier.
tr: Alt bilgi paneli, şu anda seçili aygıtların <acronym>UDI</acronym>’larını gösterir. Bu, benzersiz aygıt tanımlayıcısıdır.

source: All labels have the ability to be selected and copied from.
tr: Tüm etiketler seçilip kopyalanabilme özelliğine sahiptir.

source: Interrupt Request (<abbrev>IRQ</abbrev>) Information Module
tr: Yarıda Kesme İsteği (<abbrev>IRQ</abbrev>) Bilgisi Modülü

source: This page displays information about the Interrupt Request Lines in use, and the devices that use them.
tr: Bu sayfada, kullanımda olan Yarıda Kesme İsteği Hatları ve bunları kullanan aygıtlar hakkında bilgiler görüntülenir.
