Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kinfocenter.po
Languages: tr

source: When you open the modules in this section, you are presented with some information. The left hand side of the window is organized into a tree. Some of the elements have a plus sign in front of the label. Clicking this sign opens a <quote>submenu</quote> related to the label. Clicking on a minus sign in front of a label hides the submenu.
tr: Bu bölümdeki modülleri açtığınızda size bazı bilgiler sunulur. Pencerenin sol tarafı bir ağaç şeklinde düzenlenmiştir. Bazı ögelerin etiketin önünde artı işareti vardır. Bu işarete tıklamak, etiketle ilgili bir <quote>alt menü</quote> açar. Bir etiketin önündeki eksi işaretine tıklandığında alt menü gizlenir.

source: The right hand side of the window contains the individual values for each of the parameters on the left.
tr: Pencerenin sağ tarafı, soldaki parametrelerin her biri için bireysel değerleri içerir.

source: The information presented will vary depending on your setup.
tr: Sunulan bilgiler kurulumunuza bağlı olarak değişecektir.

source: Some setups may not be able to determine some or all of the parameters.
tr: Bazı kurulumlar parametrelerin bir kısmını veya tamamını belirleyemeyebilir.

source: You can not change any values from this module. It is for information only.
tr: Bu modülden herhangi bir değeri değiştiremezsiniz. Yalnızca bilgi amaçlıdır.

source: &Wayland; Information Module
tr: &Wayland; Bilgisi Modülü

source: This screen is useful for getting specific information about your <ulink url="https://en.wikipedia.org/wiki/Wayland_(display_server_protocol)">&Wayland; Compositor</ulink>.
tr: Bu ekran, <ulink url="https://en.wikipedia.org/wiki/Wayland_(display_server_protocol)">&Wayland; Bileşikleştiriciniz</ulink> hakkındaki belirli bilgileri almak için yararlıdır.

source: X Server Information Module
tr: X Sunucusu Bilgi Modülü

source: This screen is useful for getting specific information about your X Server and the current session of X.
tr: Bu ekran, X Sunucunuz ve X’in geçerli oturumu hakkında özel bilgiler almak için yararlıdır.

source: OpenGL Information Module
tr: OpenGL Bilgisi Modülü

source: This page displays information about installed <acronym>OpenGL</acronym> implementation. OpenGL (for "Open Graphics Library") is a cross-platform, hardware independent interface for 3D graphics.
tr: Bu sayfa, kurulu <acronym>OpenGL</acronym> uygulaması hakkında bilgi görüntüler. OpenGL ("Open Graphics Library" — Açık Grafikler Kitaplığı), 3B grafikler için donanımdan bağımsız bir çapraz platform arabirimidir.

source: <acronym>GLX</acronym> is the binding for OpenGL to X Window system.
tr: <acronym>GLX</acronym>, OpenGL için X Pencere Sistemi bağlarıdır.

source: <acronym>DRI</acronym> (Direct Rendering Infrastucture) provides hardware acceleration for OpenGL. You must have a videocard with 3D accelerator and properly installed driver for this.
tr: <acronym>DRI</acronym> (Doğrudan Sunum Altyapısı) OpenGL için donanım ivmelendirmesi sağlar. Bunun için 3B hızlandırıcılı bir video kartı ve düzgün kurulmuş bir sürücüye gereksiniminiz vardır.

source: Read more at the official OpenGL site <ulink url="https://www.opengl.org">OpenGL</ulink>
tr: Resmi <ulink url="https://www.opengl.org">OpenGL</ulink> sitesinde daha fazlasını okuyun

source: Credits and License
tr: Emeği Geçenler ve Lisanslar

source: Program copyright 1997-2001 The &infocenter; Developers
tr: Program telif hakkı 1997–2001 &infocenter; Geliştiricileri

source: Contributors:
tr: Katkıda Bulunanlar:

source: Documentation <trademark class="copyright">copyright 2000 &Mike.McBride;</trademark> &Mike.McBride.mail;
tr: Belgelendirme <trademark class="copyright">telif hakkı 2000 &Mike.McBride;</trademark> &Mike.McBride.mail;
