Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kioworker6_man.po
Languages: tr

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Serdar</firstname><surname>Soytetir</surname><affiliation><address><email>tulliana@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Using the man KIO worker you are able to read the man pages installed on your system. It is easy to use:
tr: man KIO işçisini kullanarak, sisteminizde kurulu olan man sayfalarını okuyabilirsiniz. Kullanımı kolaydır:

source: See the sections of the manual, click to find the rest.
tr: Kılavuzun bölümlerine bakın, gerisini bulmak için tıklayın.

source: See the man page of <command>fopen</command>.
tr: <command>fopen</command>’ın man sayfasına bakın.

source: See the man page of <command>fopen</command> in section 3.
tr: <command>fopen</command>’ın 3. bölümdeki man sayfasına bakın.

source: See the index of section 3.
tr: 3. bölümün indeksine bakın.

source: See the introduction of section 3.
tr: 3. bölümün girişine bakın.

source: If there are more than one man page of the name that you have entered, you will get a list where you can choose the man page that you want to see.
tr: Girdiğiniz adın birden fazla man sayfası varsa görmek istediğiniz man sayfasını seçebileceğiniz bir liste göreceksiniz.

source: There is also a shortcut: <userinput><command>#fopen</command></userinput>, which has the same effect as above.
tr: Yukarıdaki ile aynı işi yapan bir <userinput><command>#fopen</command></userinput> kısayolu da vardır.

source: If you do not find all your man pages, adjust the configuration file <filename>/etc/manpath.config</filename> (or a file of a similar name depending on your distribution) or adjust the environment variables <envar>MANPATH</envar> and <envar>MANSECT</envar>.
tr: Eğer hiçbir man sayfasını bulamıyorsanız <filename>/etc/manpath.config</filename> dosyasını (veya dağıtımınıza bağlı olarak benzer bir ad) <envar>MANPATH</envar> ve <envar>MANSECT</envar> çevre değişkenlerini ayarlayın.

source: As with any other KIO worker, it is possible to enter a &URL;, like <userinput><command>man:/socket</command></userinput> in <emphasis>any</emphasis> &kde; application. Try it in &kwrite; and you will see the man page in &HTML; format.
tr: Her bir diğer KIO işçisi gibi, <emphasis>herhangi bir</emphasis> &kde; uygulamasında <userinput><command>man:/socket</command></userinput> girebilirsiniz. &kwrite;’da deneyin, man sayfasını &HTML; biçiminde göreceksiniz.

source: Contact mailing list: <email>kde-devel@kde.org</email>
tr: İletişim posta listesi: <email>kde-devel@kde.org</email>
