Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kioworker6_audiocd.po
Languages: tr

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@îcloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Allows treating audio <acronym>CD</acronym>s like a <quote>real</quote> filesystem, where tracks are represented as files and, when copied from the folder, are digitally extracted from the <acronym>CD</acronym>. This ensures a perfect copy of the audio data.
tr: Ses <acronym>CD</acronym>’lerinin, parçaların dosya olarak temsil edildiği ve klasörden kopyalandığında sayısal olarak <acronym>CD</acronym>’den çıkarıldığı <quote>gerçek</quote> dosya sistemi gibi işlenmesine olanak tanır. Bu, ses verisinin mükemmel bir kopyasını sağlar.

source: To see how this KIO worker works, insert an audio <acronym>CD</acronym> in your &CD-ROM; drive and type <userinput>audiocd:/</userinput> into &konqueror;. Within a few seconds you should see a list of tracks and some folders.
tr: Bu KIO işçisinin nasıl çalıştığını görmek için &CD-ROM; sürücünüze bir ses <acronym>CD’si</acronym> yerleştirin ve &konqueror;’a <userinput>audiocd:/</userinput> yazın. Birkaç saniye içinde parçaların ve bazı klasörlerin bir listesini görmelisiniz.

source: Audio <acronym>CD</acronym>s don't really have folders, but the audiocd KIO worker provides them as a convenience. If you look inside these folders you will see that they all contain the same number of tracks. If you are connected to the Internet, some folders will have the actual track titles shown as the filenames.
tr: Ses <acronym>CD</acronym>’lerinin gerçekte klasörleri yoktur; ancak audiocd KIO işçisi bunları kolaylık sağlamak için sağlar. Bu klasörlerin içine bakarsanız hepsinin aynı sayıda parça içerdiğini göreceksiniz. İnternete bağlıysanız bazı klasörlerde gerçek parça adları dosya adları olarak gösterilir.

source: The reason that these separate folders exist are so that you can choose in which format you would like to listen to (or copy) the tracks on the <acronym>CD</acronym>.
tr: Bu ayrı klasörlerin var olmasının nedeni, <acronym>CD</acronym> üzerindeki parçaları hangi biçimde dinlemek (veya kopyalamak) istediğinizi seçebilmenizdir.

source: If you drag a track from the <filename class="directory">Ogg Vorbis</filename> folder and drop it on another &konqueror; window open at your home folder, you should see a progress window showing you that the track is being extracted from the <acronym>CD</acronym> and saved to a file. Note that Ogg Vorbis is a compressed format, so the file in your home folder will appear a great deal smaller than it would have been if you had copied the raw data.
tr: <filename class="directory">Ogg Vorbis</filename> klasöründen bir parçayı sürükleyip ana klasörünüzde açık olan başka bir &konqueror; penceresine bırakırsanız parçanın <acronym>CD</acronym>’den çıkarıldığını ve bir dosyaya kaydedildiğini gösteren bir ilerleme penceresi görürsünüz. Ogg Vorbis’in sıkıştırılmış bir biçim olduğunu unutmayın, bu nedenle ana klasörünüzdeki dosya, ham veriyi kopyalamış olsaydınız olacağından çok daha küçük görünecektir.

source: The mechanism behind this is quite simple. When the audiocd KIO worker is asked to retrieve a track from the <filename class="directory">Ogg Vorbis</filename> folder, it starts extracting the digital audio data from the <acronym>CD</acronym>. As it sends the data over to the file in your home folder, it simultaneously encodes it in Ogg Vorbis format (<acronym>CD</acronym> audio is in an uncompressed format to start with).
tr: Bunun arkasındaki mekanizma oldukça basittir. audiocd KIO işçisinden <filename class="directory">Ogg Vorbis</filename> klasöründen bir parça alması istendiğinde, sayısal ses verisini <acronym>CD</acronym>’den çıkarmaya başlar. Veriyi ana klasörünüzdeki dosyaya gönderirken aynı anda onu Ogg Vorbis biçiminde kodlar (<acronym>CD</acronym> sesi, normalde sıkıştırılmamış bir biçimdedir).

source: You could also try dragging a file ending in <literal role="extension">.wav</literal> and dropping it on the &kde; Media Player, &juk;. In this case, the procedure that happens behind the scenes is similar, except that instead of encoding the audio data in Ogg Vorbis format, it is put through a very simple conversion, from raw binary data (which the <literal role="extension">.cda</literal> files in the toplevel folder represent) to <quote>RIFF WAV</quote> format, a non-compressed format that most media players understand.
tr: Ayrıca <literal role="extension">.wav</literal> ile biten bir dosyayı sürükleyip &kde;’nin &juk; ortam oynatıcısına bırakmayı da deneyebilirsiniz, Bu durumda, sahne arkasında gerçekleşen prosedür benzerdir; ancak ses verisinin Ogg Vorbis biçiminde kodlanması yerine, ham ikili veriden (üst düzey klasördeki <literal role="extension">.cda</literal> dosyalarından), çoğu ortam oynatıcısının anladığı sıkıştırılmamış bir biçim olan <quote>RIFF WAV</quote> biçimine çok basit bir dönüşüme tabi tutulur.

source: &juk; should quite happily play the <literal role="extension">.wav</literal> file, but if it has trouble, you may consider using the <option>paranoia_level</option> option, explained below.
tr: &juk;, <literal role="extension">.wav</literal> dosyalarını sıkıntısızca çalmalıdır; ancak bir sorun yaşarsanız aşağıda açıklanan <option>paranoia_level</option> seçeneğini kullanmayı düşünebilirsiniz.

source: Options
tr: Seçenekler

source: device
tr: aygıt

source: Set the path to the audio <acronym>CD</acronym> device, &eg; <userinput>audiocd:/<option>?device</option>=<parameter>/dev/sdc</parameter></userinput>. Normally, the KIO worker will try to find a <acronym>CD</acronym> drive with an audio <acronym>CD</acronym> inserted, but if it fails or you have more than one <acronym>CD</acronym> drive, you may want to try this option. Note that the configuration dialog allows you to set a default value for this option.
tr: Sese olan yolu <acronym>CD</acronym> aygıtınıza ayarlayın; örneğin, <userinput>audiocd:/<option>?device</option>=<parameter>/dev/sdc</parameter></userinput>. Normalde KIO işçisi, içinde bir ses <acronym>CD</acronym>’si olan takılı bir <acronym>CD</acronym> bulmaya çalışır; ancak başarısız olursa veya birden çok <acronym>CD</acronym> sürücünüz varsa bu seçeneği denemek isteyebilirsiniz. Yapılandırma iletişim kutusunun bunun için öntanımlı bir değer ayarlamanıza izin verdiğini unutmayın.

source: Set the file name template, &eg; <userinput>audiocd:/<option>?fileNameTemplate</option>=<parameter>Track %{number}</parameter></userinput>. Note that the configuration dialog allows you to set a default value for this option. A warning that if you set it to an empty string no files will show up.
tr: Dosya adı şablonunu ayarlayın; &eg;, <userinput>audiocd:/<option>?fileNameTemplate</option>=<parameter>Parça %{number}</parameter></userinput>. Yapılandırma iletişim kutusunun bu seçenek için öntanımlı bir değer ayarlamanıza izin verdiğini unutmayın. Boş bir dizi olarak ayarlarsanız hiçbir dosyanın görünmeyeceğine dair bir uyarı gösterilir.

source: Set the album name template, &eg; <userinput>audiocd:/<option>?albumNameTemplate</option>=<parameter>%{albumartist} %{albumtitle}</parameter></userinput>. Note that the configuration dialog allows you to set a default value for this option.
tr: Albüm adı şablonunu ayarlayın; &eg;, <userinput>audiocd:/<option>?albumNameTemplate</option>=<parameter>%{albumartist} %{albumtitle}</parameter></userinput>. Yapılandırma iletişim kutusunun bu seçenek için öntanımlı bir değer ayarlamanıza izin verdiğini unutmayın.

source: Sets the process nice level for encoders, &eg; <userinput>audiocd:/<option>?albumNameTemplate</option>=<parameter>niceLevel=10</parameter></userinput>. Note that the configuration dialog allows you to set a default value for this option.
tr: Kodlayıcılar için süreç öncelik değerini ayarlar; &eg;, <userinput>audiocd:/<option>?albumNameTemplate</option>=<parameter>niceLevel=10</parameter></userinput>. Yapılandırma iletişim kutusunun bu seçenek için öntanımlı bir değer ayarlamanıza izin verdiğini unutmayın.

source: Set the amount of error detection and correction used when extracting data.
tr: Veri çıkarırken kullanılan hata algılama ve düzeltme miktarını ayarlayın.

source: Level 0
tr: Düzey 0

source: No detection or correction. Only useful if you have a perfect <acronym>CD</acronym> drive (unlikely).
tr: Algılama veya düzeltme yok. Yalnızca mükemmel bir <acronym>CD</acronym> sürücünüz varsa kullanışlıdır (pek olası değil).

source: Level 1
tr: Düzey 1

source: Enable basic error checking and correction.
tr: Temel hata denetimini ve düzeltmesini etkinleştirin.

source: Level 2
tr: Düzey 2

source: Default. Specifies that only a perfect extraction will be accepted.
tr: Öntanımlı. Yalnızca mükemmel bir çıkarmanın kabul edileceğini belirtir.

source: Note that there is a disadvantage to level 2. Extraction can be very slow, so real-time digital playback may not work properly. If you have a good quality <acronym>CD</acronym> drive (note that more expensive does not necessarily mean better quality) then you probably won't experience very slow extraction, but a poor drive may take days (!) to extract the audio from one <acronym>CD</acronym>.
tr: 2. düzeyin bir dezavantajı olduğunu unutmayın. Çıkarma çok yavaş olabilir, dolayısıyla gerçek zamanlı sayısal çalma düzgün çalışmayabilir. Kaliteli bir <acronym>CD</acronym> sürücünüz varsa (daha pahalının mutlaka daha iyi kalite anlamına gelmediğini unutmayın), o zaman büyük olasılıkla çok yavaş çıkarma deneyimi yaşamazsınız; ancak kötü bir sürücünün bir <acronym>CD</acronym>’deki sesi çıkarması günler(!) alabilir.

source: Specify which Internet <acronym>CD</acronym> Database entry to use. Audio <acronym>CD</acronym>s don't have track names, but the Internet <acronym>CD</acronym> Database is a clever system which uses a special unique identifier generated from the number and length of tracks on each <acronym>CD</acronym> to cross-reference a track listing. Track listings are contributed by the Internet community and made available to all. Occasionally there will be multiple entries. You can specify which one to use.
tr: Hangi İnternet <acronym>CD</acronym> Veritabanı girdisinin kullanılacağını belirtin. Ses <acronym>CD</acronym>’lerinin parça adları yoktur; ancak İnternet <acronym>CD</acronym> Veritabanı, bir parça listesine çapraz başvuru vermek için her <acronym>CD</acronym>’deki parçaların sayısı ve uzunluğundan oluşturulan özel bir benzersiz tanımlayıcı kullanan akıllı bir sistemdir. Parça listeleri, internetteki herkes tarafından katkıda bulunulur ve kullanımına sunulur. Bazen birden fazla girdi olacaktır. Hangisini kullanacağınızı belirtebilirsiniz.

source: You can submit your own track listings using &kscd;, the &kde; <acronym>CD</acronym> player.
tr: &kscd;, &kde; <acronym>CD</acronym> çalarını kullanarak kendi parça listelerinizi gönderebilirsiniz.

source: By default audiocd tries to pick the best one.
tr: Öntanımlı olarak audiocd, en iyisini seçmeye çalışır.

source: Examples
tr: Örnekler

source: Gives a listing of the tracks on the audio <acronym>CD</acronym> inserted in <filename class="devicefile">/dev/scd0</filename>, which on &Linux; specifies the first <acronym>SCSI</acronym> &CD-ROM; device. If you copy tracks from the <acronym>CD</acronym>, digital extraction will be performed without error correction or detection. The <acronym>CDDB</acronym> Database entry 0 will be used.
tr: &Linux; üzerindeki ilk <acronym>SCSI</acronym> &CD-ROM; aygıtını belirten <filename class="devicefile">/dev/scd0</filename> içindeki ses <acronym>CD</acronym>’sindeki parçaların listesini verir. Parçaları <acronym>CD</acronym>’den kopyalarsanız sayısal çıkarma hata düzeltme veya algılama kullanmadan gerçekleştirilir. <acronym>CDDB</acronym> veritabanındaki 0. girdi kullanılacaktır.

source: Frequently Asked Question
tr: Sıkça Sorulan Sorular

source: I get <errorname>The file or folder / does not exist</errorname>. How do I fix that? I have an audio <acronym>CD</acronym> in my drive!
tr: <errorname>Dosya/Klasör yok</errorname> hatasını alıyorum. Bunu nasıl düzeltebilirim? Sürücümde bir ses <acronym>CD</acronym>’si var!

source: Try running <userinput><command>cdparanoia</command> <option>-vsQ</option></userinput> as yourself (not <systemitem class="username">root</systemitem>). Do you see a track list? If not, make sure you have permission to access the <acronym>CD</acronym> device. If you're using <acronym>SCSI</acronym> emulation (possible if you have an <acronym>IDE</acronym> <acronym>CD</acronym> writer) then make sure you check that you have read and write permissions on the generic <acronym>SCSI</acronym> device, which is probably <filename class="devicefile">/dev/sg0</filename>, <filename class="devicefile">/dev/sg1</filename>, &etc; If it still doesn't work, try typing <userinput>audiocd:/?device=/dev/sg0</userinput> (or similar) to tell kio_audiocd which device your &CD-ROM; is.
tr: <userinput><command>cdparanoia</command> <option>-vsQ</option></userinput> komutunu kendi kullanıcınızdan çalıştırmayı deneyin (<systemitem class="username">root</systemitem> olarak değil). Bir parça listesi görüyor musunuz? Görmüyorsanız <acronym>CD</acronym> aygıtına erişiminiz olduğundan emin olun. <acronym>SCSI</acronym> öykünmesi kullanıyorsanız (bir <acronym>IDE</acronym> <acronym>CD</acronym> yazıcınız varsa olasıdır) genel <acronym>SCSI</acronym> aygıtında okuma/yazma izinleriniz olduğundan emin olun, büyük olasılıkla <filename class="devicefile">/dev/sg0</filename>, <filename class="devicefile">/dev/sg1</filename>, vb. olabilir. Hâlâ çalışmıyorsa kio_audiocd’ye hangi aygıtınızın &CD-ROM; olduğunu söylemek için <userinput>audiocd:/?device=/dev/sg0</userinput> (veya benzerini) kullanın.
