Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kioworker6_fish.po
Languages: tr

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Volkan</firstname><surname>Gezer</surname><affiliation><address><email>volkangezer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Allows you to access another computer's files using the <emphasis>S</emphasis>ecure <emphasis>SH</emphasis>ell (<acronym>SSH</acronym>) protocol. The remote computer needs to be running the <acronym>SSH</acronym> daemon, but the remainder of the protocol uses standard commandline tools as discussed below.
tr: Başka bir bilgisayarın dosyalarına <emphasis>S</emphasis>ecure <emphasis>SH</emphasis>ell (<acronym>SSH</acronym> — Güvenli Kabuk) protokolü ile erişmenizi sağlar. Uzak bilgisayar <acronym>SSH</acronym> ardalan sürecini çalıştırmalıdır; ancak protokolün geri kalan kısmı aşağıda anlatılan standart komut satırı araçlarını kullanır.

source: You can use the fish KIO worker like this: <userinput>fish://<replaceable>hostname</replaceable></userinput> or <userinput>fish://<replaceable>username</replaceable>@<replaceable>hostname</replaceable></userinput>.
tr: fish KIO işçisini şöyle kullanabilirsiniz: <userinput>fish://<replaceable>makineadı</replaceable></userinput> veya <userinput>fish://<replaceable>kullanıcıadı</replaceable>@<replaceable>makineadı</replaceable></userinput>.

source: You need to use double forward slashes.
tr: İki bölü işareti kullanmanız gerekir.

source: You can omit the <replaceable>username</replaceable> (and the trailing @ symbol) if you have the same username on both computers.
tr: Her iki bilgisayarda da aynı kullanıcı adına sahipseniz <replaceable>kullanıcıadı</replaceable> (ve sonundaki @ sembolünü) atlayabilirsiniz.

source: You can add a password in the format: <userinput>fish://<replaceable>username</replaceable>:<replaceable>password</replaceable>@<replaceable>hostname</replaceable></userinput> but it is not necessary as you will be prompted for one if it is not supplied.
tr: Şu biçimde bir parola ekleyebilirsiniz: <userinput>fish://<replaceable>kullanıcıadı</replaceable>:<replaceable>parola</replaceable>@<replaceable>makineadı</replaceable></userinput>; ancak belirtilmediğinde bir parola için sorulacağınızdan, bu gerekli değildir.

source: If you are running the <acronym>SSH</acronym> daemon on a non-standard port, you can specify that port using the normal &URL; syntax as shown below: <userinput>fish://<replaceable>hostname</replaceable>:<replaceable>portnumber</replaceable></userinput>.
tr: <acronym>SSH</acronym> ardalan sürecini standart olmayan bir kapıda çalıştırıyorsanız bu kapıyı normal &URL; sözdizimiyle aşağıda gösterildiği gibi belirtebilirsiniz: <userinput>fish://<replaceable>makineadı</replaceable>:<replaceable>kapınumarası</replaceable></userinput>.

source: Fish should work with any roughly <acronym>POSIX</acronym> compatible &UNIX; based remote computer. It uses the shell commands <command>cat</command>, <command>chgrp</command>, <command>chmod</command>, <command>chown</command>, <command>cp</command>, <command>dd</command>, <command>env</command>, <command>expr</command>, <command>grep</command>, <command>ls</command>, <command>mkdir</command>, <command>mv</command>, <command>rm</command>, <command>rmdir</command>, <command>sed</command>, and <command>wc</command>. Fish starts <command>/bin/sh</command> as its shell and expects it to be a Bourne shell (or compatible, like <command>bash</command>). If the <command>sed</command> and <command>file</command> commands are available, as well as a <filename>/etc/apache/magic</filename> file with &MIME; type signatures, these will be used to guess &MIME; types.
tr: Fish, herhangi bir <acronym>POSIX</acronym> uyumlu &UNIX; tabanlı uzak bilgisayarda çalışmalıdır. Bu; <command>cat</command>, <command>chgrp</command>, <command>chmod</command>, <command>chown</command>, <command>cp</command>, <command>dd</command>, <command>env</command>, <command>expr</command>, <command>grep</command>, <command>ls</command>, <command>mkdir</command>, <command>mv</command>, <command>rm</command>, <command>rmdir</command>, <command>sed</command> ve <command>wc</command> kabuk komutlarını kullanır. Fish, kabuğu olarak <command>/bin/sh</command> başlatır ve bir Bourne kabuk (veya <command>bash</command> benzeri uyumlu bir kabuk) olmayı bekler. Eğer <command>sed</command> ve <command>file</command> komutları ve bununla birlikte &MIME; türü imzalarla <filename>/etc/apache/magic</filename> dosyası kullanılabilirse bunlar &MIME; türlerini tahmin etmekte kullanılacaktır.

source: If <application>Perl</application> is available on the remote machine, it will be used instead. Then only <command>env</command> and <command>/bin/sh</command> are needed. Using <application>Perl</application> has the additional benefit of being faster.
tr: Eğer uzak makinede <application>Perl</application> kullanılabilirse yerine bu kullanılacaktır. Ardından sadece <command>env</command> ve <command>/bin/sh</command> gerekli olacaktır. <application>Perl</application> kullanmanın ek faydası daha hızlı olmasıdır.

source: Fish may even work on &Windows; machines, if tools like <application>Cygwin</application> are installed. All the above utilities must be in the system <envar>PATH</envar>, and the initial shell must be able to process the command <command>echo FISH:;/bin/sh</command> correctly.
tr: Fish <application>Cygwin</application> benzeri araçlar kuruluysa &Windows; makinelerinde de çalışır. Yukarıdaki izlencelerin tümü sistem <envar>PATH</envar> değişkeninde olmalı ve tüm başlangıç kabuğu <command>echo FISH:;/bin/sh</command> komutunu doğru bir biçimde işleyebilmelidir.
