Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kioworker6_help_documentationnotfound.po
Languages: tr

source: Documentation not Found
tr: Belgelendirme Bulunamadı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: The requested documentation was not found on your computer.
tr: İstenen belgelendirme bilgisayarınızda bulunamadı.

source: The documentation may not exist, or it may not have been installed with the application.
tr: Belgelendirme var olmayabilir veya uygulamayla birlikte kurulmamış olabilir.

source: Please do not email the author of this page to find the missing document. He will just tell you to follow the instructions on this page.
tr: Lütfen eksik belgeyi bulmak için bu sayfanın yazarına e-posta göndermeyin. Size yalnızca bu sayfadaki talimatları izlemenizi söyleyecektir.

source: How to solve this issue
tr: Bu sorunun çözümü

source: If the application is &kde; software, first use the search function in &khelpcenter;. In some cases, the documentation has a different name than the software was using to try to find it. If that doesn't work, try searching the <ulink url="https://docs.kde.org/">&kde; Documentation site</ulink> for the requested documentation. If you find the documentation on that site, your distribution might ship a separate package for documentation (&eg; called plasma-doc for documentation related to &plasma;). Please use the package manager of your distribution to find and install the missing documentation.
tr: Uygulama bir &kde; yazılımıysa önce &khelpcenter; yazılımındaki arama işlevini kullanın. Bazı durumlarda belgeler, yazılımın onu bulmaya çalışmak için kullandığından farklı bir ada sahiptir. Bu işe yaramazsa istenen belgeleri bulmak için <ulink url="https://docs.kde.org/">&kde; Belgelendirmesi</ulink> sitesine bakın. Belgeleri bu sitede bulursanız dağıtımınız belgeler için ayrı bir paket çıkarabilir (örneğin, &plasma; ile ilgili belgeler plasma-doc olarak adlandırılır). Eksik belgelendirmeyi bulmak ve kurmak için lütfen dağıtımınızın paket yöneticisini kullanın.

source: If you use a source based distribution, such as Gentoo, be sure that there are not any configuration settings (USE flags in Gentoo) that might have disabled the installation of the documentation.
tr: Gentoo gibi kaynak tabanlı bir dağıtım kullanıyorsanız belgelerin kurulumunu devre dışı bırakabilecek herhangi bir yapılandırma ayarı (Gentoo’daki USE bayraklarını kullanın) olmadığından emin olun.

source: If you have done that, but still get this page displayed instead of the application handbook, you probably found a bug in the help system. In this case, please report this on the <ulink url="https://bugs.kde.org/">&kde;'s bugtracker</ulink> under the KIO product.
tr: Bunu da yaptısanız; ancak yine de uygulama El Kitabı yerine bu sayfayı görüyorsanız yardım sisteminde bir hata bulmuş olmanız olasıdır. Bu durumda, bunu <ulink url="https://bugs.kde.org/">&kde;’nin hata izleyicisinde </ulink> KIO bileşeni altında bildirin.

source: If you do not find any documentation on the <ulink url="https://docs.kde.org/">&kde; Documentation site</ulink>, the application may not have offline documentation. Please report this on the <ulink url="https://bugs.kde.org/">&kde;'s bugtracker</ulink> under the product for the application.
tr: <ulink url="https://docs.kde.org/">&kde; Belgelendirmesi</ulink> sitesinde hiçbir belge bulamadıysanız uygulamanın kendisinin çevrimdışı kullanılabilecek bir belgelendirmesi olmayabilir. Bunu, <ulink url="https://bugs.kde.org/">&kde;’nin hata izleyicisinde</ulink> ilgili uygulama bileşeni altında bildirin.

source: In case the application does not have offline documentation, you should use the online resources <ulink url="https://userbase.kde.org/">UserBase Documentation</ulink> and <ulink url="https://forum.kde.org/">&kde; Community Forums</ulink> to get help.
tr: Uygulamanın çevrimdışı kullanılabilecek bir belgelendirmesi yoksa yardım almak için çevrimiçi <ulink url="https://userbase.kde.org/">Kullanıcı Tabanı Belgelendirmesi</ulink> veya <ulink url="https://forum.kde.org/">&kde; Topluluk Forumları</ulink>’na bakın.

source: For non-&kde; applications, please contact the application author to determine whether there should be offline documentation available.
tr: &kde; dışı uygulamalar için lütfen uygulama yazarıyla iletişime geçerek çevrimdışı belgelendirme var mı yok mu diye sorun.
