Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kioworker6_webdav.po
Languages: tr

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Serdar</firstname><surname>Soytetir</surname><affiliation><address><email>tulliana@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: <acronym>WebDAV</acronym> is a <emphasis>D</emphasis>istributed <emphasis>A</emphasis>uthoring and <emphasis>V</emphasis>ersioning protocol for the World Wide Web. It allows for easy management of documents and scripts on a &HTTP; server, and has additional features designed to simplify version management amongst multiple authors.
tr: <acronym>WebDAV</acronym>, World Wide Web (WWW) için bir <emphasis>D</emphasis>istributed <emphasis>A</emphasis>uthoring and <emphasis>V</emphasis>ersioning (Dağıtılmış Yazma ve Sürümleme) protokolü anlamına gelir. Bir &HTTP; sunucusundaki belgelerin ve betiklerin kolay yönetimine izin verir ve sürüm yönetimini birden çok yazar arasında kolaylaştırmak için ek özelliklere iyedir.

source: Usage of this protocol is simple. Type the location you want to view, similar to a &HTTP; &URL; except for the webdav:// protocol name at the start. An example is <userinput>webdav://<replaceable>www.hostname.com/path/</replaceable></userinput>. If you specify a folder name, a list of files and folders will be displayed, and you can manipulate these folders and files just as you would with any other filesystem.
tr: Bu protokolün kullanımı pek basittir. Görüntülemek istediğiniz konumu bir &HTTP; &URL;’sine benzer biçimde, yalnızca başında webdav:// protokolü adı ile girin. Örnek olarak, <userinput>webdav://<replaceable>www.alanadı.com/yol/</replaceable></userinput> kullanılabilir. Bir klasör adı belirtirseniz bir dosyalar ve klasörler listesi görüntülenir ve herhangi başka bir dosya sisteminde olduğu gibi bunları manipüle edebilirsiniz.

source: WebDAV Features
tr: WebDAV Özellikleri

source: Locking
tr: Kilitleme

source: File locking allows users to lock a file, informing others that they are currently working on this file. This way, editing can be done without fear that the changes may be overwritten by another person who is also editing the same document.
tr: Dosya kilitleme, kullanıcıların dosyaları kilitleyerek, diğer kullanıcılara bu dosya üzerinde çalıştığı bilgisini vermelerini sağlar. Bu şekilde, dosya düzenleme sırasında bir başka kullanıcının aynı dosyayı düzenlemesi engelenerek yapılan işin boşa gitmesi olasılığı ortadan kaldırılmış olur.

source: Source file access
tr: Kaynak dosya erişimi

source: <acronym>WebDAV</acronym> allows access to the script which is called to produce a specific page, so changes can be made to the script itself.
tr: <acronym>WebDAV</acronym>, belirli bir sayfayı üretmek için betiklerin çağrılmasına ve betiklerin kendilerinin de düzenlenmesine izin verir.

source: Per-document property support
tr: Belge başına özellik desteği

source: Arbitrary properties may be set to assist identification of a document, such as the author.
tr: Örneğin, belgenin yazarı gibi özellikler isteğe bağlı biçimde kimlik tanımlamaya yardımcı olmak için ayarlanabilirler.

source: To take advantage of these additional capabilities, you will need an application which supports them. No application currently supports them through this KIO worker.
tr: Bu ek yeteneklerden yararlanmak için bunları destekleyen bir uygulamaya gereksiniminiz vardır. Şu anda hiçbir uygulama onları bu KIO işçisi aracılığıyla desteklemez.

source: <acronym>WebDAVS</acronym> is the <acronym>WebDAV</acronym> protocol encrypted via SSL.
tr: <acronym>WebDAVS</acronym>, <acronym>WebDAV</acronym> protokolünün SSL ile şifrelenmiş halidir.
