Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/klipper.po
Languages: tr

source: The &klipper; Handbook
tr: &klipper; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: &klipper; is the &plasma; clipboard cut &amp; paste utility.
tr: &klipper;, &plasma; panosu için kes ve yapıştır izlencesidir.

source: clipboard
tr: pano

source: Introduction
tr: Giriş

source: &klipper; is the &plasma; clipboard utility. It stores clipboard history, and allows you to link clipboard contents to application actions. Please report any problems or feature requests to <ulink url="http://bugs.kde.org">KDEs bugzilla</ulink>.
tr: &klipper;, &plasma; pano izlencesidir. Pano geçmişini depolar ve pano içeriğini uygulama eylemlerine bağlamanıza izin verir. Herhangi bir sorunu veya özellik isteğini lütfen <ulink url="http://bugs.kde.org">KDE hata izleyicisine</ulink> bildirin.

source: Using &klipper;
tr: &klipper; Kullanımı

source: Basic Usage
tr: Temel Kullanım

source: You can use &klipper; in the systemtray either as &plasma; widget or classic application. Both share the same functionality but have a different &GUI; and show the last item of the history when hovering the &klipper; icon in the systemtray:
tr: &klipper;’ı sistem tepsisinde bir &plasma; araç takımı veya klasik bir uygulama olarak kullanabilirsiniz. İkisi de aynı işlevselliği paylaşır; ancak kullanıcı arayüzleri farklıdır ve sistem tepsisindeki &klipper; simgesinin üzerine fare ile geldiğinizde panodaki son ögeyi gösterirler.

source: The &klipper; icon.
tr: &klipper; simgesi.

source: The &klipper; icon
tr: &klipper; simgesi

source: The &klipper; widget is hidden if the clipboard is empty.
tr: Pano boşsa &klipper; araç takımı gizlidir.

source: To display the clipboard history, click on the &klipper; icon in the systemtray.
tr: Pano geçmişini görüntülemek için sistem tepsisindeki &klipper; simgesine tıklayın.

source: &klipper; Widget
tr: &klipper; Araç Takımı

source: The &klipper; Widget.
tr: &klipper; Araç Takımı.

source: The &klipper; Widget
tr: &klipper; Araç Takımı

source: Hover an entry with the mouse pointer and four icons appear which enable you to invoke an action, show the barcode, edit the content or remove the entry from the history. Use &spectacle; to capture the barcodes and save them.
tr: Fare işaretçisi ile bir girişin üzerine gelin ve bir eylemi başlatmanıza, kare kod göstermenize, içeriği düzenlemenize veya girdiyi geçmişten kaldırmanıza olanak tanıyan dört simge görünür. Kare kodları yakalamak ve kaydetmek için &spectacle; kullanın.

source: You can search through the clipboard history by opening it (click on &klipper;) and typing your query. The results are updated as you type. To clear the clipboard history click on the icon at the right of the search field.
tr: Pano geçmişini açıp (&klipper;’a tıklayın) ve sorgunuzu yazarak arama yapabilirsiniz. Siz yazdıkça sonuçlar güncellenir. Pano geçmişini temizlemek için arama alanının sağındaki simgeye tıklayın.

source: The <guilabel>Configure Clipboard...</guilabel> action in the context menu opens the <link linkend="preferences">settings dialog</link>.
tr: Bağlam menüsündeki <guilabel>Panoyu Yapılandır…</guilabel> eylemi, <link linkend="preferences">ayarlar iletişim kutusunu</link> açar.

source: Actions
tr: Eylemler

source: &klipper; can perform actions on the contents of the clipboard, based on whether they match a particular regular expression. For example, any clipboard contents starting with <quote>http://</quote> can be passed to Firefox or &konqueror; as &URL;s to open. In addition, if the contents matches a path, similar actions can be performed according to the file's type. &eg;, if the path to a <acronym>PDF</acronym> file is copied to the clipboard, the file can be viewed in &okular;.
tr: &klipper;, pano içeriği üzerinde belirli düzenli ifadeyle eşleşip eşleşmediğine göre çeşitli eylemler gerçekleştirebilir. Örneğin, <quote>http://</quote> ile başlayan herhangi bir pano içeriği Firefox’a veya &konqueror;’a açılacak &URL;’ler olarak aktarılabilir. Ek olarak, içerik bir yolla eşleşiyorsa dosyanın türüne bağlı olarak benzer eylemler gerçekeştirilebilir; &eg;, eğer bir <acronym>PDF</acronym> dosyasına giden bir yol panoya kopyalanırsa dosya &okular;’da görüntülenebilir.

source: To use this feature, just select a &URL; or path. If there is a matching regular expression in &klipper;'s list, a menu will appear showing you the programs for your selection. Use the mouse or cursor keys to select a program, and &klipper; will run this program, opening the address pointed to by the selection.
tr: Bu özelliği kullanmak için bir &URL; veya yol seçin. &klipper;’ın listesinde eşleşen bir düzenli ifade varsa seçiminiz için programları gösteren bir menü görüntülenir. Bir program seçmek için fare veya imleç düğmelerini kullanın ve &klipper; seçimin işaret ettiği adresi açarak bu programı çalıştırır.

source: You can change the time that the menu remains for in the settings dialog, with the option <guilabel>Show action popup menu</guilabel> under the <guilabel>General</guilabel> page. You can separately disable the file path part using the option <guilabel>Include MIME actions</guilabel> under the <guilabel>Action Menu</guilabel> page.
tr: Ayarlar iletişim kutusunda <guilabel>Genel</guilabel> sayfası altındaki <guilabel>Eylem açılır menüsünü göster</guilabel> seçeneği ile menünün kalacağı süreyi değiştirebilirsiniz. <guilabel>Eylem Menüsü</guilabel> sayfası altındaki <guilabel>MIME eylemlerini içer</guilabel> seçeneğini kullanarak dosya yolu bölümünü ayrı olarak devre dışı bırakabilirsiniz.

source: Actions can be disabled completely by pressing the shortcut <keycombo action="simul">&Ctrl;&Alt;<keycap>X</keycap></keycombo>.
tr: Eylemler, <keycombo action="simul">&Ctrl;&Alt;<keycap>X</keycap></keycombo> kısayoluyla tümüyle devre dışı bırakılabilir.

source: Clipboard contents which match a regular expression can also be edited before performing an action on them. Select <guimenuitem>Edit contents...</guimenuitem> at the right of the clipboard entry, and you can change the clipboard contents in the dialog which appears, before clicking the <guibutton>OK</guibutton> button to run the appropriate action.
tr: Düzenli bir ifadeyle eşleşen pano içeriği de üzerilerinde bir işlem yapılmadan önce düzenlenebilir. Pano girişinin sağındaki <guimenuitem>İçeriği düzenle…</guimenuitem> ögesini seçin ve uygun olanı çalıştırmak için <guibutton>Kaydet</guibutton> düğmesine basmadan önce açılan iletişim kutusunda pano içeriğini uygun eylemle değiştirebilirsiniz.

source: Pressing <keycombo action="simul">&Ctrl;&Alt;<keycap>R</keycap></keycombo> shows the pop-up menu to repeat the last action which &klipper; performed.
tr: <keycombo action="simul">&Ctrl;&Alt;<keycap>R</keycap></keycombo> kısayoluna basmak, &klipper;’ın gerçekleştirdiği son eylemi yinelemek için açılır menüyü gösterir.

source: Clipboard/Selection Behavior
tr: Pano/Seçim Davranışı

source: General
tr: Genel

source: &klipper; can be used to set the behavior of the clipboard and selection in &plasma;.
tr: &klipper;, &plasma;’daki pano ve seçim davranışlarını ayarlamak için kullanılabilir.

source: The &X-Window; uses two separate clipboard buffers: the <quote>selection</quote> and the <quote>clipboard</quote>. Text is placed in the selection buffer by simply selecting it, and can be pasted with the middle mouse button. To place text in the clipboard buffer, select it and press <keycombo>&Ctrl;<keycap>X</keycap> </keycombo> or <keycombo>&Ctrl;<keycap>C</keycap> </keycombo>. Text from the clipboard buffer is pasted using <keycombo>&Ctrl;<keycap>V</keycap> </keycombo> or by selecting <guimenuitem>Paste</guimenuitem> in a context menu.
tr: &X-Window;, iki ayrı pano arabelleği kullanır: <quote>Seçim</quote> ve <quote>pano</quote>. Metin, seçildiğinde seçim arabelleğine yerleştirilir ve orta fare düğmesiyle yapıştırılabilir. Pano arabelleğine metin yerleştirmek için onu seçin ve <keycombo>&Ctrl;<keycap>X</keycap> </keycombo> veya <keycombo>&Ctrl;<keycap>C</keycap> </keycombo> kısayollarını kullanın. Pano arabelleğindeki metin <keycombo>&Ctrl;<keycap>V</keycap> </keycombo> veya bir bağlam menüsündeki <guimenuitem>Yapıştır</guimenuitem> komutuyla yapıştırılabilir.

source: Changing Clipboard/Selection Behavior
tr: Pano/Seçim Davranışını Değiştirmek

source: In order to change clipboard/selection behavior, select <guimenuitem>Configure Clipboard...</guimenuitem> from the &klipper; context menu, and in the dialog box that appears, select the <guilabel>General</guilabel> page. Unchecking <guilabel>Selection and Clipboard</guilabel> makes the clipboard and selection function as completely separate buffers as described above. With this option set, the option <guilabel>Ignore</guilabel> will prevent &klipper; from including the contents of the selection in its clipboard history and from performing actions on the contents of the selection. Selecting <guilabel>Selection and Clipboard</guilabel> causes the clipboard and selection buffers to always be the same, meaning that text in the selection can be pasted with either the <mousebutton>middle</mousebutton> mouse button or the key combination <keycombo>&Ctrl;<keycap>V</keycap> </keycombo>, and similarly for text in the clipboard buffer.
tr: Pano/seçim davranışını değiştirmek için &klipper; bağlam menüsünden <guimenuitem>Panoyu Yapılandır…</guimenuitem>’ı seçin ve açılan iletişim kutusundan <guilabel>Genel</guilabel> sayfasına geçin. <guilabel>Seçim ve Pano</guilabel> seçeneğinin içeriğini kaldırmak pano ve seçim işlevlerini yukarıda anlatıldığı üzere tümüyle ayrı arabelleklerde tutar. Bu seçenek ayarlandığında, <guilabel>Yok Say</guilabel> eylemi, &klipper;’ın seçim içeriğini onun pano geçmişine almasına ve seçimin üzerinde eylemler gerçekleştirmesine engel olur. <guilabel>Seçim ve Pano</guilabel> seçeneğini işaretlemek pano ve seçim arabelleklerinin her zaman aynı olmasına neden olur ve seçilen metnin hem <mousebutton>orta</mousebutton> fare düğmesi hem de <keycombo>&Ctrl;<keycap>V</keycap> </keycombo> düğme kombinasyonuyla ve pano arabelleğindeki metnin de aynı biçimde yapıştırılabilmesine izin verir.

source: Configuring &klipper;
tr: &klipper; Yapılandırması

source: General Options
tr: Genel Seçenekler

source: Selection and Clipboard
tr: Seçim ve Pano

source: When text or an area of the screen is highlighted with the mouse or keyboard, this is the <emphasis>selection</emphasis>. It can be pasted using the middle mouse button.
tr: Metin veya ekranın bir alanı fare veya klavye ile vurgulandığında, bu <emphasis>seçim</emphasis>’dir. Orta fare düğmesi kullanılarak yapıştırılabilir.

source: If the selection is explicitly copied using a <guimenuitem>Copy</guimenuitem> or <guimenuitem>Cut</guimenuitem> action, it is saved to the <emphasis>clipboard</emphasis>. It can be pasted using a <guimenuitem>Paste</guimenuitem> action.
tr: Seçim, <guimenuitem>Kopyala</guimenuitem> veya <guimenuitem>Yapıştır</guimenuitem> eylemleriyle açıkça kopyalanmışsa <emphasis>panoya</emphasis> kopyalanır. Bir<guimenuitem>Yapıştır</guimenuitem> eylemi kullanılarak yapıştırılabilir.

source: When turned on this option keeps the selection and the clipboard the same, so that any selection is immediately available to paste by any means. If it is turned off, the selection may still be saved in the clipboard history (subject to the options below), but it can only be pasted using the middle mouse button.
tr: Bu seçenek etkinleştirildiğinde, seçim ve pano aynı kalır, böylece herhangi bir seçim herhangi bir yolla hemen yapıştırılabilir. Kapatılırsa seçim yine de pano geçmişine kaydedilebilir (aşağıdaki seçeneklere tabidir); ancak yalnızca farenin orta düğmesi kullanılarak yapıştırılabilir.

source: Clipboard history
tr: Pano geçmişi

source: Toggles clipboard history.
tr: Pano geçmişini açar/kapatır.

source: Number of entries
tr: Girdi sayısı

source: Sets the number of items that are stored in the clipboard history.
tr: Pano geçmişinde tutulan ögelerin sayısını ayarlar.

source: Text selection
tr: Metin seçimi

source: When an area of the screen is selected with mouse or keyboard, this is called the <quote>selection</quote>. This option determines whether text selections are saved in the clipboard history. It is possible to choose between <guilabel>Always save in history</guilabel> and <guilabel>Only when explicitly copied</guilabel>. The <guilabel>Always save in history</guilabel> option is not available if selection/clipboard synchronisation is turned off &dash; in this case the selection is never automatically saved in the clipboard history. See <xref linkend="clipboard-modes"/>.
tr: Ekranın bir bölümü fare veya klavyeyle seçildiğinde, buna <quote>seçim</quote> denir. Bu seçenek, metin seçimlerinin panoya kaydedilip kaydedilmeyeceğini belirler. <guilabel>Her zaman geçmişe kaydet</guilabel> ve <guilabel>Yalnızca açıkça kopyalandığında</guilabel> arasında seçim yapılabilir. <guilabel>Her zaman geçmişe kaydet</guilabel> seçeneği, seçim/pano eşzamanlaması kapalıysa kullanılamaz &dash; bu durumda seçim pano geçmişine hiçbir zaman kendiliğinden kaydedilmez. <xref linkend="clipboard-modes"/> bölümüne bakın.

source: Non-text selection
tr: Metin olmayan seçim

source: This option determines whether non-text selections (such as images) are saved in the clipboard history. It is possible to choose between <guilabel>Always save in history</guilabel>, <guilabel>Only when explicitly copied</guilabel>, and <guilabel>Never save in history</guilabel>. The <guilabel>Always save in history</guilabel> option is not available if selection/clipboard synchronisation is turned off &dash; in this case the selection is never automatically saved in the clipboard history. See <xref linkend="clipboard-modes"/>.
tr: Bu seçenek, metin olmayan seçimlerin (örn. görseller) pano geçmişine kaydedilip kaydedlimeyeceğini belirler. <guilabel>Her zamang geçmişe kaydet</guilabel>, <guilabel>Yalnızca açıkça kopyalandığında</guilabel> ve <guilabel>Asla geçmişe kaydetme</guilabel> arasından seçim yapılabilir. <guilabel>Her zaman geçmişe kaydet</guilabel> seçeneği, seçim/pano eşzamanlaması kapalıysa kullanılamaz &dash; bu durumda seçim pano geçmişine hiçbir zaman kendiliğinden kaydedilmez. <xref linkend="clipboard-modes"/> bölümüne bakın.

source: Action Menu
tr: Eylem Menüsü

source: Show action popup menu
tr: Eylem açılır menüsünü göster

source: Set the time that a popup menu will remain for if you do nothing with it.
tr: Hiçbir şey yapmazsanız açılır menünün kalacağı süreyi ayarlayın.

source: Replay actions on an item selected from history
tr: Geçmişten seçilen bir ögedeki eylemleri yinele

source: If this is switched on, selecting an item from the history causes &klipper; to display the actions pop-up on that item, if appropriate.
tr: Bu açıksa geçmişten bir ögeyi seçmek uygunsa &klipper;’ın o öge üzerinde eylem açılır menüsünü göstermesini sağlar.

source: Exclude Windows
tr: Pencereleri Dışla

source: Brings up the <guilabel>Disable Actions for windows of type WM_CLASS</guilabel> dialog.
tr: <guilabel>WM_CLASS türündeki pencereler için Eylemleri Devre Dışı Bırak</guilabel> iletişim kutusunu getirir.

source: Some programs, such as &konqueror;, use the clipboard internally. If you get unwanted &klipper; pop-ups all the time when using a certain application, do the following:
tr: &konqueror; gibi bazı programlar panoyu kendi içinde kullanır. Belirli bir uygulamayı kullanırken sürekli istenmeyen &klipper; açılır pencerleri alıyorsanız şunu yapın:

source: Open the application.
tr: Uygulamayı açın.

source: From a terminal, run <userinput><command>xprop</command> | <command>grep</command> <parameter>WM_CLASS</parameter></userinput> and then click on the window of the application you are running.
tr: Bir uçbirimden <userinput><command>xprop</command> | <command>grep</command> <parameter>WM_CLASS</parameter></userinput> komutunu çalıştırıp kullandığınız uygulamanın penceresine tıklayın.

source: The first string after the equals sign is the one to enter.
tr: Eşittir iminden sonraki ilk diziyi girin.

source: Once the WM_CLASS is added, no more actions will be generated for windows of that application.
tr: WM_CLASS eklendikten sonra o uygulamanın pencereleri için artık bir daha eylemler üretilmeyecektir.

source: Remove white space when executing actions
tr: Seçimden boşlukları kırp

source: If selected, any white space (spaces, tabs, &etc;) at the beginning and end of the clipboard contents will be removed before passing the clipboard contents to an application. This is useful, for example, if the clipboard contains a &URL; with spaces which, if opened by a web browser, would cause an error.
tr: Seçilirse pano içeriği bir uygulamaya aktarılmadan önce pano içeriğinin başındaki ve sonundaki boşluklar (boşluklar, sekmeler &etc;.) kaldırılır. Bu; örneğin, pano bir web tarayıcısı tarafından açıldığında hataya neden olacak boşluklar içeren bir &URL; içeriyorsa kullanışlıdır.

source: Include MIME actions
tr: MIME eylemlerini içer

source: If selected, include applications that can accept its &MIME; type of a file name or URL selected in the popup menu.
tr: Seçilirse açılır menüde seçili bir dosya adı veya URL’nin &MIME; türünü kabul edebilen uygulamaları içerin.

source: Actions Configuration
tr: Eylemler Yapılandırması

source: Editing Expressions/Actions
tr: İfadeleri/Eylemleri Düzenlemek

source: On the <guilabel>Actions</guilabel> page, double-click the regular expression or action that you want to edit or select it and press the <guibutton>Edit Action</guibutton> button. A dialog will appear in which the expression text can be edited as you wish.
tr: <guilabel>Eylemler</guilabel> sayfasında, düzenlemek istediğiniz düzenli ifadeye veya eyleme çift tıklayın veya onu seçip <guibutton>Eylemi Düzenle</guibutton> düğmesine tıklayın. İfade metnini istediğiniz gibi düzenleyebileceğiniz bir iletişim kutusu açılacaktır.

source: Adding Expressions/Actions
tr: İfadeler/Eylemler Eklemek

source: Click the <guibutton>Add Action...</guibutton> button to add a regular expression for &klipper; to match. &klipper; uses &Qt;'s <classname>QRegularExpression</classname>, which uses PCRE (Perl Compatible Regular Expressions).
tr: &klipper;’ın eşleşeceği bir düzenli ifade eklemek için <guibutton>Eylem Ekle…</guibutton> düğmesine tıklayın. &klipper;, &Qt;’nin PCRE (Perl Uyumlu Düzenli İfadeler) kullanan <classname>QRegularExpression</classname> sınıfını kullanır.

source: You can add a description of the regular expression type (&eg; <quote>HTTP URL</quote>) by <mousebutton>left</mousebutton> clicking in the <guilabel>Description</guilabel> column.
tr: Düzenli ifadenin türünü (&eg;, <quote>HTTP URL</quote>), <guilabel>Açıklama</guilabel> sütununa <mousebutton>sol</mousebutton> fare düğmesiyle tıklayarak ekleyebilirsiniz.

source: You can find detailed information about the use of <classname>QRegularExpression</classname> regular expressions in <ulink url="https://doc.qt.io/qt-5/qregularexpression.html#details">the Qt upstream documentation</ulink>.
tr: <classname>QRegularExpression</classname> düzenli ifadelerinin kullanımına ilişkin ayrıntılı bilgiyi <ulink url="https://doc.qt.io/qt-5/qregularexpression.html#details">Qt belgelendirmesinde</ulink> bulabilirsiniz.

source: Edit the regular expression as described above. To add a command to execute, click <guimenuitem>Add Command</guimenuitem> and edit the command in an in-place text editing box. Double-clicking on a command allows you to edit it.
tr: Normal ifadeyi yukarıda açıklandığı gibi düzenleyin. Yürütülecek bir komut eklemek için <guimenuitem>Komut Ekle</guimenuitem> ögesini tıklayın ve komutu metin düzenleme kutusunda düzenleyin. Bir komuta çift tıklamak onu düzenlemenizi sağlar.

source: Note that <token>%s</token> in the command line is replaced with the clipboard contents, &eg; if your command definition is <userinput><command>kwrite</command> <token>%s</token></userinput> and your clipboard contents are <filename>/home/phil/textfile</filename>, the command <userinput><command>kwrite</command> <filename>/home/phil/textfile</filename></userinput> will be run. To include <token>%s</token> in the command line, escape it with a backslash, as so: <userinput>\%s</userinput>.
tr: Komut satırındaki <token>%s</token>’nin pano içeriğiyle değiştirildiğini not edin; &eg;, komut tanımınız <userinput><command>kwrite</command> <token>%s</token></userinput> ise ve pano içeriğiniz <filename>/home/umay/metindosyası</filename> ise <userinput><command>kwrite</command> <filename>/home/umay/metindosyası</filename></userinput> çalıştırılır. <token>%s</token> ögesini komut satırında içermek için onu bir ters eğik çizgi ile kaçırın: <userinput>\%s</userinput>.

source: Entries <userinput><token>%0</token></userinput> through <userinput><token>%9</token></userinput> will be replaced by the corresponding captured texts from the match pattern.
tr: <userinput><token>%0</token></userinput>-<userinput><token>%9</token></userinput> arasındaki girdiler, eşleşme dizgisindeki ilgili yakalanmış metinlerle değiştirilir.

source: Shortcuts Options
tr: Kısayollar Seçenekleri

source: The shortcuts page allows you to change the keyboard shortcuts which are used to access &klipper; functions. You can change the shortcut to one of three things:
tr: Kısayollar sayfası, &klipper; işlevlerine erişmek için kullanılan klavye kısayollarını değiştirmenize olanak tanır. Kısayolu üç şeyden biriyle değiştirebilirsiniz:

source: None
tr: Yok

source: The selected action cannot be accessed directly from the keyboard
tr: Seçili eyleme klavyeden doğrudan erişilemez

source: Default
tr: Öntanımlı

source: The selected action uses &klipper;'s default key. These are the shortcuts referred to in this manual.
tr: Seçili eylem, &klipper;’ın öntanımlı düğmesini kullanır. Bunlar, bu el kitabında söz edilen kısayollardır.

source: Custom
tr: Özel

source: The selected action is assigned to the keys you choose.
tr: Seçili eyleme sizin seçtiğiniz düğmeler atanmıştır.

source: To choose a custom key for the action you have selected, click on <guilabel>Custom</guilabel> and then <guilabel>None</guilabel>. Now type the desired key combination on your keyboard, as in any &kde; application.
tr: Seçtiğiniz eyleme özel bir düğme atamak isterseniz <guilabel>Özel</guilabel>’e ve ardından <guilabel>Yok</guilabel>’a tıklayın. Şimdi, başka &kde; uygulamalarında da yaptığınız gibi, istediğiniz kısayolu girin.

source: If you define a shortcut for <guilabel>Open Klipper at Mouse Position</guilabel> pressing this shortcut will open the &klipper; popup menu at the position of the mouse cursor, instead of their default position (in the &plasma; Panel). Useful if you use the mouse more than the keyboard.
tr: <guilabel>Fare Konumunda Ögeleri Göster</guilabel> için bir kısayol atarsanız &klipper; açılır menüsü, öntanımlı konumu yerine (&plasma; paneli) fare imlecinin konumunda açılacaktır. Fareyi klavyeden daha çok kullanıyorsanız yararlıdır.

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Program copyright 1998 &Andrew.Stanley-Jones; <email>asj@cban.com</email>
tr: Program telif hakkı 1998 &Andrew.Stanley-Jones; <email>asj@cban.com</email>

source: Program copyright 1998-2000 &Carsten.Pfeiffer; &Carsten.Pfeiffer.mail;
tr: Program telif hakkı 1998–2000 &Carsten.Pfeiffer; &Carsten.Pfeiffer.mail;

source: Currently maintained by Esben Mose Hansen. See <ulink url="http://mosehansen.dk/about">http://mosehansen.dk/about</ulink> for contact details.
tr: Geçerli bakımcı: Esben Mose Hansen. İletişim bilgileri için <ulink url="http://mosehansen.dk/about">http://mosehansen.dk/about</ulink> sayfasına bakın.
