Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/klipper.po
Languages: tr

source: Documentation copyright 2000-2003, 2005 &Philip.Rodrigues; &Philip.Rodrigues.mail;
tr: Belgelendirme telif hakkı 2000–2003, 2005 &Philip.Rodrigues; &Philip.Rodrigues.mail;

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
