Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kmenuedit.po
Languages: tr

source: The &kde; Menu Editor Handbook
tr: &kde; Menü Düzenleyicisi El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: &kmenuedit; allows editing one of the &kde; application launchers.
tr: &kmenuedit;, &kde; uygulama başlatıcılarından birini düzenlemenize olanak verir.

source: KDE Menu Editor
tr: KDE Menü Düzenleyicisi

source: application
tr: uygulama

source: menu
tr: menü

source: Introduction
tr: Giriş

source: &kmenuedit; allows editing the menu of &kde; application launchers.
tr: &kmenuedit; &kde; uygulama başlatıcılarının menülerini düzenlemeye izin verir.

source: &kmenuedit; can be started either by &RMB; clicking the application launcher button on the panel and choosing <guimenuitem>Edit Applications...</guimenuitem>, or by typing <userinput>kmenuedit</userinput> in the &krunner; line.
tr: &kmenuedit;, paneldeki uygulama başlatıcısı düğmesine &RMB; ile tıklayıp <guimenuitem>Uygulamaları Düzenle…</guimenuitem>’yi seçerek veya &krunner; satırına <userinput>kmenuedit</userinput> yazarak başlatılabilir.

source: &kmenuedit; allows you to:
tr: &kmenuedit;, şunları yapmanıza izin verir:

source: View and edit the menu used by the current application launcher
tr: Geçerli uygulama başlatıcısı tarafından kullanılan menüyü görüntülemek ve düzenlemek

source: <guimenuitem>Cut</guimenuitem>, <guimenuitem>Copy</guimenuitem> and <guimenuitem>Paste</guimenuitem> submenus and items
tr: Ögeleri ve alt menüleri <guimenuitem>Kes</guimenuitem>, <guimenuitem>Kopyala</guimenuitem> ve <guimenuitem>Yapıştır</guimenuitem> yapmak

source: Create and delete submenus and items
tr: Ögeler ve alt menüler oluşturmak ve onları silmek

source: Change the order of submenus and items
tr: Ögelerin ve alt menülerin sıralamasını değiştirmek

source: Hide items and add new submenus and items
tr: Yeni ögeler ve alt menüler eklemek ve ögeleri gizlemek

source: By default all applications installed on the computer appear in the application launchers menu of all users. Applications may appear more than once in several different menus. Empty submenu categories defined in the desktop menu specification will show up as well, but are not visible in application launchers unless you install applications belonging to these categories.
tr: Bilgisayarda kurulu olan tüm uygulamalar öntanımlı olarak tüm kullanıcıların uygulama başlatıcıları menüsünde görünür. Uygulamalar birkaç farklı menüde birden çok kez görünebilir. Masaüstü menü belirtiminde tanımlanan boş alt menü kategorileri de görünür; ancak bu kategorilere ait uygulamaları kurmadığınız sürece başlatıcılar bu menüde görünmez.

source: The tree view has two different entry types:
tr: Ağaç görünümünün iki farklı girdi türü vardır:

source: Submenu: Only <guilabel>Name</guilabel>, <guilabel>Comment</guilabel> and <guilabel>Description</guilabel> fields and the button to select an icon are enabled, the <guilabel>Advanced</guilabel> tab is disabled. Any submenu can hold additional submenus and/or items.
tr: Alt menü: Yalnızca <guilabel>Ad</guilabel>, <guilabel>Yorum</guilabel> ve <guilabel>Açıklama</guilabel> alanları ve bir simge seçme düğmesi etkindir; <guilabel>Gelişmiş</guilabel> sekmesi devre dışıdır. Herhangi bir alt menü ek ögeler veya alt menüler içerebilir.

source: Items: Use this entry to enter the data for the application you want to add. For detailed information see <link linkend="using-kmenuedit">Using &kmenuedit;</link>.
tr: Ögeler: Eklemek istediğiniz uygulama için veri girişinde bu girdiyi kullanın. Ayrıntılı bilgi için <link linkend="using-kmenuedit">&kmenuedit; Kullanımı</link> bölümüne bakın.

source: &kmenuedit; has two tree view modes - normal and with hidden entries. To see the latter check the option <guilabel>Show hidden entries</guilabel> in the configuration dialog on the <guilabel>General options</guilabel> page.
tr: &kmenuedit;’in iki ağaç görünümü kipi vardır — normal ve gizli girdiler. İkincisini görmek için <guilabel>Genel Seçenekler</guilabel> sayfasındaki <guilabel>Gizli girdileri göster</guilabel> yapılandırma seçeneğini işaretleyin.

source: Many additional entries appear in hidden view mode in the tree. Several hidden entries seem to be just duplicates but have different command options. Usually you should never change these hidden entries or you risk to break some functionality of the system.
tr: Ağaçtaki gizli görünüm kipinde birçok ek girdi görünür. Birkaç gizli girdi, yalnızca başka girdilerin kopyası gibi görünür; ancak farklı komut seçeneklerine sahiptir. Genellikle bu gizli girdileri asla değiştirmemelisiniz; aksi takdirde sistemin bazı işlevlerini bozma riskiniz vardır.

source: In hidden mode you will have a special submenu <guilabel>.hidden [Hidden]</guilabel> as top level item in the tree. This special submenu is not editable. In this submenu all deleted items will be shown at the next start of &kmenuedit;.
tr: Gizli kipte, ağaçtaki üst düzey öge olarak özel bir <guilabel>.hidden [Gizli]</guilabel> alt menüsü görünür. Bu özel alt menü düzenlenemez. Bu alt menüde, silinen tüm ögeler bir sonraki &kmenuedit; başlatımında gösterilir.

source: It is not possible to delete entries using the &GUI; in this special submenu. They will reappear at the next start of &kmenuedit;.
tr: Grafik arayüz kullanarak bu özel menüdeki girdileri silmek olanaklı değildir. &kmenuedit;’in her bir sonraki başlatımında bu girdiler yeniden ortaya çıkarlar.

source: Use Cases
tr: Kullanım Senaryoları

source: Adapt the Menu for a User
tr: Menüyü Bir Kullanıcıya Adapte Etmek

source: Reorder Items
tr: Ögeleri Sıralamak

source: This should be done in hidden view mode where only the submenus and items visible in the application launcher menu are displayed.
tr: Bu, yalnızca uygulama başlatıcısı menüsünde görünen alt menülerin ve ögelerin görüntülendiği gizli görünüm kipinde yapılmalıdır.

source: By default the menu is sorted alphabetically using the English names or descriptions. Using another language than English some submenus and items therefore will appear in an unsorted order.
tr: Öntanımlı olarak menü, İngilizce adlar veya açıklamalar kullanılarak abecesel olarak sıralanmıştır. Bu nedenle, İngilizceden başka bir dil kullanıldığında bazı alt menüler ve ögeler sıralanmamış olarak görünecektir.

source: Use the options in <menuchoice><guimenu>Edit</guimenu><guimenuitem>Sort</guimenuitem></menuchoice> to sort either by name or description. If you use the classic application launcher you have to select the corresponding <guilabel>Format</guilabel> option in the settings dialog. In the &kickoff; launcher check <guilabel>Show applications by name</guilabel> if you sort them by name here.
tr: Ada veya açıklamaya göre sıralamak için <menuchoice><guimenu>Düzen</guimenu><guimenuitem>Sırala</guimenuitem></menuchoice> menü ögesini kullanın. Klasik uygulama başlatıcısını kullanıyorsanız ayarlar iletişim kutusundaki ilgili <guilabel>Biçim</guilabel> seçeneğini seçmelisiniz. Onları burada ada göre sıralıyorsanız &kickoff; başlatıcısındaki <guilabel>Uygulamaları ada göre göster</guilabel> seçeneğini işaretleyin.

source: Grouping your frequently used submenus or items together &eg; at the top of the menu makes selecting them easier. To change the order of particular items or submenus in the tree use the <guibutton>Move Up</guibutton> or <guibutton>Move Down</guibutton> button in the toolbar or these actions in the menu.
tr: Sık kullandığınız ögelerinizi veya alt menülerinizi; &eg;, gruplamak, onları daha kolay seçmenizi sağlar. Ağaçtaki belirli ögelerin veya alt menülerin sıralamasını değiştirmek için araç çubuğundaki <guibutton>Yukarı Taşı</guibutton> veya <guibutton>Aşağı Taşı</guibutton> düğmelerini kullanın veya bu eylemleri menüden seçin.

source: All application launchers will use the order of submenus defined in &kmenuedit;.
tr: Tüm uygulama başlatıcıları, &kmenuedit; içinde tanımlı alt menü sıralamasını kullanır.

source: Remove Items from the Menu View
tr: Menü Görünümünden Ögeleri Kaldırmak

source: Having shown all applications installed on a computer may be confusing for some users so you may want to hide some less frequently used items or submenus. There are two different ways to do that:
tr: Bilgisayarda kurulu tüm uygulamaları göstermek bazı kullanıcılar için kafa karıştırıcı olabilir, bu nedenle daha az kullanılan bazı ögeleri veya alt menüleri gizlemek isteyebilirsiniz. Bunu yapmanın iki farklı yolu vardır:

source: Switch to normal view mode without hidden entries. If you delete items they are moved to the <guilabel>.hidden [Hidden]</guilabel> submenu. You can move them back into the tree to have them in the menu again.
tr: Gizli girdiler olmayan normal görünüm kipine geçin. Ögeleri silerseniz onlar <guilabel>.hidden [Gizli]</guilabel> alt menüsüne taşınırlar. Yeniden menüde görüntülemek için onları ağaca geri taşıyabilirsiniz.

source: If you delete a submenu it will be really deleted with all its submenus and items. To recreate them you can use <menuchoice><guimenu>Edit</guimenu><guimenuitem>Restore to System Menu</guimenuitem></menuchoice>, but this will remove all your custom submenus and items and the corresponding <filename class="extension">.desktop</filename> files are deleted too. This action cannot be reverted.
tr: Bir alt menüyü silerseniz tüm ögeleri ve alt menüleriyle birlikte gerçekten silinecektir. Onları yeniden oluşturmak için <menuchoice><guimenu>Düzen</guimenu><guimenuitem>Menü Sistemini Geri Yükle</guimenuitem></menuchoice> ögesini kullanabilirsiniz; ancak bu tüm özelleştirilmiş ögelerinizi, alt menülerinizi ve ilgili <filename class="extension">.desktop</filename> dosyalarınızı kaldıracaktır.

source: The preferred way to remove submenus and items in the menu of an application launcher is to check <guilabel>Hidden entry</guilabel> on the <guilabel>General</guilabel> tab and switch to the hidden view mode. In this mode it is easy to revert changes without destroying the menu structure. The only drawback is that you have to hide all entries in a submenu manually to hide the whole submenu from the view.
tr: Bir uygulama başlatıcısının menüsündeki ögeleri ve alt menüleri kaldırmanın yeğlenen yöntemi <guilabel>Genel</guilabel> sekmesindeki <guilabel>Gizli girdi</guilabel> kutusunu işaretlemek ve gizli görünüm kipine geçmektir. Bu kipte menü yapısını yok etmeden değişikliklerinizi geri alabilirsiniz. Tek dezavantajı, tüm alt menüyü görünümden gizlemek için bir alt menüdeki tüm girişleri elle gizlemeniz gerekmesidir.

source: Adding Custom Items
tr: Özel Ögeler Eklemek

source: To add custom items (submenu or item) use the actions in the menu or toolbar. Items need a Name and a Command, without a command entry an item will not be saved and your addition gets lost.
tr: Özel ögeler (alt menü veya öge) eklemek için menüdeki veya araç çubuğundaki eylemleri kullanın. Ögelerin bir Ad ve Komut’a gereksinimi vardır, komut girişi olmadan hiçbir öge kaydedilmez ve ekleme işleminiz kaybolur.

source: If you add an entry it is inserted as sub entry at the actual highlighted position in the tree. Move an entry by dragging it with the mouse or using the <guibutton>Move Down</guibutton> button to the bottom of the tree to make it a top level entry.
tr: Bir girdi eklerseniz ağaçta asıl vurgulanan konuma alt girdi olarak eklenir. Bir girdiyi üst düzey bir girdi yapmak için fareyle sürükleyerek veya <guibutton>Aşağı Taşı</guibutton> düğmesini kullanarak ağacın altına taşıyın.

source: Transfer application launcher settings
tr: Uygulama başlatıcısı ayarlarını aktar

source: There is no way to transfer menu settings using the &GUI;, you have to do that manually and copy the following files to the target user:
tr: Menü ayarlarını grafik arayüz kullanarak aktarmanın bir yolu yoktur; bunu elle aşağıdaki dosyaları hedef kullanıcıya kopyalayarak yapmalısınız:

source: &kmenuedit; stores the menu hierarchy in <filename>menus/applications-kmenuedit.menu</filename> in the folder <filename class="directory">$(qtpaths --paths GenericConfigLocation)</filename> and <filename class="directory">desktop-directories</filename> in the folder <filename class="directory">$(qtpaths --paths GenericDataLocation)</filename> contains desktop files for submenus you created. In <filename class="directory">applications/</filename> in the folder <filename class="directory">$(qtpaths --paths GenericDataLocation)</filename> you find the desktop files for the custom items you created.
tr: &kmenuedit; menü hiyerarşisini <filename class="directory">$(qtpaths --paths GenericConfigLocation)</filename> klasöründeki <filename>menus/applications-kmenuedit.menu</filename> dosyasında depolar; <filename class="directory">$(qtpaths --paths GenericDataLocation)</filename> klasöründeki <filename class="directory">desktop-directories</filename> dosyasında oluşturduğunuz alt menü dosyaları için desktop dosyaları bulunur. <filename class="directory">$(qtpaths --paths GenericDataLocation)</filename> klasöründeki <filename class="directory">applications/</filename> dosyasında oluşturduğunuz özel ögeler için desktop dosyalarını bulursunuz.

source: The shortcuts for each application are stored in <filename>kglobalshortcutsrc</filename> in the folder <filename class="directory">$(qtpaths --paths GenericConfigLocation)</filename>, but export/import does not work because the UUIDs of the shortcuts do not match up between systems, even though the <filename class="extension">.desktop</filename> files are the same. You have to assign all shortcuts manually again.
tr: Her bir uygulama için kısayollar <filename class="directory">$(qtpaths --paths GenericConfigLocation)</filename> klasöründeki <filename>kglobalshortcutsrc</filename> dosyasında depolanır; ancak içe/dışa aktarma çalışmaz; çünkü kısayolların UUID’leri, <filename class="extension">.desktop</filename> dosyaları aynı olsa bile sistemler arasında eşleşmez. Tüm kısayolları elle yeniden atamanız gerekir.

source: Adding a Menu Entry
tr: Bir Menü Girdisi Eklemek

source: In this example, we will add &firefox; to the <guisubmenu>Internet</guisubmenu> submenu.
tr: Bu örnekte, &firefox;’u <guisubmenu>İnternet</guisubmenu> alt menüsüne ekleyeceğiz.

source: To start off, we need to open &kmenuedit;, so &RMB; on the application launcher menu, click <guimenuitem>Edit Applications...</guimenuitem> to start &kmenuedit;. After &kmenuedit; has started, select <guisubmenu>Internet</guisubmenu> as shown in picture below.
tr: Başlamak için önce &kmenuedit; uygulamasını açmamız gerekiyor; bu yüzden &kmenuedit; uygulamasını başlatmak için uygulama menüsüne &RMB; ile tıklayıp <guimenuitem>Uygulamaları Düzenle…</guimenuitem>’ye tıklayın. &kmenuedit; başladıktan sonra, aşağıdaki görselde gösterildiği üzere <guisubmenu>İnternet</guisubmenu> alt menüsünü seçin.

source: <screeninfo>Select <guisubmenu>Internet</guisubmenu></screeninfo>
tr: <screeninfo><guisubmenu>İnternet</guisubmenu>’i Seç</screeninfo>

source: <phrase>Select <guisubmenu>Internet</guisubmenu></phrase>
tr: <phrase><guisubmenu>İnternet</guisubmenu>’i Seç</phrase>

source: Once you have selected <guisubmenu>Internet</guisubmenu>, click on <menuchoice><guimenu>File</guimenu><guimenuitem>New Item...</guimenuitem></menuchoice>, opening the <guilabel>New Item</guilabel> dialog, as shown below. Type the name of the program you want to add, in this case, type <userinput>firefox</userinput>.
tr: <guisubmenu>İnternet</guisubmenu>’i seçtikten sonra, <menuchoice><guimenu>Dosya</guimenu><guimenuitem>Yeni Öge…</guimenuitem></menuchoice> menü ögesini seçmek, aşağıda gösterildiği üzere <guilabel>Yeni Öge</guilabel> iletişim kutusunu açar. Eklemek istediğiniz uygulamanın adını girin; bu örnek için <userinput>firefox</userinput>.

source: <guilabel>New Item</guilabel> dialog
tr: <guilabel>Yeni Öge</guilabel> iletişim kutusu

source: The <guilabel>New Item</guilabel> dialog.
tr: <guilabel>Yeni Öge</guilabel> iletişim kutusu.

source: Press return, and you should see something like the picture below in the main window.
tr: Dönüş’e basın ve ana pencerede aşağıdaki resme benzer bir şeyler görmelisiniz.

source: New Item
tr: Yeni Öge

source: The new item created.
tr: Oluşturulan yeni öge.

source: Now lets fill in the <guilabel>Description:</guilabel>, in this case type <userinput>Web Browser</userinput>. <note><para>The appearance how description and name will be displayed depends on the settings in the application launcher &eg; <quote>Web Browser (Firefox)</quote> or <quote>Firefox (Web Browser)</quote>.</para></note> We will need to fill in the executable name in the <guilabel>Command:</guilabel> field, in this instance we will type <userinput><command>firefox</command></userinput>.
tr: Şimdi <guilabel>Açıklama:</guilabel> alanını dolduralım; bu örnekte <userinput>Web Tarayıcı</userinput> yazıyoruz. <note><para>Açıklamanın ve adın nice görüntüleneceği uygulama başlatıcısının ayarlarına bağlıdır; &eg;, <quote>Web Tarayıcı (Firefox)</quote> veya <quote>Firefox (Web Tarayıcı)</quote>.</para></note> <guilabel>Komut:</guilabel> alanında yürütülebilirin adını girmemiz gerekecek. Buraya <userinput><command>firefox</command></userinput> yazmalıyız.

source: The command has to be in your <envar>PATH</envar> variable or you have to specify the full path to the executable. If you do not know the executable name of an application use the <userinput><command>locate</command></userinput> command to search for the desktop file and enter the string from the Exec line as command here.
tr: Komut, <envar>PATH</envar> değişkeninizde olmalıdır veya yürütülebilire olan tam yolu belirtmelisiniz. Bir uygulamanın yürütülebilirinin adını bilmiyorsanız desktop dosyasını aramak ve Exec alanındaki diziyi buraya komut olarak girmek için <userinput><command>locate</command></userinput> komutunu kullanın.

source: Following the command, you can have several place holders which will be replaced with actual values when the program is run:
tr: Komuttan sonra, program çalıştığında gerçek değerlerle değiştirebileceğiniz birkaç yer tutucu koyabilirsiniz:

source: %f - a single file name
tr: %f — bir tek dosya adı

source: %F - a list of files; use for applications that can open several local files at once
tr: %F — bir dosyalar listesi; birden çok dosyayı aynı anda açabilen uygulamalarda kullanın

source: %u - a single &URL;
tr: %u — tek bir &URL;

source: %U - a list of &URL;s
tr: %U — bir &URL;’ler listesi

source: %d - the folder of a file to open
tr: %d — açılacak bir dosyanın klasörü

source: %D - a list of folders
tr: %D — bir klasörler listesi

source: %i - the icon
tr: %i — simge

source: %m - the mini icon
tr: %m — ufak simge

source: %c - the caption
tr: %c — alt yazı

source: For example: if you want to firefox to start your web browsing at www.kde.org - instead of <command>firefox</command> you would type <command>firefox %u www.kde.org</command>.
tr: Örneğin: Firefox’un web taramaya <command>firefox</command> komutu yerine www.kde.org ile başlamasını istiyorsanız <command>firefox %u www.kde.org</command> yazın.

source: Most applications accept additional options &eg; the name of a defined profile like &konqueror; or &konsole;. To see all options for an application launch <userinput><command><replaceable>applicationname</replaceable></command> <option>--help</option></userinput> in &konsole;.
tr: Çoğu uygulamalar ek seçenekler kabul ederler; &eg;, &konqueror; veya &konsole; gibi tanımlı bir profil. Bir uygulama başlangıcı için tüm seçenekleri görmek üzere &konsole;’da <userinput><command><replaceable>uygulamaadı</replaceable></command> <option>--help</option></userinput> yazın.

source: We would like to have a more creative icon, so we will click the generic icon sitting beside <guilabel>Name:</guilabel> (note, the default icon may be blank, in which case click in the area to the right of the name entry box.) It will bring the <guilabel>Select Icon</guilabel> dialog which will let us choose the new icon, as shown below.
tr: Daha yaratıcı bir simge koyalım derseniz <guilabel>Ad:</guilabel> alanının yanındaki düz simgeye tıklayın (not; öntanımlı simge boş olabilir, öyleyse ad giriş alanının sağındaki alana tıklayın). Bu, yeni simgemizi aşağıda gösterildiği üzere seçmemize izin verecek olan <guilabel>Simge Seç</guilabel> iletişim kutusunu getirir.

source: <guilabel>Select Icon</guilabel> dialog
tr: <guilabel>Simge Seç</guilabel> iletişim kutusu

source: The <guilabel>Select Icon</guilabel> dialog.
tr: <guilabel>Simge Seç</guilabel> iletişim kutusu.

source: We choose the firefox icon from the list, and press &Enter;. Your finished screen should probably look something like the screenshot below.
tr: Listeden Firefox simgesini seçip &Enter;’e basıyoruz. Bitmiş ekranınız aşağı yukarı aşağıdaki gibi görünür.

source: Done screenshot
tr: Bitmiş ekran görüntüsü

source: This is what the completed menu item should looks like.
tr: Bu, bitmiş menü ögesinin nasıl görünmesi gerektiğidir.

source: The place of the new menu item can now be changed using <guibutton>Move Up</guibutton> and <guibutton>Move Down</guibutton> buttons on the &kmenuedit; toolbar or by dragging with the mouse.
tr: Yeni menü ögesinin yeri artık &kmenuedit; araç çubuğundaki <guibutton>Yukarı Taşı</guibutton> ve <guibutton>Aşağı Taşı</guibutton> düğmeleri kullanılarak veya fare ile sürüklenerek değiştirilebilir.

source: The submenu items can be sorted using <guibutton>Sort</guibutton> button on the &kmenuedit; toolbar or <menuchoice><guimenu>Edit</guimenu><guisubmenu>Sort</guisubmenu></menuchoice> submenu items.
tr: Alt menü ögeleri, &kmenuedit; içindeki <guibutton>Sırala</guibutton> düğmesiyle veya <menuchoice><guimenu>Düzen</guimenu><guisubmenu>Sırala</guisubmenu></menuchoice> menü ögesiyle sıralanabilir.

source: Click <menuchoice><guimenu>File</guimenu><guimenuitem>Save</guimenuitem></menuchoice>, wait for the <guilabel>Updating System Configuration</guilabel> dialog to get finished, you should find &firefox; in the application launcher <guisubmenu>Internet</guisubmenu> submenu.
tr: <menuchoice><guimenu>Dosya</guimenu><guimenuitem>Kaydet</guimenuitem></menuchoice> menü ögesine tıklayın, <guilabel>Sistem Yapılandırması Güncelleniyor</guilabel> iletişim kutusunun bitmesini bekleyin. &firefox; uygulamasını başlatıcısındaki <guisubmenu>İnternet</guisubmenu> alt menüsünde bulabilirsiniz.

source: Using &kmenuedit;
tr: &kmenuedit; Kullanımı

source: The left application panel shows the application launcher structure. When you browse items in the left panel, the right panel shows detailed information for the highlighted menu item.
tr: Sol uygulama paneli, uygulama başlatıcısı yapısını gösterir. Sol paneldeki ögelere göz attığınızda, sağ panel, vurgulanan menü ögesi için ayrıntılı bilgileri gösterir.

source: General tab
tr: Genel sekmesi

source: Name:
tr: Ad:

source: This is the name of your program as it appears in the application launcher menu. It can be different from the real executable name. For instance the name of <command>mc</command> executable is "<application>Midnight Commander</application>".
tr: Bu, uygulama başlatıcısı menüsünde göründüğü şekliyle programınızın adıdır. Gerçek yürütülebilir dosya adından farklı olabilir. Örneğin, <command>mc</command> yürütülebilirinin adı "<application>Midnight Commander</application>"dır.

source: Description:
tr: Açıklama:

source: The description will be displayed together with the name in the application launcher. This is entirely optional.
tr: Açıklama, uygulama başlatıcısındaki adla birlikte görüntülenecektir. Bu tümüyle isteğe bağlıdır.

source: Comment:
tr: Yorum:
