Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kmenuedit.po
Languages: tr

source: Describe the program in greater detail in this field. This is entirely optional.
tr: Programı bu alanda daha ayrıntılı olarak açıklayın. Bu tümüyle isteğe bağlıdır.

source: Command:
tr: Komut:

source: This is the name of the executable program. Make sure that you have permission to run the program.
tr: Bu, yürütülebilir programın adıdır. Programı çalıştırma izniniz olduğundan emin olun.

source: Enable launch feedback
tr: Başlatma geri bildirimini etkinleştir

source: If this box is checked, this will display feedback when an application is started.
tr: Bu kutu işaretlenirse bir uygulama başlatıldığında geri bildirim görüntülenir.

source: Only show in &kde;
tr: Yalnızca &kde;’de göster

source: When checked, the application entry will only be visible in all &kde; application launchers but not in other desktops environments.
tr: İşaretlendiğinde, uygulama girdisi yalnızca tüm &kde; uygulama başlatıcılarında görünür, diğer masaüstü ortamlarında görünmez.

source: Hidden entry
tr: Gizli girdi

source: Remove an entry from the menu view in the application launcher.
tr: Uygulama başlatıcısındaki menü görünümünden bir girdiyi kaldırın.

source: Advanced tab
tr: Gelişmiş sekmesi

source: Work path:
tr: Çalışma dizini:

source: Specify the work path of the program. This will be the current path when the program launches. It does not need to be the same as the executable location.
tr: Programın çalışma yolunu belirtin. Bu, program başladığındaki geçerli yol olur. Yürütülebilir konumuyla aynı olması gerekmez.

source: Run in terminal
tr: Uçbirimde çalıştır

source: You must check this if your program requires terminal emulator in order to run. This mainly applies to <link linkend="gloss-console-application">console applications</link>.
tr: Programınızın çalışması için bir uçbirim öykünücüsü gerekiyorsa bunu işaretlemelisiniz. Bu temel olarak <link linkend="gloss-console-application">konsol uygulamaları</link> için geçerlidir.

source: Terminal options:
tr: Uçbirim seçenekleri:

source: Put all terminal options in this field.
tr: Tüm uçbirim seçeneklerini bu alana koyun.

source: Run as a different user
tr: Farklı kullanıcı altında çalıştır

source: If you want to run this program as a different user (not you), check this checkbox, and provide the username in the <guilabel>Username:</guilabel> field.
tr: Bu programı farklı bir kullanıcı olarak (sizden başka) çalıştırmak istiyorsanız bu onay kutusunu işaretleyin ve kullanıcı adını <guilabel>Kullanıcı adı:</guilabel> alanına girin.

source: Current shortcut key:
tr: Geçerli kısayol düğmesi:

source: You can assign a special keyboard shortcut to launch your program.
tr: Programınızı başlatmak için özel bir klavye kısayolu atayabilirsiniz.

source: Click the <guibutton>None</guibutton> button to the right of the <guilabel>Current shortcut key:</guilabel> checkbox.
tr: <guibutton>Geçerli kısayol düğmesi:</guibutton> onay kutusunun sağındaki <guilabel>Yok:</guilabel> düğmesine tıklayın.

source: The button text will change to <guilabel>Input...</guilabel> and you can press the key combination on your keyboard that you want to be assigned to your program.
tr: Düğme metni <guilabel>Giriş…</guilabel> olarak değişir ve programınıza atamak istediğiniz düğme kombinasyonunu girebilirsiniz.

source: You can reset the shortcut to <guilabel>None</guilabel> by using this button: <inlinemediaobject><imageobject> <imagedata fileref="reset.png" format="PNG"/></imageobject></inlinemediaobject>.
tr: Kısayolu, bu düğmeyi kullanarak yine <guilabel>Yok</guilabel> yapabilirsiniz: <inlinemediaobject><imageobject> <imagedata fileref="reset.png" format="PNG"/></imageobject></inlinemediaobject>.

source: Don't forget to save your setting by clicking the toolbar <guiicon>Save</guiicon> icon or using the <menuchoice> <guimenu>File</guimenu><guimenuitem>Save</guimenuitem> </menuchoice> menu item.
tr: <guiicon>Save</guiicon> simgesini veya <menuchoice><guimenu>Dosya</guimenu><guimenuitem>Kaydet</guimenuitem></menuchoice> menü ögesini kullanarak ayarlarınızı kaydetmeyi unutmayın.

source: Menu Reference
tr: Menü Başvurusu

source: Most actions in the menubar are also available in the context menu opened with a &RMB; click on an item in the tree view.
tr: Menü çubuğundaki çoğu eylem, bir ögeye ağaç görünümündeyken &RMB; ile sağ tıklandığında açılan bağlam menüsünde de kullanılabilir.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>New Item...</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Yeni Öge…</guimenuitem>

source: Adds new menu item.
tr: Yeni menü ögesi ekler.

source: <guimenu>File</guimenu> <guimenuitem>New Submenu...</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Yeni Alt Menü…</guimenuitem>

source: Adds new submenu.
tr: Yeni alt menü ekler.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Save</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>Dosya</guimenu><guimenuitem>Kaydet</guimenuitem>

source: Saves the menu
tr: Menüyü kaydeder.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Çık</guimenuitem>

source: <action>Quits</action> &kmenuedit;.
tr: &kmenuedit; uygulamasından <action>çıkar</action>.

source: <guimenu>Edit</guimenu> <guimenuitem>Move Up</guimenuitem>
tr: <guimenu>Düzen</guimenu> <guimenuitem>Yukarı Taşı</guimenuitem>

source: <action>Moves</action> the selected item up in its submenu.
tr: Seçili ögeyi alt menüsünde <action>yukarı taşır</action>.

source: <guimenu>Edit</guimenu> <guimenuitem>Move Down</guimenuitem>
tr: <guimenu>Düzen</guimenu> <guimenuitem>Aşağı Taşı</guimenuitem>

source: <action>Moves</action> the selected item down in its submenu.
tr: Seçili ögeyi alt menüsünde <action>aşağı taşır</action>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu> Edit</guimenu> <guimenuitem>Cut</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu> Düzen</guimenu> <guimenuitem>Kes</guimenuitem>

source: <action>Cuts the current menu item to the clipboard.</action> If you want to move menu item, you should first cut it to the clipboard, move to the destination place using the left panel, and use the <guimenuitem>Paste</guimenuitem> function to paste the menu item from the clipboard.
tr: <action>Geçerli menü ögesini panoya keser</action>. Menü ögesini taşımak istiyorsanız onu önce panoya kesmeli, sol paneli kullanarak hedef konuma taşımalı ve panodan yapıştırmak için <guimenuitem>Yapıştır</guimenuitem> işlevini kullanmalısınız.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu> Edit</guimenu> <guimenuitem>Copy</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu> Düzen</guimenu> <guimenuitem>Kopyala</guimenuitem>

source: <action>Copies the current menu item to the clipboard</action>. You can later use the <guimenuitem>Paste</guimenuitem> function to paste the copied menu item from the clipboard to its destination. You can paste the same item many times.
tr: <action>Geçerli menü ögesini panoya kopyalar</action>. Sonrasında, kopyalanan menü ögesini panodan hedef konumuna yapıştırmak için <guimenuitem>Yapıştır</guimenuitem> işlevini kullanabilirsiniz. Aynı ögeyi birden çok kez yapıştırabilirsiniz.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Yapıştır</guimenuitem>

source: <action>Paste menu item from the clipboard</action> to currently selected place in the main menu. You must first use <guimenuitem>Cut</guimenuitem> or <guimenuitem>Copy</guimenuitem> before you can <guimenuitem>Paste</guimenuitem>.
tr: Panodaki menü ögesini ana menüdeki <action>geçerli seçili konuma yapıştırın</action>. <guimenuitem>Yapıştır</guimenuitem> yapabilmeniz için önce <guimenuitem>Kes</guimenuitem> veya <guimenuitem>Kopyala</guimenuitem> yapmalısınız.

source: <shortcut><keycap>Del</keycap></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Delete</guimenuitem>
tr: <shortcut><keycap>Sil</keycap></shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Sil</guimenuitem>

source: Deletes currently selected menu item.
tr: Geçerli seçili menü ögesini siler.

source: <guimenu>Edit</guimenu> <guisubmenu>Sort</guisubmenu>
tr: <guimenu>Düzen</guimenu> <guisubmenu>Sırala</guisubmenu>

source: <action>Opens</action> submenu to sort selected submenu or all menu tree. There are two sorting methods implemented, namely, by the name and by the description.
tr: Seçili alt menüyü veya tüm menü ağacını sıralamak için alt menüyü <action>açar</action>. Ada veya açıklamaya göre sıralayabilirsiniz.

source: <guimenu>Edit</guimenu> <guimenuitem>Restore to System Menu</guimenuitem>
tr: <guimenu>Düzen</guimenu> <guimenuitem>Sistem Menüsünü Geri Yükle</guimenuitem>

source: This will restore the application launcher as it was as default and remove all your custom settings. A message box will ask you if you really want to do that.
tr: Bu, uygulama başlatıcısını öntanımlı durumuna geri yükler ve tüm özel ayarlarınızı kaldırır. Bunu gerçekten yapmak isteyip istemediğinizi soran bir ileti kutusu çıkacaktır.

source: &kmenuedit; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/menus.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/menus.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
tr: &kmenuedit; yazılımında ortak &kde; <guimenu>Ayarlar</guimenu> ve <guimenu>Yardım</guimenu> menü ögeleri vardır; daha fazla bilgi için &kde; Temelleri’nde <ulink url="help:/fundamentals/menus.html#menus-settings">Ayarlar Menüsü</ulink> ve <ulink url="help:/fundamentals/menus.html#menus-help">Yardım Menüsü</ulink> ile ilgili bölüme bakın.

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Program copyright &copy; 2002, &Raffaele.Sandrini;
tr: Program telif hakkı &copy; 2002, &Raffaele.Sandrini;

source: Contributors:
tr: Katkıcılar:

source: &Matthias.Elter; &Matthias.Elter.mail; - Original Author
tr: &Matthias.Elter; &Matthias.Elter.mail; — Özgün Yazar

source: Documentation copyright &copy; 2000 &Milos.Prudek;
tr: Belgelendirme telif hakkı &copy; 2000 &Milos.Prudek;

source: Documentation copyright &copy; 2008 &Anne-Marie.Mahfouf;
tr: Belgelendirme telif hakkı &copy; 2008 &Anne-Marie.Mahfouf;

source: Updated for &kde; 3.0 by &Lauri.Watts; &Lauri.Watts.mail; 2002
tr: &kde; 3.0 için &Lauri.Watts; &Lauri.Watts.mail; (2002) tarafından güncellenmiştir

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>

source: Glossary
tr: Kavram Dizini

source: Console Application
tr: Konsol Uygulaması

source: Application originally written for non-graphic, text oriented environment. Such applications run fine in &kde;. They must run within console emulator, like &konsole;. They are not warned automatically when you shut down your &kde; session. You therefore must not forget to save documents open in these applications before you log out from the &kde;.
tr: Uygulama, ilk olarak grafik olmayan, metin odaklı ortamlar için yazılmıştır. Bu tür uygulamalar &kde; ile uyumludur; &konsole; gibi konsol öykünücülerinde çalışırlar. Ancak, &kde; oturumunuzu kapattığınızda otomatik olarak uyarılmazlar. Bu nedenle, &kde; oturumunu kapatmadan önce bu uygulamalarda açık olan belgeleri kaydetmeyi unutmamalısınız.

source: Console applications support copying and pasting from &kde;-compliant applications.Simply mark the text in the console application with your mouse, switch to the &kde;-compliant application and press <keycombo action="simul">&Ctrl; <keycap>V</keycap></keycombo> to paste the text. If you want to copy from &kde; application to a console application, first mark the text with your mouse, press <keycombo action="simul">&Ctrl; <keycap>C</keycap></keycombo>, switch to the console application and press the middle button on your mouse<footnote><para>If your mouse does not have a middle button, you must press <mousebutton>left</mousebutton> and <mousebutton>right</mousebutton> button at the same time. This is called <quote>middle button emulation</quote> and it must be supported by your operating system to work.</para></footnote>.
tr: Konsol uygulamaları, &kde; uyumlu uygulamalardan kopyalamayı ve yapıştırmayı desteklerler. Yalnızca farenizle konsol uygulamanızda metni imleyin, &kde; uyumlu uygulamanıza geçin ve metni yapıştırmak için <keycombo action="simul">&Ctrl; <keycap>V</keycap></keycombo> kısayoluna basın. Bir &kde; uygulamasından bir konsol uygulamasına yapıştırmak istiyorsanız önce metni farenizle imleyin, <keycombo action="simul">&Ctrl; <keycap>C</keycap></keycombo> kısayoluna basın, konsol uygulamasına geçin ve farenizin orta düğmesine basın. <footnote><para>Farenizin bir orta düğmesi yoksa <mousebutton>sol</mousebutton> ve <mousebutton>sağ</mousebutton> fare düğmelerine aynı anda basabilirsiniz. Buna, <quote>orta düğme öykünmesi</quote> denir ve işletim sisteminiz tarafından genelde desteklenir.</para></footnote>.
