Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/knetattach.po
Languages: tr

source: The &knetattach; Handbook
tr: &knetattach; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: &knetattach; is a wizard which makes it easier to integrate your network resources with your &kde; Desktop.
tr: &knetattach;, &kde; masaüstünüz ile ağ kaynaklarınızı tümleştirmeyi kolaylaştıran bir sihirbazdır.

source: Network Folders
tr: Ağ Klasörleri

source: Network Folder Wizard
tr: Ağ Klasörü Sihirbazı

source: KDE Network Folder Wizard
tr: KDE Ağ Klasörü Sihirbazı

source: Introduction
tr: Giriş

source: The &knetattach; wizard, affectionately and hereafter known as the Network Folder Wizard, allows easy addition and integration of various network folders with your &kde; desktop. Please report any problems or feature requests for it to the &kde; bugs website.
tr: Bundan böyle Ağ Klasörü Sihirbazı olarak anılacak olan &knetattach; sihirbazı, çeşitli ağ klasörlerinin &kde; masaüstüne kolayca eklenmesine ve tümleşmesine izin verir. Lütfen olası sorunları veya özellik isteklerini &kde; hata izleyicisinde raporlayın.

source: Using &knetattach;
tr: &knetattach; Kullanımı

source: As you will see in the screenshot below, the Network Folder Wizard currently allows you to add four types of network folders: WebDav, &FTP;, &Microsoft; &Windows; (&Samba;) network drives and SSH. Additionally you can select a recent connection for the list box.
tr: Aşağıdaki ekran görüntüsünde göreceğiniz gibi, Ağ Klasörü Sihirbazı şu anda dört tür ağ klasörünü eklemenize izin verir: WebDav, &FTP;, &Microsoft; &Windows; (&Samba;) ağ sürücüleri ve SSH. Ek olarak, liste kutusu için yeni bir bağlantı seçebilirsiniz.

source: Here's a screenshot of &knetattach;
tr: Burada bir &knetattach; ekran görüntüsü görebilirsiniz

source: Screenshot
tr: Ekran Görüntüsü

source: Network Folder Wizard main window
tr: Ağ Klasörü Sihirbazı ana penceresi

source: Adding network folders
tr: Ağ klasörleri eklemek

source: Network folders show up in a special location of &konqueror; and &dolphin; called a <emphasis>virtual folder</emphasis>. This virtual folder is accessed by typing <userinput>remote:/</userinput> in the location bar or by selecting <guilabel>Network</guilabel> from the <guilabel>Places</guilabel> panel. You will then be able to see any folders which have been previously added and you also will be able to use the wizard to add new ones.
tr: Ağ klasörleri, &konqueror; ve &dolphin; bünyesinde özel bir konumda görünürler ve <emphasis>sanal klasör</emphasis> adını alırlar. Bu sanal klasöre, konum çubuğunda <userinput>remote:/</userinput> yazarak veya <guilabel>Yerler</guilabel> panelinden <guilabel>Ağ</guilabel>’ı seçerek erişilir. Sonrasında, daha önceden eklenmiş olan tüm klasörleri görebilir ve ayrıca yenilerini eklemek için sihirbazı kullanabilirsiniz.

source: The virtual folder with the Network Folder wizard
tr: Ağ Klasörü sihirbazıyla sanal klasör

source: Speaking of wizards, the Network Folder Wizard aims at being very easy to use. After opening the wizard you must choose the type of network folder you would like to access. When you move on to the next screen you will just need to fill in the requested information. The final step is entering your username and login password for the network share you've chosen to access.
tr: Sihirbazlardan bahsetmişken, Ağ Klasörü Sihirbazı, kullanımının çok kolay olmasını amaçlar. Sihirbazı açtıktan sonra, erişmek istediğiniz ağ klasörü türünü seçmelisiniz. Bir sonraki ekrana geçtiğinizde sizden istenen bilgileri doldurmanız yeterli olacaktır. Son adım, erişmeyi seçtiğiniz ağ paylaşımı için kullanıcı adınızı ve oturum açma şifrenizi girmektir.

source: Below is a list of the information needed by the wizard to create the network folders. If an option is not available for a particular folder it does not have to be entered. The &Samba; folders &eg; do not require a <guilabel>Port</guilabel> entry.
tr: Aşağıda, sihirbazın ağ klasörlerini oluşturmak için gereksinim duyduğu bilgilerin bir listesi bulunmaktadır. Belirli bir klasör için bir seçenek yoksa girilmesi gerekmez. &Samba; klasörleri; &eg;. <guilabel>Kapı</guilabel> girdisi gerektirmez.

source: Name:
tr: Ad:

source: This is where you give a name to the network connection. It is limited only by your imagination (or alphabet).
tr: Ağ bağlantısına bir ad verdiğiniz yer burasıdır. Yalnızca hayal gücünüzle sınırlıdır.

source: User:
tr: Kullanıcı:

source: This is the username that will be used to establish the connection.
tr: Bu, bağlantıyı kurmak için kullanılacak kullanıcı adıdır.

source: Server:
tr: Sunucu:

source: This is the address of the server you are attempting to add. It can be an IP address or domain name.
tr: Bu, eklemeye çalıştığınız sunucunun adresidir. Bir IP adresi veya alan adı olabilir.

source: Port:
tr: Kapı:

source: Here you enter the port number you wish to connect to. The defaults are usually sufficient.
tr: Buraya bağlanmak istediğiniz kapı numarasını girin. Öntanımlılar genellikle yeterlidir.

source: Not available for &Microsoft; &Windows; (&Samba;) folders.
tr: &Microsoft; &Windows; (&Samba;) klasörleri için kullanılamaz.

source: Folder:
tr: Klasör:

source: The path to the folder you wish to connect to should go here.
tr: Bağlanmak istediğiniz klasörün yolu buraya gider.

source: Encoding:
tr: Kodlama:

source: Use the items in this list box to select an encoding for &FTP; and ssh connections.
tr: &FTP; ve ssh bağlantıları için bir kodlama seçmek üzere buradaki ögeleri kullanın.

source: Create an icon for this remote folder
tr: Bu uzak klasör için bir simge oluştur

source: If this box is checked an icon will be created allowing access through the remote:/ virtual folder. If it is not checked, a connection will be possible but it will not be accessible from remote:/.
tr: Bu kutu işaretlenirse remote:/ sanal klasörü aracılığıyla erişime izin veren bir simge oluşturulur. İşaretlenmezse bağlantı kurulabilir; ancak remote:/ adresinden erişilemez.

source: The <guilabel>Recent connection:</guilabel> option allows you to re-connect to the last network mount point you connected to using the wizard whether an icon is created or not.
tr: <guilabel>Son bağlantı:</guilabel> seçeneği, bir simge oluşturulmuş olsun veya olmasın, sihirbazı kullanarak bağlandığınız son ağ bağlama noktasına yeniden bağlanmanıza olanak tanır.

source: Use encryption
tr: Şifreleme kullan

source: If checked the ability to make a secure connection will be enabled.
tr: İşaretlenirse güvenli bağlantı kurma özelliği etkinleştirilir.

source: Available only for WebDav folders.
tr: Yalnızca WebDav klasörleri için kullanılabilir.

source: &knetattach; Walkthrough
tr: &knetattach; Kılavuzu

source: This will be a quick walkthrough of the Network Folder Wizard. Don't blink or you might miss it.
tr: Bu, Ağ Klasörü Sihirbazı’nın tez bir incelemesidir. Gözünüzü kırpmayın yoksa kaçırabilirsiniz.

source: Below you see the main window of the Network Folder Wizard. It is here that we choose what type of folder we want to add or connect to. For the purposes of this walkthrough we will be using &FTP;. It contains most of the options you will encounter while using the wizard.
tr: Aşağıda Ağ Klasörü Sihirbazı’nın ana penceresini görüyorsunuz. Eklemek veya bağlanmak istediğimiz klasörün türünü burada seçiyoruz. Bu izlenecek yolun amaçları doğrultusunda &FTP; kullanacağız; bu sihirbazı kullanırken karşılaşacağınız seçeneklerin çoğunu içerir.

source: Here's a screenshot of the &knetattach; main window
tr: İşte &knetattach; ana penceresinin bir ekran görüntüsü

source: OK, so we (as in me) have chosen to add an &FTP; folder. Below you see an example of the type of information you will need to add for your particular &FTP; server. After filling it in we press <guibutton>Save &amp; Connect</guibutton> and wait for the magic. Oh yes, if your server requires validation of some kind you will be prompted at this point before being allowed to connect.
tr: Tamam, biz (yani ben), bir &FTP; klasörü eklemeyi seçtik. Aşağıda, kendi &FTP; sunucunuz için eklemeniz gereken bilgi türlerinin bir örneğini görüyorsunuz. Doldurduktan sonra <guibutton>Kaydet ve Bağlan</guibutton>’a tıklayın ve sihri bekleyin. Ah evet, sunucunuz bir tür doğrulama gerektiriyorsa bu noktada bağlanmanıza izin verilmeden önce sizden istenecektir.

source: Screenshot showing addition of &FTP; Folder using &knetattach;
tr: &knetattach; kullanarak &FTP; klasörü eklemeyi gösteren ekran görüntüsü

source: So now we are all connected now and able to navigate our newly added share. Joy!
tr: Artık hepimiz bağlıyız ve yeni eklenen paylaşımımızda dolaşabiliyoruz. Yaşasın!

source: Screenshot of the connected &FTP; folder
tr: Bağlı &FTP; klasörünün ekran görüntüsü

source: To get back to our network folders all that is necessary is typing <action>remote:/</action> in the location bar of &konqueror; or &dolphin; or select <guilabel>Network</guilabel> from the <guilabel>Places</guilabel> panel.
tr: Ağ klasörlerimize geri dönmek için yapmamız gereken tek şey &konqueror; veya &dolphin; konum çubuğuna <action>remote:/</action> yazmak veya <guilabel>Places</guilabel> panelinden <guilabel>Ağ</guilabel>’ı seçmektir.

source: Screenshot of the remote:/ virtual folder with the added connection
tr: Ekli bağlantıyla birlikte remote:/ sanal klasörünün ekran görüntüsü

source: You can even add new folders from the same location by using the <guilabel>Add a Network Folder</guilabel> link. Well that brings us to the end of our walkthrough (told you it would be quick). I wish you the best of luck in your own network folder adventures ;-)
tr: <guilabel>Ağ Klasörü Ekle</guilabel> bağlantısını kullanarak aynı konumdan yeni klasörler bile ekleyebilirsiniz. Bu da bizi izlenecek yolun sonuna getiriyor (tez olacağını söylemiştim). Kendi ağ klasörü maceralarınızda size bol şans diliyorum ;-)

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Program copyright 2004 &George.Staikos; &George.Staikos.mail;
tr: Program telif hakkı 2004 &George.Staikos; &George.Staikos.mail;

source: Documentation Copyright &copy; 2005 &Orville.Bennett; &Orville.Bennett.mail;
tr: Belgelendirme telif hakkı &copy; 2005 &Orville.Bennett; &Orville.Bennett.mail;

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
