Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/knetwalk.po
Languages: tr

source: The &knetwalk; Handbook
tr: &knetwalk; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Ayhan</firstname><surname>YALÇINSOY</surname><affiliation><address><email>ayhanyalcinsoy@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit> <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: &knetwalk;, a game for system administrators.
tr: &knetwalk;, sistem yöneticileri için bir oyundur.

source: kdegames
tr: kde oyunları

source: game
tr: oyun

source: logic game
tr: mantık oyunu

source: knetwalk
tr: K Geçit

source: Introduction
tr: Giriş

source: Gametype:
tr: Oyun türü:

source: Strategy
tr: Strateji

source: Number of possible players:
tr: Olası en çok oyuncu sayısı:

source: <para>One</para>
tr: <para>Bir</para>

source: &knetwalk; is a single player logic game.
tr: &knetwalk; tek oyunculu bir mantık oyunudur.

source: The object of the game is to start the LAN, connecting all the terminals to the server, in as few turns as possible.
tr: Oyunun amacı LAN’ı başlatmak, tüm uçbirimleri sunucuya olabildiğince az turda bağlamaktır.

source: How to Play
tr: Nasıl Oynanır

source: Objective:
tr: Hedef:

source: Connect each client with the server, without leaving wires unconnected.
tr: Kabloları bağlantısız bırakmadan her bir istemciyi sunucuya bağlayın.

source: &knetwalk; Game Board
tr: &knetwalk; Oyun Panosu

source: The player is presented with a rectangular grid containing a server, several terminals, and pieces of wire. The object of the game is to rotate these elements until every client is connected to the server, and no wires are left unconnected. Optionally, you can try to get a high score by minimizing the number of rotations needed.
tr: Oyuncuya bir sunucu, birkaç uçbirim ve kablo parçaları içeren dikdörtgen bir ızgara sunulur. Oyunun amacı, her istemci sunucuya bağlanana ve hiçbir kablo bağlantısız kalmayana kadar bu öğeleri döndürmektir. İsteğe bağlı olarak, gereken döndürme sayısını en aza indirerek yüksek bir puan elde etmeye çalışabilirsiniz.

source: Left clicking on a square rotates it counterclockwise, while right clicking rotates it clockwise. Middle clicking on a square marks it as blocked and prevents it from being rotated unless it gets unblocked by another middle click; this can be very useful for marking squares which are known to be in the correct orientation. The status bar displays the number of clicks so far.
tr: Bir kareye sol tıklamak onu saat yönünün tersine, sağ tıklamak ise saat yönünde döndürür. Bir karenin ortasına tıklamak onu engellenmiş olarak işaretler ve başka bir orta tıklama ile engellenmediği sürece döndürülmesini engeller; bu, doğru yönde olduğu bilinen kareleri işaretlemek için çok yararlı olabilir. Durum çubuğu o ana kadarki tıklama sayısını gösterir.

source: Game Rules, Strategies and Tips
tr: Oyun Kuralları, Stratejileri ve İpuçları

source: Rules
tr: Kurallar

source: There is only one possible correct solution for every game.
tr: Her oyun için sadece bir tek doğru çözüm vardır.

source: When playing the <guilabel>Very hard</guilabel> difficulty level, connections can wrap from left to right and from top to bottom.
tr: <guilabel>Çok zor</guilabel> zorluk düzeyinde oynarken, bağlantılar soldan sağa ve yukarıdan aşağıya doğru sarılabilir.

source: The game ends when every terminal and every wire is connected to the server.
tr: Her bir terminal ve her bir kablo sunucuya bağlandığında oyun sona erer.

source: The score rewards the least number of clicks it took to complete the game. The smaller this number, better.
tr: Puan, oyunu tamamlamak için gereken en az tıklama sayısını ödüllendirir. Bu sayı ne kadar küçükse o kadar iyidir.

source: Strategies and Tips
tr: Stratejiler ve İpuçları

source: Start seeking for squares which orientation can be easily determined.
tr: Yönü kolayca belirlenebilen kareler aramaya başlayın.

source: Once you are sure of the orientation of a square you can mark it using the &MMB;. This is particularly usefull in harder games.
tr: Bir karenin yönünden emin olduğunuzda &MMB;’yi kullanarak onu imleyebilirsiniz. Bu özellikle zor oyunlarda kullanışlıdır.

source: Look for I-shaped and T-shaped wires near the borders, and L-shaped wires near the edges. The position of these squares can be easily determined, unless you are playing the <guilabel>Very hard</guilabel> difficulty level.
tr: Sınırların yakınında I ve T şeklindeki telleri ve kenarların yakınında L şeklindeki telleri arayın. <guilabel>Çok zor</guilabel> zorluk düzeyinde oynamadığınız sürece bu karelerin konumu kolayca belirlenebilir.

source: When playing the <guilabel>Very hard</guilabel> difficulty level a good place to start looking is near empty squares, if present, and near regions containing many terminals grouped together.
tr: <guilabel>Çok zor</guilabel> zorluk düzeyinde oynarken, aramaya başlamak için iyi bir yer, varsa boş karelerin yakınları ve bir arada gruplanmış birçok uçbirim içeren bölgelerin yakınlarıdır.

source: Even when playing with the same difficulty level some games are easier than others, restart the game if you want to get a different board.
tr: Aynı zorluk düzeyinde oynarken bile bazı oyunlar diğerlerinden daha kolaydır, farklı bir tahta almak istiyorsanız oyunu yeniden başlatın.

source: If you want to get a good score, only do a move when you are sure.
tr: İyi bir puan almak istiyorsanız bir hareketi yalnızca emin olduğunuzda yapın.

source: Interface Overview
tr: Arayüze Genel Bakış

source: Menu Items
tr: Menü Ögeleri

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Oyun</guimenu> <guimenuitem>Yeni</guimenuitem>

source: Starts a new game. It creates a random board using the current difficulty level.
tr: Yeni bir oyun başlatır. Geçerli zorluk düzeyini kullanarak rastgele bir tahta oluşturur.

source: <shortcut><keycap>P</keycap></shortcut> <guimenu>Game</guimenu> <guimenuitem>Pause</guimenuitem>
tr: <shortcut><keycap>P</keycap></shortcut> <guimenu>Oyunl</guimenu> <guimenuitem>Duraklat</guimenuitem>

source: Pauses the game time. Click on the menu item again to make the game resume. Note that the board disappears when the game is paused as it would be unfair if you could search for good moves without the time pressure.
tr: Oyun süresini duraklatır. Oyunun sürmesi için menü ögesine yeniden tıklayın. Zaman baskısı olmadan iyi hamleleri arayabilmeniz haksızlık olacağından, oyun duraklatıldığında tahtanın kaybolduğunu unutmayın.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Show High Scores</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Oyun</guimenu> <guimenuitem>Yüksek Puanları Göster</guimenuitem>

source: Shows a dialog containing the High Scores for the various difficulty levels.
tr: Çeşitli zorluk düzeyleri için Yüksek Skorlar’ı içeren bir iletişim kutusu gösterir.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Oyun</guimenu> <guimenuitem>Çık</guimenuitem>

source: Quits the program.
tr: Programdan çıkar.

source: <guimenu>Move</guimenu> <guimenuitem>Solve</guimenuitem>
tr: <guimenu>Taşı</guimenu> <guimenuitem>Çöz</guimenuitem>

source: Use it to give up a game. It shows you the solution, but the record will not be considered as a high score.
tr: Bir oyunu bırakmak için kullanın. Size çözümü gösterir; ancak kayıt bir yüksek puan olarak değerlendirilmez.

source: <guimenu>Move</guimenu> <guimenuitem>Unlock All</guimenuitem>
tr: <guimenu>Taşı</guimenu> <guimenuitem>Tümünün Kilidini Aç</guimenuitem>

source: Unlock all cells which were previously locked by the player using &Space; or automatically after checking <guilabel>Auto lock</guilabel> option on <link linkend="config_general"><guilabel>General</guilabel> page</link> of <guilabel>Configure - &knetwalk;</guilabel> dialog.
tr: Daha önceden kilitlenen tüm hücrelerin kilidini elle veya denetim sonrası kendiliğinden açmak için <guilabel>&knetwalk; Uygulamasını Yapılandır…</guilabel> penceresinin <link linkend="config_general"><guilabel>Genel</guilabel> sayfasındaki</link> <guilabel>Kendiliğinden kilitle</guilabel> seçeneğini kullanarak veya &Space; düğmesine basarak yapabilirsiniz.

source: <guimenu>Settings</guimenu> <guisubmenu>Difficulty</guisubmenu>
tr: <guimenu>Ayarlar</guimenu> <guisubmenu>Zorluk</guisubmenu>

source: Lets you set the difficulty level from a sub-menu.
tr: Bir alt menüden zorluk düzeyini ayarlamanızı sağlar.

source: There are five levels of difficulty:
tr: Beş zorluk düzeyi vardır:

source: <guimenuitem>Easy</guimenuitem>: 5 rows, 5 columns, without wrapping.
tr: <guimenuitem>Kolay</guimenuitem>: 5 satır, 5 sütun

source: <guimenuitem>Medium</guimenuitem>: 7 rows, 7 columns, without wrapping.
tr: <guimenuitem>Orta</guimenuitem>:7 satır, 7 sütun

source: <guimenuitem>Hard</guimenuitem>: 9 rows, 9 columns, without wrapping.
tr: <guimenuitem>Zor</guimenuitem>:9 satır, 9 sütun

source: <guimenuitem>Very hard</guimenuitem>: 9 rows, 9 columns, with wrapping.
tr: <guimenuitem>Çok zor</guimenuitem>:9 satır, 9 sütun; kaydırmalı

source: <guimenuitem>Custom</guimenuitem>: The settings you have configured in the <link linkend="config_custom_game"><guilabel>Configure - &knetwalk;</guilabel> dialog</link> will be used.
tr: <guimenuitem>Özel</guimenuitem>: <link linkend="config_custom_game"><guilabel>&knetwalk; Uygulamasını Yapılandır…</guilabel> iletişim kutusunda</link> belirlediğiniz ayarlar kullanılacaktır.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &knetwalk;…</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>&knetwalk; Uygulamasını Yapılandır…</guimenuitem>

source: <action>Open <guilabel>Configure - &knetwalk;</guilabel> dialog.</action> Please see <link linkend="configuration">Game Configuration</link> for more information.
tr: Daha fazla bilgi için <action>&knetwalk; Uygulamasını Yapılandır…</action> sayfasını açıp <link linkend="configuration">Oyun Yapılandırması</link> bölümüne bakın.

source: Additionally &knetwalk; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/menus.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/menus.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
tr: Ek olarak &knetwalk;, ortak &kde; <guimenu>Ayarlar</guimenu> ve <guimenu>Yardım</guimenu> menü ögelerini kullanın. Daha fazla bilgi için &kde; temellerinin <ulink url="help:/fundamentals/menus.html#menus-settings">Ayarlar Menüsü</ulink> ve <ulink url="help:/fundamentals/menus.html#menus-help">Yardım Menüsü</ulink> menülerine bakın.

source: Game Configuration
tr: Oyun Yapılandırması

source: To open the <guilabel>Configure - &knetwalk;</guilabel> dialog, select the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &knetwalk;…</guimenuitem></menuchoice> menu item.
tr: <guilabel>&knetwalk; Uygulamasını Yapılandır</guilabel> iletişim kutusunua açmak için <menuchoice><guimenu>Ayarlar</guimenu> <guimenuitem>&knetwalk; Uygulamasını Yapılandır…</guimenuitem></menuchoice> menü ögesini seçin.

source: General
tr: Genel

source: Using this page you can change the following game settings.
tr: Bu sayfayı kullanarak aşağıdaki oyun ayarlarını değiştirebilirsiniz.

source: Play sounds
tr: Sesleri çal

source: If checked, &knetwalk; game sounds are played.
tr: İşaretlenirse &knetwalk; oyun sesleri çalınır.

source: Auto lock
tr: Kendiliğinden kilitle

source: If checked, &knetwalk; will automatically lock cell after rotation.
tr: İşaretlenirse &knetwalk;, döndürmeden sonra kendiliğinden hücreyi kilitler.

source: Reverse mouse buttons
tr: Ters fare düğmeleri

source: If checked, &knetwalk; uses the left click for the clockwise rotation and the right click for the counter-clockwise rotation.
tr: İşaretlenirse &knetwalk;, saat yönünde döndürme için sol tıklamayı ve saat yönünün tersine döndürme için sağ tıklamayı kullanır.

source: Rotate duration:
tr: Döndürme süresi:

source: Here you can determine the time needed to animate a single cell rotation.
tr: Burada tek bir hücre dönüşünü canlandırmak için gereken süreyi belirleyebilirsiniz.

source: Theme
tr: Tema

source: To select the theme you want to play, go to the <guilabel>Theme</guilabel> section. The theme is loaded by clicking on <guibutton>OK</guibutton> or <guibutton>Apply</guibutton>. The current game will be ended and a new one started. You can click on the <guibutton>Defaults</guibutton> button to restore the default theme.
tr: Oynatmak istediğiniz temayı seçmek için <guilabel>Tema</guilabel> bölümüne gidin. Tema, <guibutton>Tamam</guibutton> veya <guibutton>Uygula</guibutton> seçeneklerine tıklanarak yüklenir. Geçerli oyun sonlandırılacak ve yeni bir oyun başlatılacaktır. Öntanımlı temayı geri yüklemek için <guibutton>Öntanımlılar</guibutton> düğmesine tıklayabilirsiniz.

source: Custom Game
tr: Özel Oyun

source: This page can be used to configure custom game settings. You can choose <guilabel>Width:</guilabel> and <guilabel>Height:</guilabel> of the board and check the <guilabel>Wrapping</guilabel> if the board should be wrapped from left to right and from top to bottom.
tr: Bu sayfa özel oyun ayarlarını yapılandırmak için kullanılabilir. Tahtanın <guilabel>Genişlik:</guilabel> ve <guilabel>Yükseklik:</guilabel> değerlerini seçebilir ve tahtanın soldan sağa ve yukarıdan aşağıya sarılması gerekip gerekmediğini <guilabel>Sarma</guilabel> seçeneğini işaretleyebilirsiniz.

source: Shortcuts
tr: Kısayollar

source: The default shortcuts are:
tr: Öntanımlı kısayollar:

source: Start a new game
tr: Yeni bir oyun başlat

source: Pause
tr: Duraklat

source: Show High Scores
tr: Yüksek Puanları Göster

source: Quit
tr: Çık

source: Help
tr: Yardım

source: What's this? help
tr: “Bu Nedir?” yardımı

source: Move left
tr: Sola git

source: &Left; arrow
tr: &Left; Düğmesi

source: Move right
tr: Sağa git

source: &Right; arrow
tr: &Right; Düğmesi

source: Move up
tr: Yukarı git

source: &Up; arrow
tr: &Up; Düğmesi

source: Move down
tr: Aşağı git

source: &Down; arrow
tr: &Down; Düğmesi

source: Turn clockwise
tr: Saat yönünde döndür

source: Turn counterclockwise
tr: Saat yönünün tersine döndür

source: Toggle lock
tr: Kilitle/Kilidi Aç

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Program copyright 2004 - 2007 by Andi Peredri, Thomas Nagy and Fela Winkelmolen <email>fela.kde@gmail.com</email>
tr: Program telif hakkı 2004–2007, Andi Peredri, Thomas Nagy ve Fela Winkelmolen <email>fela.kde@gmail.com</email>

source: Documentation copyright 2007 by Fela Winkelmolen <email>fela.kde@gmail.com</email>
tr: Belgelendirme telif hakkı 2007, Fela Winkelmolen <email>fela.kde@gmail.com</email>

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Ayhan YALÇINSOY <email>ayhanyalcinsoy@gmail.com</email></para> <para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
