Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konqueror.po
Languages: tr

source: To go up the folder tree you can click on the <guiicon>Up</guiicon> button in the Toolbar, use<keycombo action="simul">&Alt;<keysym>Up</keysym></keycombo>, or use the Menubar <menuchoice><guimenu>Go</guimenu><guimenuitem>Up</guimenuitem></menuchoice> option.
tr: Klasör ağacında yukarı çıkmak için araç çubuğundaki <guiicon>Yukarı</guiicon> düğmesine basın, <keycombo action="simul">&Alt;<keysym>Yukarı</keysym></keycombo> kısayolunu kullanın veya menü çubuğundaki <menuchoice><guimenu>Git</guimenu><guimenuitem>Yukarı</guimenuitem></menuchoice> seçeneğini kullanın.

source: To <quote>select</quote> a file or folder in the displayed folder without opening it in any way use the <keysym>up</keysym> and <keysym>down </keysym> arrow keys to move through the items. The selected item will be highlighted and some information about it will be displayed in the Status Bar.
tr: Görüntülenen klasördeki bir dosyayı veya klasörü, onu açmadan seçmek için ögeler arasında dolaşmak üzere <keysym>Yukarı</keysym> ve <keysym>Aşağı</keysym> ok düğmelerini kullanın. Seçili öge vurgulanır ve onun hakkındaki bazı bilgiler durum çubuğunda görüntülenir.

source: Setting the <link linkend="viewmode">View Mode</link> to <guimenuitem> Details</guimenuitem> can help you locate folders in the tree below the current folder; in this mode each folder is shown with a small box at the left. If the box contains a <keycap>&gt;</keycap> sign, <mousebutton>left </mousebutton> clicking on the box (not on the folder name or icon) will display a sub tree showing files and subfolders contained in that folder. The small box will then change to show a <keycap>v</keycap> sign. <mousebutton>Left</mousebutton> click on that to collapse the sub tree. Once you have found the folder you are looking for, <mousebutton>left </mousebutton> click on the folder name or icon to open it.
tr: <link linkend="viewmode">Görünüm Kipi</link>’ni <guimenuitem>Ayrıntılar</guimenuitem> olarak ayarlamak, geçerli klasörün altındaki klasörleri bulmanızda yardımcı olabilir; bu kipte, her bir klasörün sol yanında küçük bir kutu ile gösterilirler. Kutuda bir <keycap>⏵</keycap> işareti varsa ona <mousebutton>sol</mousebutton> tıklamak, (klasör adına veya simgesine değil), o klasörde içerilen alt klasörleri ve dosyaları gösteren bir ağaç görünümünü açar. Küçük kutuda artık bir <keycap>⏷</keycap> işareti gösterilir. Yeniden <mousebutton>sol</mousebutton> tıklarsanız ağaç daraltılır. İstediğiniz klasörü bulduğunuzda ona <mousebutton>sol</mousebutton> tıklayıp açabilirsiniz.

source: You can go directly to any folder by switching with <menuchoice><guimenu>File</guimenu><guimenuitem>Open Location</guimenuitem> </menuchoice> or <keycombo action="simul">&Alt;<keycap>O</keycap> </keycombo> to the Location Bar and typing its path. &konqueror;’s <link linkend="path-complete"> Text Completion</link> feature may be useful when you do this. Don’t forget that in &Linux; / &UNIX; file and folder names are case sensitive.
tr: <menuchoice><guimenu>Dosya</guimenu><guimenuitem>Konum Aç</guimenuitem></menuchoice> veya <keycombo action="simul">&Alt;<keycap>O</keycap></keycombo> yollarını izleyip konum çubuğuna giderek herhangi bir dosyaya veya klasöre doğrudan gidebilirsiniz. Bunu yaparken &konqueror;’un <link linkend="path-complete">Metin Tamamlama</link> özelliği size yardımcı olabilir. &Linux;/&UNIX; sistemlerde, klasör adının BÜYÜK/küçük harf duyarlı olduğunu unutmayın.

source: When you have moved to a new folder you can go back to your previous choice by using the Toolbar <guiicon>Back</guiicon> button, the Menubar <menuchoice><guimenu>Go</guimenu> <guimenuitem>Back</guimenuitem></menuchoice> item, or <keycombo action="simul">&Alt;<keysym>Left</keysym></keycombo>. Once you have gone back you can go forward. Use the Toolbar <guiicon>Forward</guiicon> button, the Menubar <menuchoice><guimenu>Go</guimenu> <guimenuitem>Forward</guimenuitem></menuchoice> item or <keycombo action="simul">&Alt;<keysym>Right</keysym></keycombo>.
tr: Yeni bir klasöre geçtiğinizde eski bulunduğunuz konuma geri gitmek için <guiicon>Geri</guiicon> düğmesini, menü çubuğundan <menuchoice><guimenu>Git</guimenu> <guimenuitem>Geri</guimenuitem></menuchoice> ögesini veya <keycombo action="simul">&Alt;<keysym>Sol</keysym></keycombo> kısayolunu kullanabilirsiniz. Geri gittikten sonra araç çubuğundaki <guiicon>İleri</guiicon> düğmesini, menü çubuğundan <menuchoice><guimenu>Git</guimenu> <guimenuitem>İleri</guimenuitem></menuchoice> ögesini veya <keycombo action="simul">&Alt;<keysym>Sağ</keysym></keycombo> kısayolunu kullanın.

source: Alternatively, you can also choose to enter the parent folder by clicking on the Toolbar <guiicon>Up</guiicon>, the <menuchoice><guimenu>Go</guimenu> <guimenuitem>Up</guimenuitem></menuchoice> item, or with <keycombo action="simul">&Alt;<keysym>Up</keysym></keycombo>.
tr: Alternatif olarak, üst klasöre geçmek için araç çubuğundan <guiicon>Yukarı</guiicon> düğmesine basabilir, menü çubuğundan <menuchoice><guimenu>Git</guimenu> <guimenuitem>Yukarı</guimenuitem></menuchoice> ögesini veya <keycombo action="simul">&Alt;<keysym>Up</keysym></keycombo> kısayolunu kullanabilirsiniz.

source: Click the checkmark at the right of the toolbar <guiicon>Up</guiicon>, <guiicon>Back</guiicon> or <guiicon>Forward</guiicon> buttons or selecting these items in the <guimenu>Go</guimenu> menu brings up a submenu of recently visited locations.
tr: Araç çubuğundaki <guiicon>Yukarı</guiicon>, <guiicon>Geri</guiicon> veya <guiicon>İleri</guiicon> düğmelerinin yanındaki oka tıklamak veya <guimenu>Git</guimenu> menüsünde bu ögeleri seçmek, son ziyaret edilen konumların bir listesini getirir.

source: Finding Files and Folders
tr: Dosyaları ve Klasörleri Bulmak

source: If you don’t know or can’t remember where a file or folder is within your system, then use the shortcut <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> or the Menubar <menuchoice><guimenu>Tools</guimenu><guimenuitem>Find File…</guimenuitem></menuchoice> option. This starts the file finder application &kfind;. See the <ulink url="help:/kfind/index.html">&kfind; Handbook</ulink> for help in using &kfind;.
tr: Bir dosyanın veya klasörün sisteminizde nerede olduğunu anımsayamıyorsanız <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> kısayolunu veya menü çubuğundan <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Dosya Bul…</guimenuitem></menuchoice> seçeneğini kullanın. Bu, &kfind; uygulamasını başlatacaktır. &kfind; kullanımı üzerine yardım için <ulink url="help:/kfind/index.html">&kfind; El Kitabı</ulink>’na bakın.

source: If the name of a file or folder begins with a period (dot), then it is a <quote>hidden</quote> file or folder, and will not normally be shown by &konqueror;. To see hidden files or folders use the Menubar <menuchoice> <guimenu>View</guimenu><guimenuitem>Hidden Files</guimenuitem> </menuchoice> option.
tr: Bir dosyanın veya klasörün adı nokta (.) ile başlıyorsa o bir <quote>gizli</quote> dosya veya klasördür ve normalde &konqueror; içinde görüntülenmez. Gizli dosyaları ve klasörleri görmek için menü çubuğundan <menuchoice> <guimenu>Görünüm</guimenu> <guimenuitem>Gizli Dosyaları Göster</guimenuitem></menuchoice> seçeneğini kullanın.

source: Another reason &konqueror; may not show the file or folder you are looking for is that you may have the <link linkend="konq-plugin"><guilabel> Directory Filter</guilabel></link> plugin set to display only certain types of file.
tr: &konqueror;’un aradığınız dosyayı veya klasörü göstermemesinin başka bir nedeni de <link linkend="konq-plugin"><guilabel>Dizin Süzgeci</guilabel></link> eklentisinin yalnızca belirli dosya türlerini göstermek için ayarlanmış olması olabilir.

source: Removable Devices
tr: Kaldırılabilir Aygıtlar

source: Any removable device (USB stick, &CD; drive or other hard disk partition that you have on your system) will usually appear in the <filename class="directory">/</filename>, <filename class="directory">/media</filename>, <filename class="directory">/mnt</filename> or <filename class="directory">/auto</filename> folder, having a path something like <filename class="directory">/mnt/floppy</filename> or <filename class="directory">/cdrom</filename>. The details will depend on how your system was set up.
tr: Herhangi bir kaldırılabilir aygıt (USB bellek, &CD; sürücüsü veya sisteminizdeki başka bir sabit disk bölüntüsü) genelde <filename class="directory">/ </filename>, <filename class="directory">/media</filename>, <filename class="directory">/mnt</filename> veya <filename class="directory">/auto</filename> klasörlerinde, <filename class="directory">/mnt/floppy</filename> veya <filename class="directory">/cdrom</filename> gibi bir yol ile görünür. Ayrıntılar, sisteminizin nasıl ayarlandığına bağlı olarak değişebilir.

source: &UNIX; / &Linux; requires that you <command>mount</command> a removable device when you have inserted it into the drive, and <command>mount </command> other hard disk partitions when you want to access them. You also need to unmount a removable device before removing it to register that it is no longer available.
tr: &UNIX;/&Linux;, kaldırılabilir bir aygıtı sürücüye taktığınızda ve başka bir sabit disk sürücüsünü kullanmak istediğinizde onları <command>mount</command> (bağla) yapmanızı gerektirir. Bir kaldırılabilir aygıtı çıkarmadan önce onun bağlantısını kesmeniz gerekir ki sistem artık bu aygıta erişmesin.

source: How you do this will depend on your system setup:
tr: Bunu nasıl yapacağınız sistem ayarlarınıza da bağlı olacaktır:

source: Using the <guilabel>Device Notifier</guilabel>
tr: <guilabel>Aygıt Bildiricisi</guilabel>’ni kullanarak

source: In a &kde; session the <ulink url="help:/plasma-desktop/index.html#device-notifier">Device Notifier</ulink> window will popup, when you insert a removable device and allows you to select an appropriate application for this media or only mount the device.
tr: Bir &kde; oturumunda kaldırılabilir bir aygıtı taktığınızda <ulink url="help:/plasma-desktop/index.html#device-notifier">Aygıt Bildiricisi</ulink> penceresi görünür ve bu ortam için uygun bir aygıt seçmenizi veya yalnızca aygıtı bağlamanıza olanak tanır.

source: If you use the <guilabel>Folder View</guilabel> layout for your desktop, you may have icons for removable devices on your desktop, in which case &LMB; click on the icon to mount it. Doing this should also bring up a &konqueror; window showing the contents of the device. To unmount, <mousebutton>right</mousebutton> click on the icon and choose the <guimenuitem>Unmount</guimenuitem> item. Visit the section <link linkend="making">Create New…</link> in this Handbook to see how to create such an icon.
tr: Masaüstünüz için <guilabel>Klasör Görünümü</guilabel> yerleşimini kullanıyorsanız kaldırılabilir aygıtlarınız için masaüstünüzde simgeler görebilirsiniz. Bunlara &LMB; ile tıklamak onları bağlar. Bunu yaptıktan sonra aygıtın içeriğini görebileceğiniz bir &konqueror; penceresi görünmelidir. Bağlantıyı kesmek için simgeye <mousebutton>sağ</mousebutton> tıklayın ve <guimenuitem>Bağlantıyı Kes</guimenuitem> ögesini seçin. Böyle bir simgeyi nasıl oluşturacağınız ile ilgili olarak bu el kitabındaki <link linkend="making">Yeni Oluştur…</link> bölümünü ziyaret edin.

source: Or you can do it the traditional way by typing into a text console window:
tr: Bir metin konsolu penceresine girerek:

source: to mount, for example, the floppy drive, and
tr: … örneğin bir disketi bağlamak için

source: to unmount it (<command>umount</command> not <command>unmount</command>).
tr: … disketin bağlantısını kesmek için (<command>umount</command>, <command>unmount</command> komutu ile aynı şey değildir).

source: Rather than having to open a text console to type the <command>mount </command> or <command>umount</command> commands, you may prefer to use &konqueror;’s <menuchoice><guimenu>Tools</guimenu><guimenuitem>Execute Shell Command</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo>) feature.
tr: <command>mount</command> veya <command>umount</command> komutlarını girmek için bir metin konsolu açmak yerine, &konqueror;’un <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Kabuk Komutu Yürüt</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo>) özelliğini kullanabilirsiniz.

source: Deleting Files and Folders
tr: Dosyaları ve Klasörleri Silmek

source: &konqueror; gives you two ways to dispose of an unwanted file or folder:
tr: &konqueror; ile istenmeyen bir dosya veya klasörü ortadan kaldırmanın iki yolu vardır:

source: You can move it to the <filename>Trash</filename> folder, which is the safest method as you can get it back if you realize that you have made a mistake.
tr: Onu <filename>Çöp Kutusu</filename> klasörüne taşıyabilirsiniz; bu, bir yanlış yaptığınızı anlamanız durumunda en kısa yoldan kurtarabilmeniz için en güvenli yoldur.

source: You can just plain Delete it, which removes the entry from the folder and adds the disk area occupied by the file(s) to the system’s list of free disk areas, in the same way as the <command>rm</command> command.
tr: Onu doğrudan silebilirsiniz; bu, girdiyi doğrudan klasörden kaldırır ve dosya tarafından kullanılan alanı sistemin boş disk alanı listesine bildirir. <command>rm</command> komutu ile aynı şekilde çalışır.

source: If you want to use this feature check the option <guilabel>Show “Delete” menu entries which bypass the trashcan</guilabel> on the <guilabel>File Management</guilabel> settings page.
tr: Bu özelliği kullanmak istiyorsanız <guilabel>Dosya Yönetimi</guilabel> sayfasındaki <guilabel>Çöp kutusuna göndermeden silmek için “Sil” menü girdisini göster</guilabel> seçeneğini işaretleyin.

source: The simplest way to remove a file or folder is to position the mouse pointer over its name or icon and press the &RMB;, which will bring up a menu containing the options <guimenuitem>Move to Trash</guimenuitem> and <guimenuitem>Delete</guimenuitem>.
tr: Bir dosyayı veya klasörü silmenin en kolay yolu, fare işaretçisini üzerine getirip &RMB; ile tıklamaktır. Bu, <guimenuitem>Çöp Kutusuna Taşı</guimenuitem> ve <guimenuitem>Sil</guimenuitem> girdilerini içeren bir menüyü getirecektir.

source: Or, if you have <quote>selected</quote> the item, the Menubar <guimenu>Edit</guimenu> menu will give you the choice of <quote><guimenuitem>Move to Trash</guimenuitem></quote> and <quote><guimenuitem>Delete</guimenuitem></quote> options.
tr: Ögeyi <quote>seçtiyseniz</quote> menü çubuğundan <guimenu>Düzen</guimenu> menüsünde <quote><guimenuitem>Çöp Kutusuna Taşı</guimenuitem></quote> ve <quote><guimenuitem>Sil</guimenuitem></quote> seçeneklerini bulabilirsiniz.

source: <keycap>Del</keycap> will move the selected item or items to Trash.
tr: <keycap>Sil</keycap>, seçili ögeyi çöp kutusuna taşır.

source: <keycombo action="simul">&Shift;<keycap>Del</keycap></keycombo> will really, truly and irrevocably delete the selected item or items.
tr: <keycombo action="simul">&Shift;<keycap>Sil</keycap></keycombo> kısayolu, seçili ögeyi veya ögeleri geri alınamayacak bir biçimde silecektir.

source: You won’t be able to remove a file or folder if you don’t have the necessary permissions.
tr: Gerekli izinlere sahip değilseniz bir dosyayı veya klasörü kaldıramazsınız.

source: Moving and Copying
tr: Taşımak ve Kopyalamak

source: To copy a file or subfolder between folders you can:
tr: Bir dosyayı veya alt klasörü klasörler arasında kopyalamak için şunları yapabilirsiniz:

source: Position the mouse pointer over its name or icon and hold down the &RMB;, which will bring up a menu containing the <guimenuitem>Copy</guimenuitem> option. Choose that.
tr: Fare işaretçisini adının veya simgesinin üzerine getirin ve &RMB; düğmesini basılı tutun; bu, <guimenuitem>Kopyala</guimenuitem> seçeneğini içeren bir menüyü getirir. Onu seçin.

source: Or if the item is <quote>selected</quote> you can use the <guiicon>Copy</guiicon> button on the Toolbar or the Menubar <menuchoice><guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem></menuchoice> item, or the <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> shortcut key combination. You can also select <link linkend="selection">multiple</link> files or folders to copy/move as well.
tr: Öge <quote>seçiliyse</quote> araç çubuğundaki <guiicon>Kopyala</guiicon> düğmesini veya menü çubuğundan <menuchoice><guimenu>Düzen</guimenu> <guimenuitem>Kopyala</guimenuitem></menuchoice> ögesini veya <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> kısayollarını kullanabilirsiniz. Kopyalamak/taşımak için <link linkend="selection">birden çok</link> dosya veya klasör de seçilebilir.

source: Navigate to the folder you want to copy the item into then Paste the item into the new folder by using the Toolbar <guiicon>Paste</guiicon> button or the Menubar <menuchoice><guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem></menuchoice> option or the <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> shortcut, or by moving the mouse pointer to a clear area of the window and holding the &RMB; down to bring up a menu containing the <guimenuitem>Paste</guimenuitem> option.
tr: Ögeyi içine yapıştırmak istediğiniz klasöre gidin ve sonrasında araç çubuğundaki <guiicon>Yapıştır</guiicon> düğmesini veya menü çubuğundan <menuchoice><guimenu>Düzen</guimenu> <guimenuitem>Yapıştır</guimenuitem></menuchoice> seçeneğini veya <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> kısayolunu kullanın. Ek olarak, fare işaretçisini boş bir alana getirip &RMB; ile tıklayarak gelen menüden <guimenuitem>Yapıştır</guimenuitem> seçeneğini kullanabilirsiniz.

source: Moving a file or subfolder between folders can be done in the same way as copying, except that you choose the <guimenuitem>Cut</guimenuitem> option or <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> instead of <guimenuitem>Copy</guimenuitem>. The item that you have <guimenuitem>Cut</guimenuitem> will be removed from the original folder when you do the <guimenuitem>Paste</guimenuitem> into the new folder.
tr: Bir dosyayı veya klasörü, klasörler arasında taşımak yine aynı biçimde yapılabilir, yalnızca bunun için <guimenuitem>Kopyala</guimenuitem> yerine <guimenuitem>Kes</guimenuitem> seçeneğini veya <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> kısayolunu kullanmalısınız. <guimenuitem>Kes</guimenuitem> yaptığınız öge özgün klasörden kaldırılır ve yeni klasöre <guimenuitem>Yapıştır</guimenuitem> yapılır.

source: Using Drag’n Drop
tr: Sürükle ve Bırak Özelliğini Kullanmak

source: &konqueror; also supports Drag and Drop copying and moving of files and folders.
tr: &konqueror;, dosyaların ve klasörlerin taşınmasında/kopyalanmasında Sürükle ve Bırak özelliğini destekler.

source: You can do this by having two instances of &konqueror;, one showing the folder you want to copy from, the other showing the target folder. Position the mouse pointer over the item you wish to copy or move, then, holding the &LMB; pressed, <quote>drag</quote> it to a clear space in the target folder. Release the button and you will be presented with a menu choice of <guimenuitem>Copy Here</guimenuitem>, <guimenuitem>Move Here</guimenuitem> or <guimenuitem>Link Here</guimenuitem>. Take care to <quote>drop</quote> the item into an empty area of the target folder view—dropping it on top of a subfolder will copy or move the item into that folder.
tr: Bunu, &konqueror;’dan iki tane açarak yapabilirsiniz; bir tanesi içinden kopyalamak istediğiniz klasörü, diğeri de içine kopyalamak istediğiniz klasörü göstersin. Fare işaretçisini kopyalamak istediğiniz ögenin üzerine getirin ve &LMB; düğmesini basılı tutarken onu hedef klasördeki boş bir alana <quote>sürükleyin</quote>. Düğmeyi bırakın ve <guimenuitem>Buraya Kopyala</guimenuitem>, <guimenuitem>Buraya Taşı</guimenuitem> veya <guimenuitem>Buraya Bağlantıla</guimenuitem> seçeneklerinin olduğu bir menü göreceksiniz. Ögeyi hedef klasörün boş bir alanına <quote>bırakmaya</quote> özen gösterin — onu bir alt klasörün üzerine bırakmak ögeyi oraya kopyalar veya taşır.

source: You can also set up &konqueror; to show more than one folder within its window and drag &amp; drop between them.
tr: Ayrıca &konqueror;’u penceresinde birden çok klasörü gösterecek biçimde ayarlayabilir ve bu görünümler arasında sürükleyip bırakabilirsiniz.

source: Split Views for Drag &amp; Drop
tr: Bölünmüş Görünümlerde Sürükle ve Bırak

source: This screenshot illustrates the use of the Menubar <menuchoice><guimenu>Window</guimenu> <guimenuitem>Split View Left/Right</guimenuitem></menuchoice> option, also available with the shortcut <keycombo action="simul">&Ctrl;&Shift;<keycap>L</keycap></keycombo>, to split the main &konqueror; window into two views, each showing the contents of a different folder.
tr: Bu ekran görüntüsü, menü çubuğundan <menuchoice><guimenu>Pencere</guimenu> <guimenuitem>Görünümü Sol/Sağ Şeklinde Böl</guimenuitem></menuchoice> seçeneğinin kullanımını gösterir. Ayrıca, ana &konqueror; penceresini ikiye bölmek için <keycombo action="simul">&Ctrl;&Shift;<keycap>L</keycap></keycombo> kısayolunu da kullanabilirsiniz.

source: To be able to show different folders in each view they should not be linked; the little boxes at the bottom right of each view should be empty.
tr: Her görünümde farklı klasörler gösterebilmek için bunların bağlantılı olmaması gerekir; her görünümün sağ alt tarafındaki küçük kutular boş olmalıdır.

source: The <quote>active</quote> view, that is the one whose path is shown in the Location Toolbar and which responds to navigation and Menubar commands, is shown by the little green light in the bottom left corner. To make a view active, <mousebutton>left</mousebutton> click on an empty area of the view or on its Status Bar.
tr: <quote>Etkin</quote> görünüm; yani, yolu konum çubuğunda gösterilen ve dolaşım ve menü bar komutlarına yanıt veren görünüm, sol alt köşedeki küçük yeşil ışıkla gösterilir. Bir görünümü etkin yapmak için üzerindeyken veya durum çubuğundayken boş bir yere <mousebutton>sol</mousebutton> fare düğmesiyle tıklayın.

source: To remove an active view from &konqueror;’s window use the <keycombo action="simul">&Ctrl;&Shift;<keycap>W</keycap></keycombo> shortcut, or the Menubar <menuchoice><guimenu>Window</guimenu><guimenuitem>Close Active View</guimenuitem></menuchoice> option, or &RMB; click on the Status Bar and choose the <guimenuitem>Close View</guimenuitem> option from the resulting menu.
tr: &konqueror;’un penceresinden bir etkin görünümü kaldırmak için <keycombo action="simul">&Ctrl;&Shift;<keycap>W</keycap></keycombo> kısayolunu veya menü çubuğundan <menuchoice><guimenu>Pencere</guimenu><guimenuitem>Etkin Görünümü Kapat</guimenuitem></menuchoice> seçeneğini veya durum çubuğunda &RMB; tıklayıp açılan menüden <guimenuitem>Görünümü Kapat</guimenuitem> ögesini kullanın.

source: If you use &konqueror; tabs, you can drag and drop between tabs by dragging the file to the tab label, without letting go yet. The destination tab will pop to the front, allowing you to continue dragging and then to drop the file.
tr: &konqueror; sekmelerini kullanıyorsanız sekmeler arasında dosyayı sekme etiketine sürükleyip henüz bırakmadan bekleyin. Hedef sekme öne gelip dosyayı bırakmayı bitirmenize olanak tanıyacaktır.

source: Duplicate File or Folder Names
tr: Dosya veya Klasör Adlarını Çoğalt

source: If you try to paste a file or folder into a folder that already contains an item with the same name, &konqueror; will pop up a dialog box warning you that the item already exists. You can then choose to:
tr: Eğer bir dosya veya klasörü halihazırda aynı adda bir öge içeren bir klasöre yapıştırmaya çalışırsanız &konqueror; ögenin var olduğuna dair sizi uyaran bir iletişim kutusu açacaktır. Daha sonra şunları seçebilirsiniz:
