Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konqueror.po
Languages: tr

source: Clicking the &RMB; on almost any part of &konqueror;’s window will bring up an appropriate context menu.
tr: &konqueror; penceresinin hemen hemen her bir kısmında &RMB; kullanmak, uygun bir bağlam menüsünü getirecektir.

source: If you have enabled the <guilabel>Right click goes back in history</guilabel> option in &konqueror;’s <link linkend="othersettings"> configuration</link> settings a simple <mousebutton>right</mousebutton> click is equivalent to clicking on the <guibutton>Back</guibutton> button. In this case you can access the context menu by moving the mouse with the <mousebutton>right</mousebutton> button held down.
tr: &konqueror;’un <link linkend="othersettings">yapılandırmasındaki</link> <guilabel>Sağ tık geçmişte geriye gider</guilabel> seçeneğini etkinleştirdiyseniz sağ tıklamak, <guibutton>Geri</guibutton> düğmesine basmakla eşdeğerdir. Bu durumda bağlam menüsüne, <mousebutton>sağ</mousebutton> fare düğmesini basılı tutarken fareyi hareket ettirerek erişebilirsiniz.

source: On the Titlebar
tr: Başlık Çubuğunda

source: <mousebutton>Right</mousebutton> clicking on any free area of the Titlebar brings up the Titlebar Menu, allowing you to control the position of &konqueror;’s window as well as the decoration applied to all &kde; program windows.
tr: Başlık çubuğunun herhangi bir yerinde <mousebutton>sağ</mousebutton> tıklamak, başlık çubuğu menüsünü getirir. Bu menüden, &konqueror; pencerelerinin ve tüm &kde; programları pencerelerine uygulanan dekorasyonların konumunu denetleyebilirsiniz.

source: On the Main Toolbar
tr: Ana Araç Çubuğunda

source: <mousebutton>Right</mousebutton> click on any free area of the Toolbar to bring up the Toolbar Menu. You can also use the Toolbar Menu to set the size of the buttons on the Toolbar, and whether they are shown as icons, text or both.
tr: Araç çubuğunun herhangi bir yerinde <mousebutton>sağ</mousebutton> tıklamak, araç çubuğu menüsünü getirir. Bu menüden, araç çubuğundaki düğmelerin boyutunu ve görüntülenme biçemini (simge, metin veya her ikisi de) seçebilirsiniz.

source: Unlock the toolbar and you can move it to the top, bottom, left or right of &konqueror;’s window.
tr: Araç çubuğunun kilidini açtığınızda, onu &konqueror; penceresinin üst, alt, sol veya sağ tarafına taşıyabilirsiniz.

source: On the Location Toolbar
tr: Konum Araç Çubuğunda

source: <mousebutton>Right</mousebutton> click in the &URL; entry box area to perform Cut, Copy, Paste or Clear operations in this area, or to change the automatic <link linkend="path-complete">Text Completion</link> features.
tr: Kes, kopyala, yapıştır eylemlerini ve <link linkend="path-complete">Metin Tamamlama</link> özelliklerini gerçekleştirmek için &URL; giriş kutusu alanında <mousebutton>sağ</mousebutton> tıklayın.

source: Within a View
tr: Görünüm İçinde

source: If you <mousebutton>right</mousebutton> click on any free area of a view then you will get a menu that contains, among other options, the <guiicon>Up</guiicon>, <guiicon>Back</guiicon>, <guiicon>Forward</guiicon> and <guiicon>Reload</guiicon> navigation commands.
tr: Görünümün herhangi bir yerinde <mousebutton>sağ</mousebutton> tıklarsanız <guiicon>Yukarı</guiicon>, <guiicon>Geri</guiicon>, <guiicon>İleri</guiicon> ve <guiicon>Yeniden Yükle</guiicon> dolaşım komutlarının yanında başka komutları da içeren bir menü açılır.

source: On a File or Folder
tr: Dosya veya Klasör Üzerinde

source: This is a most useful feature. <mousebutton>Right</mousebutton> clicking on the name or icon of any file or folder not only <quote>selects</quote> that item but also brings up a menu allowing you to <guimenuitem>Cut</guimenuitem>, <guimenuitem>Move</guimenuitem>, <guimenuitem>Copy</guimenuitem> or <guimenuitem>Remove</guimenuitem> the item in various ways, open it with the program of your choice or preview it, rename it, or edit the file type or properties.
tr: Bu, en kullanışlı özelliklerden biridir. Bir dosyanın veya klasörün adının veya simgesinin üzerinde <mousebutton>sağ</mousebutton> tıklamak hem onu <quote>seçer</quote> hem de bu ögeyi çeşitli yollarla <guimenuitem>kesmenize</guimenuitem>, <guimenuitem>taşımanıza</guimenuitem>, <guimenuitem>kopyalamanıza</guimenuitem> veya <guimenuitem>kaldırmanıza</guimenuitem> izin veren bir menü açılır. Bu menüden, dosyayı hangi programla açmak istediğinizi de seçebilmenizin yanı sıra onu önizleyebilir, yeniden adlandırabilir veya dosya türünü/özelliklerini düzenleyebilirsiniz.

source: On the Status Bar
tr: Durum Çubuğunda

source: <mousebutton>Right</mousebutton> click on the Status Bar at the bottom of a window or view to add or remove a view and lock or link views within &konqueror;’s window.
tr: Bir görünümü eklemek veya kaldırmak için görünümleri &konqueror; penceresinde kilitlemek veya bağlantı oluşturmak için pencerenin altındaki durum çubuğuna <mousebutton>sağ</mousebutton> tıklayın.

source: Viewing Help, Man and Info Pages
tr: Yardım, Kılavuz ve Bilgi Sayfalarını Görüntülemek

source: You can view &kde; Help and &UNIX; Man and Info pages directly in &konqueror;, without having to start up &khelpcenter;.
tr: &kde; yardımını ve &Unix; kılavuz ve bilgi sayfalarını doğrudan &konqueror; üzerinden, &khelpcenter; uygulamasını başlatmadan görüntüleyebilirsiniz.

source: To view a &kde; Help page, enter <userinput>help:/<replaceable>application name</replaceable></userinput> (for example <userinput>help:/<replaceable>kmail</replaceable></userinput> to view the &kmail; documentation.) into &konqueror;’s Location Toolbar window.
tr: Bir &kde; yardım sayfasını görüntülemek için <userinput>help:/<replaceable>uygulama adı</replaceable></userinput> girişini &konqueror;’un konum araç çubuğuna girin (örneğin, &kmail; belgelendirmesini görüntülemek için <userinput>help:/<replaceable>kmail</replaceable></userinput> yazın).

source: If you want to read &UNIX; Man pages &konqueror; makes it easy. For example type <userinput>man:/touch</userinput> or <userinput>#touch</userinput> into the Location Toolbar to see the page for the <command>touch</command> command.
tr: &konqueror;, &UNIX; kılavuz sayfalarını okumayı pek kolaylaştırır. Örneğin, <command>touch</command> komutu için olan kılavuz sayfasını görüntülemek için konum araç çubuğuna <userinput>man:/touch</userinput> veya <userinput>#touch</userinput> yazın.

source: To browse through &UNIX; Info pages, entering <userinput>info:/dir</userinput> takes you to Info’s top level directory, then it’s just a matter of clicking on the right links to find the page you want. Alternatively, use <userinput>info:/<replaceable>command name</replaceable></userinput> to go straight to the Info page you want.
tr: &UNIX; bilgi sayfalarında gezinmek için <userinput>info:/dir</userinput> girmek, sizi bilgi sayfasının en üst düzeyine götürür; buradan artık istediğiniz sayfayı bulmak için bağlantıları izleyebilirsiniz. Alternatif olarak, istediğiniz bilgi sayfasına gitmek için doğrudan <userinput>info:/<replaceable>komut adı</replaceable></userinput> da yazabilirsiniz.

source: Unfortunately, &kde; Help pages are stored in such a way that they cannot be viewed in other browsers. If you really need to do this your only recourse is to go online and visit <ulink url="http://docs.kde.org"> http://docs.kde.org</ulink>.
tr: Ne yazık ki, &kde; yardım sayfaları başka tarayıcılar tarafından görüntülenemeyecek bir biçimde tutulurlar. İlla ki görmeniz gerekiyorsa <ulink url="http://docs.kde.org"> http://docs.kde.org</ulink> adresini kullanabilirsiniz.

source: &konqueror; the File Manager
tr: &konqueror;, Dosya Yöneticisi

source: Folders and Paths
tr: Klasörler ve Yollar

source: In &UNIX; and &Linux; all folders are arranged in a simple hierarchy. Starting from a top level folder (also called the root directory), the structure descends and branches containing various files and subfolders. This means that you can get from any folder to any other by going <quote>up </quote> until you reach a common point then <quote>down</quote> through the appropriate subfolders until you reach your target.
tr: &UNIX; ve &Linux; üzerinde, tüm klasörler temel bir hiyerarşide organize edilirler. Bir üst düzey klasörden başlayarak (kök dizin de denir), yapı aşağıya doğru çeşitli dosyalar ve klasörler içerecek biçimde iner. Bu, <quote>yukarı</quote> ve <quote>aşağı</quote> giderek istediğiniz alt klasörlere erişim sağlayabileceğiniz anlamına gelir.

source: The position of any file or folder in the structure (also called a directory tree) can be described by its <quote>path</quote>, which is a simple list of the folders you would have to descend through to get to the target folder or file. For example <filename class="directory">/home/pam</filename> is the subfolder <filename class="directory">pam</filename> of the subfolder <filename class="directory">home</filename> of the top level folder, and <filename>/home/pam/words.txt</filename> is the file <filename>words.txt </filename> in that subfolder. The leading <quote>/</quote> in these paths represents the top level folder.
tr: Bu yapıda, bir dosyanın veya klasörün konumu (aynı zamanda bir dizin ağacı da denir), onun <quote>yolu</quote> ile açıklanabilir; bu, hedef dosyaya veya klasöre erişmeniz için kat etmeniz gereken bir klasörler listesidir. Örneğin, <filename class="directory">/home/beliz</filename>, üst düzey <filename class="directory">home</filename> klasörünün <filename class="directory">beliz</filename> alt klasörüdür; <filename>/home/beliz/sözler.txt</filename> ise bu alt klasördeki <filename>sözler.txt </filename> dosyasıdır. En baştaki <quote>/</quote>, en üst düzey klasörü temsil eder.

source: Every folder accessible by your system &mdash; including those on other hard disk partitions, a USB device or &CD-ROM; &mdash; will appear in the tree descending from /, their exact paths will depend on how your system was set up (see also the section on <link linkend="removable-devices">Removable Devices</link>).
tr: Sisteminizdeki her klasör &mdash;buna başka sabit disk bölüntüleri, USB aygıtlar veya &CD-ROM; diskleri de dahildir&mdash; ağaçta “/” konumundan aşağıya doğru listelenir; tam yolları sisteminizin nasıl ayarlandığına göre değişebilir (<link linkend="removable-devices">Kaldırılabilir Aygıtlar</link> bölümüne de bir bakın).

source: Every user on a &UNIX; / &Linux; system has their own <quote>home</quote> folder to hold their personal files and settings; for example <filename class="directory">/home/john</filename> and <filename class="directory">/home/mary</filename>. The symbol <keycap>~</keycap> is often used to represent the user’s home folder, so that <filename>~/letter.txt</filename> refers to the file <filename>letter.txt</filename> in my home folder.
tr: &UNIX;/&Linux; sistemlerdeki her bir kullanıcı, kişisel dosyalarını ve ayarlarını depolamak üzere bir <quote>home (ana, ev)</quote> klasörüne sahiptir; örneğin, <filename class="directory">/home/hakan</filename> ve <filename class="directory">/home/umay</filename>. <keycap>~</keycap> sembolü genelde kullanıcının ana klasörünü temsil etmek için kullanılır; yani, <filename>~/mektup.txt</filename> dosyası, ana klasörümdeki <filename>mektup.txt</filename> dosyasını ima eder.

source: Note that the term <quote>directory</quote> is often used instead of <quote>folder</quote>.
tr: <quote>Klasör</quote> teriminin <quote>dizin</quote> ile aynı anlama geldiğini aklınızda bulundurun.

source: View Modes
tr: Görünüm Kipleri

source: In File Manager mode, &konqueror; lists which files and subfolders are contained within a given folder and can provide you with some information about them. The <quote>path</quote> of the current folder is shown in the Location Toolbar. The way that &konqueror; displays the files and folders depends mainly on your choice of view mode which can be selected from the <menuchoice><guimenu>View</guimenu><guisubmenu>View Mode</guisubmenu></menuchoice> sub menu. The view modes &konqueror; provides are outlined below.
tr: Dosya yöneticisi kipinde &konqueror;, verilen bir klasörde hangi dosyaların ve alt klasörlerin içerildiğini listeler ve size onlar hakkında belirli bilgileri verebilir. Geçerli klasörün <quote>yolu</quote> konum çubuğunda gösterilir. &konqueror;’un dosyaları/klasörleri nasıl görüntülediği genelde sizin görünüm kipi tercihinize bağlıdır; bu, <menuchoice><guimenu>Görünüm</guimenu><guisubmenu>Görünüm Kipi</guisubmenu></menuchoice> alt menüsünden ayarlanabilir. &konqueror;’un sahip olduğu görünüm kipleri aşağıda ayrıntılandırılmıştır.

source: In File Manager mode, &konqueror; uses an embedded &dolphin; component. Please refer to the &dolphin; documentation for detailed information about this mode.
tr: Dosya yöneticisi kipinde &konqueror;, gömülü bir &dolphin; bileşenini kullanır. Bu bölüm hakkında ayrıntılı bilgi için lütfen &dolphin; belgelendirmesine başvurun.

source: In the <guibutton>Icons</guibutton> view, which is the default, files will be represented by an icon that visualizes the file type, and a folder icon will be shown for subfolders. The names of folders and files, and the items enabled in <menuchoice><guimenu>View</guimenu><guisubmenu>Additional Information</guisubmenu></menuchoice>, are displayed below the icons.
tr: Öntanımlı <guibutton>Simgeler</guibutton> görünümünde, dosyalar, dosya türünü görselleştiren bir simge ile ve alt klasörler ise bir klasör simgesi ile gösterilir. Klasörlerin, dosyaların ve ögelerin adları <menuchoice><guimenu>Görünüm</guimenu><guisubmenu>Ek Bilgi</guisubmenu></menuchoice> ögesi ile etkinleştirilir ve simgelerin altında görüntülenir.

source: The <guilabel>Compact</guilabel> view shows the folder contents as icons with the name beside it and the items enabled in <menuchoice><guimenu>View</guimenu><guisubmenu>Additional Information</guisubmenu></menuchoice> below the name. The items are grouped in columns similar to the <guilabel>Short View</guilabel> in the &kde; file dialog.
tr: <guilabel>Sıkışık</guilabel> görünüm, klasör içeriğini simgeler olarak ve adını simgenin yanında gösterir. Ek olarak, <menuchoice><guimenu>Görünüm</guimenu><guisubmenu>Ek Bilgileri Göster</guisubmenu></menuchoice> ile etkinleştirilen bilgiler de adın altına yerleştirilir. Ögeler, &kde;’nin dosya iletişim kutusundaki haline benzer bir biçimde sütunlar halinde gruplanırlar.

source: In the <guibutton>Details</guibutton> view, the folder contents are displayed as a detailed list which contains the name, size and last modification time of each item. Additional columns can be added by clicking a column header with the &RMB;.
tr: <guibutton>Ayrıntılar</guibutton> görünümünde, klasör içeriği; her bir ögenin adını, boyutunu ve son değişiklik tarihini içeren ayrıntılı bir liste halinde görüntülenir. Sütun başlığına &RMB; ile tıklayarak ek sütunlar ekleyebilirsiniz.

source: In the context menu of the header line you can choose between custom or automatic column width. Automatic width adjusts the width of all columns once to display the longest item in the column completely, except for the <guilabel>Name</guilabel> column where the extension is replaced by <quote>…</quote>
tr: Üstbilgi satırının bağlam menüsünde özel veya kendiliğinden ayarlı sütun genişliği arasında seçim yapabilirsiniz. Kendiliğinden ayarlı genişlik, sütundaki en geniş ögeyi tümüyle gösterecek biçimde her bir sütunun genişliğini ayarlar. Bunda, <guilabel>Ad</guilabel> sütunu içerilmez; burada genişlik <quote>…</quote> ile değiştirilir.

source: The order of columns can be changed by drag and drop of column headers, except for the <guilabel>Name</guilabel> header, which is always the first column in this view.
tr: Sütunların sırası, <guilabel>Ad</guilabel> sütunu dışında sürükleyip bırakılarak değiştirilebilir. Bu sütun, her zaman görünümdeki ilk sütun olarak kalır.

source: The details view allows you to view the current directory in a tree-like fashion if <guilabel>Expandable folders</guilabel> are enabled: Each subfolder of the current folder can be <quote>expanded</quote> or <quote>collapsed</quote> by clicking on the <guiicon>&gt;</guiicon> or <guiicon>v</guiicon> icon next to it.
tr: Ayrıntılar görünümü, geçerli dizini bir ağaç görünümünde görüntülemenize izin verir; bunun için <guilabel>Genişletilebilir klasörler</guilabel> ayarının açık olması gerekir: Geçerli klasörün her bir alt klasörü, yanındaki <guiicon>˃</guiicon> veya <guiicon>˅</guiicon> simgelerine tıklanarak <quote>genişletilebilir</quote> veya <quote>daraltılabilir</quote>.

source: <screeninfo>Grouped View</screeninfo>
tr: <screeninfo>Gruplandırılmış Görünüm</screeninfo>

source: <phrase>Grouped View</phrase>
tr: <phrase>Gruplandırılmış Görünüm</phrase>

source: All view modes support grouping by the sort type selected in <menuchoice><guimenu>View</guimenu><guisubmenu>Sort by</guisubmenu></menuchoice>
tr: Tüm görünüm kipleri, <menuchoice><guimenu>Görünüm</guimenu><guisubmenu>Şuna Göre Sırala</guisubmenu></menuchoice> ile seçilen türe göre sıralamayı destekler.

source: Information in the View
tr: Görünümdeki Bilgiler

source: In all view modes &konqueror; shows at least an icon and a name for each item. Using <guisubmenu>Additional Information</guisubmenu> in the <guimenu>View</guimenu> menu or the context menu of the header in <guilabel>Details</guilabel> mode, you can select more information for each item to be shown:
tr: Tüm görünüm kiplerinde &konqueror;, her bir öge için en az bir simge ve ad gösterir. <guimenu>Görünüm</guimenu> menüsündeki <guisubmenu>Ek Bilgileri Göster</guisubmenu> ögesini veya <guilabel>Ayrıntılar</guilabel> kipindeki başlığın bağlam menüsünü kullanarak her bir öge için daha fazla bilginin gösterilmesini seçebilirsiniz:

source: <guimenuitem>Size</guimenuitem>, <guimenuitem>Date</guimenuitem>, <guimenuitem>Type</guimenuitem>, <guimenuitem>Rating</guimenuitem>, <guimenuitem>Tags</guimenuitem> or <guimenuitem>Comment</guimenuitem>.
tr: <guimenuitem>Boyut</guimenuitem>, <guimenuitem>Tarih</guimenuitem>, <guimenuitem>Tür</guimenuitem>, <guimenuitem>Derecelendirme</guimenuitem>, <guimenuitem>Künyeler</guimenuitem> veya <guimenuitem>Açıklama</guimenuitem>.

source: Depending on the file type, additionally, the following criteria can be selected:
tr: Dosya türüne bağlı olarak, ek olarak aşağıdaki kriterler seçilebilir:

source: <guimenuitem>Document</guimenuitem>: Number of words and lines
tr: <guimenuitem>Belge</guimenuitem>: Sözcük ve satır sayısı

source: <guimenuitem>Image</guimenuitem>: Size and orientation
tr: <guimenuitem>Görsel</guimenuitem>: Boyut ve yönelim

source: <guimenuitem>Audio</guimenuitem>: Artist, album, duration and track
tr: <guimenuitem>Ses</guimenuitem>: Sanatçı, albüm, süre ve parça

source: The <guisubmenu>Other</guisubmenu> submenu allows to select <guimenuitem>Path</guimenuitem>, <guimenuitem>Link Destination</guimenuitem>, <guimenuitem>Copied From</guimenuitem>, <guimenuitem>Permissions</guimenuitem>, <guimenuitem>Owner</guimenuitem> or <guimenuitem>User Group</guimenuitem>.
tr: <guisubmenu>Diğer</guisubmenu> alt menüsü; <guimenuitem>Yol</guimenuitem>, <guimenuitem>Hedef Konumu</guimenuitem>, <guimenuitem>Şuradan Kopyalandı</guimenuitem>, <guimenuitem>İzinler</guimenuitem>, <guimenuitem>Sahip</guimenuitem> veya <guimenuitem>Kullanıcı Grubu</guimenuitem> bilgisinin seçilmesine de olanak tanır.

source: Folder View Properties
tr: Klasör Görünümü Özellikleri

source: The following settings control how the contents of a folder are displayed in the &konqueror; view, and are stored on a per-folder basis by default:
tr: Aşağıdaki ayarlar, bir klasörün içeriğinin &konqueror; görünümünde nasıl görüntüleneceğini denetler ve öntanımlı olarak klasör bazında saklanır:

source: The view mode (Icons, Compact, Details)
tr: Görünüm kipi (Simgeler, Sıkışık, Ayrıntılı)

source: The sorting of items, which is determined by the sort order (ascending, descending) and the attribute (such as name, size, …) that the items are sorted by
tr: Sıralama düzeni (artan, azalan) ve ögelerin sıralandığı öznitelik (ad, boyut, … gibi) tarafından belirlenen ögelerin sıralanması

source: Sorting of folders and files &ndash; are folders shown first or not?
tr: Klasörlerin ve dosyaların sıralaması &mdash; klasörlerin ilk gösterilip gösterilmeyeceği?

source: Previews &ndash; are they shown instead of icons (based on the settings made in <guilabel>Previews</guilabel> tab of &konqueror;’s General settings) or not?
tr: Simgeler yerine önizlemelerin gösterilip gösterilmeyeceği (&konqueror;’un ayarlarının <guilabel>Önizlemeler</guilabel> sekmesindeki ayarlara göre)?

source: Are items shown in groups in the views?
tr: Görünümlerdeki ögeler gruplar halinde mi gösteriliyor?

source: Are hidden files shown?
tr: Gizli dosyalar gösteriliyor mu?

source: What additional information (besides the name) is shown in the Icons or Details view?
tr: Simgeler veya Ayrıntılar görünümünde, (adın dışında) hangi ek bilgiler gösteriliyor?

source: The view properties can be configured in the <menuchoice><guimenu>View</guimenu></menuchoice> menu, some (such as the view mode) can also be changed using toolbar buttons.
tr: Özellikler, <menuchoice><guimenu>Görünüm</guimenu></menuchoice> menüsünden yapılandırılabilirler, bazıları (görünüm kipi gibi) araç çubuğu düğmeleri kullanılarak da değiştirilebilir.

source: The View Properties Dialog
tr: Görünüm Özellikleri İletişim Kutusu

source: Screenshot of the View Properties dialog
tr: Görünüm Özellikleri iletişim kutusunun ekran görüntüsü

source: The View Properties dialog.
tr: Görünüm Özellikleri iletişim kutusu.

source: The View Properties Dialog.
tr: Görünüm Özellikleri iletişim kutusu.

source: The <guilabel>View Properties</guilabel> dialog can be used to quickly modify several view properties at once. This is done for the current folder, for the current folder including all subfolders, or even for all folders, depending on the choice made in the <guilabel>Apply View Properties To</guilabel> section.
tr: <guilabel>Görünüm Özellikleri</guilabel> iletişim kutusu, birden çok görünüm özelliğinde aynı anda tez değişiklikler yapmak için kullanılabilir. Bu, <guilabel>Şuraya Görünüm Özelliklerini Uygula</guilabel> bölümünde yapılan seçime bağlı olarak; geçerli klasör için tüm alt klasörler içerilecek biçimde geçerli klasör için ve tüm klasör için yapılabilir.

source: If <guilabel>Use these view properties as default</guilabel> is enabled, the chosen view properties will also be used for all folders which do not have customized view properties yet.
tr: <guilabel>Bu görünüm özelliklerini öntanımlı olarak kullan</guilabel> seçeneği etkinleştirilmişse seçili görünüm özellikleri, henüz özelleştirilmiş görünüm özelliklerine sahip olmayan tüm klasörler için kullanılabilir.

source: Navigation
tr: Dolaşım

source: To get to a file with &konqueror; you first need to navigate through the folder tree to find the folder containing that file.
tr: &konqueror; ile bir dosyaya erişmek için öncelikle klasör ağacında o dosyayı içeren klasöre gitmeniz gerekir.

source: To move between folders you can simply step up and down the tree:
tr: Klasörler arasında geçiş yapmak için yalnızca ağaçta aşağı veya yukarı inip çıkabilirsiniz:

source: To descend into a subfolder <mousebutton>left </mousebutton> click on its name or icon —or if you have already <quote>selected</quote> it (see below)— then just press <keysym>Enter</keysym>.
tr: Bir alt klasöre inmek için onun adına veya simgesine <mousebutton>sol</mousebutton> tıklayın —veya halihazırda <quote>seçtiyseniz</quote> (aşağıya bakın)— yalnızca <keysym>Giriş</keysym> düğmesine basın.
