Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konqueror.po
Languages: tr

source: Open another &konqueror; window, duplicating the current one.
tr: Geçerli pencerenin bir kopyasını oluşturarak yeni bir &konqueror; penceresi açın.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>New Tab</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo></shortcut> <guimenu>Pencere</guimenu> <guimenuitem>Yeni Sekme</guimenuitem>

source: Open a new, empty, tab page.
tr: Yeni ve boş bir sekme sayfası açın.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>Duplicate Current Tab</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo></shortcut> <guimenu>Pencere</guimenu> <guimenuitem>Geçerli Sekmeyi Çoğalt</guimenuitem>

source: Open a duplicate tab page.
tr: Geçerli sekmenin bir kopyasını açar.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>Detach Current Tab</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap></keycombo></shortcut> <guimenu>Pencere</guimenu> <guimenuitem>Geçerli Sekmeyi Ayır</guimenuitem>

source: Show the current tab page in a new instance of &konqueror;.
tr: Geçerli sekme sayfasını yeni bir &konqueror; örneğinde gösterin.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>Close Current Tab</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo></shortcut> <guimenu>Pencere</guimenu> <guimenuitem>Geçerli Sekmeyi Kapat</guimenuitem>

source: Close the current tab page.
tr: Geçerli sekme sayfasını kapatın.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Left</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>Move Tab Left</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Sol</keycap></keycombo></shortcut> <guimenu>Pencere</guimenu> <guimenuitem>Sekmeyi Sola Taşı</guimenuitem>

source: Move the current tab one place left in the list of tabs.
tr: Geçerli sekmeyi, sekme listesinde bir adım sola taşır.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Right</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>Move Tab Right</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Sağ</keycap></keycombo></shortcut> <guimenu>Pencere</guimenu> <guimenuitem>Sekmeyi Sağa Taşı</guimenuitem>

source: Move the current tab one place right in the list of tabs.
tr: Geçerli sekmeyi, sekme listesinde bir adım sağa taşır.

source: The Help Menu
tr: Yardım Menüsü

source: Apart from standard &kde; <guimenu>Help</guimenu> menu items described in the section <ulink url="help:/fundamentals/menus.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals you will have the menu entry <guimenuitem>&konqueror; Introduction</guimenuitem> to revisit the introductory pages that you got when &konqueror; was first started.
tr: &kde; Temelleri’nin <ulink url="help:/fundamentals/menus.html#menus-help">Yardım Menüsü</ulink> faslında açıklanan ortak &kde; Yardım menüsü ögelerinin yanı sıra, &konqueror; ilk başlatıldığında gösterilen <guimenuitem>&konqueror; Giriş</guimenuitem> bölümünü açabileceğiniz bir menü girdisi vardır.

source: Questions and Answers
tr: Sorular ve Yanıtlar

source: Can I run &konqueror; from another window manager?
tr: &konqueror;’u başka bir pencere yöneticisinden çalıştırabilir miyim?

source: Just install &Qt;, &kde-frameworks; and &konqueror;, and from your favorite window manager, launch &konqueror;. It should work just fine, but if it doesn’t (&kde; developers don’t test that case often), report it to <ulink url="https://bugs.kde.org">https://bugs.kde.org</ulink> and try running <application>kdeinit</application> before running &konqueror;; it usually helps.
tr: Favori pencere yöneticinizdeyken &Qt;, &kde-frameworks; ve &konqueror; paketlerini kurup &konqueror;’u başlatın. Düzgün çalışmalıdır; ancak çalışmazsa (&kde; geliştiricileri pek sık bu tür durumları sınamayabilirler) <ulink url="https://bugs.kde.org">https://bugs.kde.org</ulink> adresinde bildirin ve &konqueror;’u çalıştırmadan önce <application>kdeinit</application> uygulamasını çalıştırmayı deneyin, genelde yardımcı olur.

source: Where does &konqueror; keep all its configuration data?
tr: &konqueror; yapılandırma verisini nerede tutar?

source: Generally in the <filename class="directory">qtpaths --paths GenericDataLocation</filename> folder (this may be <filename>~/.local/share</filename> on your system, depending on how &konqueror; was installed). Don’t alter these files unless you really know what you are doing.
tr: Genelde <filename class="directory">qtpaths --paths GenericDataLocation</filename> klasöründedir (bu, sisteminizde &konqueror;’un nasıl kurulduğuna bağlı olarak <filename>~/.local/share</filename> konumudur). Ne yaptığınızı bilmiyorsanız bu konumlara ellemeyin.

source: Your bookmarks are held in <filename class="directory">konqueror/bookmarks.xml</filename>
tr: Yer imleriniz <filename class="directory">konqueror/bookmarks.xml</filename> dosyasındadır.

source: Cookies are held in <filename class="directory">kcookiejar/cookies</filename>
tr: Çerezleriniz, <filename class="directory">kcookiejar/cookies</filename> konumundadır.

source: Your history, as used for the auto-completion feature, is in <filename>konq_history</filename> in the folder <filename class="directory">qtpaths --paths GenericConfigLocation</filename>.
tr: Kendiliğinden tamamlama özelliği için de kullanılan geçmişiniz <filename class="directory">qtpaths --paths GenericConfigLocation</filename> klasörünün <filename>konq_history</filename> dosyasındadır.

source: In the folder <filename class="directory">qtpaths --paths GenericConfigLocation</filename> the file <filename>konquerorrc</filename> holds a whole lot of general configuration settings.
tr: <filename class="directory">qtpaths --paths GenericConfigLocation</filename> klasöründeki <filename>konquerorrc</filename> dosyası, genel yapılandırma ayarlarının çoğunu barındırır.

source: The folder <filename class="directory">kio_http/</filename> in <filename class="directory">qtpaths --paths GenericCacheLocation</filename> contains the browser cache.
tr: <filename class="directory">qtpaths --paths GenericCacheLocation</filename> klasöründeki <filename class="directory">kio_http/</filename> dosyası, tarayıcı önbelleğini barındırır.

source: Any folder specific view settings are put into <literal role="extension">.directory</literal> files in the individual folders.
tr: Herhangi bir klasöre özel görünüm ayarları, bireysel klasörlerin içindeki <literal role="extension">.directory</literal> dosyalarındadır.

source: How do I clear out the history file?
tr: Geçmiş dosyasını nasıl temizlerim?

source: There are two <quote>histories</quote>:
tr: İki tane <quote>geçmiş</quote> vardır:

source: One is used for text completion in the Location Toolbar text entry box. To clear this <mousebutton>right</mousebutton> click on the text entry box and select <guimenuitem>Clear History </guimenuitem>.
tr: Bir tanesi, konum çubuğunda metin tamamlama için kullanılır. Bunu temizlemek için metin kutusunda <mousebutton>sağ</mousebutton> tıklayın ve <guimenuitem>Geçmişi Temizle</guimenuitem> ögesini seçin.

source: The other is the log of visited locations. Select <guimenuitem>Show History</guimenuitem> in the menu <guimenu>Go</guimenu> and <mousebutton>right</mousebutton> click on an entry and choose <guimenuitem>Remove Entry</guimenuitem> (&Del;) to remove just that entry or <guimenuitem>Clear History</guimenuitem> to delete all entries.
tr: Diğeri ise ziyaret edilen konumların günlüğüdür. <guimenu>Git</guimenu> menüsünden <guimenuitem>Geçmişi Göster</guimenuitem>’i seçin ve bir girdinin üzerine <mousebutton>sağ</mousebutton> tıklayıp <guimenuitem>Girdiyi Kaldır</guimenuitem>’ı (&Del;) seçin veya tüm girdileri silmek için <guimenuitem>Geçmişi Temizle</guimenuitem>’ye tıklayın.

source: You can also use the application &sweeper; from the kdeutils module which allows you to clean up cookies, favicons, web history and cache, form completion entries and cache policies of visited websites.
tr: Ayrıca kdeutils modülündeki &sweeper; uygulamasını kullanarak çerezleri, site simgelerini, web geçmişini ve önbelleğini, form tamamlama girdilerini ve ziyaret edilen web sitelerinin önbellek politikalarını temizleyebilirsiniz.

source: How do I enable, disable or clear the browser cache?
tr: Tarayıcı önbelleğini nasıl etkinleştiririm, devre dışı bırakırım veya temizlerim?

source: If you select <menuchoice><guimenu>Web Browsing</guimenu><guimenuitem>Cache</guimenuitem></menuchoice> in the dialog launched by selecting <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Konqueror…</guimenuitem></menuchoice>, you will be presented with a dialog box that lets you disable the cache, clear it or set its size, and change the caching policy.
tr: <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Konqueror Uygulamasını Yapılandır…</guimenuitem></menuchoice> iletişim kutusunun <menuchoice><guimenu>Web Tarama</guimenu><guimenuitem>Önbellek</guimenuitem> </menuchoice> sayfasını açarsanız size, önbelleği devre dışı bırakmanıza, temizlemenize veya boyutunu ayarlayıp politikasını kurmaya olanak tanıyacak seçenekler göreceksiniz.

source: How do I set my <quote>home</quote> page—the page loaded on startup?
tr: Başlangıçta yüklenen <quote>ana sayfayı</quote> nasıl ayarlarım?

source: &konqueror; has a <guilabel>Home Folder</guilabel> used in file manager mode and a <guilabel>Home Page</guilabel> used in browser mode.
tr: &konqueror;’da dosya yöneticisi kipinde bir <guilabel>Ana Klasör</guilabel> ve tarayıcı kipinde kullanılan bir <guilabel>Ana Sayfa</guilabel> vardır.

source: To change these settings launch <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Konqueror…</guimenuitem><guilabel>General</guilabel></menuchoice>.
tr: Bu ayarları değiştirmek için <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Konqueror Uygulamasını Yapılandır…</guimenuitem><guilabel>Genel</guilabel></menuchoice> sayfasına bakın.

source: To set the &konqueror; startup page in filemanager mode select <guilabel>Show Introduction Page</guilabel>, <guilabel>Show My Home Page</guilabel>, <guilabel>Show Blank Page</guilabel> or <guilabel>Show My Bookmarks</guilabel> from the drop down box labeled <guilabel>When Konqueror starts</guilabel>.
tr: Dosya yöneticisi kipindeki &konqueror; başlangıç sayfasını belirlemek için <guilabel>Konqueror başlatıldığında</guilabel> şeklinde etiketli açılır menüden <guilabel>Giriş sayfasını göster</guilabel>, <guilabel>Ana sayfamı göster</guilabel>, <guilabel>Boş sayfa göster</guilabel> veya <guilabel>Yer imlerimi göster</guilabel> seçeneklerinden birini seçin.

source: In browser mode &konqueror; starts with the <guilabel>Home page</guilabel> entry.
tr: Tarayıcı kipinde &konqueror;, <guilabel>Ana Sayfa</guilabel> şeklinde etiketli girdiyi kullanır.

source: I can’t find the answer to my question here.
tr: Soruma olan yanıtı burada bulamıyorum.

source: You may find further information in the <ulink url="https://discuss.kde.org/"> KDE Community Forums</ulink> or on <ulink url="http://userbase.kde.org/Konqueror"> Konqueror’s KDE Userbase page</ulink>.
tr: <ulink url="https://discuss.kde.org/">KDE Discuss</ulink> forumunda veya <ulink url="https://userbase.kde.org/Konqueror">Konqueror KDE UserBase</ulink> sayfasında daha fazla bilgi bulabilirsiniz.

source: Program copyright 1999–2025, the &konqueror; developers:
tr: Program telif hakkı 1999–2025, &konqueror; geliştiricileri:

source: developer (parts, JavaScript, I/O lib) and maintainer
tr: geliştirici (part’lar, JavaScript, G/Ç kitaplıkları) ve bakımcı

source: developer (framework, parts)
tr: geliştirici (çatı, part’lar)

source: developer (framework)
tr: geliştirici (çatı)

source: developer
tr: geliştirici

source: developer (list views)
tr: geliştirici (liste görünümleri)

source: developer (list views, I/O lib)
tr: geliştirici (liste görünümleri, G/Ç kitaplığı)

source: developer (<acronym>HTML</acronym> rendering engine)
tr: geliştirici (<acronym>HTML</acronym> sunumu işletkesi)

source: developer (<acronym>HTML</acronym> rendering engine, JavaScript)
tr: geliştirici (<acronym>HTML</acronym> sunumu işletkesi, JavaScript)

source: developer (<acronym>HTML</acronym> rendering engine, I/O lib)
tr: geliştirici (<acronym>HTML</acronym> sunumu işletkesi, G/Ç kitaplığı)

source: developer (I/O lib)
tr: geliştirici (G/Ç kitaplığı)

source: developer (<acronym>HTML</acronym> rendering engine, I/O lib, regression test framework)
tr: geliştirici (<acronym>HTML</acronym> sunumu işletkesi, G/Ç kitaplığı, sınama çatısı)

source: developer (&Java; applet support)
tr: geliştirici (&Java; uygulamacıkları desteği)

source: developer (&Java;2 manager support and other major improvements to applet support)
tr: geliştirici (&Java;2 yönetici desteği ve diğer uygulamacık desteğine büyük katkılar)

source: developer (JavaScript)
tr: geliştirici (JavaScript)

source: developer (&Netscape; plugin support)
tr: geliştirici (&Netscape; eklentileri desteği)

source: developer (SSL support, Netscape plugins)
tr: geliştirici (SSL desteği, Netscape eklentileri)

source: developer (I/O lib, Authentication support)
tr: geliştirici (G/Ç kitaplığı, kimlik doğrulama desteği)

source: Graphics / icons
tr: grafikler ve simgeler

source: kfm author
tr: kfm yazarı

source: developer (navigation panel framework)
tr: geliştirici (dolaşım paneli çatısı)

source: developer (misc stuff)
tr: geliştirici (çeşitli şeyler)

source: JavaScript access controls, per-domain policies extensions, HTML rendering engine
tr: JavaScript erişim denetimleri, alan adı başına politika uzantıları, HTML sunumu işletkesi

source: Developer (HTML rendering engine)
tr: geliştirici (HTML sunumu işletkesi)

source: Developer (HTML rendering engine, JavaScript)
tr: geliştirici (HTML sunumu işletkesi, JavaScript)

source: Apple Safari Developers
tr: Apple Safari Geliştiricileri

source: Developer (Java applets and other embedded objects)
tr: geliştirici (Java uygulamacıkları ve diğer gömülü nesneler)

source: Developer (AdBlock filter)
tr: geliştirici (AdBlock süzgeci)

source: Developer (framework)
tr: geliştirici (çatı)

source: Documentation copyright 2000–2025
tr: Belgelendirme telif hakkı 2000–2025

source: Documentation updated for &kde; 3.2 by &Philip.Rodrigues; &Philip.Rodrigues.mail;.
tr: Belgelendirme, &kde; 3.2 için &Philip.Rodrigues; &Philip.Rodrigues.mail; tarafından güncellendi.

source: Documentation proofreading for &kde; 4.11 by David Palser <email>davidpalser179@btinternet.com</email>.
tr: &kde; 4.11 için belgelendirme düzeltmesi David Palser <email>davidpalser179@btinternet.com</email> tarafından yapıldı.

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Mesutcan Kurt<email>mesutcank@gmail.com</email></para> <para>Çeviri: Emir SARI<email>emir_sari@icloud.com</email></para>
