Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konqueror.po
Languages: tr

source: The &konqueror; Handbook
tr: &konqueror; El Kitabı

source: The &kde; Team
tr: &kde; Takımı

source: Developers
tr: Geliştiriciler

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit> <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: &konqueror; is &kde;’s advanced File Manager, Web Browser and Universal Viewing Application.
tr: &konqueror;, &kde;’nin gelişmiş dosya yöneticisi, web tarayıcısı ve çok özellikli görüntüleme uygulamasıdır.

source: File Manager
tr: Dosya Yöneticisi

source: Browser
tr: Tarayıcı

source: Viewer
tr: Görüntüleyici

source: Overview
tr: Genel Görünüm

source: <emphasis>&konqueror;</emphasis> is an advanced <link linkend="filemanager">file manager</link>, providing file management functions ranging from simple cut/copy and paste operations to advanced local and remote network file browsing. Folder contents can be displayed in a variety of text and icon <link linkend="viewmode">view modes</link>, which can include thumbnail preview images of file contents. File and folder properties can easily be examined and changed, and applications launched with a double click of the &LMB;.
tr: <emphasis>&konqueror;</emphasis>, gelişmiş bir <link linkend="filemanager">dosya yöneticisidir</link>. Temel kes/kopyala/yapıştır eylemlerinden gelişmiş yerel ve uzak dosya taramasına kadar uzanan bir aralıkta dosya yönetimi özellikleri sağlar. Klasör içerikleri çok çeşitli metin ve simge <link linkend="viewmode">görünümü kiplerinde</link> gösterilebilir; bu kipler dosya içeriklerinin küçük bir görsel olarak önizlemesini sunabilir. Dosya ve klasör özellikleri kolaylıkla değiştirilebilir ve uygulamalar tek bir çift tıklamayla başlatılabilir.

source: In &kde; applications, &dolphin; is the default file manager. To change the default component for browsing folders, open <guimenu>Default Applications</guimenu> in the &systemsettings; and select &konqueror; as file manager.
tr: &kde; uygulamalarındaki öntanımlı dosya yöneticisi &dolphin; uygulamasıdır. Klasörlere göz atmak için kullanılan öntanımlı bileşeni değiştirmek için &systemsettings; içindeki <guimenu>Öntanımlı Uygulamalar</guimenu> sayfasına gidip dosya yöneticisi olarak &konqueror;’u seçin.

source: <emphasis>&konqueror;</emphasis> is an <acronym>HTML</acronym> 5 compliant <link linkend="browser">web browser</link> with built-in support for JavaScript (ECMA-262), <acronym>CSS</acronym> (Cascading Style Sheets) and bidirectional scripts (&eg; Arabic, Hebrew and others). It provides <acronym>SSL</acronym> support for secure communications. Advanced features include automatic &URL; and form completion, the ability to import bookmarks from other browsers and tabbed browsing.
tr: <emphasis>&konqueror;</emphasis>; JavaScript (ECMA-262), <acronym>CSS</acronym> (Cascading Style Sheets) ve iki yönlü yazı sistemleri için (&eg; Arapça, İbranice ve diğerleri) için yerleşik destek içeren <acronym>HTML</acronym> 5 uyumlu bir <link linkend="browser">web tarayıcısıdır</link>. Güvenli iletişim için <acronym>SSL</acronym> desteği içerir. Gelişmiş özelliklerinin arasında kendiliğinden &URL; ve form tamamlaması, başka tarayıcılardan yer imlerini içe aktarma ve sekmeli dolaşım bulunur.

source: <emphasis>&konqueror;</emphasis> is also an excellent full featured <link linkend="ftp">FTP</link> client.
tr: <emphasis>&konqueror;</emphasis> ayrıca, mükemmel bir tam özellikli <link linkend="ftp">FTP</link> istemcisidir.

source: <emphasis>&konqueror;</emphasis> is a universal viewing application, capable of displaying images and documents without having to launch another application. It does this by embedding components (&kde; Parts) provided by other applications; from &gwenview;; for image viewing, &okular; for <acronym>PDF</acronym>, &PostScript; and other documents.
tr: <emphasis>&konqueror;</emphasis>, görselleri ve belgeleri görüntülemek için başka bir uygulamayı açmanıza gerek bırakmayan çok amaçlı bir görüntüleme uygulamasıdır. Bunu, diğer uygulamaların bileşenlerini (&kde; Part’larını) kullanarak yapar; örneğin, görseller için &gwenview;; <acronym>PDF</acronym>, &PostScript; ve diğer belgeler için &okular; gibi.

source: <emphasis>&konqueror;</emphasis> is a fully customizable application which anyone can <link linkend="config">configure</link> to suit their own needs, from changing the overall style and the sizes of text and icons to selecting which items appear in the Menubar, changing the number and positions of the toolbars and even defining new shortcut key combinations.
tr: <emphasis>&konqueror;</emphasis>, herkesin kendi gereksinimlerine göre <link linkend="config">yapılandırabileceği</link>, tümüyle özelleştirilebilir bir uygulamadır. Özelleştirilebilecek şeylerin arasında genel biçem, metin ve simge boyutları, menülerde hangi ögelerin görüneceği, araç çubuklarının sayısı ve konumu ve hatta yeni düğme kısayolu kombinasyonları oluşturma bulunur.

source: &konqueror; Basics
tr: &konqueror; Temelleri

source: Like all &kde; applications, &konqueror; is highly configurable. This document describes how &konqueror; behaves with the normal, default settings.
tr: Tüm &kde; uygulamaları gibi, &konqueror; da oldukça yapılandırılabilirdir. Bu belge, &konqueror;’un olağan, öntanımlı ayarlarıyla nasıl davrandığını açıklar.

source: A three button mouse can be useful when you are running &konqueror; or any other &kde; application. If your mouse only has two buttons then you should be able to set your system up so that you can simulate a &MMB; by pressing both buttons at the same time.
tr: Bir üç düğmeli fare, &konqueror;’u veya başka bir &kde; uygulamasını çalıştırırken yararlı olabilir. Farenizde yalnızca iki düğme varsa sisteminizi her iki fare düğmesine aynı anda basarak bir &MMB; basışına öykünebilmeniz için ayarlayabilmeniz gerekir.

source: You can read more about mouse usage in <xref linkend="lmb-mmb"/>
tr: <xref linkend="lmb-mmb"/> bölümünde fare kullanımı ile ilgili daha fazla bilgi alabilirsiniz.

source: Starting &konqueror;
tr: &konqueror;’u Başlatmak

source: From the application launcher menu, select <menuchoice><guisubmenu>Internet</guisubmenu><guimenuitem>Konqueror</guimenuitem></menuchoice> to start it as a browser.
tr: Bir web tarayıcısı olarak başlatmak için uygulama başlatıcısı menüden <menuchoice><guisubmenu>İnternet</guisubmenu><guimenuitem>Konqueror</guimenuitem></menuchoice> girdisini seçin.

source: <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> will open &krunner;, enter a path to a folder and press <keysym>Enter</keysym> to start in file manager mode, or just enter a &URL; such as <userinput>https://www.kde.org</userinput> to start &konqueror; as a browser.
tr: <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> kısayolu &krunner;’ı açacaktır; bir klasör yolunu girin ve <keysym>Giriş</keysym>’a basarak dosya yöneticisi kipinde başlatın. Aynı işlemi bir &URL; için yaptığınızda; örneğin, <userinput>https://www.kde.org</userinput> yazarsanız &konqueror;’ı web tarayıcısı olarak başlatırsınız.

source: Click on the black arrow to the right of the <guiicon>Home Page</guiicon> icon to switch to your <guiicon>Home Folder</guiicon> in the file manager mode and vice versa.
tr: <guiicon>Ana Sayfa</guiicon> simgesinin yanındaki siyah oka tıklayarak <guiicon>Ana Klasör</guiicon>’ünüze iki yönlü olarak geçiş yapabilirsiniz.

source: If &konqueror; is the default file manager, it also starts automatically when you double click on a desktop icon that represents a folder, such as a hard disk drive or the <guiicon>Trash</guiicon> icon.
tr: &konqueror; öntanımlı dosya yöneticisiyse masaüstünde bir klasöre, disk sürücüsüne veya <guiicon>Çöp Kutusu</guiicon> simgesine çift tıklarsanız kendiliğinden başlar.

source: The Parts of &konqueror;
tr: &konqueror;’un Kısımları

source: A brief look at the main parts of &konqueror;’s window:
tr: &konqueror; penceresinin ana kısımlarına bir göz atalım:

source: Here’s a screenshot of &konqueror;
tr: &konqueror; ekran görüntüsüne bakalım.

source: The <interface>Titlebar</interface> is the strip across the top of &konqueror;’s window, and operates in the same way as for other &kde; applications. <mousebutton>Right</mousebutton> click on the central portion to bring up the neat Titlebar menu.
tr: <interface>Başlık Çubuğu</interface>, &konqueror; penceresinin üst kısmındaki şerittir ve diğer &kde; uygulamalarıyla aynı biçimde çalışır. Başlık Çubuğu bağlam menüsünü getirmek için çubuğun üzerindeyken <mousebutton>sağ</mousebutton> fare düğmesiyle tıklayın.

source: The <interface>Menubar</interface> is the strip containing the names of the drop-down menus. <mousebutton>Left</mousebutton> click on a name to alternately show and hide that menu, or use <keycombo action="simul">&Alt;<keycap>the underlined letter</keycap></keycombo> in the name as a hot key, for example <keycombo action="simul">&Alt;<keycap>E</keycap></keycombo> to show the <guimenu>Edit</guimenu> menu. The various menus are described in the <link linkend="menubar">Menubar</link> section of this document.
tr: <interface>Menü Çubuğu</interface>, açılır menülerin bulunduğu şeride verilen addır. Bir menüyü gösterip gizlemek için ona <mousebutton>sol</mousebutton> fare düğmesiyle tıklayın veya menünün adındaki <keycombo action="simul">&Alt;<keycap>altı çizili harfe basın</keycap></keycombo>. Örneğin, <guimenu>Düzen</guimenu> menüsünü göstermek için <keycombo action="simul">&Alt;<keycap>E</keycap></keycombo> kullanın. Çeşitli menüler, bu belgenin <link linkend="menubar">menü çubuğu</link> bölümünde açıklanmıştır.

source: The <interface>Toolbar</interface> contains icons for commonly used operations. <mousebutton>Left</mousebutton> clicking on an icon will activate it. A brief description of what that icon does will appear when you hover the pointer over it.
tr: <interface>Araç Çubuğu</interface>, sıkça kullanılan işlemler için simgeler içerir. Üzerilerinde <mousebutton>sol</mousebutton> fare düğmesiyle tıklamak onu etkinleştirir. Fareyle üzerine gelip biraz beklediğinizde düğmenin ne yaptığını açıklayan bir araç ipucu görünür.

source: Some icons, for example the Up and Back icons in the previous screenshot, have a small black arrow at the right. If you click with the &LMB; at this arrow a small dropdown menu will appear.
tr: Bazı simgeler; örneğin, bir önceki ekran görüntüsündeki yukarı ve aşağı simgelerinin yanında küçük, siyah bir ok vardır. Bu oka &LMB; ile tıklarsanız küçük bir açılır menü görünür.

source: <mousebutton>Right</mousebutton> clicking on the <interface>Toolbar</interface> will bring up the <link linkend="rmb-menus"><guilabel>Toolbar Settings</guilabel> menu</link> which you can use to change the <interface>Toolbar</interface>’s appearance and position.
tr: <interface>Araç Çubuğu</interface> üzerinde <mousebutton>sağ</mousebutton> tıklamak, <link linkend="rmb-menus"><guilabel>Araç Çubuğu Ayarları</guilabel> menüsünü getirir</link>. Buradan, <interface>Araç Çubuğu</interface>’nun görünüşünü ve konumunu değiştirebilirsiniz.

source: The <interface>Location Toolbar</interface> shows the path to the directory, &URL; or file being viewed. You can type a path or &URL; here and press <keysym>Enter</keysym> or <mousebutton>left</mousebutton> click on the <guiicon>Go</guiicon> icon at the right hand end of the <interface>Location Toolbar</interface> to go to it. The black icon at the right hand end of the <interface>Location Toolbar</interface> clears the text entry box.
tr: <interface>Konum Araç Çubuğu</interface>, dizine olan yolu, &URL;’yi veya görüntülenen dosyayı gösterir. Buraya bir yol veya &URL; girebilir ve <keysym>Giriş</keysym> veya <interface>Konum Araç Çubuğu</interface>’nun sağ ucunda bulunan <guiicon>Git</guiicon> düğmesine <mousebutton>sol</mousebutton> fare düğmesiyle basarak adrese gidebiliriz. <interface>Konum Araç Çubuğu</interface>’nun sağ ucundaki siyah simge, metin giriş kutusunu temizler.

source: The <interface>Bookmark Toolbar</interface> is the area under the <interface>Location Toolbar</interface> in the previous screenshot. You can add frequently used bookmarks here; see the <link linkend="bookmarks">Organizing Your Bookmarks</link> section of this document.
tr: <interface>Yer İmi Araç Çubuğu</interface>, bir önceki ekran görüntüsünde <interface>Konum Araç Çubuğu</interface>’nun altındaki alandır. Sıkça kullandığınız yer imlerini buraya ekleyebilirsiniz; ek bilgi için bu belgenin <link linkend="bookmarks">Yer imlerini düzenlemek</link> bölümüne bakın.

source: The <interface>Window</interface> is the main area of &konqueror; and can show you the contents of a directory, web page, document or image. Using the <link linkend="menu-window"><guimenu>Window</guimenu></link> menu you can split &konqueror;’s main window into one or more separate views, useful for drag and drop operations, or set it to contain two or more tabbed views.
tr: <interface>Pencere</interface>, &konqueror;’un ana alanıdır ve size bir dizinin, web sayfasının, belgenin veya görselin içeriğini gösterebilir. <link linkend="menu-window"><guimenu>Pencere</guimenu></link> menüsünün kullanarak &konqueror;’un ana menüsünü bir veya birden çok görünüme ayırabilirsiniz. Bu, sürükle ve bırak işlemleri ve sekmeli çalışma için pek uygundur.

source: The <interface>Status Bar</interface> runs across the bottom of the &konqueror;’s window and often shows general information about whatever the mouse pointer is hovering over. If you have split the main window into a number of views you will get a Status Bar for each view, and it will include a small green light at the left hand end to show which is the <quote>active</quote> view. <mousebutton>Right</mousebutton> clicking on the Status Bar brings up the Status Bar <link linkend="rmb-menus"><mousebutton>Right</mousebutton> Mouse Button Menu</link>.
tr: <interface>Durum Çubuğu</interface>, &konqueror; penceresinin alt kısmında bulunur ve genellikle fare işaretçisinin üzerinde bulunduğu şeyler hakkında genel bilgiler verir. Ana pencereyi birden çok görünüme bölmüşseniz her bir görünüm için ayrı bir durum çubuğu alırsınız ve bunlar, hangi görünümün <quote>etkin</quote> olduğunu belirtmek için bir yeşil ışık sağlar. Durum çubuğunda <mousebutton>sağ</mousebutton> fare düğmesine tıklarsanız bu sizi, durum çubuğunun <link linkend="rmb-menus"><mousebutton>sağ</mousebutton> fare düğmesi menüsünü</link> getirir.

source: Don’t worry if your &konqueror; doesn’t look exactly like this screenshot; it is highly configurable. In particular:
tr: &konqueror; bu ekran görüntüsündeki haline benzemiyorsa endişelenmeyin; büyük oranda yapılandırılabilirdir. Özellikle:

source: You can use the <link linkend="menu-settings"><guimenu>Settings</guimenu></link> menu to choose whether to show or hide the Menubar, Main Toolbar, Location Toolbar and Bookmark Toolbar, or even to add an Extra Toolbar.
tr: Menü çubuğunu, ana araç çubuğunu, konum araç çubuğunu ve yer imleri araç çubuğunu gösterip gizlenmeyi ayarlamak için <link linkend="menu-settings"><guimenu>Ayarlar</guimenu></link> menüsünü kullanın. Hatta ek bir araç çubuğu bile ekleyebilirsiniz.

source: If the toolbars are unlocked, you can also drag them to a new position by <mousebutton>left</mousebutton> clicking on the handle at the left hand end of a bar and move it around by holding the &LMB; down while you drag it.
tr: Araç çubuklarının kilidi açıksa onları <mousebutton>sol</mousebutton> fare düğmesiyle sol taraftaki tutaca tıklayıp &LMB; ile sürükleyerek onları yeni bir konuma taşıyabilirsiniz.

source: For more details of how to change &konqueror;’s appearance, see the <link linkend="config">Configuring &konqueror;</link> section.
tr: &konqueror;’un görünüşünü değiştirmek hakkında daha fazla ayrıntı için <link linkend="config">&konqueror; uygulamasını yapılandırmak</link> bölümüne bakın.

source: Tooltips and What’s This?
tr: Araç ipuçları ve “Bu Nedir?”

source: You can find out a lot about how &konqueror; works without needing to read this entire document if you take advantage of <guilabel>Tooltips</guilabel> and the <guimenuitem>What’s This?</guimenuitem> feature.
tr: <guimenuitem>Araç İpuçları</guimenuitem>’ndan ve <guimenuitem>Bu Nedir?</guimenuitem> özelliğinden yararlanırsanız bu belgenin tamamını okumanıza gerek kalmadan &konqueror;’un nasıl çalıştığı hakkında çok şey öğrenebilirsiniz.

source: When you hover the mouse pointer over a Toolbar tab button it should bring up a terse description of what that button does.
tr: Fare işaretçisini bir Araç Çubuğu sekmesi düğmesinin üzerine getirdiğinizde, bu düğmenin ne işe yaradığına dair kısa bir açıklama gelmelidir.

source: <guimenuitem>What’s This?</guimenuitem> is invoked by the Menubar <menuchoice><guimenu>Help</guimenu><guimenuitem>What’s This?</guimenuitem></menuchoice> item or by <keycombo action="simul">&Shift;<keycap>F1</keycap></keycombo>. It changes the cursor to show a question mark alongside the arrow.
tr: <guimenuitem>Bu Nedir?</guimenuitem>, menü çubuğundaki <menuchoice><guimenu>Yardım</guimenu><guimenuitem>Bu Nedir?</guimenuitem></menuchoice> ögesinden veya <keycombo action="simul">&Shift;<keycap>F1</keycap></keycombo> düğmesi ile çağrılır. İmleci, okun yanında bir soru işareti gösterecek biçimde değiştirir.

source: When this question mark is visible, a &LMB; click won’t actually do anything until you have clicked on a control (or the text alongside it) that supports <guimenuitem>What’s This?</guimenuitem>, in which case it will display a reasonably comprehensive description of what the control does. Most of the dialog boxes that &konqueror; brings up support the <guimenuitem>What’s This?</guimenuitem> feature.
tr: Bu soru işareti görünür olduğunda, &LMB; ile tıklamak, <guimenuitem>Bu Nedir?</guimenuitem> özelliğini destekleyen bir denetime veya yanındaki metne tıklamadığınız sürece bir şey yapmaz. Destekliyorsa denetimin ne yaptığına dair ayrıntılı bir açıklama görünecektir. &konqueror;’un sahip olduğu çoğu iletişim kutusu, <guimenuitem>Bu Nedir?</guimenuitem> özelliğiyle kullanılabilir.

source: <mousebutton>Left</mousebutton> and <mousebutton>Middle</mousebutton> Mouse Button Actions
tr: <mousebutton>Sol</mousebutton> ve <mousebutton>Orta</mousebutton> fare düğmesi eylemleri

source: If you click the &LMB; on an item in &konqueror;’s window, it will be <quote>activated</quote>. Thus
tr: &konqueror; penceresindeki bir ögeye &LMB; ile tıklarsanız etkinleştirilir. Bu durumda,

source: <mousebutton>Left</mousebutton> click on an icon in the Toolbar to perform the action that icon represents.
tr: araç çubuğunda bir eylemi temsil eden bir simgeye <mousebutton>sol</mousebutton> fare düğmesiyle tıklamak o eylem gerçekleştirir.

source: <mousebutton>Left</mousebutton> click on an item in the Menubar to make that menu drop down.
tr: Menü çubuğundaki bir menüyü açmak için üzerindeyken <mousebutton>sol</mousebutton> fare düğmesi ile tıklayın.

source: <mousebutton>Left</mousebutton> click on a menu item to do that thing.
tr: Menüdeki bir eylemi gerçekleştirmek için <mousebutton>sol</mousebutton> fare düğmesini kullanın.

source: <mousebutton>Left</mousebutton> click on an icon in the Bookmark Toolbar to open that &URL;.
tr: Yer imleri araç çubuğundaki bir &URL;’yi açmak için simgesine <mousebutton>sol</mousebutton> fare düğmesiyle tıklayın.

source: <mousebutton>Left</mousebutton> click on a link in a web page to make &konqueror; follow that link.
tr: &konqueror;’un bir bağlantıya gitmesi için bağlantının üzerindeyken <mousebutton>sol</mousebutton> fare düğmesiyle tıklayın.

source: <mousebutton>Left</mousebutton> click on a folder icon or name and &konqueror; will descend into (show the contents of) that folder.
tr: Bir klasör simgesi veya adı üzerindeyken <mousebutton>sol</mousebutton> fare düğmesine basarsanız &konqueror; o klasörün içine girer.

source: <mousebutton>Left</mousebutton> click on a file name or icon and &konqueror; will do whatever it thinks appropriate, based on the file type. In general this means opening <acronym>HTML</acronym> pages, or previewing text, image or &okular; documents, showing them within &konqueror;’s window (<quote>Preview</quote> means that you can see the file but not change it).
tr: Bir dosya adı veya simgesi üzerindeyken <mousebutton>sol</mousebutton> fare düğmesine basarsanız &konqueror;, dosya türüne bağlı olarak o dosya için neyi uygun görürse onu yapacaktır. Genelde bu, <acronym>HTML</acronym> sayfalarını açmak, metinleri, görselleri veya &okular; belgelerini önizlemek, onları &konqueror;’un penceresinde göstermek anlamına gelir (<quote>Önizleme</quote>, dosyayı görüntüleyebilirsiniz; ancak değiştiremezsiniz demektir).

source: &konqueror; decides what the file type is by matching the filename extension against a list of known types. If that fails it tries to guess the type from the file contents. You can change the list of known file types and associated actions with the <guilabel>File Associations</guilabel> page of the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Konqueror… </guimenuitem></menuchoice> dialog.
tr: &konqueror;, dosya adı uzantısını bilinen türlerin bir listesiyle eşleştirerek dosya türünün ne olduğuna karar verir. Bu başarısız olursa dosya içeriğinden türü tahmin etmeye çalışır. Bilinen dosya türlerini ve ilişkili eylemlerini <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Konqueror Uygulamasını Yapılandır…</guimenuitem></menuchoice> iletişim kutusunun <guilabel>Dosya İlişkilendirmeleri</guilabel> sayfasından değiştirebilirsiniz.

source: Clicking the &MMB; on a file or folder name or icon does essentially the same as <mousebutton>left</mousebutton> clicking except that it usually does it in a new &konqueror; window, unless the <guilabel>Open links in new tab instead of in new window</guilabel> box has been checked in the <guimenuitem>General</guimenuitem> page of the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Konqueror…</guimenuitem></menuchoice> dialog. &konqueror; can open links on pages and <menuchoice><guimenu>Bookmarks</guimenu></menuchoice>, as well as the <guibutton>Home</guibutton>, <guibutton>Up</guibutton>, <guibutton>Back</guibutton> and <guibutton>Forward</guibutton> entries in a new tab or window.
tr: Bir dosya veya klasör adı veya simgesi üzerinde &MMB; ile tıklamak, <mousebutton>sol</mousebutton> fare düğmesinin yaptığı şeyi yeni bir &konqueror; penceresinde yapar. Bunun çalışması için <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Konqueror Uygulamasını Yapılandır…</guimenuitem></menuchoice> iletişim kutusunun <guilabel>Genel</guilabel> sayfasındaki <guilabel>Bağlantıları yeni bir sekme yerine yeni pencerede aç</guilabel> kutusunun işaretli olması gerekir. &konqueror;, sayfalardaki ve <menuchoice><guimenu>Yer İmleri</guimenu></menuchoice>’ndeki bağlantıların yanı sıra yeni bir sekme veya penceredeki <guibutton>Ana Sayfa</guibutton>, <guibutton>Yukarı</guibutton>, <guibutton>Geri</guibutton> ve <guibutton>İleri</guibutton> düğmeleriyle gidilen bağlantıları da açabilir.

source: Holding the &Shift; key down while pressing the &MMB; will open the link in the background.
tr: &MMB; basılırken &Shift; düğmesini basılı tutmak, bağlantıyı arka planda açacaktır.

source: <mousebutton>Right</mousebutton> Mouse Button Menus
tr: <mousebutton>Sağ</mousebutton> fare düğmesi menüleri
