Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konqueror.po
Languages: tr

source: For more complex operations, &konqueror; has another nice feature: the Menubar <menuchoice><guimenu>Settings</guimenu><guimenuitem>Show Terminal Emulator</guimenuitem></menuchoice> option, which opens up a terminal window as a new view within &konqueror;.
tr: Daha karmaşık işlemler için &konqueror;’da güzel bir özellik daha vardır: <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Göster: Uçbirim Öykünücüsü</guimenuitem></menuchoice> seçeneği, &konqueror; içinde yeni bir görünüm olarak bir uçbirim penceresi açar.

source: Including the terminal emulator
tr: Uçbirim öykünücüsü içerilir

source: &konqueror; the Web Browser
tr: &konqueror;, Web Tarayıcısı

source: Browsing www.konqueror.org
tr: www.konqueror.org adresine göz atılıyor

source: Surfing and Searching
tr: Sörf Yapma ve Arama

source: Once you have a connection to the Internet, you can surf with &konqueror; just as you can with any other browser.
tr: İnternete bağlandıktan sonra, &konqueror; ile sörf yapabilirsiniz; tıpkı diğer tarayıcılarda olduğu gibi.

source: Type a &URL; into the Location Toolbar window, press <keysym>Enter</keysym> or <mousebutton>left</mousebutton> click on the <guiicon><inlinemediaobject><imageobject> <imagedata fileref="go-jump.png" format="PNG"/> </imageobject></inlinemediaobject></guiicon> <guibutton>Go</guibutton> button at the right hand end of the Location Toolbar, and &konqueror; will download and display that page. If you have visited the page before, &konqueror;’s <link linkend="path-complete">Automatic Text Completion</link> feature can help you type the &URL; a second time. If you want to use one of the web’s search engines, &konqueror;’s Web Search Keywords feature can make this easier.
tr: Konum çubuğuna bir &URL; girin, <keysym>Giriş</keysym> düğmesine basın veya konum çubuğunun sağ ucundaki <guiicon><inlinemediaobject><imageobject> <imagedata fileref="go-jump.png" format="PNG"/> </imageobject></inlinemediaobject></guiicon> <guibutton>Git</guibutton> düğmesine <mousebutton>sol</mousebutton> fare düğmesine tıklayın. &konqueror; o sayfayı indirip görüntüleyecektir. Sayfayı daha önceden ziyaret ettiyseniz &konqueror;’un <link linkend="path-complete">Kendiliğinden Metin Tamamlama</link> özelliği, &URL; bir ikinci kez girerken yardımcı olur. Web’deki arama motorlarından birini kullanmak isterseniz &konqueror;’un <link linkend="enhanced-browsing">Web Arama Anahtar Sözcükleri</link> özelliği bunu daha kolay yapar.

source: <mousebutton>Left</mousebutton> click on a link in a page to open that link.
tr: Bir bağlantıyı açmak için üzerindeyken <mousebutton>sol</mousebutton> fare düğmesi ile tıklayın.

source: To open a link in a new instance of &konqueror;, leaving the old page still visible, &RMB; click on the link and select the <guimenuitem>Open in New Window</guimenuitem> option. Alternatively, you might want to <guimenuitem>Open in New Tab</guimenuitem>. <link linkend="tabbrowse">Tabbed Browsing</link> will let you hold a number of pages in one &konqueror; window and quickly switch between them with a single mouse click.
tr: Bir bağlantıyı &konqueror;’un yeni bir örneğinde açmak için bağlantıya &RMB; ile tıklayın ve <guimenuitem>Yeni Pencerede Aç</guimenuitem> seçeneğini seçin. Alternatif olarak, <guimenuitem>Yeni Bir Sekmede Aç</guimenuitem> seçeneğini kullanmak isteyebilirsiniz. <link linkend="tabbrowse">Sekmeli Tarama</link>, birden çok sayfayı tek bir &konqueror; penceresinde açık tutmanıza ve onlara tek bir fare tıklamasıyla erişmenize olanak tanır.

source: You could also select multiple view modes with <menuchoice><guimenu>Window</guimenu> <guimenuitem>Split View Left/Right</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl; &Shift;<keycap>L</keycap></keycombo>) / <menuchoice><guimenu>Window</guimenu> <guimenuitem>Split View Top/Bottom</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl; &Shift;<keycap>T</keycap></keycombo>) option which will let you see different pages at the same time. This can be useful if you are looking through a complicated set of <acronym>HTML</acronym> pages, but make sure the little link box at the bottom right hand corner is empty when you are doing this.
tr: <menuchoice><guimenu>Pencere</guimenu> <guimenuitem>Görünümü Sol/Sağ Şeklinde Böl</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl; &Shift;<keycap>L</keycap></keycombo>)/<menuchoice><guimenu>Pencere</guimenu> <guimenuitem>Görünümü Alt/Üst Şeklinde Böl</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl; &Shift;<keycap>T</keycap></keycombo>) seçenekleri, aynı anda birden çok web sayfasını görmenize olanak tanır. Bu, özellikle karmaşık bir <acronym>HTML</acronym> sayfaları kümesine bakarken yararlıdır; ancak sağ alt köşedeki bağlantı kutusunun boş olduğundan emin olun.

source: To go back to the previous page use the <keycombo action="simul">&Alt;<keysym>Left</keysym></keycombo> shortcut, the <guibutton>Back</guibutton> button on the Toolbar, or the menubar <menuchoice><guimenu>Go</guimenu> <guimenuitem>Back</guimenuitem></menuchoice> option.
tr: Önceki sayfaya geri gitmek için <keycombo action="simul">&Alt;<keysym>Sol</keysym></keycombo> kısayolunu, araç çubuğundaki <guibutton>Geri</guibutton> düğmesini veya menü çubuğundaki <menuchoice><guimenu>Git</guimenu> <guimenuitem>Geri</guimenuitem></menuchoice> seçeneğini kullanın.

source: Similarly, once you have gone back you can go forward by using <keycombo action="simul">&Alt;<keysym>Right</keysym></keycombo>, the <guibutton>Forward</guibutton> button, or the menubar <menuchoice><guimenu>Go</guimenu> <guimenuitem>Forward</guimenuitem></menuchoice> option.
tr: Benzer bir şekilde, bir kez geri gittikten sonra <keycombo action="simul">&Alt;<keysym>Sağ</keysym></keycombo> kısayolunu, araç çubuğundaki <guibutton>İleri</guibutton> düğmesini veya menü çubuğundaki <menuchoice><guimenu>Git</guimenu> <guimenuitem>İleri</guimenuitem></menuchoice> seçeneğini kullanın.

source: There are multiple ways of scrolling the viewing area. One is to use the <keysym>Up</keysym> and <keysym>Down</keysym> keys. You may also use the scrollbar, your mousewheel or the <keysym>PgUp</keysym> and <keysym>PgDn</keysym> keys.
tr: Görünüm alanını sarmanın birden çok yolu vardır. Bunlardan biri <keysym>Yukarı</keysym> ve <keysym>Aşağı</keysym> düğmeleridir. Ayrıca sarma çubuğunuzu, fare tekerleğinizi veya <keysym>Sayfa Yukarı</keysym> ve <keysym>Sayfa Aşağı</keysym> düğmelerini de kullanabilirsiniz.

source: If you want to stop a download for any reason then use the &Esc; key, the Toolbar <guibutton>Stop</guibutton> button or the Menubar <menuchoice><guimenu>View</guimenu> <guimenuitem>Stop</guimenuitem></menuchoice> item.
tr: Herhangi bir nedenden dolayı bir indirmeyi durdurmak istiyorsanız &Esc; düğmesini, araç çubuğundaki <guibutton>Durdur</guibutton> düğmesini veya menü çubuğundaki <menuchoice><guimenu>Görünüm</guimenu> <guimenuitem>Durdur</guimenuitem></menuchoice> ögesini kullanın.

source: When you are viewing a web page with the <guilabel>HTML Toolbar</guilabel> enabled you should see two new icons in the toolbar <guiicon><inlinemediaobject><imageobject> <imagedata fileref="format-font-size-less.png" format="PNG"/> </imageobject></inlinemediaobject></guiicon> and <guiicon><inlinemediaobject><imageobject> <imagedata fileref="format-font-size-more.png" format="PNG"/> </imageobject></inlinemediaobject></guiicon>. Use these to adjust the size of the text in the page if you find it difficult to read. How well this works will depend on how the web page has been constructed.
tr: <guilabel>HTML Araç Çubuğu</guilabel> etkinken bir web sayfasını görüntülüyorsanız araç çubuğunda iki adet yeni simge görmelisiniz: <guiicon><inlinemediaobject><imageobject> <imagedata fileref="format-font-size-less.png" format="PNG"/> </imageobject></inlinemediaobject></guiicon> ve <guiicon><inlinemediaobject><imageobject> <imagedata fileref="format-font-size-more.png" format="PNG"/> </imageobject></inlinemediaobject></guiicon>. Okumakta zorlanıyorsanız sayfadaki metnin boyutunu ayarlamak için bunları kullanın. Bunun ne kadar iyi çalışacağı web sayfasının nasıl oluşturulduğuna bağlı olacaktır.

source: Tabbed Browsing
tr: Sekmeli Gezinme

source: By using this feature you can make &konqueror; load multiple web pages in the same window, and switch between them using tabbed pages. This way, you can preload a page <quote>in the background</quote> while you carry on reading another.
tr: Bu özelliği kullanarak &konqueror;’un aynı pencerede birden fazla web sayfası yüklemesini ve sekmeli sayfaları kullanarak bunlar arasında geçiş yapmasını sağlayabilirsiniz. Bu şekilde, siz başka bir sayfayı okumayı sürdürürken arka planda bir sayfayı önceden yükleyebilirsiniz.

source: To use tabbed browsing, <mousebutton>right</mousebutton> click on a link and choose <guimenuitem>Open in New Tab</guimenuitem> from the drop down menu or &MMB; click. The page will be downloaded and displayed as normal, but with tabs across the top of the view, one tab for each page. &LMB; click on a tab to view that page, or you can use the shortcuts <keycombo action="simul">&Ctrl;<keycap>,</keycap></keycombo> and <keycombo action="simul">&Ctrl;<keycap>.</keycap></keycombo> to cycle through the tab pages. Alternatively, you can scroll through the tabs using the mouse <mousebutton>wheel</mousebutton> while the mouse pointer is over the tab bar (presuming that your mouse has one). Also, double-clicking over the empty tab bar space will open a new tab.
tr: Sekmeli gezinmeyi kullanmak için bir bağlantıya <mousebutton>sağ</mousebutton> tıklayın ve açılan menüden <guimenuitem>Yeni Sekmede Aç</guimenuitem> ögesini veya bağlantının üzerindeyken &MMB; düğmesini kullanın. Sayfa normal bir biçimde indirilir ve görüntülenir; ancak her bir sayfa için ayrı bir sekmede. O sayfayı görüntülemek için &LMB; ile tıklayın veya sekmeler arasında gezinmek için <keycombo action="simul">&Ctrl;<keycap>,</keycap></keycombo> ve <keycombo action="simul">&Ctrl;<keycap>.</keycap></keycombo> kısayollarını kullanın. Alternatif olarak, fare işaretçisi sekmelerin üzerindeyken fare tekerleğini kullanarak da gezinebilirsiniz. Ayrıca, boş sekme çubuğunda çift tıklamak yeni bir sekme açar.

source: Using the <guilabel>Open new tabs in the background</guilabel> option in the <guilabel>General</guilabel> page of the <guimenu>Settings</guimenu> dialog, clicking on a link downloads the page and shows a new tab for it, but the new page will not be displayed until you <mousebutton>left</mousebutton> click on the tab.
tr: <guimenu>Settings</guimenu> iletişim kutusunun <guilabel>Genel</guilabel> sayfasında <guilabel>Yeni sekmeleri arka planda aç</guilabel> seçeneği işaretliyse bir bağlantıya tıklamak onu yeni bir sekmede açar; ancak siz o sekmeye açıkça tıklayana kadar size gösterilmez.

source: If you check the <guilabel>Open links in new tab instead of in new window</guilabel> box in the <guimenuitem>General</guimenuitem> page of the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Konqueror… </guimenuitem></menuchoice> dialog, &MMB; clicking on a link will open it in a new tab page and if you hold the &Shift; key down while clicking the &MMB; the link will be opened in a background tab page.
tr: <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Konqueror Uygulamasını Yapılandır… </guimenuitem></menuchoice> iletişim kutusunun <guimenuitem>Genel</guimenuitem> sayfasındaki <guilabel>Bağlantıları yeni pencere yerine yeni sekmede aç</guilabel> seçeneği işaretliyse bir bağlantıya &MMB;ile tıklamak onu yeni bir sekme sayfasında açar ve &MMB; basılırken &Shift; düğmesini basılı tutarsanız bağlantı arka planda yeni bir sekmede açılır.

source: <mousebutton>Right</mousebutton> clicking on a tab will bring up a menu with the following options:
tr: Bir sekmeye <mousebutton>sağ</mousebutton> tıklamak, aşağıdaki seçenekleri içeren bir menüyü getirir:

source: <guimenuitem>New Tab</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo>)
tr: <guimenuitem>Yeni Sekme</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo>)

source: This opens a new, blank, tabbed page view. You can then download a web page into it by typing the &URL; into the Location Bar or by making a selection from the Bookmark Toolbar.
tr: Bu yeni, boş, sekmeli bir sayfa görünümü açar. Daha sonra konum çubuğuna &URL; yazarak veya yer imi araç çubuğundan bir seçim yaparak bir web sayfasını indirebilirsiniz.

source: <guimenuitem>Duplicate Tab</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo>)
tr: <guimenuitem>Sekmeyi Çoğalt</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo>)

source: To create a duplicate tabbed page.
tr: Çoğaltılmış sekmeli sayfa oluşturur.

source: <guimenuitem>Reload Tab</guimenuitem> (<keycap>F5</keycap>)
tr: <guimenuitem>Sekmeyi Yeniden Yükle</guimenuitem> (<keycap>F5</keycap>)

source: Reloads the content of the current tab.
tr: Geçerli sekmenin içeriğini yeniden yükler.

source: Other Tabs
tr: Diğer Sekmeler

source: Displays a submenu showing all other tabs. Choosing a tab from this list makes it the active tab.
tr: Diğer tüm sekmeleri gösteren bir alt menü görüntüler. Bu listeden bir sekme seçmek, onu etkin sekme yapar.

source: <menuchoice><guisubmenu>Other Tabs</guisubmenu><guimenuitem>Reload All Tabs</guimenuitem></menuchoice> (<keycombo action="simul">&Shift;<keycap>F5</keycap></keycombo>)
tr: <menuchoice><guisubmenu>Diğer Sekmeler</guisubmenu><guimenuitem>Tüm Sekmeleri Yeniden Yükle</guimenuitem></menuchoice> (<keycombo action="simul">&Shift;<keycap>F5</keycap></keycombo>)

source: Reloads the content of every tab.
tr: Her bir sekmenin içeriğini yeniden yükler.

source: <guisubmenu>Other Tabs</guisubmenu><guimenuitem>Close Other Tabs</guimenuitem>
tr: <guisubmenu>Diğer Sekmeler</guisubmenu><guimenuitem>Diğer Sekmeleri Kapat</guimenuitem>

source: To close all but the selected tab page.
tr: Seçili sekme sayfası dışındaki tüm sekmeleri kapatır.

source: <guimenuitem>Detach Tab</guimenuitem> (<keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap></keycombo>)
tr: <guimenuitem>Sekmeyi Ayır</guimenuitem> (<keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap></keycombo>)

source: This option removes the selected tabbed page from the current &konqueror; window and opens it in a new instance of &konqueror;.
tr: Bu seçenek, seçili sekme sayfasını geçerli &konqueror; penceresinden ayırır ve yeni bir &konqueror; örneğinde açar.

source: <guimenuitem>Close Tab</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo>)
tr: <guimenuitem>Sekmeyi Kapat</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo>)

source: To close the selected tab page.
tr: Seçili sekme sayfasını kapatır.

source: Web Search Keywords
tr: Web Arama Anahtar Sözcükleri

source: If enabled, &konqueror;’s Web Search Keywords feature lets you submit a query directly to a search engine or similar web site without having to visit the site first.
tr: Etkinleştirilirse &konqueror;’un Web Arama Anahtar Sözcükleri özelliği, bir sorguyu önce siteyi ziyaret etmek zorunda kalmadan doğrudan bir arama motoruna veya benzer bir web sitesine göndermenizi sağlar.

source: For example, entering <userinput>gg:konqueror</userinput> into the Location Bar and pressing <keysym>Enter</keysym> will ask <trademark>Google</trademark> to search for items related to &konqueror;.
tr: Örneğin, konum çubuğuna <userinput>gg:konqueror</userinput> yazmak ve <keysym>Giriş</keysym> düğmesine basmak, &konqueror;’un arama sorgusunu doğrudan <trademark>Google</trademark>’a göndermesini sağlar.

source: To see what Web Search Keywords are available, and perhaps add your own, open the <guilabel>Web Search Keywords</guilabel> page in <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Konqueror…</guimenuitem></menuchoice> page.
tr: Hangi anahtar sözcüklerin kullanılabilir olduğunu görmek veya kendi sözcüklerinizi eklemek için <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Konqueror Uygulamasını Yapılandır…</guimenuitem></menuchoice> iletişim kutusunun <guilabel>Web Arama Anahtar Sözcükleri</guilabel> sayfasını kullanın.

source: Access Keys
tr: Erişim Düğmeleri

source: &konqueror; has full support for the <sgmltag class="attribute">accesskey</sgmltag> &HTML; attribute in forms and links. Access keys allow you to use the keyboard keys for functions which would perhaps normally be done with the mouse, such as following links. The benefit of this is, quite simply, that users can interact with a page with devices other than a pointing device.
tr: &konqueror;’da formlardaki <sgmltag class="attribute">accesskey</sgmltag> &HTML; özniteliği için tam destek bulunur. Erişim düğmeleri, normalde fare ile yapılamayacak işlemler için klavye düğmelerini kullanmanıza olanak tanır. Bunun yararı, kullanıcılar bir işaretleme aygıtı olmadan da bir sayfa ile etkileşimde bulunabilirler.

source: This feature has to be enabled by checking the <guilabel>Enable Access Key activation with &Ctrl; key</guilabel> option on the <guilabel>Web Browsing</guilabel> settings page.
tr: Bu özellik, <guilabel>Web Tarama</guilabel> ayar sayfasındaki <guilabel>&Ctrl; düğmesiyle Erişim Düğmesi etkinleştirmesini sağla</guilabel> seçeneği ile etkinleştirilmelidir.

source: To activate the access keys in &konqueror;, press and release &Ctrl;. Once this is pressed, if a particular link on the website has the <sgmltag class="attribute">accesskey</sgmltag> attribute in the given link, then the character(s) should appear over the link, identifying what needs to be pressed. Then, you can enter the character(s) associated with the link as an alternative to following the link with the mouse. To disable the access keys once activated you can press &Ctrl; again.
tr: &konqueror;’da erişim düğmelerini etkinleştirmek için &Ctrl; düğmesine bir kez basın. Basıldıktan sonra web sitesindeki bir bağlantıda <sgmltag class="attribute">accesskey</sgmltag> özniteliği varsa hangi düğmeye basılması gerektiğini söyleyen karakterler belirir. Sonrasında, fare kullanımı yerine bu karakterleri kullanarak bağlantıya gidebilirsiniz. Bunu devre dışı bırakmak için &Ctrl; düğmesine bir kez daha basın.

source: The proper use of this feature requires that the web designer of the page has specifically assigned, using the <sgmltag class="attribute">accesskey</sgmltag> attribute, an access key for the link. Many web designers might not include the <sgmltag class="attribute">accesskey</sgmltag> in their links and forms, and consequently this feature will be unusable on the given webpage.
tr: Bu özelliğin etkin kullanımı için sayfanın tasarımcısının bağlantıya özellikle <sgmltag class="attribute">accesskey</sgmltag> özniteliği erişimini sağlamış olması gerekir. Birçok web tasarımcısı, bağlantılarında ve formlarında <sgmltag class="attribute">accesskey</sgmltag> özniteliğine yer vermezse bu özellik de çoğu yerde kullanılamayacaktır.

source: Browser Identification
tr: Tarayıcı Tanımlaması

source: When &konqueror; connects to a web site it sends some brief browser identification information, known as the <quote>User Agent</quote> string. Many web sites use this information to customize the pages that they send back, based on the strengths and weaknesses of different browsers.
tr: &konqueror; bir web sitesine bağlandığında, basit bir tarayıcı kimliği bilgisini gönderir, buna <quote>User-Agent</quote> dizisi denir. Çoğu web sitesi, bu bilgiyi kullanarak gösterdikleri web sayfasını özelleştirirler.

source: Unfortunately, some badly designed sites refuse to work properly unless you are using a browser that the site recognizes as a <quote>valid</quote> one, even though if given a chance, &konqueror; will work satisfactorily with the vast majority of web pages.
tr: Ne yazık ki bazı kötü bir biçimde tasarlanmış web siteleri, <quote>geçerli</quote> olarak belirledikleri bazı web tarayıcıları dışındakiler için düzgünce çalışmayı reddedebilirler. Bir şans verilirse &konqueror; çoğu web sitesiyle herhangi bir sorun olmadan çalışacaktır.

source: To overcome this problem you can change the browser identification information that &konqueror; sends for specific sites or domains by selecting the <ulink url="help:/kcontrol/useragent/">Browser Identification</ulink> module in the &systemsettings; category <guilabel>Network</guilabel>.
tr: Bu sorunun üstesinden gelmek için &konqueror;’un çeşitli sitelere ve etki alanlarına gönderdiği tarayıcı tanımlaması bilgisini değiştirmek üzere &systemsettings; uygulamasının <guilabel>Ağ</guilabel> kategorisinin <ulink url="help:/kcontrol/useragent/">Tarayıcı Tanımlaması</ulink> modülüne gidin.

source: Problems with getting a web page to work properly may also be due to its use of &Java; or JavaScript. If you suspect that this may be the case check that they have been enabled in the <guilabel>Java &amp; JavaScript</guilabel> section of the settings dialog.
tr: Bir web sayfasını düzgünce çalıştırmak, onun &Java; veya JavaScript kullanımına da bağlı olabilir. Sorunun bu olduğunu düşünüyorsanız ayarlar iletişim kutusunun <guilabel>Java ve JavaScript</guilabel> bölümünden etkin olduklarını denetleyin.

source: Saving and Printing Web Items
tr: Web Ögelerini Kaydetmek ve Yazdırmak

source: When you are viewing a web page you can save it (or at least the basic &HTML; or similar source text) to your local disk with <menuchoice><guimenu>File</guimenu><guimenuitem>Save As…</guimenuitem></menuchoice>. If the page you are viewing uses frames, then you will also be given the <menuchoice><guimenu>File</guimenu><guimenuitem>Save Frame As…</guimenuitem></menuchoice> option. <mousebutton>Left</mousebutton> click in the frame you want to save first.
tr: Bir web sitesini (en azından temel &HTML; veya benzer kaynak metin olarak) yerel diskinize kaydetmek için <menuchoice><guimenu>Dosya</guimenu><guimenuitem>Farklı Kaydet…</guimenuitem></menuchoice> seçeneğini kullanın. Görüntülediğiniz web sitesi çerçeveler kullanıyorsa <menuchoice><guimenu>Dosya</guimenu><guimenuitem>Çerçeveyi Farklı Kaydet…</guimenuitem></menuchoice> seçeneğini de kullanabilirsiniz. Öncelikle, kaydetmek istediğiniz çerçevede <mousebutton>sol</mousebutton> fare düğmesi ile tıklayın.

source: If the page uses a background image, you can get and save that with the <menuchoice><guimenu>File</guimenu><guimenuitem>Save Background Image As…</guimenuitem></menuchoice> option.
tr: Sayfa bir arka plan görseli kullanıyorsa onu <menuchoice><guimenu>Dosya</guimenu><guimenuitem>Arka Plan Görselini Farklı Kaydet…</guimenuitem></menuchoice> seçeneğiyle kaydedebilirsiniz.

source: But if what you really want is that glorious picture of the latest Ferrari, then <mousebutton>right</mousebutton> clicking on the image will give you a drop-down menu with a <guimenuitem>Save Image As…</guimenuitem> option. Be sure to respect the owner’s copyright, and ask for permission before using any pictures saved this way for anything other than your own viewing pleasure.
tr: Yapmak istediğiniz şey, sayfadaki görkemli Ferrari’nin görselini kaydetmekse görsel üzerinde <mousebutton>right</mousebutton> tıklamak, size <guimenuitem>Görseli Farklı Kaydet…</guimenuitem> seçeneğini içeren bir menü verir. Görselin sahibinin telif hakkı bilgisine saygı gösterin ve görüntüleme dışındaki herhangi bir kullanım için izin aldığınızdan emin olun.
