Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konqueror.po
Languages: tr

source: If you <mousebutton>right</mousebutton> click on a link (which may be a picture) and select <guimenuitem>Save Link As…</guimenuitem> from the pop up menu the basic &HTML; or similar source text will be downloaded and saved on your local disk.
tr: Bir bağlantıya (bir resim de olabilir) <mousebutton>sağ</mousebutton> tıklayıp <guimenuitem>Bağlantıyı Farklı Kaydet…</guimenuitem> seçeneğini seçerseniz temel &HTML; veya benzer kaynak metin indirilip yerel diskinizde saklanır.

source: <mousebutton>Right</mousebutton> clicking on a link (which may be a picture) and choosing <guimenuitem>Copy Link Address</guimenuitem> will copy the &URL; of the link to the clipboard so you can then paste it into, say, an e-mail to a friend telling her about this wonderful new site.
tr: Bir bağlantıya (bir resim de olabilir) <mousebutton>sağ</mousebutton> tıklayıp <guimenuitem>Bağlantı Adresini Kopyala</guimenuitem> seçeneğini seçerseniz bağlantının &URL;’si panoya kopyalanır ve böylece onu; örneğin, bir e-postaya yapıştırıp bu muhteşem site hakkında arkadaşınızı darlayabilirsiniz.

source: <mousebutton>Right</mousebutton> clicking on a picture and choosing <guimenuitem>Copy Image</guimenuitem> copies the &URL; of the picture to the clipboard.
tr: Bir resme <mousebutton>sağ</mousebutton> tıklamak ve <guimenuitem>Görseli Kopyala</guimenuitem> ögesine tıklamak, resmin &URL;’sini panoya kopyalar.

source: Printing a copy of the page you are viewing is easily done with the Menubar <menuchoice><guimenu>File</guimenu> <guimenuitem>Print…</guimenuitem></menuchoice> or <guimenuitem>Print Frame</guimenuitem> option or with the Toolbar <guiicon>Print</guiicon> button.
tr: Görüntülediğiniz sayfanın bir kopyasını yazdırmak, menü çubuğundaki <menuchoice><guimenu>Dosya</guimenu> <guimenuitem>Yazdır…</guimenuitem></menuchoice> veya <guimenuitem>Çerçeveyi Yazdır</guimenuitem> veya araç çubuğundaki <guiicon>Yazdır</guiicon> ögesini seçmek kadar kolaydır.

source: &FTP;, or File Transfer Protocol, is one of the earliest, and still perhaps the best, way of transferring files between computers over the Internet.
tr: &FTP; veya Dosya Aktarım Protokolü, dosyaları internet üzerinden bilgisayarlar arasında aktarmanın en eski ve belki de en iyi yoludur.

source: With &FTP; you can see files and folders on the distant computer just as if they were on your own system, download them onto your computer using &konqueror;’s normal <guimenuitem>Copy</guimenuitem> and <guimenuitem>Paste</guimenuitem> or Drag’n Drop methods and, if allowed, upload files from your machine to the other computer’s filesystem. To try it, type the &URL;
tr: &FTP; ile, uzak bilgisayarlardaki dosyaları ve klasörleri, sanki kendi bilgisayarınızdaymışçasına görebilir ve onları &konqueror;’ın normal <guimenuitem>Kopyala</guimenuitem> ve <guimenuitem>Yapıştır</guimenuitem> veya Sürükle–Bırak yöntemleriyle aktarabilir; ayrıca izin veriliyorsa bilgisayarınızdan uzak bilgisayarın dosya sistemine karşıya yükleyebilirsiniz. Denemek için

source: into the Location Toolbar and press <keysym>Enter</keysym>. As long as you are connected to the Internet, you should end up seeing the <filename class="directory">ftp</filename> folder of the l10n server.
tr: &URL;’sini konum araç çubuğuna girin ve <keysym>Giriş</keysym>’e basın. İnternete bağlı olduğunuz sürece, l10n sunucusunun <filename class="directory">ftp</filename> klasörünü görüyor olmalısınız.

source: Although, strictly speaking, &FTP; &URL;s should be entered starting with <userinput>ftp://</userinput> and <acronym>WWW </acronym> &URL;s starting with <userinput>http://</userinput> &konqueror; is usually smart enough to figure out what is meant, and insert these characters for you if you leave them out.
tr: &FTP; &URL;’leri girilirken başlarında <userinput>ftp://</userinput> olması gerekirken, <acronym>WWW </acronym> &URL;’leri girilirken <userinput>http://</userinput> girilmesine gerek yoktur; &konqueror; genelde bunun ne anlama geldiğini bilir ve yazmasanız bile sizin yerinize onları koyar.

source: When you access an &FTP; site it will usually need some form of username and password from you. To simplify things, most &FTP; sites that offer files for free downloading will accept the word <systemitem class="username"> anonymous</systemitem> as a username and your email address as a password, and to make your life even easier &konqueror; will automatically supply these without troubling you.
tr: Bir &FTP; sitesine erişirken sizden genelde bir tür kullanıcı adı ve parola bilgisine gereksinim duyulur. Özgürce dosya erişimi sağlayan çoğu &FTP; sitess giriş bilgisi olarak <systemitem class="username">anonymous</systemitem> sözcüğünü kabul eder. İşinizi kolaylaştırmak adına &konqueror;, bu bilgiyi sizin yerinize sağlar.

source: If you try to access an &FTP; site that does not need a proper username or password but which is too busy to accept any more connections, &konqueror; often interprets the <quote>busy</quote> message as a request for a name and password and will therefore pop up a dialog box asking you to supply them.
tr: Uygun bir kullanıcı adı veya parolaya gereksinim duymayan; ancak daha fazla bağlantı kabul edemeyecek kadar meşgul olan bir &FTP; sitesine erişmeye çalışırsanız &konqueror;, genellikle <quote>meşgul</quote> iletisini bir ad ve parola talebi olarak yorumlar ve bu nedenle bunları sağlamanızı isteyen bir iletişim kutusu açar.

source: Sites that are more concerned with security will need a proper username and password, in which case &konqueror; will ask you for them or you can include the username in the &URL; you type into the Location Toolbar, as for example
tr: Güvenlikle daha fazla ilgilenen siteler uygun bir kullanıcı adı ve parolaya gereksinim duyacaktır, bu durumda &konqueror; sizden bunları isteyecektir veya kullanıcı adını konum araç çubuğuna yazdığınız &URL; içine ekleyebilirsiniz; örneğin,

source: <userinput>ftp://<replaceable>username</replaceable>@ftp.l10n.kde.org</userinput>
tr: <userinput>ftp://<replaceable>kullanıcı adı</replaceable>@ftp.l10n.kde.org</userinput>

source: &konqueror; will then prompt you for the password.
tr: &konqueror; sonra size parolayı soracaktır.

source: &konqueror; can also support automatic logins as specified in a <filename>.netrc</filename> file. Details of how to enable this feature are given at <ulink url="https://konqueror.org/faq/#DoesKonquerorsupportautomaticftploginsvianetrcfiles"> https://konqueror.org/faq/#DoesKonquerorsupportautomaticftploginsvianetrcfiles</ulink>
tr: &konqueror; ayrıca bir <filename>.netrc</filename> dosyasında belirtilen bilgilerle kendiliğinden oturum açmayı destekler.

source: &URL;s with Port Numbers
tr: Kapı Numaralı &URL;’ler

source: If you specify a port number in your &URL;, as in for example <userinput>http://intranet.corp.com:1080</userinput>, you might get the error message <quote>Access to restricted port in POST denied</quote>. This is done for security reasons. If you nevertheless need to access a server on this port, just add a key line <screen><userinput> OverridenPorts=CommaSeparatedListOfAllowedPorts </userinput></screen> to <filename>kio_httprc</filename> in the folder <filename class="directory">$(qtpaths --paths GenericConfigLocation)</filename>.
tr: &URL;’nizde bir kapı numarası belirtirseniz; örneğin, <userinput>http://intranet.corp.com:1080</userinput>, <quote>Access to restricted port in POST denied</quote> hata iletisini alabilirsiniz. Bu, güvenlik nedenleriyle yapılır. Yine de bu kapıdan sunucuya erişmeniz gerekiyorsa şu satırı:<screen><userinput> OverridenPorts=CommaSeparatedListOfAllowedPorts </userinput></screen> <filename class="directory">$(qtpaths --paths GenericConfigLocation)</filename> klasöründeki <filename>kio_httprc</filename> dosyasına ekleyin.

source: For example <screen><userinput>OverridenPorts=23,15 </userinput></screen> (it should not include any embedded spaces).
tr: Örneğin, <screen><userinput>OverridenPorts=23,15 </userinput></screen> (herhangi bir boşluk içermemelidir).

source: &konqueror; will reject the following ports:
tr: &konqueror; aşağıdaki kapıları reddedecektir:

source: Automatic Text Completion
tr: Kendiliğinden Metin Tamamlama

source: You can get &konqueror; to help you enter a path or &URL; into the Location Toolbar by enabling one of the <guimenuitem>Text Completion</guimenuitem> features. To do this <mousebutton>right</mousebutton> click on a clear part of the Location Toolbar text entry box and select <guisubmenu>Text Completion</guisubmenu> from the pop up menu. This will let you choose between the following options:
tr: &konqueror;’u, <guimenuitem>Metin Tamamlama</guimenuitem> özelliklerinden birini etkinleştirerek konum çubuğuna yol veya &URL; girerken size yardımcı olmasını sağlayabilirsiniz. Bunu yapmak için konum araç çubuğunun boş bir yerinde <mousebutton>sağ</mousebutton> tıklayın ve açılır menüden <guisubmenu>Metin Tamamlama</guisubmenu> ögesini seçin. Bu, aşağıdaki seçeneklerden birini seçmenize olanak tanır:

source: None
tr: Yok

source: What you get is what you type.
tr: Ne yazarsanız onu görürsünüz.

source: Manual
tr: Elle

source: When you have typed part of a path or &URL;, pressing <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> or &Tab; will complete the entry if it is possible to do so unambiguously.
tr: Bir yolun veya &URL;’nin bir kısmını yazdığınızda, <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> veya &Tab; düğmelerine basmak, olanaklıysa girdiyi tamamlayacaktır.

source: Automatic
tr: Kendiliğinden

source: As you type into the Location Toolbar window &konqueror; will automatically extend what you type to complete one possible path or &URL;, highlighting the characters it has added. Continue typing if that’s not what you wanted or press <keysym>Enter</keysym> to accept it.
tr: Siz konum çubuğuna yazarken &konqueror; olanaklı girdilerle yolu veya &URL;’yi, eklendiği karakterleri vurgulayarak doldurur. İstediğiniz bu değilse yazmayı sürdürün veya kabul etmek için <keysym>Giriş</keysym> düğmesine basın.

source: Dropdown List
tr: Açılır liste

source: A drop-down window will appear as you type, showing the possible matches to what you have typed so far. When the path or &URL; that you want appears in the window click on it with the &LMB;. You can also use the <keysym>Down</keysym> or &Tab; and <keysym>Up</keysym> or <keycombo action="simul">&Shift;&Tab;</keycombo> keys to select it then press <keysym>Enter</keysym>.
tr: Siz yazdıkça bir açılır menü görünür ve olası eşleşmeleri gösterir. Girmek istediğiniz yol veya &URL; listede görününce &LMB; ile tıklayın. Seçim için ayrıca <keysym>Aşağı</keysym> veya &Tab; ve <keysym>Yukarı</keysym> veya <keycombo action="simul">&Shift;&Tab;</keycombo> düğmelerini kullanabilirsiniz. Sonrasında <keysym>Giriş</keysym> düğmesine basın.

source: Short Automatic
tr: Kısa kendiliğinden

source: This is like Automatic mode except that it only extends what you have typed as far as the next <keycap>/</keycap> symbol in the path or &URL;. Press <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> or &Tab; to accept the suggestion, <keysym>Enter</keysym> when the complete path or &URL; is shown.
tr: Bu, Kendiliğinden kipi gibidir; ancak yalnızca yoldaki veya &URL;’deki bir sonraki <keycap>/</keycap> sembolüne kadar genişletir. Öneriyi kabul etmek için <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> veya &Tab; düğmesine basın; tam yol veya &URL; göründüğünde de <keysym>Giriş</keysym> düğmesine basarak işlemi sonlandırın.

source: Dropdown List &amp; Automatic
tr: Açılır liste ve kendiliğinden

source: This is a combination of both options described above.
tr: Bu, yukarıda açıklanan her iki seçeneğin de bir birleşimidir.

source: Default
tr: Öntanımlı

source: This item appears at the bottom of the submenu and enables you to switch to the default behaviour <guimenuitem>Dropdown List</guimenuitem>.
tr: Bu öge, alt menünün en sonunda görünür ve öntanımlı davranış olan <guimenuitem>Açılır liste</guimenuitem> davranışına geri dönmenizi sağlar.

source: You should try out these different modes and pick the one that suits you best.
tr: Bu değişik kipleri denemeli ve size en uygun olanı seçmelisiniz.

source: Using Bookmarks
tr: Yer İmlerini Kullanmak

source: Although you can use &konqueror;’s bookmarks to record the locations of your own files and folders, they are most useful when you are surfing the Web, letting you build up a list of useful sites.
tr: Her ne kadar &konqueror;’un yer imlerini kendi dosya ve klasörlerinizin konumlarını kaydetmek için kullanabilseniz de, bunlar en çok web’de gezinirken kullanışlıdır ve yararlı sitelerin bir listesini oluşturmanızı sağlar.

source: To open the <guimenu>Bookmarks</guimenu> menu <mousebutton>left</mousebutton> click on the <guimenu>Bookmarks</guimenu> menu. Once the list is visible, you can navigate through it with the arrow keys or with your mouse, then press <keysym>Enter</keysym> or <mousebutton>left</mousebutton> click to visit the selected location.
tr: <guimenu>Yer İmleri</guimenu> menüsünü açmak için <guimenu>Yer İmleri</guimenu> menü başlığına <mousebutton>sol</mousebutton> tıklayın. Menü göründüğünde, ok düğmeleriyle veya fare ile içinde dolaşabilir ve <keysym>Giriş</keysym> veya <mousebutton>sol</mousebutton> fare düğmesiyle seçili konuma gidebilirsiniz.

source: To add a new item to the list use <menuchoice><guimenu>Bookmarks </guimenu><guimenuitem>Add Bookmark</guimenuitem></menuchoice> or <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> or <mousebutton>right</mousebutton> click on a clear space in the web page or folder view and select <guimenuitem>Bookmark this Page</guimenuitem> from the pop up menu.
tr: Listeye yeni bir öge eklemek için <menuchoice><guimenu>Yer İmleri</guimenu> <guimenuitem>Yer İmi Koy</guimenuitem></menuchoice> ögesini veya <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> kısayolunu veya web sayfasının veya klasör görünümünün boş bir yerinde <mousebutton>sağ</mousebutton> tıklayıp <guimenuitem>Bu Sayfaya Yer İmi Koy</guimenuitem> seçeneğini kullanabilirsiniz.

source: The <guimenu>Bookmarks</guimenu> list can contain subfolders containing other bookmarks, you can create these with <menuchoice><guimenu>Bookmarks </guimenu><guimenuitem>New Bookmark Folder…</guimenuitem></menuchoice> To add a bookmark into a subfolder rather than into the main Bookmark list, select the folder from within the <guimenu>Bookmarks</guimenu> list and use the <guimenuitem>Add Bookmark</guimenuitem> item in that folder.
tr: <guimenu>Yer İmleri</guimenu> listesi, başka yer imlerini içeren alt klasörler içerebilir. Bunları, <menuchoice><guimenu>Yer İmleri</guimenu> <guimenuitem>Yeni Yer İmi Klasörü…</guimenuitem></menuchoice> ögesini kullanarak oluşturabilirsiniz. Bir yer imini doğrudan bir alt klasöre yerleştirmek için <guimenu>Yer İmleri</guimenu> menüsündeki <guimenuitem>Yer İmi Koy</guimenuitem> ögesini o klasörde çalıştırın.

source: If you enter <userinput>bookmarks:</userinput> in the location bar the bookmarks home page with an overview of all bookmarks and folders is shown.
tr: Konum çubuğuna <userinput>bookmarks:</userinput> yazarsanız tüm yer imleri ve klasörlerin bir genel görünümünü gösteren yer imleri ana sayfası gösterilir.

source: If you want to edit your bookmarks use the <ulink url="help:/keditbookmarks/index.html">Bookmark Editor</ulink>
tr: Yer imlerinizi düzenlemek istiyorsanız <ulink url="help:/keditbookmarks/index.html">Yer İmi Düzenleyicisi</ulink>’ni kullanın.

source: Saving Settings
tr: Ayarları Kaydetmek

source: You can specify different <guimenu>View</guimenu> menu settings for an individual folder. To do this select <menuchoice><guimenu>View</guimenu> <guimenuitem>Adjust View Properties…</guimenuitem></menuchoice>, change the <guimenu>View</guimenu> settings in the dialog to whatever you want. Then apply the view properties to the <guilabel>Current folder</guilabel>. Doing this creates a <filename>.directory</filename> file in that folder to hold the folder <guimenu>View</guimenu> settings. Use this dialog again to remove the folder specific settings (or just delete the <filename>.directory</filename> file).
tr: Her bir klasör için farklı <guimenu>Görünüm</guimenu> menüsü ayarları belirtilebilir. Bunu yapmak için <menuchoice><guimenu>Görünüm</guimenu> <guimenuitem>Görünüm Özelliklerini Ayarla…</guimenuitem></menuchoice> menü ögesinden <guimenu>Görünüm</guimenu> ayarlarını istediğiniz gibi değiştirin. Sonrasında, görünüm özelliklerini <guilabel>geçerli klasör</guilabel> için uygulayın. Bunu yapmak, içinde <guimenu>Görünüm</guimenu> ayarlarını saklayan bir <filename>.directory</filename> dosyasını o klasörde oluşturur. Klasöre özel ayarları kaldırmak için bu yine bu iletişim kutusunu kullanın (veya <filename>.directory</filename> dosyasını silin).

source: One nice use of this feature is if you have a folder full of pictures, you can set that particular folder to display thumbnails of the pictures (by choosing the <menuchoice><guisubmenu>View Mode</guisubmenu> <guimenuitem>Icons</guimenuitem></menuchoice> and <guimenuitem>Preview</guimenuitem> from the <guimenu>View</guimenu> menu) when you open it, while not displaying images as thumbnails in other folders.
tr: Bu özelliğin yararlı bir kullanımına örnek olarak, resimlerle dolu bir klasörün her zaman küçük görsel görünümünde kalmasını sağlayabilirsiniz (<menuchoice><guisubmenu>Görünüm Kipi</guisubmenu> <guimenuitem>Simgeler</guimenuitem></menuchoice> ve <guimenu>Görünüm</guimenu> menüsünden <guimenuitem>Önizle</guimenuitem>).

source: <title>Plugins</title>
tr: <title>Eklentiler</title>

source: &konqueror; Plugins
tr: &konqueror; Eklentileri

source: &kde; releases several useful plugins that interact with &konqueror; in various ways. These are explained briefly below.
tr: &kde;, &konqueror; ile çeşitli yollarda etkileşime giren birkaç yararlı eklenti yayımlar. Bunlar aşağıda kısaca açıklanmıştır.

source: Use <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Extensions…</guimenuitem></menuchoice> to open a dialog with all installed plugins and select the ones you need. All plugins are accessible in the <guimenu>Tools</guimenu> menu.
tr: Tüm kurulu eklentileri görmek ve yalnızca gereksiniminiz olanları seçmek için <menuchoice><guimenu>Ayarlar</guimenu> <guimenuitem>Genişletmeleri Yapılandır…</guimenuitem></menuchoice> ögesinden bir iletişim kutusu açabilirsiniz. Tüm eklentilere <guimenu>Araçlar</guimenu> menüsünden erişilebilir.

source: Only plugins appropriate for the current mode (file manager or browser) are listed in the dialog.
tr: Bu iletişim kutusunda yalnızca geçerli kip için uygun olan eklentiler listelenir (dosya yöneticisi veya tarayıcı).

source: Browser Mode
tr: Tarayıcı Kipi

source: Web Page Translation
tr: Web Sayfası Çevirisi

source: This uses the machine translation service provided by <ulink url="https://translate.google.com/">Google Translate</ulink> to translate the current <acronym>HTML</acronym> page to whatever language you want (within reason). It can be launched with <menuchoice><guimenu>Tools</guimenu><guisubmenu>Translate Web Page</guisubmenu></menuchoice>.
tr: Bu, geçerli <acronym>HTML</acronym> sayfasını istediğiniz bir dile çevirmek için <ulink url="https://translate.google.com/">Google Çeviri</ulink> altyapısını kullanır. <menuchoice><guimenu>Araçlar</guimenu> <guisubmenu>Web Sayfasını Çevir</guisubmenu></menuchoice> ile etkinleştirilebilir.

source: If you have a portion of the text on the page selected, that will be translated instead of the entire &URL;.
tr: Sayfadaki metnin bir kısmını seçtiyseniz &URL;’nin tamamı yerine bu kısmı çevrilecektir.

source: Machine translation is not a perfect science! Google will at best give you a rough translation, and at worst will give you a very funny read. Don’t base important decisions on things you have read from a Google translated page, without confirming that the translation is indeed accurate.
tr: Makine çevirisi mükemmel bir bilim değildir! Google size en iyi olasılıkla kaba bir çeviri, en kötü olasılıkla da çok komik bir çeviri verecektir. Önemli kararlarınızı, çevirinin gerçekten doğru olduğunu teyit etmeden, Google tarafından çevrilmiş bir sayfadan okuduğunuz şeylere dayandırmayın.

source: You may only translate web pages that are accessible on the world wide web. To translate any other text, you should go directly to the Google site itself, where you are able to paste in text for translation.
tr: Yalnızca dünya çapında web üzerinden erişilebilen web sayfalarını çevirebilirsiniz. Başka herhangi bir metni çevirmek için doğrudan Google sitesine gitmeli ve burada çeviri için metni yapıştırabilmelisiniz.

source: HTML Settings
tr: HTML Ayarları

source: Select <menuchoice><guimenu>Tools</guimenu><guisubmenu>HTML Settings</guisubmenu></menuchoice> to enable or disable a number of HTML settings without going through the <guimenu>Settings</guimenu> dialog.
tr: <guimenu>Ayarlar</guimenu> iletişim kutusuna gitmeden birkaç HTML ayarını etkinleştirmek veya devre dışı bırakmak için <menuchoice><guimenu>Araçlar</guimenu> <guisubmenu>HTML Ayarları</guisubmenu></menuchoice> ögesini seçin.

source: Allows you to turn the use of JavaScript in &konqueror; on or off.
tr: &konqueror;’da JavaScript kullanımını açıp kapatmaya yarar.

source: Allows you to turn the use of &Java; in &konqueror; on or off.
tr: &konqueror;’da Java kullanımını açıp kapatmaya yarar.

source: Cookies
tr: Çerezler

source: Allows you to turn the use of Cookies in &konqueror; on or off.
tr: &konqueror;’da çerez kullanımını açıp kapatmaya yarar.

source: <guimenuitem>Plugins</guimenuitem>
tr: <guimenuitem>Eklentiler</guimenuitem>

source: Allows you to turn the use of the &konqueror; plugins you have installed on or off.
tr: Kurduğunuz &konqueror; eklentilerini açıp kapatmanıza olanak tanır.

source: Autoload Images
tr: Görselleri kendiliğinden yükle

source: Allows you to turn on or off the loading of images in web pages.
tr: Web sayfalarındaki görsellerin yüklenmesini açmanıza veya kapatmanıza olanak tanır.

source: Enable Proxy
tr: Vekili Etkinleştir

source: Allows you to enable or disable the use of a proxy in the &konqueror; browser.
tr: &konqueror; tarayıcısında bir vekil kullanımını etkinleştirmenizi veya devre dışı bırakmanızı sağlar.

source: Enable Cache
tr: Önbelleği Etkinleştir

source: Allows you to enable or disable the use of a cache in the &konqueror; browser.
tr: &konqueror; tarayıcısında önbellek kullanımını etkinleştirmenizi veya devre dışı bırakmanızı sağlar.

source: Cache Policy
tr: Önbellek Politikası

source: The Cache Policy submenu provides you with a way to configure how &konqueror; uses a cache. The possible uses include:
tr: Önbellek Politikası alt menüsü, &konqueror;’un önbelleği nasıl kullanacağını yapılandırmanız için bir yol sağlar. Olası kullanımlar şunları içerir:

source: Keep Cache in Sync
tr: Önbelleği Eşzamanlı Tut

source: Use Cache if Possible
tr: Olanaklıysa Önbellek Kullan

source: Offline Browsing Mode
tr: Çevrimdışı Tarama Kipi

source: File Manager Mode
tr: Dosya Yöneticisi Kipi

source: Directory Filter
tr: Dizin Süzgeci

source: This is controlled by <menuchoice><shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>I</keycap></keycombo></shortcut> <guimenu>Tools</guimenu><guisubmenu>Show Filter Bar</guisubmenu></menuchoice> and allows you to choose which types of item are displayed in a folder.
tr: Bu, <menuchoice><shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>I</keycap></keycombo></shortcut> <guimenu>Araçlar</guimenu> <guisubmenu>Süzgeç Çubuğunu Göster</guisubmenu></menuchoice> ile denetlenir ve bir klasörde hangi tür ögelerin görüntüleneceğini seçmenize olanak tanır.

source: Image Gallery
tr: Görsel Galerisi
