Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konqueror.po
Languages: tr

source: <guimenu>View</guimenu> <guisubmenu>View Mode</guisubmenu>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Görünüm Kipi</guisubmenu>

source: In browser mode this submenu holds items to select embedded views like <guimenuitem>WebEngine</guimenuitem>, <guimenuitem>Embedded Advanced Text Editor</guimenuitem> and more embedded views.
tr: Tarayıcı kipinde bu alt menü, <guimenuitem>WebEngine</guimenuitem>, <guimenuitem>Gömülü Gelişmiş Metin Düzenleyicisi</guimenuitem> veya bunun gibi başka gömülü görünümlere ev sahipliği yapar.

source: In file manager mode this submenu holds items to select <guimenuitem>Icon</guimenuitem>, <guimenuitem>Details</guimenuitem>, <guimenuitem>Compact</guimenuitem>, <guimenuitem>Terminal Emulator</guimenuitem> and more view modes.
tr: Dosya yöneticisi kipinde bu alt menü, <guimenuitem>Simge</guimenuitem>, <guimenuitem>Ayrıntılar</guimenuitem>, <guimenuitem>Sıkışık</guimenuitem>, <guimenuitem>Uçbirim Öykünücüsü</guimenuitem> ve bunun gibi başka görünüm kiplerine ev sahipliği yapar.

source: <guimenu>View</guimenu> <guimenuitem>Lock to Current Location</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Geçerli Konuma Kilitlen</guimenuitem>

source: A locked view cannot change folders. Use in combination with <guimenuitem>Link View</guimenuitem> to explore many files from one folder.
tr: Kilitli bir görünümde klasörler değiştirilemez. Bir klasördeki pek çok dosyayı keşfetmek için bunu <guimenuitem>Görünümü Bağlantıla</guimenuitem> ile birlikte kullanın.

source: <guimenu>View</guimenu> <guimenuitem>Link View</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Görünümü Bağlantıla</guimenuitem>

source: Link current view to others in a multiple view window. A linked view follows folder changes made in other linked views. This is especially useful with different types of views, such as a folder tree with an icon view or detailed view, and possibly a terminal emulator window.
tr: Çoklu görünüm penceresinde geçerli görünümü diğerlerine bağlayın. Bağlantılı bir görünüm, diğer bağlantılı görünümlerde yapılan klasör değişikliklerini takip eder. Bu, özellikle simge görünümlü veya ayrıntılı görünümlü bir klasör ağacı ve büyük olasılıkla bir uçbirim öykünücüsü penceresi gibi farklı görünüm türlerinde kullanışlıdır.

source: <shortcut><keycap>F5</keycap></shortcut> <guimenu>View</guimenu> <guimenuitem>Reload</guimenuitem>
tr: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Yeniden Yükle</guimenuitem>

source: Reload.
tr: Görünümü yeniden yükleyin.

source: <shortcut>&Esc;</shortcut> <guimenu>View</guimenu> <guimenuitem>Stop</guimenuitem>
tr: <shortcut>&Esc;</shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Durdur</guimenuitem>

source: Stop load (particularly useful when web browsing).
tr: Yüklemeyi durdurun (özellikle web tarayıcısı kipindeyken yararlıdır).

source: <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>U</keycap> </keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>View Document Source</guimenuitem></menuchoice> (Browser mode)
tr: <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>U</keycap> </keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Belge Kaynağını Görüntüle</guimenuitem></menuchoice> (Tarayıcı kipi)

source: View document source text.
tr: Belge kaynağı metnini görüntüleyin.

source: Only available if you are viewing a document or &HTML; page.
tr: Yalnızca bir belge veya &HTML; sayfası görüntülüyorsanız kullanılabilir.

source: <menuchoice> <guimenu>View</guimenu> <guimenuitem>View Frame Source</guimenuitem></menuchoice> (Browser mode)
tr: <menuchoice> <guimenu>Görünüm</guimenu> <guimenuitem>Çerçeve Kaynağını Görüntüle</guimenuitem></menuchoice> (Tarayıcı kipi)

source: View frame source text
tr: Çerçeve kaynağı metnini görüntüleyin.

source: Only applies if you are viewing a web site that uses frames. Similar to <guimenuitem>View Document Source</guimenuitem>.
tr: Çerçeveler kullanan bir web sitesini görüntülüyorsanız kullanılabilir. <guimenuitem>Belge Kaynağını Görüntüle</guimenuitem> ile benzerdir.

source: <menuchoice> <guimenu>View</guimenu> <guimenuitem>Zoom In</guimenuitem> <guimenuitem>Zoom Out</guimenuitem> <guimenuitem>Actual Size</guimenuitem> <guimenuitem>Zoom Text Only</guimenuitem> <guimenuitem>Zoom To DPI</guimenuitem></menuchoice> (Browser mode)
tr: <menuchoice> <guimenu>Görünüm</guimenu> <guimenuitem>Yakınlaştır</guimenuitem> <guimenuitem>Uzaklaştır</guimenuitem> <guimenuitem>Gerçek Boyut</guimenuitem> <guimenuitem>Yalnızca Metni Yakınlaştır</guimenuitem> <guimenuitem>DPI’ye Yakınlaştır</guimenuitem></menuchoice> (Tarayıcı kipi)

source: These menuitems offer different actions to modify the size of the items in the page.
tr: Bu menü ögeleri, sayfadaki ögelerin boyutunu değiştirmek için farklı eylemler sunar.

source: <menuchoice> <guimenu>View</guimenu> <guimenuitem>Set Encoding</guimenuitem></menuchoice> (Browser mode)
tr: <menuchoice> <guimenu>Görünüm</guimenu> <guimenuitem>Kodlamayı Ayarla</guimenuitem></menuchoice> (Tarayıcı kipi)

source: Allows you to choose the character encoding used to display &HTML; pages. <guimenuitem>Default</guimenuitem> is usually the best choice.
tr: &HTML; sayfalarını görüntülemekte kullanılan kodlamayı seçmenize olanak tanır. <guimenuitem>Öntanımlı</guimenuitem>, genelde en iyi seçimdir.

source: <menuchoice> <guimenu>View</guimenu> <guisubmenu>Sort By</guisubmenu></menuchoice> (File Manager mode)
tr: <menuchoice> <guimenu>Görünüm</guimenu> <guisubmenu>Şuna Göre Sırala</guisubmenu></menuchoice> (Dosya Yöneticisi kipi)

source: <action>Changes whether items are sorted</action> by <guimenuitem>Name</guimenuitem> or other criteria described in <link linkend="dolphin-view-information">Information in the View</link>.
tr: <link linkend="dolphin-view-information">Görünümdeki Bilgiler</link> bölümünde açıklandığı üzere, ögelerin <guimenuitem>Ad</guimenuitem> veya başka bir kritere göre <action>sıralanıp sıralanmadığını</action> değiştirir.

source: <guimenuitem>Descending</guimenuitem> reverses the sort order. <guimenuitem>Folders First</guimenuitem> sorts folders before files.
tr: <guimenuitem>Azalan</guimenuitem>, sıralamayı tersine çevirir. <guimenuitem>Önce Klasörler</guimenuitem>, dosyalardan önce klasörleri sıralar.

source: <menuchoice> <guimenu>View</guimenu> <guisubmenu>Additional Information</guisubmenu></menuchoice> (File Manager mode)
tr: <menuchoice> <guimenu>Görünüm</guimenu> <guisubmenu>Ek Bilgileri Göster</guisubmenu></menuchoice> (Dosya Yöneticisi kipi)

source: <action>Displays additional information</action> described in <link linkend="dolphin-view-information">Information in the View</link>.
tr: <link linkend="dolphin-view-information">Görünümdeki Bilgiler</link> bölümünde açıklandığı üzere, ek bilgileri <action>görüntüler</action>.

source: <menuchoice> <guimenu>View</guimenu> <guimenuitem>Preview</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <guimenu>Görünüm</guimenu> <guimenuitem>Önizleme</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: <action>Displays a symbolic preview of the file contents </action> in the different view modes.
tr: Farklı görünüm kiplerinde, dosya içeriğinin sembolik bir önizlemesini <action>görüntüler</action>.

source: <menuchoice> <guimenu>View</guimenu> <guimenuitem>Show in Groups</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <guimenu>Görünüm</guimenu> <guimenuitem>Gruplarla Göster</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: <action>Displays</action> the content of the current folder grouped by the option selected in <guimenuitem>Sort By</guimenuitem> (only available in the Icons view mode).
tr: <guimenuitem>Şuna Göre Sırala</guimenuitem> içinde seçili seçeneğe göre, geçerli klasörün içeriğini gruplayarak <action>görüntüler</action> (yalnızca Simge Görünümü kipinde kullanılabilir).

source: <menuchoice> <shortcut> <keycombo action="simul">&Alt;<keycap>.</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Show Hidden Files</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <shortcut> <keycombo action="simul">&Alt;<keycap>.</keycap></keycombo> </shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Gizli Dosyaları Göster</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: Shows all the hidden files and sub-folders within the current folder.
tr: Geçerli klasördeki tüm gizli dosyaları ve alt klasörleri gösterir.

source: <menuchoice> <guimenu>View</guimenu> <guimenuitem>Adjust View Properties…</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <guimenu>Görünüm</guimenu> <guimenuitem>Görünüm Özelliklerini Ayarla…</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: Opens the <link linkend="view-properties-dialog">View Properties Dialog</link>.
tr: <link linkend="view-properties-dialog">Görünüm Özellikleri</link> iletişim kutusunu açar.

source: The Go Menu
tr: Git Menüsü

source: <shortcut> <keycombo action="simul">&Alt;<keysym>Up</keysym></keycombo> </shortcut><guimenu>Go</guimenu> <guimenuitem>Up</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;<keysym>Yukarı</keysym></keycombo> </shortcut><guimenu>Git</guimenu> <guimenuitem>Yukarı</guimenuitem>

source: Go up a level in the folder hierarchy or select a folder in the hierarchy from the submenu.
tr: Klasör hiyerarşisinde bir düzey yukarı çıkın veya alt menüden hiyerarşideki bir klasörü seçin.

source: <shortcut> <keycombo action="simul">&Alt;<keysym>Left</keysym></keycombo> </shortcut><guimenu>Go</guimenu> <guimenuitem>Back</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;<keysym>Sol</keysym></keycombo> </shortcut><guimenu>Git</guimenu> <guimenuitem>Geri</guimenuitem>

source: Go back to the previous view or select a previously visited item from the submenu.
tr: Önceki görünüme geri dönün veya alt menüden daha önce ziyaret edilen bir ögeyi seçin.

source: <shortcut> <keycombo action="simul">&Alt;<keysym>Right</keysym></keycombo> </shortcut><guimenu>Go</guimenu> <guimenuitem>Forward</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;<keysym>Sağ</keysym></keycombo> </shortcut><guimenu>Git</guimenu> <guimenuitem>İleri</guimenuitem>

source: You can only go forward if you’ve previously gone back.
tr: Yalnızca daha önce geri döndüyseniz ileri gidebilirsiniz.

source: <menuchoice> <shortcut> <keycombo action="simul">&Alt;<keycap>Home</keycap></keycombo> </shortcut><guimenu>Go</guimenu> <guimenuitem>Home Page</guimenuitem></menuchoice> (Browser mode)
tr: <menuchoice> <shortcut> <keycombo action="simul">&Alt;<keycap>Baş</keycap></keycombo> </shortcut><guimenu>Git</guimenu> <guimenuitem>Ana Sayfa</guimenuitem></menuchoice> (Tarayıcı kipi)

source: Go to your home page as defined on the <guilabel>General</guilabel> page of the settings dialog.
tr: Ayarlar iletişim kutusunun <guilabel>Genel</guilabel> sayfasında tanımlanmış ana sayfaya gidin.

source: <menuchoice> <shortcut> <keycombo action="simul">&Alt;<keycap>Home</keycap></keycombo> </shortcut><guimenu>Go</guimenu> <guimenuitem>Home Folder</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <shortcut> <keycombo action="simul">&Alt;<keycap>Baş</keycap></keycombo> </shortcut><guimenu>Git</guimenu> <guimenuitem>Ana Klasör</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: <action>Changes</action> to the users home folder, &eg;, /home/Peter/.
tr: Kullanıcının ana klasörüne; örneğin, /home/Hakan/, <action>geçiş yapar</action>.

source: <menuchoice> <guimenu>Go</guimenu> <guimenuitem>Applications</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <guimenu>Git</guimenu> <guimenuitem>Uygulamalar</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: Open the folder holding your applications.
tr: Uygulamalarınızı tutan klasörü açın.

source: <menuchoice> <guimenu>Go</guimenu> <guimenuitem>Network Folders</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <guimenu>Git</guimenu> <guimenuitem>Ağ Klasörleri</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: Network folders show up in a special location of &konqueror; and &dolphin; called a virtual folder. You can find more information on how to use this folder in the <ulink url="help:/knetattach/index.html">KNetAttach Handbook</ulink>.
tr: Ağ klasörleri, &konqueror; ve &dolphin; bünyesinde bir sanal klasör olarak adlandırılırlar. Bu klasörleri kullanmak ile ilgili daha fazla bilgi için <ulink url="help:/knetattach/index.html">KNetAttach El Kitabı</ulink>’na bakın.

source: <menuchoice> <guimenu>Go</guimenu> <guimenuitem>Trash</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <guimenu>Git</guimenu> <guimenuitem>Çöp Kutusu</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: Open your <filename class="directory">Trash</filename> folder.
tr: <filename class="directory">Çöp Kutusu</filename> klasörünüzü açar.

source: <menuchoice> <guimenu>Go</guimenu> <guimenuitem>Autostart</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <guimenu>Git</guimenu> <guimenuitem>Kendiliğinden Başlat</guimenuitem></menuchoice> (Dosya Yöneticisi)

source: Open your <filename class="directory">Autostart</filename> folder.
tr: <filename class="directory">Kendiliğinden Başlat</filename> klasörünüzü açar.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>H</keycap></keycombo> </shortcut><guimenu>Go</guimenu> <guimenuitem>Show History</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>H</keycap></keycombo> </shortcut><guimenu>Git</guimenu> <guimenuitem>Geçmişi Göster</guimenuitem>

source: Shows a tree view of your browsing history in a separate window.
tr: Tarama geçmişinizi ayrı bir pencerede gösterir.

source: <guimenu>Go</guimenu> <guisubmenu>Most Often Visited</guisubmenu>
tr: <guimenu>Git</guimenu> <guisubmenu>Sık Ziyaret Edilen</guisubmenu>

source: Displays a submenu showing the &URL;s you visit most often. Selecting one of these will make &konqueror; open that &URL;.
tr: Sık ziyaret ettiğiniz &URL;’leri gösteren bir alt menüyü görüntüler. Bunlardan birini seçmek, &konqueror;’un o &URL;’yi açmasını sağlar.

source: <guimenu>Go</guimenu> <guisubmenu>Recently Visited</guisubmenu>
tr: <guimenu>Git</guimenu> <guisubmenu>Son Ziyaret Edilen</guisubmenu>

source: Displays a submenu showing the &URL;s you recently visited. Selecting one of these will make &konqueror; open that &URL;.
tr: Son ziyaret ettiğiniz &URL;’leri gösteren bir alt menüyü görüntüler. Bunlardan birini seçmek, &konqueror;’un o &URL;’yi açmasını sağlar.

source: <guimenu>Go</guimenu> <guisubmenu>Closed Items</guisubmenu>
tr: <guimenu>Git</guimenu> <guisubmenu>Kapatılmış Ögeler</guisubmenu>

source: Displays a submenu showing the closed &URL;s you visit. Selecting one of these will make &konqueror; open that &URL;. Use <guimenuitem>Empty Closed Items History</guimenuitem> to clear the submenu.
tr: Kapattığınız &URL;’leri gösteren bir alt menüyü görüntüler. Bunlardan birini seçmek, &konqueror;’un o &URL;’yi açmasını sağlar. Alt menüyü temizlemek için <guimenuitem>Kapatılmış Ögelerin Geçmişini Temizle</guimenuitem> seçeneğini kullanın.

source: The Bookmarks Menu
tr: Yer İmleri Menüsü

source: See the section <link linkend="bookmarks">Using Bookmarks</link> in this manual for a fuller description of these menu items.
tr: Bu menü ögelerinin daha tam bir açıklamasını görmek için <link linkend="bookmarks">Yer İmlerini Kullanmak</link> bölümüne bakın.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Bookmarks</guimenu> <guimenuitem>Add Bookmark</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Yer İmleri</guimenu> <guimenuitem>Yer İmi Koy</guimenuitem>

source: Add current selection to your bookmarks.
tr: Geçerli seçime yer imi koyun.

source: <guimenu>Bookmarks</guimenu> <guimenuitem>Bookmark Tabs as Folder…</guimenuitem>
tr: <guimenu>Yer İmleri</guimenu> <guimenuitem>Sekmelere Klasör Olarak Yer İmi Koy…</guimenuitem>

source: Create a bookmark folder containing links to all of the &URL;s currently open in &konqueror; tabs.
tr: Şu anda &konqueror; sekmelerinde açık olan tüm &URL;’leri içeren bir yer imleri klasörü oluşturun.

source: <guimenu>Bookmarks</guimenu> <guimenuitem>New Bookmark Folder…</guimenuitem>
tr: <guimenu>Yer İmleri</guimenu> <guimenuitem>Yeni Yer İmi Klasörü…</guimenuitem>

source: Create a new folder in your Bookmarks folder.
tr: Yer İmleri klasörünüzde yeni bir alt klasör oluşturun.

source: <guimenu>Bookmarks</guimenu> <guimenuitem>Edit Bookmarks…</guimenuitem>
tr: <guimenu>Yer İmleri</guimenu> <guimenuitem>Yer İmlerini Düzenle…</guimenuitem>

source: Open the <link linkend="bookmarks">Bookmark Editor</link>.
tr: <link linkend="bookmarks">Yer İmi Düzenleyicisi</link>’ni açın.

source: The Tools Menu
tr: Araçlar Menüsü

source: <menuchoice> <shortcut><keycap>F4</keycap></shortcut> <guimenu>Tools</guimenu> <guimenuitem>Open Terminal</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <shortcut><keycap>F4</keycap></shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Uçbirim Aç</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: Open a &konsole; terminal window.
tr: &konsole; uçbirim penceresini açın.

source: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Tools</guimenu> <guimenuitem>Find File…</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Dosya Bul…</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: Open the &kfind; application.
tr: &kfind; uygulamasını açar.

source: <menuchoice> <guimenu>Tools</guimenu> <guisubmenu>Select Remote Charset</guisubmenu></menuchoice> (File Manager mode)
tr: <menuchoice> <guimenu>Araçlar</guimenu> <guisubmenu>Uzak Karakter Kodlamasını Seç</guisubmenu></menuchoice> (Dosya Yöneticisi kipi)

source: Offers to choose the charset used by a remote connection manually.
tr: Bir uzak bağlantı tarafından kullanılan karakter kümesini seçmeye olanak tanır.

source: If you have &konqueror; plugins installed there will be additional entries in the <guimenu>Tools</guimenu> menu. See the <link linkend="konq-plugin">&konqueror; Plugins</link> chapter for further details.
tr: Kurulu &konqueror; eklentileriniz varsa <guimenu>Araçlar</guimenu> menüsünde ek girdiler olur. Daha çok ayrıntı için <link linkend="konq-plugin">&konqueror; Eklentileri</link> faslına bakın.

source: The Settings Menu
tr: Ayarlar Menüsü

source: Apart from the common &kde; Settings menu items described in the <ulink url="help:/fundamentals/menus.html#menus-settings">Settings Menu</ulink> chapter of the &kde; Fundamentals &konqueror; has these application specific menu entries:
tr: &kde; Temelleri’nin <ulink url="help:/fundamentals/menus.html#menus-settings">Ayarlar Menüsü</ulink> faslında açıklanan ortak &kde; Ayarlar menüsü ögelerinin yanı sıra, &konqueror;’da şu uygulamaya özel menü girdileri vardır:

source: <guimenu>Settings</guimenu> <guimenuitem>Show Terminal Emulator</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Göster: Uçbirim Öykünücüsü</guimenuitem>

source: Open a small text terminal view at the bottom of the main window.
tr: Ana pencerenin alt kısmında küçük bir uçbirim görünümü açın.

source: <shortcut> <keycombo action="simul"><keycap>F9</keycap></keycombo></shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Sidebar</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>F9</keycap></keycombo></shortcut> <guimenu>Ayarlar</guimenu> <guimenuitem>Kenar Çubuğunu Göster</guimenuitem>

source: Toggles the display of the &konqueror; sidebar.
tr: &konqueror; kenar çubuğunun görüntülenmesini açar/kapatır.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift; <keycap>F</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Full Screen Mode</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift; <keycap>F</keycap></keycombo> </shortcut> <guimenu>Ayarlar</guimenu> <guimenuitem>Tam Ekran Kipi</guimenuitem>

source: Changes &konqueror; to full screen mode, in which the &konqueror; window takes up the whole screen, and does not have the usual window decorations. To exit full screen mode, click on the <guiicon>Exit Full Screen Mode</guiicon> icon on the toolbar, or press <keycombo action="simul">&Ctrl;&Shift; <keycap>F</keycap></keycombo>.
tr: &konqueror;’u, tam ekranı kapladığı ve pencere dekorasyonlarının olmadığı tam ekran kipine sokar. Tam ekran kipinden çıkmak için araç çubuğundaki <guiicon>Tam Ekran Kipinden Çık</guiicon> simgesine basın veya <keycombo action="simul">&Ctrl;&Shift; <keycap>F</keycap></keycombo> kısayolunu kullanın.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Extensions…</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Genişletmeleri Yapılandır…</guimenuitem>

source: Opens a dialog with all installed plugins (&eg; from the KDE module extragear) and allows you to select the ones you need. All plugins are accessible in the <guimenu>Tools</guimenu> menu.
tr: Tüm kurulu eklentileri görebileceğiniz ve gereksiniminiz olanları seçebileceğiniz bir iletişim kutusu açar. Tüm eklentilere <guimenu>Araçlar</guimenu> menüsünden erişilebilir.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Spell Checking…</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Yazım Denetimini Yapılandır…</guimenuitem>

source: Displays the spell checking configuration dialog box, in which you can change settings associated with spell checking in &konqueror;.
tr: &konqueror;’da yazım denetimi yapılandırmasını yapabileceğiniz ve ilgili ayarları değiştirebileceğiniz bir iletişim kutusu görüntüler.

source: The Window Menu
tr: Pencere Menüsü

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>L</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>Split View Left/Right</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>L</keycap></keycombo></shortcut> <guimenu>Pencere</guimenu> <guimenuitem>Görünümü Sol/Sağ Şeklinde Böl</guimenuitem>

source: Split the view from left to right.
tr: Görünümü sol/sağ şeklinde bölün.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>T</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>Split View Top/Bottom</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>T</keycap></keycombo></shortcut> <guimenu>Pencere</guimenu> <guimenuitem>Görünümü Alt/Üst Şeklinde Böl</guimenuitem>

source: Split the view from top to bottom.
tr: Görünümü alt/üst şeklinde bölün.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>W</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>Close Active View</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>W</keycap></keycombo></shortcut> <guimenu>Pencere</guimenu> <guimenuitem>Etkin Görünümü Kapat</guimenuitem>

source: Remove the active view.
tr: Etkin görünümü kaldırın.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>New Window</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Pencere</guimenu> <guimenuitem>Yeni Pencere</guimenuitem>

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>D</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>Duplicate Window</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>D</keycap></keycombo></shortcut> <guimenu>Pencere</guimenu> <guimenuitem>Pencereyi Çoğalt</guimenuitem>
