Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konqueror.po
Languages: tr

source: <ulink url="help:/dolphin/configuring-dolphin.html#preferences-dialog-viewmodes">View Modes</ulink>: Configure file manager view modes
tr: <ulink url="help:/dolphin/configuring-dolphin.html#preferences-dialog-viewmodes">Görünüm Kipleri</ulink>: Dosya yöneticisi görünüm kiplerini yapılandır

source: <ulink url="help:/dolphin/configuring-dolphin.html#preferences-dialog-navigation">Navigation</ulink>: Configure file manager navigation
tr: <ulink url="help:/dolphin/configuring-dolphin.html#preferences-dialog-navigation">Dolaşım</ulink>: Dosya yöneticisi dolaşımını yapılandır

source: <ulink url="help:/dolphin/configuring-dolphin.html#preferences-dialog-services">Services</ulink>: Configure file manager services
tr: <ulink url="help:/dolphin/configuring-dolphin.html#preferences-dialog-services">Hizmetler</ulink>: Dosya yöneticisi hizmetlerini yapılandır

source: <ulink url="help:/dolphin/configuring-dolphin.html#preferences-dialog-general">General</ulink>: Configure general file manager settings
tr: <ulink url="help:/dolphin/configuring-dolphin.html#preferences-dialog-general">Genel</ulink>: Genel dosya yöneticisi ayarlarını yapılandır

source: <ulink url="help:/kcontrol/filetypes/index.html">File Associations</ulink>: Configure file associations
tr: <ulink url="help:/kcontrol/filetypes/index.html">Dosya İlişkilendirmeleri</ulink>: Dosya ilişkilendirmelerini yapılandır

source: <ulink url="help:/kcontrol/trash/index.html">Trash</ulink>: Configure trash settings
tr: <ulink url="help:/kcontrol/trash/index.html">Çöp Kutusu</ulink>: Çöp kutusu ayarlarını yapılandır

source: <ulink url="help:/kcontrol/khtml-behavior/index.html">Web Browsing</ulink>: Configure the browser behavior
tr: <ulink url="help:/kcontrol/khtml-behavior/index.html">Web Taraması</ulink>: Tarayıcı davranışını yapılandır

source: <ulink url="help:/kcontrol/proxy/index.html">Proxy</ulink>: Configure the proxy servers used
tr: <ulink url="help:/kcontrol/proxy/index.html">Vekil</ulink>: Kullanılan vekil sunucularını yapılandır

source: <ulink url="help:/kcontrol/kcmcss/index.html">Appearance</ulink>: Configure how to display web pages
tr: <ulink url="help:/kcontrol/kcmcss/index.html">Görünüş</ulink>: Web sayfalarının nasıl görüntüleneceğini yapılandır

source: <ulink url="help:/kcontrol/khtml-adblock/index.html">AdBlocK Filters</ulink>: Configure &konqueror; AdBlocK filters
tr: <ulink url="help:/kcontrol/khtml-adblock/index.html">Reklâm Engelleme Süzgeçleri</ulink>: &konqueror; Reklâm engelleme süzgeçlerini yapılandır

source: <ulink url="help:/kcontrol/cache/index.html">Cache</ulink>: Configure web cache settings
tr: <ulink url="help:/kcontrol/cache/index.html">Önbellek</ulink>: Web önbelleği ayarlarını yapılandır

source: <ulink url="help:/kcontrol/history/index.html">History</ulink>: Configure the history sidebar
tr: <ulink url="help:/kcontrol/history/index.html">Geçmiş</ulink>: Geçmiş kenar çubuğunu yapılandır

source: <ulink url="help:/kcontrol/cookies/index.html">Cookies</ulink>: Configure the way cookies work
tr: <ulink url="help:/kcontrol/cookies/index.html">Çerezler</ulink>: Çerezlerin nasıl çalıştığını yapılandır

source: <ulink url="help:/kcontrol/useragent/index.html">Browser Identification</ulink>: Configure the way Konqueror reports itself
tr: <ulink url="help:/kcontrol/useragent/index.html">Tarayıcı Tanımlaması</ulink>: Konqueror’un kendini nasıl tanıttığını yapılandır

source: <ulink url="help:/kcontrol/khtml-java-js/index.html">JavaScript</ulink>: Configure the behavior of JavaScript
tr: <ulink url="help:/kcontrol/khtml-java-js/index.html">JavaScript</ulink>: JavaScript davranışını yapılandır

source: Pressing the <guibutton>Help</guibutton> button will give you detailed instructions about how to use each of these sections, or you can use the <link linkend="bubble">What’s This?</link> feature.
tr: <guibutton>Yardım</guibutton> düğmesine basmak, bu bölümlerin her birini nasıl kullanacağınız konusunda ayrıntılı yönergeler sağlar veya <link linkend="bubble">Bu Nedir?</link> özelliğini de kullanabilirsiniz.

source: Command Reference
tr: Komut Başvurusu

source: The shortcut key combinations shown in this chapter are the default ones. They can of course be changed.
tr: Bu fasılda gösterilen kısayol düğmesi kombinasyonları, öntanımlı ayarlardır. Elbette istediğiniz gibi değiştirebilirsiniz.

source: Special Shortcuts
tr: Özel Kısayollar

source: There are some useful shortcuts that are not shown in any of the menus:
tr: Menülerin herhangi birinde gösterilmeyen bazı kullanışlı kısayollar vardır:

source: Sets the focus to the text entry box in the Location Toolbar.
tr: Odağı, konum araç çubuğundaki metin girişi kutusuna taşır.

source: Activate the next tab page.
tr: Sonraki sekme sayfasını etkinleştirin.

source: Activate the previous tab page.
tr: Önceki sekme sayfasını etkinleştirin.

source: The Menubar
tr: Menü Çubuğu

source: Note that some menu entries only appear when they are applicable to the file you currently have open in &konqueror;. For example, the <menuchoice><guimenu>Edit</guimenu><guimenuitem>Find…</guimenuitem> </menuchoice> item will not appear when you are viewing the contents of a directory.
tr: Bazı menü girdilerinin yalnızca &konqueror;’da açık olan dosyaya/sayfaya göre göründüğünü aklınızda bulundurun. Örneğin, <menuchoice><guimenu>Düzen</guimenu><guimenuitem>Bul…</guimenuitem></menuchoice> ögesi, bir dizinin içeriğini görüntülerken gösterilmez.

source: &konqueror; has different menu items in file manager and browser mode. Only the items for these two modes are described in this chapter.
tr: &konqueror;’un dosya yöneticisi ve tarayıcı kipinde farklı menü ögeleri vardır. Bu fasılda, yalnızca bu iki kipteki ögeler açıklanmıştır.

source: If <emphasis>&konqueror;</emphasis> is using embedded components (&kde; Parts) such as &gwenview; for image viewing, &okular; for <acronym>PDF</acronym> and &PostScript; documents &etc; the menu items from these applications are merged into &konqueror;’s menu. Help for these additional menu items you find in the handbook of the embedded application.
tr: <emphasis>&konqueror;</emphasis> gömülü bileşenler (&kde; Part’ları) kullanıyorsa; örneğin, görsel görüntülemek için &gwenview;, <acronym>PDF</acronym> ve &PostScript; belgelerini görüntülemek için &okular; &etc;; bu uygulamalardaki menü ögeleri &konqueror;’un menüsüne birleştirilirler. Bu ek menü ögeleri için olan yardımı, bu uygulamaların belgelendirmesinde bulabilirsiniz.

source: The File Menu
tr: Dosya Menüsü

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New Window</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Yeni Pencere</guimenuitem>

source: Open another &konqueror; window.
tr: Başka bir &konqueror; penceresi açın.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New Tab</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Yeni Sekme</guimenuitem>

source: Open another &konqueror; tab, containing a blank page.
tr: Boş bir sayfa içeren, başka bir &konqueror; sekmesi açın.

source: <shortcut> <keycombo action="simul">&Alt;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open Location…</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Konum Aç…</guimenuitem>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open File…</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Dosya Aç…</guimenuitem>

source: Open a file using the &kde; file dialog.
tr: &kde; dosya iletişim kutusunu kullanarak bir dosya açın.

source: <guimenu>File</guimenu> <guimenuitem>Sessions</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Oturumlar</guimenuitem>

source: Open a submenu to save the current session (open tabs and windows) for easy retrieval, manage sessions and switch to previously saved sessions.
tr: Geçerli oturumu (açık sekmeler ve pencereler) kolay erişim için kaydetmek, oturumları yönetmek ve önceden kaydedilmiş oturumlara geçmek için bir alt menü açın.

source: <guimenu>File</guimenu> <guimenuitem>Send Link Address…</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Bağlantı Adresini Gönder…</guimenuitem>

source: Send an email containing a link to the current location.
tr: Geçerli konuma bir bağlantı içeren bir e-posta gönderin.

source: <guimenu>File</guimenu> <guimenuitem>Send File…</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Dosya Gönder…</guimenuitem>

source: Send an email containing the selected file as an attachment.
tr: Seçili dosyayı ek olarak içeren bir e-posta gönderin.

source: <menuchoice> <guimenu>File</guimenu> <guimenuitem>Save As…</guimenuitem></menuchoice> (Browser mode)
tr: <menuchoice> <guimenu>Dosya</guimenu> <guimenuitem>Farklı Kaydet…</guimenuitem></menuchoice> (Tarayıcı kipi)

source: Only applies if you are viewing a document or web page, uses the <guilabel>Save As…</guilabel> dialog box to let you save a copy to your own computer.
tr: Yalnızca bir belge veya web sayfası görüntülüyorsanız geçerlidir; bir kopyasını kendi bilgisayarınıza kaydetmenize olanak tanımak için <guilabel>Farklı Kaydet…</guilabel> iletişim kutusunu kullanır.

source: <menuchoice> <guimenu>File</guimenu> <guimenuitem>Save Frame As…</guimenuitem></menuchoice> (Browser mode)
tr: <menuchoice> <guimenu>Dosya</guimenu> <guimenuitem>Çerçeveyi Farklı Kaydet…</guimenuitem></menuchoice> (Tarayıcı kipi)

source: Similar to <guimenuitem>Save As…</guimenuitem> but for use with a web site that uses frames.
tr: <guimenuitem>Farklı Kaydet…</guimenuitem> seçeneğine benzerdir; ancak çerçeveler kullanan bir web sitesiyle çalışır.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Print…</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Yazdır…</guimenuitem>

source: Print.
tr: Sayfayı yazdırın.

source: <menuchoice> <guimenu>File</guimenu> <guimenuitem>Print Frame</guimenuitem></menuchoice> (Browser mode)
tr: <menuchoice> <guimenu>Dosya</guimenu> <guimenuitem>Çerçeveyi Yazdır</guimenuitem></menuchoice> (Tarayıcı kipi)

source: Print selected frame of a Web page.
tr: Bir web sayfasının seçili çerçevesini yazdırın.

source: <guimenu>File</guimenu> <guimenuitem>Open With</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Birlikte Aç</guimenuitem>

source: Displays a list of applications installed on the system associated with the mimetype of the current URL.
tr: Geçerli URL’nin MIME türü ile ilişkili sistemde kurulu uygulamaların bir listesini görüntüler.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Çık</guimenuitem>

source: Close down this instance of &konqueror;.
tr: &konqueror;’un bu örneğini kapatın.

source: The Edit Menu
tr: Düzen Menüsü

source: Some items in the Menubar <guimenu>Edit</guimenu> menu can also be found by &RMB; clicking on a free area of a view.
tr: Menü çubuğundaki <guimenu>Düzen</guimenu> menüsünün bazı ögelerine, görünümün boş bir yerinde &RMB; ile tıklayarak erişebilirsiniz.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo: <replaceable>Action</replaceable></guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Geri Al: <replaceable>Eylem</replaceable></guimenuitem>

source: Sometimes lets you reverse a mistaken action.
tr: Bazen hatalı bir eylemi tersine çevirmenizi sağlar.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Cut</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Kes</guimenuitem>

source: Puts selected item(s) into the clipboard. If you then paste the items they will be moved from the original location to the new one.
tr: Seçili ögeleri panoya yerleştirir. Daha sonra ögeleri yapıştırırsanız özgün konumdan yeni konumlarına taşınırlar.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Kopyala</guimenuitem>

source: Copy selected item(s) to the clipboard.
tr: Seçili ögeleri panoya kopyalayın.

source: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem></menuchoice> (Browser mode)
tr: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Yapıştır</guimenuitem></menuchoice> (Tarayıcı kipi)

source: Paste the clipboard content into the Location Bar, if the Location Bar has the focus.
tr: Konum çubuğu odağa sahipse pano içeriğini konum çubuğuna yapıştırın.

source: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste Clipboard Contents…</guimenuitem></menuchoice> or <menuchoice><guimenu>Edit</guimenu><guimenuitem>Paste one File</guimenuitem></menuchoice> or <menuchoice><guimenu>Edit</guimenu><guimenuitem>Paste one Folder</guimenuitem></menuchoice> or <menuchoice><guimenu>Edit</guimenu><guimenuitem>Paste x Items</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Pano İçeriğini Yapıştır…</guimenuitem></menuchoice> veya <menuchoice><guimenu>Düzen</guimenu><guimenuitem>1 Dosyayı Yapıştır</guimenuitem></menuchoice> veya <menuchoice><guimenu>Düzen</guimenu><guimenuitem>1 Klasörü Yapıştır</guimenuitem></menuchoice> veya <menuchoice><guimenu>Düzen</guimenu><guimenuitem>N Ögeyi Yapıştır</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: Paste the currently copied/cut item(s) to the current folder. If the clipboard does not contain files or folders, the clipboard contents (such as text or image data) will be pasted into a new file.
tr: Şu anda kopyalanan/kesilen ögeleri geçerli klasöre yapıştırın. Pano dosya veya klasör içermiyorsa pano içeriği (metin veya görsel verisi gibi) yeni bir dosyaya yapıştırılır.

source: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut><guimenu>Edit</guimenu> <guimenuitem>Select All</guimenuitem></menuchoice> (Browser mode)
tr: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut><guimenu>Düzen</guimenu> <guimenuitem>Tümünü Seç</guimenuitem></menuchoice> (Tarayıcı kipi)

source: Selects all text in an &HTML; page or in a text page being previewed, you can then <guimenuitem>Copy</guimenuitem> it and <guimenuitem>Paste</guimenuitem> it into a text editor.
tr: Önizlenen bir &HTML; veya metin sayfasındaki metnin tümünü seçer, sonrasında onu <guimenuitem>Kopyala</guimenuitem> yapıp bir metin düzenleyicisine <guimenuitem>Yapıştır</guimenuitem> yapabilirsiniz.

source: <menuchoice> <guimenu>Edit</guimenu> <guisubmenu>Create New</guisubmenu></menuchoice> (File Manager mode)
tr: <menuchoice> <guimenu>Düzen</guimenu> <guisubmenu>Yeni Oluştur</guisubmenu></menuchoice> (Dosya Yöneticisi kipi)

source: Creates a new object (such as a folder or a text file) in the current folder. See the <link linkend="making">Create New…</link> section for more details.
tr: Geçerli klasörde yeni bir nesne (klasör veya metin dosyası gibi) oluşturur. Daha çok ayrıntı için <link linkend="making">Yeni Oluştur…</link> bölümüne bakın.

source: <menuchoice> <shortcut><keycap>F2</keycap> </shortcut><guimenu>Edit</guimenu> <guimenuitem>Rename</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <shortcut><keycap>F2</keycap> </shortcut><guimenu>Düzen</guimenu> <guimenuitem>Yeniden Adlandır</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: Lets you rename a file or folder without having to open the <guimenuitem>Properties…</guimenuitem> dialog box.
tr: <guimenuitem>Özellikler…</guimenuitem> iletişim kutusunu açmadan bir dosyayı veya klasörü yeniden adlandırmanıza olanak tanır.

source: <menuchoice> <shortcut><keycap>Del</keycap></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Move to Trash</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <shortcut><keycap>Sil</keycap></shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Çöp Kutusuna Taşı</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: Move selected item(s) to the Trash folder.
tr: Seçili ögeleri çöp kutusuna taşıyın.

source: <menuchoice> <shortcut> <keycombo action="simul">&Shift;<keycap>Del</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Delete</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <shortcut> <keycombo action="simul">&Shift;<keycap>Sil</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Sil</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: Delete the selected item(s).
tr: Seçili ögeleri silin.

source: <menuchoice> <guimenu>Edit</guimenu> <guimenuitem>Edit File Type…</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <guimenu>Düzen</guimenu> <guimenuitem>Dosya Türünü Düzenle…</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: Open the <guilabel>Edit File Type</guilabel> dialog box
tr: <guilabel>Dosya Türünü Düzenle</guilabel> iletişim kutusunu açın.

source: <menuchoice> <shortcut> <keycombo action="simul">&Alt;<keycap>Return</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Properties…</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <shortcut> <keycombo action="simul">&Alt;<keycap>Dönüş</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Özellikler…</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: Shows the properties dialog for the currently selected item(s).
tr: Şu anda seçili ögeler için özellikler iletişim kutusunu gösterir.

source: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guisubmenu>Selection</guisubmenu> <guimenuitem>Select Items Matching…</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guisubmenu>Seçim</guisubmenu> <guimenuitem>Eşleşen Ögeleri Seç…</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: Together with the <guimenuitem>Unselect Items Matching…</guimenuitem>, <guimenuitem>Unselect All</guimenuitem> and <guimenuitem>Invert Selection</guimenuitem> commands, this provides an easy and powerful way of selecting multiple files.
tr: <guimenuitem>Eşleşen Ögelerin Seçimini Kaldır…</guimenuitem>, <guimenuitem>Tümünün Seçimini Kaldır</guimenuitem> ve <guimenuitem>Seçimi Tersine Çevir</guimenuitem> komutları ile birlikte bu, birden çok dosyayı seçmenin kolay bir yolunu sağlar.

source: It brings up a simple dialog box where you can enter a file name using the wild card characters * and ?, for example entering <literal role="extension">*.html</literal> will select all files ending with <literal role="extension">.html</literal> while <filename>?a*</filename> will select all files which have the letter a as the second character in their filename.
tr: Joker karakterleri * ve ? kullanarak dosya adını girebileceğiniz basit bir iletişim kutusu açar; örneğin, <literal role="extension">*.html</literal> girmek, <literal role="extension">.html</literal> ile biten tüm dosyaları seçerken, <filename>?a*</filename> girmek ise dosya adında ikinci karakter olarak “a” içeren tüm dosyaları seçer.

source: <menuchoice> <guimenu>Edit</guimenu> <guisubmenu>Selection</guisubmenu> <guimenuitem>Unselect Items Matching…</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <guimenu>Düzen</guimenu> <guisubmenu>Seçim</guisubmenu> <guimenuitem>Eşleşen Ögelerin Seçimini Kaldır…</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: Unselect files or folders via a dialog similar to the one used by <guimenuitem>Select…</guimenuitem>.
tr: <guimenuitem>Seç…</guimenuitem> tarafından kullanılan iletişim kutusuna benzer bir tanesiyle dosyaların veya klasörlerin seçimlerini kaldırın.

source: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut><guimenu>Edit</guimenu> <guisubmenu>Selection</guisubmenu> <guimenuitem>Select All</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut><guimenu>Düzen</guimenu> <guisubmenu>Seçim</guisubmenu> <guimenuitem>Tümünü Seç</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: Selects all items in a folder; you can then <guimenuitem>Copy</guimenuitem> or <guimenuitem>Cut</guimenuitem> them and <guimenuitem>Paste</guimenuitem> them into a different folder.
tr: Bir klasördeki tüm ögeleri seçer; sonrasında onları <guimenuitem>Kopyala</guimenuitem> veya <guimenuitem>Kes</guimenuitem> yapıp başka bir klasöre <guimenuitem>Yapıştır</guimenuitem> yapabilirsiniz.

source: <menuchoice> <guimenu>Edit</guimenu> <guisubmenu>Selection</guisubmenu> <guimenuitem>Unselect All</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <guimenu>Düzen</guimenu> <guisubmenu>Seçim</guisubmenu> <guimenuitem>Tümünün Seçimini Kaldır</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: Unselect all selected files or folders.
tr: Seçili tüm dosya veya klasörlerin seçimlerini kaldırın.

source: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> </shortcut><guimenu>Edit</guimenu> <guisubmenu>Selection</guisubmenu> <guimenuitem>Invert Selection</guimenuitem></menuchoice> (File Manager mode)
tr: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> </shortcut><guimenu>Düzen</guimenu> <guisubmenu>Seçim</guisubmenu> <guimenuitem>Seçimi Tersine Çevir</guimenuitem></menuchoice> (Dosya Yöneticisi kipi)

source: Invert current selection.
tr: Geçerli seçimi tersine çevirin.

source: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut><guimenu>Edit</guimenu> <guimenuitem>Find…</guimenuitem></menuchoice> (Browser mode)
tr: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut><guimenu>Düzen</guimenu> <guimenuitem>Bul…</guimenuitem></menuchoice> (Tarayıcı kipi)

source: Displays the search bar at the bottom of the current window. Start typing to find a text string in a text page you are previewing or in an &HTML; page.
tr: Geçerli pencerenin altındaki arama çubuğunu görüntüler. Önizlemekte olduğunuz bir metin veya &HTML; sayfasında bir metin dizisi bulmak için yazmaya başlayın.

source: The View Menu
tr: Görünüm Menüsü
