Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konqueror.po
Languages: tr

source: Cancel the paste operation by pressing the <guibutton>Cancel</guibutton> button.
tr: Yapıştırma işlemini, <guibutton>İptal</guibutton> düğmesine basarak iptal edin.

source: Give the item that is being copied a different name. You can do this by typing a new name into the text entry box or get &konqueror; to <guibutton>Suggest New Name</guibutton>. When you have done this press the <guibutton>Continue</guibutton> button.
tr: Kopyalanmakta olan ögeye yeni bir ad verin. Bunu, metin giriş kutusuna yeni bir ad girerek veya &konqueror;’un <guibutton>Yeni Ad Öner</guibutton> özelliğiyle yapabilirsiniz. İşiniz bittiğinde <guibutton>Sürdür</guibutton> düğmesine tıklayın.

source: If you have copied multiple items, <guibutton>Skip</guibutton> the current item.
tr: Birden çok öge kopyalıyorsanız geçerli ögeyi <guibutton>Atla</guibutton> yapabilirsiniz.

source: The <guibutton>Apply to All</guibutton> button can be used if you have copied multiple items.
tr: Birden çok öge kopyalıyorsanız <guibutton>Tümüne Uygula</guibutton> düğmesi de kullanılabilir.

source: Selecting Items in the View
tr: Görünümdeki Ögeleri Seçmek

source: There are several ways to select items in the view. Once a group of items is selected, all actions, such as <menuchoice><guimenuitem>Cut</guimenuitem></menuchoice>, <menuchoice><guimenuitem>Copy</guimenuitem></menuchoice>, <menuchoice><guimenuitem>Move to Trash</guimenuitem></menuchoice>, and drag and drop operations, affect all selected items.
tr: Görünümdeki ögeleri seçmenin birden çok yolu vardır. Bir grup ögeyi seçtiğinizde, <menuchoice><guimenuitem>Kes</guimenuitem></menuchoice>, <menuchoice><guimenuitem>Kopyala</guimenuitem></menuchoice>, <menuchoice><guimenuitem>Çöp Kutusuna Taşı</guimenuitem></menuchoice> ve sürükle–bırak işlemleri, seçili tüm ögeleri etkiler.

source: Selecting Items Using the Mouse
tr: Fare Kullanarak Ögeleri Seçmek

source: You can press the &LMB; somewhere in the view and draw a rectangle around a group of items before releasing the button. This will select all items in the rectangle and clear the previous selection. If the &Shift; key is pressed during the selection process, the previous selection is kept.
tr: Görünümün herhangi bir yerine &LMB; ile basabilir ve düğmeyi bırakmadan önce bir grup ögenin etrafına bir dikdörtgen çizebilirsiniz. Bu, dikdörtgen içindeki tüm ögeleri seçecek ve önceki seçimi temizleyecektir. Seçim işlemi sırasında &Shift; düğmesine basılırsa önceki seçim korunur.

source: If the &Ctrl; key is pressed while an item is clicked with the &LMB;, the selection state of this item is toggled. If the &Ctrl; key is pressed while a rectangle is drawn around a group of items as described above, the selection state of all items in the rectangle will be toggled.
tr: Bir ögeye &LMB; ile tıklanırken &Ctrl; düğmesine basılırsa bu ögenin seçim durumu değiştirilir. Yukarıda açıklandığı gibi bir grup ögenin etrafına bir dikdörtgen çizilirken &Ctrl; düğmesine basılırsa dikdörtgen içindeki tüm ögelerin seçim durumu değiştirilir.

source: If the &Shift; key is pressed while an item is clicked with the &LMB;, all items between the previous current item and the clicked item will be selected.
tr: Bir ögeye &LMB; ile tıklanırken &Shift; düğmesine basılırsa önceki geçerli öge ile tıklanan öge arasındaki tüm ögeler seçilecektir.

source: Selecting Items Using the Keyboard
tr: Klavye Kullanarak Ögeleri Seçmek

source: If an arrow key, <keysym>PgUp</keysym>, <keysym>PgDn</keysym>, <keycap>Home</keycap>, or <keycap>End</keycap> is pressed, the new current item is selected, and the previous selection is cleared.
tr: Bir ok, <keysym>Sayfa Yukarı</keysym>, <keysym>Sayfa Aşağı</keysym>, <keycap>Baş</keycap> veya <keycap>Son</keycap> düğmelerinden birine basılmışsa yeni geçerli öge seçilir ve önceki seçim temizlenir.

source: If the &Ctrl; key is held while one of the above keys is pressed, the selection remains unchanged.
tr: Yukarıdaki düğmelerden birine basarken &Ctrl; düğmesi basılı tutulursa seçim değişmeden kalır.

source: If the &Shift; key is held while one of the above keys is pressed, all items between the previous current item and the new current item will be selected.
tr: Yukarıdaki düğmelerden birine basarken &Shift; düğmesi basılı tutulursa önceki geçerli öge ile yeni geçerli öge arasındaki tüm ögeler seçilecektir.

source: If <keycombo action="simul">&Ctrl;<keysym>Space</keysym></keycombo> is pressed, the selection state of the current item is toggled.
tr: <keycombo action="simul">&Ctrl;<keysym>Boşluk</keysym></keycombo> düğmesine basılırsa geçerli ögenin seçim durumu değiştirilir.

source: <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> selects all items in the view.
tr: <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo>, görünümdeki tüm ögeleri seçer.

source: <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> toggles the selection state of all items in the view.
tr: <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo>, görünümdeki tüm ögelerin seçim durumunu değiştirir.

source: Select a file or folder by typing the first few letters of its name and the first matching item is selected. To clear the selection and cancel the keyboard search press &Esc; or wait longer than the timeout of 1 second.
tr: Adının ilk birkaç harfini yazarak bir dosya veya klasör seçin ve eşleşen ilk öge seçilir. Seçimi temizlemek ve klavye aramasını iptal etmek için &Esc; düğmesine basın veya 1 saniyelik zaman aşımından daha uzun süre bekleyin.

source: Selecting Items Using the Menu
tr: Menü Kullanarak Ögeleri Seçmek

source: You sometimes want to delete, copy or move a number of files that are similar in some way. For example you may wish to move all of the <filename class="extension">.png</filename> graphics files from one folder to another. &konqueror; makes this easy by letting you select multiple files based on similarities in their file names.
tr: Bazen bir şekilde benzer olan bir dizi dosyayı silmek, kopyalamak veya taşımak istersiniz. Örneğin, tüm <filename class="extension">.png</filename> grafik dosyalarını bir klasörden diğerine taşımak isteyebilirsiniz. &konqueror; dosya adlarındaki benzerliklere göre birden fazla dosya seçmenize izin vererek bunu kolaylaştırır.

source: Use the Menubar <menuchoice><guimenu>Edit</guimenu><guisubmenu>Selection</guisubmenu> <guimenuitem>Select Matching Items…</guimenuitem></menuchoice> option or the shortcut <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo>. This brings up a little dialog box in which you enter a filename containing the wildcard characters <keycap>*</keycap>, which matches any number of characters, and <keycap>?</keycap> which matches a single character. Press <guibutton>OK</guibutton> and &konqueror; will highlight all files with matching names. For example:
tr: Menü çubuğunda <menuchoice><guimenu>Düzen</guimenu><guisubmenu>Seçim</guisubmenu> <guimenuitem>Eşleşen Ögeleri Seç…</guimenuitem></menuchoice> seçeneğini veya <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> kısayolunu kullanın. Bu, herhangi bir karakter sayısıyla eşleşen <keycap>*</keycap> veya tek bir karakter ile eşleşen <keycap>?</keycap> joker karakterlerini girebileceğiniz bir iletişim kutusu açar. <guibutton>Tamam</guibutton> düğmesine basın ve &konqueror; eşleşen adlara sahip tüm dosyaları vurgulayacaktır. Örneğin:

source: <userinput><filename>flag*.png</filename></userinput> will select all filenames starting with the letters <quote>flag</quote> and ending with <quote><literal role="extension">.png</literal></quote>.
tr: <userinput><filename>bayrak*.png</filename></userinput>, <quote>bayrak</quote> ile başlayan ve <quote><literal role="extension">.png</literal></quote> ile biten tüm dosyaları seçer.

source: <userinput><filename>memo?.txt</filename></userinput> will select <filename>memo1.txt</filename> and <filename>memo9.txt</filename> but not <filename>memo99.txt</filename>.
tr: <userinput><filename>memo?.txt</filename></userinput>, <filename>memo1.txt</filename> ve <filename>memo9.txt</filename> dosyalarını seçer; ancak <filename>memo99.txt</filename> dosyasını seçmez.

source: When you have selected a range of files, you can narrow down the selection by using the Menubar <menuchoice><guimenu>Edit</guimenu><guisubmenu>Selection</guisubmenu> <guimenuitem>Unselect Matching Items…</guimenuitem></menuchoice> option to specify which of the selected files should be removed from the selection.
tr: Bir dosya erimi seçtiğinizde, seçimi menü çubuğundan <menuchoice><guimenu>Düzen</guimenu><guisubmenu>Seçim</guisubmenu> <guimenuitem>Eşleşen Ögelerin Seçimini Kaldır…</guimenuitem></menuchoice> seçeneğini kullanarak, hangi dosyaların seçiminin kaldırılması gerektiğini belirtebilirsiniz.

source: Use the Menubar <menuchoice><guimenu>Edit</guimenu><guisubmenu>Selection</guisubmenu> <guimenuitem>Unselect All</guimenuitem></menuchoice> option or just &LMB; click on a clear area of the view to cancel the selection.
tr: Menü çubuğundan <menuchoice><guimenu>Düzen</guimenu><guisubmenu>Seçim</guisubmenu> <guimenuitem>Tümünün Seçimini Kaldır</guimenuitem></menuchoice> veya boş bir alanda &LMB; ile tıklayarak seçimi iptal edebilirsiniz.

source: You can even invert the selection: that is, deselect all selected files and select those that were previously unselected. Use the Menubar <menuchoice><guimenu>Edit</guimenu><guisubmenu>Selection</guisubmenu><guimenuitem>Invert Selection</guimenuitem></menuchoice> option or <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> to do this.
tr: Seçimi tersine de çevirebilirsiniz; bu, seçili tüm dosyaların seçimini kaldırır ve seçili olmayanları seçer. Menü çubuğundan <menuchoice><guimenu>Düzen</guimenu> <guisubmenu>Seçim</guisubmenu> <guimenuitem>Seçimi Tersine Çevir</guimenuitem></menuchoice> seçeneğini veya <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> kısayolunu kullanın.

source: Create New
tr: Yeni Oluştur

source: When &konqueror; is in File Manager mode, picking <guisubmenu>Create New</guisubmenu> from &RMB; clicking on a free area in a folder view gives you a submenu letting you create any of the following in the current folder:
tr: &konqueror; Dosya Yöneticisi kipindeyken, &RMB; bağlam menüsünden <guisubmenu>Yeni Oluştur</guisubmenu> seçeneğini kullanmak, aşağıdakilerden birini geçerli klasörde oluşturmanıza olanak tanır:

source: Folder…
tr: Klasör…

source: An easy way of creating a new (sub)folder.
tr: Yeni bir klasör oluşturmanın kolay bir yoludur.

source: Text File…
tr: Metin Dosyası…

source: Use this to create an ordinary, empty, text file. A dialog box will be opened for you to enter the name of your new file.
tr: Sıradan, boş bir metin dosyası oluşturmak için bunu kullanın. Yeni dosyanızın adını girmeniz için bir iletişim kutusu açılacaktır.

source: HTML File…
tr: HTML Dosyası…

source: Creates a skeleton <acronym>HTML</acronym> source file. When you type the new file’s name into the dialog box it is probably best to give it a <literal role="extension">.html </literal> extension to avoid confusion.
tr: Bir temel <acronym>HTML</acronym> kaynağı dosyası oluşturur. Yeni dosyanın adını iletişim kutusuna girdiğinizde, karışıklığı önlemek için <literal role="extension">.html</literal> uzantısını vermeniz yararlı olacaktır.

source: <replaceable>Type of Document</replaceable> Document…
tr: <replaceable>Belgenin Türü</replaceable> Belgesi…

source: Depending on the installed applications and file associations several menuitems for different types of documents are displayed and enable you to create skeleton documents of the selected type.
tr: Kurulu uygulamalara ve dosya ilişkilendirmelerine bağlı olarak, farklı belge türleri için çeşitli menü ögeleri görüntülenir ve seçilen türde iskelet belgeler oluşturmanıza olanak tanır.

source: Link to Location (URL)…
tr: Konuma Bağlantı (URL)…

source: This lets you create an icon to open &konqueror; at a particular folder or web page. As with <guimenuitem>Link To Application…</guimenuitem> you can make the application icon appear on your desktop by creating the link in your <filename>~/Desktop</filename> folder or going to the <guisubmenu>Create New…</guisubmenu> sub menu by right clicking on a free area of the desktop.
tr: Bu, belirli bir klasör veya web sayfası ile &konqueror;’u açabilmeniz için bir simge oluşturmanıza olanak tanır. <guimenuitem>Uygulamaya Bağlantı…</guimenuitem> ile aynı şekilde, uygulama simgesinin masaüstünde görünmesi için <filename>~/Desktop</filename> klasörünüzde veya boş bir alanda sağ tıklayıp <guisubmenu>Yeni Oluştur…</guisubmenu> seçeneğini kullanarak yapılabilir.

source: Link to File or Directory…
tr: Dosyaya veya Dizine Bağlantı…

source: Create a symbolic link for local files or folder.
tr: Yerel dosyalar veya klasörler için bir sembolik bağlantı oluşturun.

source: Link to Application…
tr: Uygulamaya Bağlantı…

source: This option is most useful if you want to create an icon that will open a particular application. It opens a dialog box with several tabbed pages. The first, <guilabel>General</guilabel>, is where you choose an icon and the text that will appear with it. The second page, <guilabel>Permissions</guilabel>, lets you select who can use or modify the icon. In the <guilabel>Application</guilabel> page you must enter the <guilabel>Command</guilabel> that will run the application, for example, <userinput>kwrite</userinput> to start up the &kwrite; text editor. <userinput>kwrite /home/pam/todo.txt</userinput> would open the file <filename>/home/pam/todo.txt</filename> in &kwrite;. Advanced options such as the file types which the application can open are also available from this page.
tr: Bu seçenek en çok, belirli bir uygulamayı açacak bir simge oluşturmak istediğinizde kullanışlıdır. Birkaç sekmeli sayfadan oluşan bir iletişim kutusu açar. İlki, <guilabel>Genel</guilabel>, bir simge ve onunla birlikte görünecek metni seçtiğiniz yerdir. İkinci sayfa, <guilabel>İzinler</guilabel>, simgeyi kimin kullanabileceğini veya üzerinde değişiklik yapabileceğini seçebileceğiniz yerdir. <guilabel>Uygulama</guilabel> sayfasında, uygulamayı çalıştıracak <guilabel>Komut</guilabel>’u girin; örneğin, &kwrite; metin düzenleyicisini çalıştırmak için <userinput>kwrite</userinput> girin. <userinput>kwrite /home/hakan/todo.txt</userinput>, <filename>/home/hakan/todo.txt</filename> dosyasını &kwrite; ile açar. Uygulamanın açabileceği dosya türleri gibi gelişmiş seçeneklere de bu sayfadan ulaşılabilir.

source: To make the application icon appear on your desktop, create the link in your <filename class="directory">~/Desktop</filename> folder (this may be called something slightly different depending on how &kde; was installed on your system) or get to the <guisubmenu>Create New…</guisubmenu> sub menu by <mousebutton>right</mousebutton> clicking on a free area of the desktop instead of within &konqueror;’s window.
tr: Uygulama simgesinin masaüstünde görünmesini sağlamak için bağlantıyı <filename class="directory">~/Desktop</filename> klasörünüzde oluşturun (bu, &kde; kurulumunun sisteminizde nasıl yapıldığına bağlı olarak farklı olabilir) veya &konqueror; penceresinin boş bir alanında <mousebutton>sağ</mousebutton> tıkladığınızda açılan menüden <guisubmenu>Yeni Oluştur…</guisubmenu> ögesini seçin.

source: If you have a lot of specialized application links and don’t want to clutter up the desktop, then why not create them in your Applications folder. You can get there in &konqueror; by choosing <menuchoice><guimenu>Go</guimenu> <guimenuitem>Applications</guimenuitem></menuchoice>. Then create a single icon on your desktop to open your Applications folder, which is usually in <filename class="directory">~/.local/share/applications</filename>.
tr: Pek fazla özelleştirilmiş bağlantılarınız varsa ve masaüstünüzde dağınıklık olmasını istemiyorsanız onları Uygulamalar klasörünüzde de oluşturabilirsiniz. Oraya gitmek için &konqueror;’da <menuchoice><guimenu>Git</guimenu> <guimenuitem>Uygulamalar</guimenuitem></menuchoice> yolunu izleyin. Sonrasında, masaüstünüzde Uygulamalar klasörünüzü açmak için tek bir bağlantı oluşturun; bu, genelde <filename class="directory">~/.local/share/applications</filename> biçimindedir.

source: To put an application link icon into the panel, first create it in the Applications folder then drag the icon onto a clear area of the panel.
tr: Panele bir uygulama bağlantısı simgesi koymak için önce Uygulamalar klasöründe oluşturun, ardından simgeyi panelin açık bir alanına sürükleyin.

source: Changing Names and Permissions
tr: Adları ve İzinleri Değiştirmek

source: The two easiest ways to change the name of a file or folder is to either <mousebutton>right</mousebutton> click on it and select <guimenuitem>Rename</guimenuitem>, or select the file or folder and then press the <keycap>F2</keycap> key.
tr: Bir dosyanın veya klasörün adını değiştirmenin en kısa iki yolu, üzerinde <mousebutton>sağ</mousebutton> tıklayıp açılan menüden <guimenuitem>Yeniden Adlandır</guimenuitem> ögesini seçmek veya dosyayı veya klasörü seçip <keycap>F2</keycap> düğmesine basmaktır.

source: To change the name or permissions of a file or folder <mousebutton>right</mousebutton> click on its name or icon and select the <guimenuitem>Properties</guimenuitem> item, or if you have <quote>selected</quote> the file or folder, then you can use the Menubar <menuchoice><guimenu>Edit</guimenu><guimenuitem>Properties</guimenuitem> </menuchoice> (<keycombo action="simul">&Alt;<keycap>Return</keycap></keycombo>) option.
tr: Bir dosyanın veya klasörün adını veya izinlerini değiştirmek için adının veya simgesinin üzerinde <mousebutton>sağ</mousebutton> tıklayın ve <guimenuitem>Özellikler</guimenuitem> ögesini seçin veya dosyayı veya klasörü halihazırda <quote>seçtiyseniz</quote> menü çubuğundan <menuchoice><guimenu>Düzen</guimenu><guimenuitem>Özellikler</guimenuitem> </menuchoice> (<keycombo action="simul">&Alt;<keycap>Dönüş</keycap></keycombo>) seçeneğini kullanın.

source: This will bring up the Properties dialog box with several tabbed pages:
tr: Bu, birkaç sekmeli sayfa içeren Özellikler iletişim kutusunu getirecektir:

source: <guilabel>General</guilabel>, which gives you some information about the item and lets you change its name and, for a folder, the associated icon.
tr: <guilabel>Genel</guilabel>, size öge hakkında bilgi verir ve adını — eğer bir klasörse ilişkili simgesini de değiştirmenize izin verir.

source: <guilabel>Permissions</guilabel>, which shows you the item’s ownership and access permissions and lets you change the permissions.
tr: <guilabel>İzinler</guilabel>, size ögenin sahiplik bilgisini gösterir ve izinlerine erişip onları değiştirmenize olanak tanır.

source: Copy and Rename
tr: Kopyala ve Yeniden Adlandır

source: If you want to make a copy of an existing file with a different name —perhaps as a backup— in the same folder as the original file, do a normal <guimenuitem>Copy</guimenuitem> then when you <guimenuitem>Paste</guimenuitem> it a dialog box will pop up, complaining that the file already exists. Just type the new name into the dialog’s text box and press the <guibutton>Continue</guibutton> button (or if you are feeling lazy pressing the <guibutton>Suggest New Name</guibutton> button will generate a new name for you).
tr: Var olan bir dosyanın bir kopyasını yaratıp —yedekleme amaçlı olarak— başka bir ad vermek istiyorsanız normal bir <guimenuitem>Kopyala</guimenuitem> ve <guimenuitem>Yapıştır</guimenuitem> işlemi yapın. Bir iletişim kutusu açılıp dosyanın halihazırda var olduğunu söyleyecektir. İletişim kutusunun metin alanına yeni adı yazıp <guibutton>Sürdür</guibutton> düğmesine tıklayın (eğer tembelliğiniz üzerinizdeyse <guibutton>Yeni Ad Öner</guibutton> düğmesi sizin için bir ad üretecektir).

source: Configuring File Associations
tr: Dosya İlişkilendirmelerini Yapılandırmak

source: &kde; provides many applications which can open many different types of file. Most of the time, the defaults will work with no problems, but &konqueror; provides a powerful system to allow you to change the applications used to open each file type. For more details, choose the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Konqueror…</guimenuitem></menuchoice> menu item, select <guilabel>File Associations</guilabel> in the configuration dialog, and click on <guibutton>Help</guibutton>.
tr: &kde;, birçok değişik dosya türünü açabilen birçok uygulama sağlar. Çoğu zaman, öntanımlı ayarlar hiçbir sorun olmadan çalışır; ancak &konqueror; her bir dosya türünü açmak için kullanılan uygulamaları yapılandırmak için güçlü bir sistem sunar. Daha fazla ayrıntı için <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Konqueror Uygulamasını Yapılandır…</guimenuitem></menuchoice> menü ögesine gidin, yapılandırma iletişim kutusunda <guilabel>Dosya İlişkilendirmeleri</guilabel> sayfasına gidip <guibutton>Yardım</guibutton> düğmesine tıklayın.

source: At the Command Line
tr: Komut Satırında

source: Although &konqueror; is a very powerful and flexible <acronym>GUI</acronym> file manager, there are occasions when the experienced &Linux; / &UNIX; user wants to get down to the basics and work at the text command line level.
tr: &konqueror; çok güçlü ve esnek bir <acronym>grafik arayüz</acronym> dosya yöneticisi olmasına karşın, deneyimli &Linux;/&UNIX; kullanıcılarının temele inip komut satırı düzeyinde çalışmasını gerektiren durumlar olabilir.

source: You can, of course, open an instance of &konsole;, perhaps with &konqueror;’s Menubar <menuchoice><guimenu>Tools</guimenu><guimenuitem>Open Terminal</guimenuitem></menuchoice> option or with <keycap>F4</keycap>.
tr: &konqueror;’un <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Uçbirim Aç</guimenuitem></menuchoice> menü seçeneğinden veya <keycap>F4</keycap> düğmesiyle &konsole;’u açabilirsiniz.

source: If you only want to launch a program or view a &URL;, the <menuchoice> <guimenu>Tools</guimenu><guimenuitem>Execute Shell Command…</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo>) option may be easier.
tr: Yalnızca bir program çalıştırmak veya bir &URL; görüntülemek istiyorsanız <menuchoice> <guimenu>Araçlar</guimenu><guimenuitem>Kabuk Komutu Yürüt…</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo>) seçeneği daha kolay olabilir.

source: <menuchoice><guimenu>Tools</guimenu><guimenuitem>Execute Shell Command… </guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl; <keycap>E</keycap></keycombo>) opens a small command line dialog window where you can enter a shell command such as <userinput>ps -ax | grep kdeinit </userinput>. Note that it does not support full featured terminal control characters, so applications such as <userinput>top</userinput> and <userinput> less</userinput> will not work properly, but it is available immediately without the delay involved in starting &konsole;.
tr: <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Kabuk Komutu Yürüt…</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl; <keycap>E</keycap></keycombo>), bir kabuk komutu girebileceğiniz küçük bir komut satırı iletişim kutusu açar; örneğin, <userinput>ps -ax | grep kdeinit </userinput>. Bütün uçbirim kontrol karakterlerini desteklemediğini aklınızda bulundurun; bundan dolayı <userinput>top</userinput> ve <userinput>less</userinput> gibi komutlar düzgün çalışmazlar; ancak &konsole;’u başlatmayı beklemeden tez komutlar girmek için yararlıdır.
