Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konqueror.po
Languages: tr

source: In File Manager mode, you can select <menuchoice><guimenu>Tools</guimenu><guisubmenu>Create Image Gallery</guisubmenu></menuchoice> or use <keycombo>&Ctrl;<keycap>I</keycap></keycombo> to create an HTML page with thumbnails of all the images in the current folder. By default the HTML page is called <filename>images.html</filename> and the thumbnails are put into a new <filename>images</filename> folder.
tr: Geçerli klasördeki tüm görsellerin küçük görsellerinden bir HTML sayfası oluşturmak için Dosya Yöneticisi kipinde, <menuchoice><guimenu>Araçlar</guimenu> <guisubmenu>Görsel Galerisi Oluştur</guisubmenu></menuchoice> ögesini seçin veya <keycombo>&Ctrl;<keycap>I</keycap></keycombo> kısayolunu kullanın. Öntanımlı olarak, HTML sayfası <filename>images.html</filename> olarak adlandırılır ve küçük görseller <filename>images</filename> klasörüne konulur.

source: When you start the Image Gallery plugin a dialog opens allowing you to adjust the way the gallery is created.
tr: Görsel Galerisi eklentisini başlattığınızda, galerinin oluşturulma şeklini ayarlamanıza olanak tanıyan bir iletişim kutusu açılır.

source: Page Look
tr: Sayfa Görünümü

source: The Look dialog is for adjusting the appearance of the gallery page.
tr: Görünüm iletişim kutusu, galeri sayfasının görünüşünü ayarlamak içindir.

source: Look Dialog Screenshot
tr: Görünüm iletişim kutusunun ekran görüntüsü

source: Screenshot
tr: Ekran görüntüsü

source: Page title
tr: Sayfa başlığı

source: The Page title option has a text input box for changing the title of the image gallery page.
tr: Sayfa başlığı seçeneği, görsel galerisi sayfasının başlığını değiştirmek için bir metin giriş kutusuna sahiptir.

source: Images per row
tr: Satır başına görsel

source: The Images per row option has a slider and a spin box for adjusting the number of thumbnails that are in a single row in the gallery.
tr: Satır başına görsel seçeneğinde, galerideki tek bir satırda bulunan küçük görsellerin sayısını ayarlamak için bir sürgü ve bir döndürme kutusu bulunur.

source: Show image file name
tr: Görselin dosya adını göster

source: The Show image file name check box allows you to choose whether to display filenames below the gallery thumbnails.
tr: Görselin dosya adını göster onay kutusu, galeri küçük görsellerinin altında dosya adlarının görüntülenip görüntülenmeyeceğini seçmenize olanak tanır.

source: Show image file size
tr: Görselin dosya boyutunu göster

source: The Show image filesize check box allows you to choose whether to display filesizes below the gallery thumbnails.
tr: Görselin dosya boyutunu göster onay kutusu, galeri küçük görsellerinin altında dosya boyutlarının görüntülenip görüntülenmeyeceğini seçmenize olanak tanır.

source: Show image dimensions
tr: Görsel boyutlarını göster

source: The Show image dimensions check box allows you to choose whether to display image dimensions in pixels below the gallery thumbnails.
tr: Görsel boyutlarını göster onay kutusu, galeri küçük görsellerinin altında görsel boyutlarının piksel türünden görüntülenip görüntülenmeyeceğini seçmenize olanak tanır.

source: Font name
tr: Yazıtipi adı

source: The Font name combo box provides you with a choice of which font to use in creating the gallery.
tr: Yazıtipi adı açılan kutusu, galeriyi oluştururken hangi yazıtipini kullanacağınızı seçmenizi sağlar.

source: Font size
tr: Yazıtipi puntosu

source: The Font size spin box is for changing the size of the font you selected.
tr: Yazıtipi puntosu döndürme kutusu, seçtiğiniz yazıtipinin puntosunu değiştirmek içindir.

source: Foreground color
tr: Ön plan rengi

source: The Foreground color option has a selector for choosing the foreground color of the gallery, this includes the text areas.
tr: Ön plan rengi seçeneği, galerinin ön plan rengini seçmek için bir seçiciye sahiptir, bunda metin alanları da içerilir.

source: Background color
tr: Arka plan rengi

source: The Background color option has a selector for choosing the background color of the gallery.
tr: Arka plan rengi seçeneği, galerinin arka plan rengini seçmek için bir seçiciye sahiptir, bunda metin alanları da içerilir.

source: Folders
tr: Klasörler

source: The Folders dialog is used for choosing where to save the gallery. This dialog is also used to configure which folders are used.
tr: Klasörler iletişim kutusu, galerinin nereye kaydedileceğini seçmek için kullanılır. Bu iletişim kutusu aynı zamanda hangi klasörlerin kullanılacağını yapılandırmak için de kullanılır.

source: Folders Dialog Screenshot
tr: Klasörler iletişim kutusu ekran görüntüsü

source: Save to HTML file
tr: HTML dosyasına kaydet

source: The Save to file selector allows you to decide where you want to save your image gallery html page.
tr: Dosyaya kaydet seçicisi, görsel galerisi HTML sayfanızı nereye kaydetmek istediğinize karar vermenizi sağlar.

source: Recurse subfolders
tr: Alt klasörlerde özyinele

source: The Recurse subfolders check box enables recursing of subdirectories. If the check box is enabled, a slider and spin box are enabled to select the recursion depth.
tr: Alt klasörlerde özyinele onay kutusu, alt dizinlerin özyinelemesini etkinleştirir. Onay kutusu etkinleştirilirse özyineleme derinliğini seçmek için bir sürgü ve döndürme kutusu etkinleştirilir.

source: Copy original files
tr: Özgün dosyaları kopyala

source: The Copy original files check box creates an image folder storing copies of the original images used in the gallery.
tr: Özgün dosyaları kopyala onay kutusu, galeride kullanılan özgün görsellerin kopyalarını depolayan bir görsel klasörü oluşturur.

source: Use comment file
tr: Açıklama dosyası kullan

source: The use comment file check box enables a file selector to choose a comments file to use with your gallery. The comment file contains the subtitles for the images.
tr: Açıklama dosyası kullan onay kutusu, galerinizle birlikte kullanmak üzere bir yorum dosyası seçmek için bir dosya seçicisini etkinleştirir. Açıklama dosyası, görseller için olan alt yazıları içerir.

source: The format of this file is:
tr: Bu dosyanın biçimi:

source: # this is a comment, lines starting with “#” are ignored FILENAME1: Description FILENAME2: Description
tr: # Bu bir yorumdur, “#” ile başlayan satırlar yok sayılır. DOSYA_ADI_1: Açıklama DOSYA_ADI_2: Açıklama

source: Thumbnails
tr: Küçük Görseller

source: The thumbnails dialog is used for adjusting the properties of the thumbnails in the gallery.
tr: Küçük görseller iletişim kutusu, galerideki küçük görsellerin özelliklerini ayarlamak için kullanılır.

source: Thumbnails Dialog Screenshot
tr: Küçük görseller iletişim kutusunun ekran görüntüsü

source: Image format for the thumbnails
tr: Küçük görseller için görsel biçimi

source: The image format combo box allows you to choose which format is used for the thumbnail images.
tr: Görsel biçimi açılan kutusu, küçük görseller için hangi biçimin kullanılacağını seçmenize olanak tanır.

source: Thumbnail size
tr: Küçük görsel boyutu

source: The thumbnail size option provides a slider and spin box for adjusting the size of the thumbnails used in the gallery.
tr: Küçük görsel boyutu seçeneği, galeride kullanılan küçük görsellerin boyutunu ayarlamak için bir sürgü ve döndürme kutusu sağlar.

source: Set different color depth
tr: Farklı renk derinliği ayarla

source: The set different color depth check box enables a combo box for changing the color depth of the thumbnails if you wish to use a different color depth to that used in the original image.
tr: Farklı renk derinliği ayarla onay kutusu, özgün görselde kullanılandan farklı bir renk derinliği kullanmak isterseniz küçük görsellerin renk derinliğini değiştirmek için bir açılır kutuyu etkinleştirir.

source: Search Bar
tr: Arama Çubuğu

source: Provides a text box for easy access to search engines such as Google. Clicking on the icon on the left side of the search box opens a menu to select and enable different search engines and configure their open the <guilabel>Web Search Keywords</guilabel>.
tr: Google gibi arama motorlarına kolay erişim için bir metin kutusu sağlar. Arama kutusunun sol tarafındaki simgeye tıklamak, farklı arama motorlarını seçmek ve etkinleştirmek ve <guilabel>Web Arama Anahtar Sözcükleri</guilabel>’ni açmak için yapılandırmak üzere bir menü açar.

source: Shell Command Plugin
tr: Kabuk Komutu Eklentisi

source: This plugin enables you to execute a shell command in the current folder and view the output in a separate window.
tr: Bu eklenti, geçerli klasörde bir kabuk komutu yürütmenize ve çıktıyı ayrı bir pencerede görüntülemenize olanak tanır.

source: View Mode Extensions
tr: Görünüm Kipi Genişletmeleri

source: &konqueror; provides additional views in <menuchoice><guimenu>View</guimenu> <guisubmenu>View Mode</guisubmenu></menuchoice> in file manager and browser mode, if the corresponding applications and plugins are installed.
tr: &konqueror;, eğer ilgili uygulamalar ve eklentiler kuruluysa dosya yöneticisi ve tarayıcı kipinde <menuchoice><guimenu>Görünüm</guimenu> <guisubmenu>Görünüm Kipi</guisubmenu></menuchoice> altından erişilebilen ek görünümler sağlar.

source: The file manager mode has the additional views <guimenuitem>Radial Map</guimenuitem> from the application <application>Filelight</application> and the &konqueror; plugin <guimenuitem>File Size View</guimenuitem>.
tr: Dosya yöneticisi kipinde <application>Dosya Feneri</application> uygulamasının <guimenuitem>Radyal Harita</guimenuitem> görünümü ve &konqueror; eklentisi olan <guimenuitem>Dosya Boyutu Görünümü</guimenuitem> vardır.

source: &fsview;—the File System View
tr: &fsview; — Dosya Sistemi Görünümü

source: Introduction
tr: Giriş

source: The &fsview; Plugin for &konqueror; is another view mode for objects of mimetype <literal>inode/directory</literal> for local files. It can be viewed as an alternative to the various iconviews and listviews for browsing the content of your local file system.
tr: &konqueror; için olan &fsview; eklentisi, <literal>inode/directory</literal> MIME türüne sahip yerel dosyalar için bir görünüm kipidir. Yerel dosya sisteminizin içeriğine göz atmak için çeşitli simge görünümlerine ve liste görünümlerine bir alternatif olarak görülebilir.

source: The unique property of &fsview; is its ability to show whole nested folder hierarchies using a so-called tree map for graphical visualization. Tree maps allow for displaying metrics of objects in nested structures: each object is represented by a rectangle whose area is proportional to its metric. The sum of the children’s metrics must be equal to or smaller than the parent object’s metric.
tr: &fsview;’ün benzersiz özelliği, grafiksel görselleştirme için ağaç haritası adı verilen bir harita kullanarak tüm iç içe geçmiş klasör hiyerarşilerini gösterme yeteneğidir. Ağaç haritaları, iç içe geçmiş yapılardaki nesnelerin metriklerini görüntülemeye izin verir: her nesne, alanı metriği ile orantılı olan bir dikdörtgenle temsil edilir. Alt nesnelerin metriklerinin toplamı, üst nesnenin metriklerine eşit veya daha küçük olmalıdır.

source: For &fsview;, sizes of files and folders are chosen as the metric, where the size of a folder is defined to be the sum of the sizes of its subitems. This way, big files even deep down in the folder hierarchy can be spotted easily be looking for large rectangles. So &fsview; can be looked at as a graphical and interactive version of the &UNIX; <command>du</command> command.
tr: &fsview; için dosya ve klasörlerin boyutları metrik olarak seçilir, burada bir klasörün boyutu alt ögelerinin boyutlarının toplamı olarak tanımlanır. Bu şekilde, klasör hiyerarşisinin derinliklerindeki büyük dosyalar bile büyük dikdörtgenler aranarak kolayca tespit edilebilir. Yani &fsview;, &UNIX; <command>du</command> komutunun grafiksel ve etkileşimli bir sürümü olarak görülebilir.

source: The integration of &fsview; as part of Konqueror allows it to use the standard features such as context file menus, and mime type sensitive actions. But it was chosen not to implement automatic update by watching file system changes: if you delete a file shown in &fsview; outside of &konqueror;, you have to update manually by &eg; pressing <keycap>F5</keycap> to see the change. The reason for this decision is the potentially huge number of files which would have to be watched for changes, and thus, could put an unreasonable pressure on system resources for a small feature.
tr: Konqueror’un bir parçası olarak &fsview; tümleştirmesi, bağlam dosya menüleri ve MIME türüne duyarlı eylemler gibi standart özellikleri kullanmasına olanak tanır. Ancak, dosya sistemi değişikliklerini izleyerek kendiliğinden güncellemeyi uygulamamak seçilmiştir: &fsview;’de gösterilen bir dosyayı &konqueror; dışında silerseniz değişikliği görmek için &eg; <keycap>F5</keycap> düğmesine basarak elle güncellemeniz gerekir. Bu kararın nedeni, değişiklikler için izlenmesi gereken potansiyel olarak çok sayıda dosya olması ve bu nedenle küçük bir özellik için sistem kaynakları üzerinde makul olmayan bir baskı oluşturmasıdır.

source: Visualization Features
tr: Görselleştirme Özellikleri

source: This section explains the graphical visualization of &fsview; in detail.
tr: Bu bölüm, &fsview; grafik görselleştirmesini ayrıntılı olarak açıklar.

source: Item Drawing Options
tr: Öge Çizimi Seçenekleri

source: In &fsview;, an item of the tree map visualization is a rectangle representing a file or folder of your file system. For easier navigation, rectangles have meaningful coloring and labeling options.
tr: &fsview; içinde, ağaç haritası görselleştirmesinin bir ögesi, dosya sisteminizin bir dosya veya klasörünü temsil eden bir dikdörtgendir. Daha kolay gezinme için dikdörtgenler anlamlı renklendirme ve etiketleme seçeneklerine sahiptir.

source: The color of a rectangle, switchable via menu item <menuchoice><guimenu>View</guimenu><guisubmenu>Color Mode</guisubmenu></menuchoice> can be either representative of <guimenuitem>Depth</guimenuitem>, for easy detection of nesting, or a color mapping of different file attributes such as name, owner, group, or mime type.
tr: Bir dikdörtgenin rengi (<menuchoice><guimenu>Görünüm</guimenu><guisubmenu>Renk Kipi</guisubmenu></menuchoice> ile değiştirilebilir), iç içe geçmenin kolayca ayırt edilebilmesi için <guimenuitem>Derinlik</guimenuitem> betimi veya ad, sahip, grup veya MIME türü gibi farklı bir dosya özniteliğinin renk eşlemlemesi olabilir.

source: A rectangle can be labeled with the various attributes of the corresponding file or folder. For each attribute, you can choose whether it should be shown at all, only if space is available, or if space should be taken from children (thus introducing errors to pure tree map drawing constraints). Additionally, you can choose the relative location of the label in the rectangle.
tr: Bir dikdörtgen, ilgili dosya veya klasörün çeşitli öznitelikleriyle etiketlenebilir. Her bir öznitelik için hiç gösterilip gösterilmeyeceğini, yalnızca alan varsa gösterilip gösterilmeyeceğini veya alt ögelerden alan alınıp alınmayacağını seçebilirsiniz (böylece saf ağaç haritası çizim kısıtlamalarına hatalar eklenir). Ayrıca, etiketin dikdörtgen içindeki göreli konumunu da seçebilirsiniz.

source: TreeMap Drawing Algorithms
tr: Ağaç Haritası Çizimi Algoritmaları

source: For drawing algorithms in tree maps, the rule that the area is proportional to the metric of an item should hold true. With the tree map in &fsview;, this goal isn’t always met: we draw borders to show the nesting of items, and this border takes space for an item which is possibly lost for the areas of child items. Note that less space is lost for the border if the rectangle is quadratic.
tr: Ağaç haritalarındaki çizim algoritmaları için alanın bir ögenin metriğiyle orantılı olması kuralı doğru olmalıdır. &fsview; içindeki ağaç haritasında, bu hedef her zaman karşılanmaz: ögelerin iç içe geçtiğini göstermek için kenarlıklar çizeriz ve bu kenarlık, bir öge için büyük olasılıkla alt ögelerin alanları için kaybedilen alanı alır. Dikdörtgenin ikinci dereceden olması durumunda kenarlık için daha az alan kaybedildiğine dikkat edin.

source: Similarly, it is better for a good overview to let each rectangle at least have its name as a label. It is an option to always force space for labels, or only to draw labels when empty space is available. In the latter case, the tool tips appearing when the mouse is held over an item can help a lot. They show information for the item the mouse is currently over, together with its parent folders up to the root item of the tree map.
tr: Benzer şekilde, iyi bir genel bakış için her dikdörtgenin en azından bir etiket olarak adına sahip olması daha iyidir. Etiketler için her zaman boşluk bırakmaya zorlamak veya yalnızca boş alan var olduğunda etiket çizmek bir seçenektir. İkinci durumda, fare bir ögenin üzerinde tutulduğunda görünen araç ipuçları çok yardımcı olabilir. Bu ipuçları, ağaç haritasının kök ögesine kadar olan üst klasörleriyle birlikte farenin o anda üzerinde bulunduğu ögeye ilişkin bilgileri gösterir.

source: How the space of an item is split into subareas for children is left to the implementation. It is always better to try to split areas in such a way that rectangles are as quadratic as possible, both for labeling and less space lost by borders. The best methods in this regard are <guilabel>Rows</guilabel>, <guilabel>Columns</guilabel>, or <guilabel>Recursive Bisection</guilabel>.
tr: Bir ögenin alanının alt ögeler için alt alanlara nasıl bölüneceği uygulamaya bırakılmıştır. Hem etiketleme hem de kenarlıklarla daha az alan kaybı için alanları dikdörtgenler olabildiğince karesel olacak şekilde bölmeye çalışmak her zaman daha iyidir. Bu konuda en iyi yöntemler <guilabel>Satırlar</guilabel>, <guilabel>Sütunlar</guilabel> veya <guilabel>Özyineli İkiye Bölme</guilabel> olur.

source: You can choose the minimal area of items to be drawn via the menu item <menuchoice><guimenu>View</guimenu><guimenuitem>Stop at Area</guimenuitem></menuchoice>. Instead, a hash pattern will be drawn over the parents area to signal that this space is in fact occupied by a child or children.
tr: <menuchoice><guimenu>Görünüm</guimenu><guimenuitem>Alanda Dur</guimenuitem></menuchoice> menü ögesinden çizilecek en düşük öge alanını seçebilirsiniz. Bunun yerine, bu alanın aslında bir alt öge veya alt ögeler tarafından işgal edildiğini belirtmek için üst öge alanının üzerine bir karma desen çizilecektir.

source: User Interface
tr: Kullanıcı Arayüzü

source: &fsview; supports multiple selection of items, similar to the iconview and listview. This allows for actions to be done simultaneously to a set of files. A simple mouse click always selects a single item below the mouse pointer. Use a mouse click in combination with pressing the &Shift; key for range selection or the &Ctrl; key for selection toggle. Note that by selecting an item, subitems can no longer be selected. Selecting an item will also clear the selection of all its parent items before.
tr: &fsview; simge görünümü ve liste görünümüne benzer şekilde ögelerin çoklu seçimini destekler. Bu, bir dizi dosyaya aynı anda işlem yapılmasına olanak tanır. Basit bir fare tıklaması her zaman fare işaretçisinin altındaki tek bir ögeyi seçer. Erim seçimi için &Shift; düğmesine veya seçim geçişi için &Ctrl; düğmesine basarak fare tıklamasını kullanın. Bir öge seçildiğinde, alt ögelerin artık seçilemeyeceğini unutmayın. Bir ögenin seçilmesi, daha önceki tüm üst ögelerinin seçimini de temizleyecektir.

source: Keyboard navigation is available in tree maps: use <keycap>Left Arrow</keycap> and <keycap>Right Arrow</keycap> keys to move the current item between siblings, and the <keycap>Up Arrow</keycap> and <keycap>Down Arrow</keycap> keys to go up and down the nesting hierarchy. <keycap>Space</keycap> selects the item; in conjunction with &Shift; does range selection; and with the &Ctrl; key held down simultaneously, toggles selection of the current item. Press <keycap>Return</keycap> to run the open action on the current item.
tr: Klavye ile dolaşım ağaç haritalarında kullanılabilir: Geçerli ögeyi eşdeğerleri arasında taşımak için <keycap>Sol Ok</keycap> ve <keycap>Sağ Ok</keycap> düğmelerini kullanın. İç içe geçiş hiyerarşisinde dolaşmak içinse <keycap>Yukarı Ok</keycap> ve <keycap>Aşağı Ok</keycap> düğmeleri vardır. <keycap>Boşluk</keycap> düğmesi ögeyi seçer, &Shift; ile birlikte kullanmak erim seçimi yapar ve &Ctrl; de basılı tutulursa geçerli ögenin seçimini açar/kapatır. Geçerli ögede açma eylemini tetiklemek için <keycap>Dönüş</keycap> düğmesine basın.

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Originally, &fsview; was meant as a small test application and usage tutorial for the TreeMap widget developed within <application>KCachegrind</application>.
tr: &fsview;, özünde küçük bir sınama uygulaması olarak ve <application>KCachegrind</application> uygulamasının ağaç araç takımı için bir öğretici olarak tasarlanmıştı.

source: Copyright by Josef Weidendorfer, licensed using GPL V2.
tr: Telif hakkı Josef Weidendorfer, GPL V2 ile lisanslanmıştır.

source: Configuring &konqueror;
tr: &konqueror;’u Yapılandırmak

source: In common with the rest of &kde;, &konqueror; is highly configurable, so you can really get the look and feel that best fits your needs and wishes.
tr: &kde;’nin geri kalanıyla uyumlu olarak &konqueror;, yüksek oranda yapılandırılabilirdir; böylece gereksinimlerinize ve isteklerinize en uygun görünümü ve hissi oluşturabilirsiniz.

source: When &kde; is newly installed, &konqueror;’s window contains a Menubar, Main and Location Toolbars and possibly a Bookmark Toolbar.
tr: Yeni kurulmuş bir &kde; içinde &konqueror;’un penceresi bir menü çubuğu, ana ve konum araç çubukları ve büyük olasılıkla bir yer imi araç çubuğu içerir.

source: For detailed information how to modify toolbars and shortcuts please read the sections about <ulink url="help:/fundamentals/config.html#toolbars">Toolbars</ulink> and <ulink url="help:/fundamentals/config.html#shortcuts">Shortcuts</ulink> in the Fundamentals.
tr: Araç çubuklarında nasıl değişiklik yapabileceğinizle ilgili olarak temellerin <ulink url="help:/fundamentals/config.html#toolbars">Araç Çubukları</ulink> ve <ulink url="help:/fundamentals/config.html#shortcuts">Kısayollar</ulink> bölümlerini okuyun.

source: Other Settings
tr: Diğer Ayarlar

source: Selecting <menuchoice><guimenu>Settings</guimenu><guimenuitem> Configure Konqueror…</guimenuitem></menuchoice> brings up a dialog box which you can use to control most aspects of &konqueror;’s behavior.
tr: <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Konqueror Uygulamasını Yapılandır…</guimenuitem></menuchoice> seçeneği, &konqueror;’un çoğu davranışını yapılandırabileceğiniz bir iletişim kutusunu açar.

source: It contains these sections which are selected by <mousebutton>left </mousebutton> clicking on one of the icons at the left of the dialog box:
tr: İletişim kutusunun solundaki simgelerden birine <mousebutton>sol</mousebutton> fare düğmesiyle tıklayarak açabileceğiniz şu bölümleri içerir:

source: <ulink url="help:/kcontrol/khtml-general/index.html">General</ulink>: Configure general &konqueror; behavior
tr: <ulink url="help:/kcontrol/khtml-general/index.html">Genel</ulink>: Genel &konqueror; davranışını yapılandır

source: <ulink url="help:/kcontrol/performance/index.html">KDE Performance</ulink>: Configure settings that can improve &konqueror;’s performance
tr: <ulink url="help:/kcontrol/performance/index.html">Başarım</ulink>: &konqueror;’un başarımını geliştirecek ayarları yapılandır

source: <ulink url="help:/kcontrol/bookmarks/index.html">Bookmarks</ulink>: Configure the bookmarks home page
tr: <ulink url="help:/kcontrol/bookmarks/index.html">Yer İmleri</ulink>: Yer İmleri ana sayfasını yapılandır
