Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konsole.po
Languages: tr

source: %B : user's Bourne prompt sigil ($ = normal user, # = superuser)
tr: %B : Kullanıcının Bourne istem başlığı ($ = normal kullanıcı, # = süper kullanıcı)

source: %w : window title set by shell
tr: %w : Kabuk tarafından ayarlanan pencere başlığı

source: %# : session number
tr: %# : Oturum numarası

source: &konsole; will substitute these tokens for remote tabs:
tr: &konsole;, uzak sekmelerde bu jetonlardan yararlanacak:

source: %c : current program
tr: %c : Geçerli program

source: %h : remote host (short)
tr: %h : Uzak makine (kısa)

source: %H : remote host (long)
tr: %H : Uzak makine (uzun)

source: %U : user name@ (if given)
tr: %U : Kullanıcı adı@ (verilmişse)

source: Examples:
tr: Örnekler:

source: <userinput>%d : %n</userinput> with /usr/src as current directory and running <application>bash</application> will display <guibutton>src : bash</guibutton>
tr: /usr/src geçerli dizininde çalışan <application>bash</application> programı, <userinput>%d : %n</userinput> ayarıyla <guibutton>src : bash</guibutton> görüntüler

source: <userinput>%D : %n</userinput> with /usr/src as current directory and running <application>top</application> will display <guibutton>/usr/src : top</guibutton>
tr: /usr/src geçerli dizininde çalışan <application>top</application> programı, <userinput>%D : %n</userinput> ayarıyla <guibutton>/usr/src : top</guibutton> görüntüler

source: <userinput>%w (%#)</userinput> with ~ as current directory and running <application>vim</application> in the first tab will display <guibutton>[No Name] (~) - VIM(1)</guibutton>
tr: ~ geçerli dizininde çalışan <application>vim</application> programı, <userinput>%w (%#)</userinput> ayarıyla <guibutton>[No Name] (~) - VIM(1)</guibutton> görüntüler

source: Copy Input Dialog
tr: Girdiyi Kopyala İletişim Kutusu

source: The text entered in one tab can simultaneously be sent to other tabs. This dialog allows you to select which tabs will get that input. The current tab will be greyed out.
tr: Bir sekmeye girilen metin aynı anda diğer sekmelere de gönderilebilir. Bu iletişim kutusu, söz konusu girdiyi hangi sekmelerin alacağını seçmenizi sağlar. Geçerli sekme gri renkte görünecektir.

source: Adjust Scrollback Dialog
tr: Geçmişi Ayarla İletişim Kutusu

source: The <link linkend="scrollback">scrollback</link> options for the history size can be changed in this dialog. Any changes are for the current tab only and will not be saved to the profile.
tr: <link linkend="scrollback">Geçmiş boyutuna ilişkin</link> seçenekler bu iletişim kutusunda değiştirilebilir. Değişiklikler yalnızca geçerli sekme içindir ve profile kaydedilmez.

source: Command-line Options
tr: Komut Satırı Seçenekleri

source: When &konsole; is started from the command line, various options can be specified to modify its behavior.
tr: &konsole; komut satırından başlatıldığında davranışını değiştirmek için çeşitli seçenekler belirtilebilir.

source: <action>List various options</action>.
tr: <action>Çeşitli seçenekleri listele</action>.

source: <option>--profile</option> <parameter>file</parameter>
tr: <option>--profile</option> <parameter>dosya</parameter>

source: <action>Start &konsole;</action> using the specified profile instead of the default profile.
tr: Öntanımlı profil yerine belirtilen profili kullanarak <action>&konsole;’u başlat</action>.

source: <option>--layout</option> <parameter>file</parameter>
tr: <option>--layout</option> <parameter>dosya</parameter>

source: <action>Start &konsole;</action> using a <link linkend="save-layout">saved &JSON; layout file</link>.
tr: Bir <link linkend="save-layout">kaydedilen &JSON; yerleşim dosyası</link> kullanarak <action>&konsole;’u başlat</action>.

source: Use the built-in profile instead of the current default profile.
tr: Geçerli öntanımlı profil yerine yerleşik profili kullan.

source: <option>--workdir</option> <parameter>dir</parameter>
tr: <option>--workdir</option> <parameter>dizin</parameter>

source: <action>Open with</action> <parameter>dir</parameter> as the initial working directory.
tr: Başlangıç çalışma dizini olarak <parameter>bu dizin</parameter> <action>ile birlikte aç</action>.

source: <action>Do not close</action> the initial session automatically when it ends.
tr: Başlatılan oturumu bittiğinde kendiliğinden <action>kapatma</action>.

source: <action>Create a new tab</action> in an existing window rather than creating a new window.
tr: Yeni bir pencere yerine var olan pencerede <action>yeni bir sekme oluştur</action>.

source: <option>--tabs-from-file </option><parameter>file</parameter>
tr: <option>--tabs-from-file </option><parameter>dosya</parameter>

source: <action>Create tabs</action> as specified in the given tabs configuration file.
tr: Sekmeleri, sekme yapılandırma dosyasında belirtildiği gibi <action>oluştur</action>.

source: The file has one tab per line in the following format:
tr: Dosyanın aşağıdaki biçimde her satırda bir sekmesi vardır:

source: Each line specifies a tab to open using up to 4 fields specifying how it is to open. Fields are delimited with <userinput>;;</userinput> and a field name must have a <userinput>:</userinput> appended. Empty lines or lines with <userinput>#</userinput> at the beginning are ignored, so you can use line beginning with <userinput>#</userinput> to add comments.
tr: Her satır, nasıl açılacağını belirten en fazla 4 alan kullanılarak açılacak bir sekmeyi belirtir. Sekmeler <userinput>;;</userinput> ile ayrılır ve bir alan adında <userinput>:</userinput> iliştirilmiş olmalıdır. Başında <userinput>#</userinput> olan satırlar veya boş satırlar yok sayılır; böylece yorum eklemek için <userinput>#</userinput> ile başlayan satırlar kullanabilirsiniz.

source: <userinput>title:</userinput> a name for this tab, tab default if blank or not specified
tr: <userinput>title:</userinput> Bu sekme için bir ad, boşsa veya belirtilmemişse öntanımlı sekme

source: <userinput>workdir:</userinput> working directory, <filename class="directory"> ~</filename> if blank or not specified
tr: <userinput>workdir:</userinput> Çalışma dizini, boşsa veya belirtilmemişse <filename class="directory"> ~</filename> kullanılır

source: <userinput>profile:</userinput> a &konsole; profile to use, the default if blank or not specified
tr: <userinput>profile:</userinput> Kullanılacak olan &konsole; profili, boşsa veya belirtilmemişse öntanımlı profil kullanılır

source: <userinput>command:</userinput> a command to run
tr: <userinput>command:</userinput> Çalıştırılacak komut

source: Each line should contain at least one of <userinput>command</userinput> or <userinput>profile</userinput> field.
tr: Her satırda <userinput>command</userinput> veya <userinput>profile</userinput> alanlarından en az biri bulunmalıdır.

source: Example: <userinput>title: %n;; command: /usr/bin/top ;; profile: Shell</userinput>
tr: Örnek: <userinput>title: %n;; command: /usr/bin/top ;; profile: Kabuk</userinput>

source: <action>Start &konsole;</action> in the background and bring to the front when <keycombo action="simul">&Ctrl;&Shift;<keycap>F12</keycap></keycombo> (by default) is pressed.
tr: <action>&konsole;’u arka planda başlat</action> ve <keycombo action="simul">&Ctrl;&Shift;<keycap>F12</keycap></keycombo> düğmelerine basıldığında (öntanımlı) ön plana getir.

source: <action>Run</action> the new instance of &konsole; in a separate process.
tr: &konsole;’nin yeni bir örneğini ayrı bir süreçte <action>çalıştır</action>.

source: <action>Show</action> the menubar, overriding the default behavior.
tr: Öntanımlı ayarı geçersiz kılarak menü çubuğunu <action>göster</action>.

source: <action>Hide</action> the menubar, overriding the default behavior.
tr: Öntanımlı ayarı geçersiz kılarak menü çubuğunu <action>gizle</action>.

source: <action>Show</action> the tabbar, overriding the default behavior.
tr: Öntanımlı ayarı geçersiz kılarak sekme çubuğunu <action>göster</action>.

source: <action>Hide</action> the tabbar, overriding the default behavior.
tr: Öntanımlı ayarı geçersiz kılarak sekme çubuğunu <action>gizle</action>.

source: <action>Start &konsole; in fullscreen mode</action>.
tr: <action>&konsole;’u tam ekran kipinde başlat</action>.

source: <action>Disable</action> transparent backgrounds, even if the system supports them.
tr: Sistem desteklese bile saydam arka planları <action>kapat</action>.

source: <action>List</action> all available profiles.
tr: Tüm kullanılabilir profilleri <action>listele</action>.

source: <action>List</action> all possible properties with name and type. See option <option>-p</option>.
tr: Tüm kullanılabilir özellikleri, adı ve türü ile <action>listele</action>. <option>-p</option> seçeneğine göz atın.

source: For more information, please visit <ulink url="https://api.kde.org/4.14-api/applications-apidocs/konsole/html/classKonsole_1_1Profile.html">&konsole; API Reference</ulink>.
tr: Daha fazla bilgi için lütfen <ulink url="https://api.kde.org/4.14-api/applications-apidocs/konsole/html/classKonsole_1_1Profile.html">&konsole; API Başvurusu</ulink>’nu ziyaret edin.

source: <option>-p</option> <parameter>property=value</parameter>
tr: <option>-p</option> <parameter>property=değer</parameter>

source: <action>Change</action> the value of a profile property.
tr: Bir profil özelliğinin değerini <action>değiştir</action>.

source: <option>-e</option> <parameter>command</parameter>
tr: <option>-e</option> <parameter>komut</parameter>

source: <action>Execute</action> <parameter>command</parameter> instead of the normal shell.
tr: Normal kabuk yerine <parameter>komut</parameter> <action>yürüt</action>.

source: This option will catch all following arguments passed to &konsole;, and execute it as <parameter>command</parameter>. So this option should always be used as the last option.
tr: Bu seçenek, &konsole;’a aktarılan tüm değişkenleri yakalar ve <parameter>komut</parameter> olarak yürütür. Bu nedenle, bu seçenek her zaman son seçenek olarak kullanılmalıdır.

source: &konsole; also accepts generic &Qt; and &kf6-full; options, see man pages qt6options and kf6options.
tr: &konsole; aynı zamanda genel &Qt; ve &kf6-full; seçeneklerini kabul eder; ek bilgi için qt6options ve kf6options kılavuz sayfalarına göz atın.

source: Scripting &konsole;
tr: &konsole; ile betik yazımı

source: &konsole; does support numerous methods that can be used with &DBus;.
tr: &konsole;, &DBus; ile kullanılabilecek birçok yöntemi destekler.

source: There are two ways to use the &DBus; interface: &Qt;'s &GUI; <application>qdbusviewer</application> and the command line <application>qdbus</application>.
tr: &DBus; arayüzünü kullanmanın iki yolu vardır: &Qt;’nin grafiksel <application>qdbusviewer</application> uygulaması ve <application>qdbus</application> komut satırı uygulaması.

source: <prompt>&percnt;</prompt> <command>qdbus</command> will display all services available.
tr: <prompt>&percnt;</prompt> <command>qdbus</command>, tüm kullanılabilir hizmetleri görüntüler.

source: <prompt>&percnt;</prompt> <command>qdbus</command> <option>org.kde.konsole</option> will display the &DBus; interface for &konsole;.
tr: <prompt>&percnt;</prompt> <command>qdbus</command> <option>org.kde.konsole</option>, &konsole; &DBus; arayüzünü görüntüler.

source: <prompt>&percnt;</prompt> <command>qdbus</command> <option>org.kde.konsole /Windows/1</option> will display methods for controlling window 1.
tr: <prompt>&percnt;</prompt> <command>qdbus</command> <option>org.kde.konsole /Windows/1</option>, pencere 1’i denetlemek için kullanılacak yöntemleri görüntüler.

source: <prompt>&percnt;</prompt> <command>qdbus</command> <option>org.kde.konsole $KONSOLE_DBUS_WINDOW</option> will display methods for controlling the current window.
tr: <prompt>&percnt;</prompt> <command>qdbus</command> <option>org.kde.konsole $KONSOLE_DBUS_WINDOW</option>, geçerli pencereyi denetlemek için kullanılacak yöntemleri görüntüler.

source: <prompt>&percnt;</prompt> <command>qdbus</command> <option>org.kde.konsole /Sessions/1</option> will display methods for controlling session 1.
tr: <prompt>&percnt;</prompt> <command>qdbus</command> <option>org.kde.konsole /Sessions/1</option>, oturum 1’i denetlemek için kullanılacak yöntemleri görüntüler.

source: <prompt>&percnt;</prompt> <command>qdbus</command> <option>org.kde.konsole $KONSOLE_DBUS_SESSION</option> will display methods for controlling the current session.
tr: <prompt>&percnt;</prompt> <command>qdbus</command> <option>org.kde.konsole $KONSOLE_DBUS_SESSION</option>, geçerli oturumu denetlemek için kullanılacak yöntemleri görüntüler.

source: <prompt>&percnt;</prompt> <command>qdbus</command> <option>$KONSOLE_DBUS_SERVICE $KONSOLE_DBUS_SESSION</option> will display methods for controlling the current &konsole;'s session.
tr: <prompt>&percnt;</prompt> <command>qdbus</command> <option>$KONSOLE_DBUS_SERVICE $KONSOLE_DBUS_SESSION</option>, geçerli &konsole; oturumunu denetlemek için kullanılacak yöntemleri görüntüler.

source: If any of the above commands outputs: Service 'org.kde.konsole' does not exist, change <option>org.kde.konsole</option> to one of the following:
tr: Yukarıdaki komutlardan biri "Service 'org.kde.konsole' does not exist" çıktısını verirse <option>org.kde.konsole</option> seçeneğini şunlardan birine değiştirin:

source: <option>org.kde.konsole-`pidof -s konsole`</option> (will select first pid)
tr: <option>org.kde.konsole-`pidof -s konsole`</option> (ilk pid’i seçer)

source: <option>$KONSOLE_DBUS_SERVICE</option> (this can be used from the current &konsole;)
tr: <option>$KONSOLE_DBUS_SERVICE</option> (bu, geçerli &konsole;’dan kullanılabilir)

source: select one from the output of 'qdbus | grep konsole'
tr: “qdbus | grep konsole” çıktılarından birini seçin

source: For more information, please visit <ulink url="https://techbase.kde.org/Development/Tutorials/D-Bus/Introduction">&DBus; tutorial</ulink>.
tr: Daha fazla bilgi için lütfen <ulink url="https://techbase.kde.org/Development/Tutorials/D-Bus/Introduction">&DBus; öğreticisi</ulink>’ni ziyaret edin.

source: Terminal Key Bindings
tr: Uçbirim Düğme Bağıntıları

source: How &konsole; Uses Key Bindings
tr: &konsole; Düğme Bağıntılarını Nasıl Kullanır

source: &konsole; uses *.keytab files to translate key combinations into control characters and escape sequences that are sent to the shell or to interactive programs (typically programs that use the Alternate Screen buffer, &eg; <application>vim</application>, <application>less</application>, <application>screen</application>) running in the shell.
tr: &konsole;, düğme kombinasyonlarını kabuğa veya kabukta çalışan etkileşimli programlara (genelde alternatif ekran arabelleğini kullanan programlar; örneğin, <application>vim</application>, <application>less</application>, <application>screen</application>) gönderilen denetim karakterlerine ve kaçış dizilerine dönüştürmek için *.keytab dosyalarını kullanır.

source: Users can customize the key bindings settings in &konsole; using the Key Bindings Editor. A key combination can be configured to send a specific control or escape sequence to the terminal.
tr: Kullanıcılar, düğme bağıntısı düzenleyicisini kullanarak &konsole;’deki düğme bağıntısı ayarlarını özelleştirebilir. Uçbirime belirli bir denetim veya kaçış dizisi göndermek için bir düğme kombinasyonu yapılandırılabilir.

source: You can open the Key Bindings Editor from the menu entry <menuchoice><guimenu>Settings</guimenu><guimenuitem>Edit Current Profile</guimenuitem></menuchoice>, and going to the <guilabel>Keyboard</guilabel> tab. Listed there are the Key Bindings schemas that come by default with &konsole;.
tr: Düğme Bağıntıları Düzenleyicisi’ni <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Geçerli Profili Düzenle</guimenuitem></menuchoice> menü girdisine gidip <guilabel>Klavye</guilabel> sekmesinden açabilirsiniz. Listede, &konsole; ile birlikte gelen düğme bağıntıları listelenir.

source: Key Combinations and Modes
tr: Düğme Kombinasyonları ve Kipleri

source: Key combinations follow the pattern:
tr: Düğme kombinasyonları şu dizgiyi takip ederler:

source: Key (+|-) Modes
tr: Düğme (+|-) Kipler

source: for example:
tr: örneğin:

source: Up+Shift+AppScreen Down+Shift-AppScreen Space+Ctrl
tr: Yukarı+Üst Karakter+AppScreen Aşağı+Üst Karakter-AppScreen Boşluk+Kontrol

source: Key names are defined in the qnamespace.h header file, with the <quote>Qt::Key_</quote> prefix removed, for a list of key names check the <ulink url="https://doc.qt.io/qt-5/qt.html#Key-enum">Qt::Key enumeration in the &Qt; documentation</ulink>.
tr: Düğme adları, qnamespace.h üstbilgi dosyasında <quote>Qt::Key_</quote> öneki kaldırılmış olarak tanımlıdır; düğme adlarının bir listesi için <ulink url="https://doc.qt.io/qt-5/qt.html#Key-enum">Qt::Key enumeration in the &Qt;</ulink> belgelendirmesine bakın.

source: A <quote>+</quote> preceding a Mode name means that mode is <emphasis>set</emphasis>; for a modifier key, that means it's pressed, whereas for all other modes it means that particular mode is in effect (&ie; active). For example <quote>+Ctrl</quote> means the key combination will work only if the &Ctrl; key is pressed.
tr: Bir kipten önce gelen bir <quote>+</quote>, kipin <emphasis>ayarlı</emphasis> olduğunu belirtir; bir niteleyici düğme için bu, onun basılı olduğu, diğer kipler içinse belirli bir kipin etkin olduğu anlamına gelir. Örneğin, <quote>+Kontrol</quote>, düğme kombinasyonunun yalnızca &Ctrl; düğmesi basılıysa geçerli olacağını belirtir.

source: A <quote>-</quote> preceding a Mode name means that mode is <emphasis>reset</emphasis>; basically this is the opposite of putting <quote>+</quote> before a Mode name, so for a modifier key that means the key isn't pressed, whereas for all other modes it means that particular mode is inactive. For example <quote>-Ctrl</quote> means the key combination will work only if the &Ctrl; key is <emphasis>not</emphasis> pressed.
tr: Bir kipten önce gelen bir <quote>-</quote>, kipin <emphasis>sıfırlandığı</emphasis> anlamına gelir; bu, bir kipten önce <quote>+</quote> koymanın tam tersidir; bir niteleyici düğme için bu düğmenin basılı olmadığı, diğer tüm kipler içinse o belirli kipin etkin olmadığı anlamına gelir. Örneğin, <quote>-Kontrol</quote>, düğme kombinasyonunun yalnızca &Ctrl; düğmesi <emphasis>basılı değilken</emphasis> geçerli olacağını belirtir.

source: If a Mode name isn't present in a key combination, its state is ignored.
tr: Bir düğme kombinasyonunda bir kip adı yoksa onun durumu yok sayılır.

source: The supported Key Bindings modes are listed below:
tr: Desteklenen düğme bağıntısı kipleri aşağıda listelenmiştir:

source: Alt, Ctrl, Shift
tr: Seçenek, Kontrol, Üst Karakter

source: One or more of these Modes can be used in a key combination, if any of them is set, the key combination uses that modifier key, respectively; and vice versa if it's reset
tr: Bu kiplerden bir veya daha fazlası bir düğme kombinasyonunda kullanılabilir; bunlardan herhangi biri ayarlanmışsa düğme kombinasyonu sırasıyla bu niteleyici düğmeyi kullanır; sıfırlanırsa tam tersi olur

source: If this mode is set, the key combination uses any modifier key (any of the previous three modifier keys); and vice versa if it's reset
tr: Bu kip ayarlanırsa düğme kombinasyonu herhangi bir niteleyici düğmeyi (önceki üç niteleyici düğmeden herhangi biri) kullanır; sıfırlanırsa tam tersi olur

source: If this mode is set, &konsole; will send ANSI escape and control sequences
tr: Bu kip ayarlanırsa &konsole; ANSI kaçış ve denetim dizileri gönderir

source: If this mode is reset &konsole; will send VT52 escape and control sequences
tr: Bu kip sıfırlanırsa &konsole;, VT52 kaçış ve denetim dizileri gönderir

source: If this mode is set, the key combination will only affect interactive programs that use the Alternate Screen buffer
tr: Bu kip ayarlanırsa düğme kombinasyonu yalnızca Alternatif Ekran arabelleğini kullanan etkileşimli programları etkiler

source: If this mode is reset the key combination will only affect the terminal when it's using the Normal Screen buffer
tr: Bu kip sıfırlanırsa düğme kombinasyonu yalnızca Normal Ekran arabelleğini kullanırken uçbirimi etkiler

source: &konsole; makes use of two screen buffers:
tr: &konsole; iki ekran arabelleğinden yararlanır:

source: The Normal Screen buffer (default): allows you to scroll back to view previous lines of output, this is the default buffer you usually use to execute commands... &etc;
tr: Normal Ekran arabelleği (öntanımlı): Önceki çıktı satırlarını görüntülemek için geçmişi görmenize olanak tanır; bu, genellikle komutları yürütmek için kullandığınız öntanımlı arabellektir.

source: The Alternate Screen buffer: the terminal switches to this buffer when you run an interactive program (&eg; <application>less</application>, <application>vim</application>, <application>screen</application>, <application>tmux</application>... &etc;)
tr: Alternatif Ekran arabelleği: Etkileşimli bir program çalıştırdığınızda uçbirim bu arabelleğe geçer (&eg; <application>less</application>, <application>vim</application>, <application>screen</application>, <application>tmux</application>… &etc;)

source: If this mode is set, the key combination uses a key on the Keypad (Number Pad). This mode is useful to distinguish between keys on the keyboard and keys on the Keypad. For example when Num Lock is <emphasis>on</emphasis> you can configure two separate key combinations, one using the key labelled <quote>1</quote> on the keyboard (usually under the <keycap>F1</keycap> key) and the other using the key labelled <quote>1</quote> on the Keypad. The same concept applies when Num Lock is <emphasis>off</emphasis> for the End, Home, Cursor Keys ...etc on the Keypad
tr: Bu kip ayarlıysa düğme kombinasyonu, numara düğmeleri takımındaki bir düğmeyi kullanır. Bu kip, klavyedeki normal harfler ve numara takımlar arasındaki ayrımı belirlemek için yararlıdır. Örneğin, Sayı Kilidi <emphasis>açıksa</emphasis> iki ayrı düğme kombinasyonu yapılandırabilirsiniz; biri klavyede <quote>1</quote> ile etiketli düğmeyi (genellikle <keycap>F1</keycap> düğmesinin altındadır), diğeri de numara düğmeleri takımındaki <quote>1</quote> düğmesini kullanır. Aynı konsept, Sayı Kilidi <emphasis>kapalıyken</emphasis> de Son, Baş, İmleç Düğmeleri için de geçerlidir.

source: This mode implements the VT100 <ulink url="https://www.vt100.net/docs/vt100-ug/chapter3.html#DECCKM">Cursor Keys Mode (DECCKM)</ulink>. It controls the escape sequences each Cursor Key (<keycap>Up</keycap>, <keycap>Down</keycap>, <keycap>Right</keycap>, <keycap>Left</keycap>) sends, depending on whether this mode is set or reset
tr: Bu kip VT100 <ulink url="https://www.vt100.net/docs/vt100-ug/chapter3.html#DECCKM">İmleç Düğmeleri Kipi (DECCKM)</ulink>’ni gerçekler. Bu, bu kipin ayarlı veya sıfırlanan durumuna istinaden, her bir imleç düğmesinin (<keycap>Yukarı</keycap>, <keycap>Aşağı</keycap>, <keycap>Sağ</keycap>, <keycap>Sol</keycap>) gönderdiği kaçış dizilerini denetler.

source: By default &konsole; follows the XTerm behavior of treating the <keycap>Home</keycap> and <keycap>End</keycap> keys as cursor keys with respect to DECCKM
tr: Öntanımlı olarak &konsole;, DECCKM ile ilgili olarak <keycap>Baş</keycap> ve <keycap>Son</keycap> düğmeleri için XTerm davranışını takip eder.

source: If this mode is set, the key combination will only work when the Keypad is in Application Mode (DECKPAM)
tr: Bu kip ayarlıysa düğme kombinasyonu, yalnızca numara düğmeleri takımı Uygulama Kipi’ndeyse (DECKPAM) çalışacaktır.

source: If this mode is reset, the key combination will only work when the Keypad is in Numeric Mode (DECKPNM)
tr: Bu kip ayarlıysa düğme kombinasyonu yalnızca numara düğmeleri takımı Sayısal Kip’te ise (DECKPNM) çalışacaktır.
