Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konsole.po
Languages: tr

source: In the <guilabel>Complex Text Layout</guilabel> tab of the <guilabel>Appearance</guilabel> page in the <guilabel>Edit Profile</guilabel> dialog, you will find options that control the rendering of text.
tr: <guilabel>Profili Düzenle</guilabel> iletişim kutusundaki <guilabel>Görünüş</guilabel> sayfasının <guilabel>Karmaşık Metin Yerleşimi</guilabel> sekmesinde metin sunumunu denetleyen seçenekleri bulacaksınız.

source: <guilabel>Word mode</guilabel> - in this mode (some) strings are displayed in the screen as a whole, instead of a character at a time. This allows Qt to render text correctly when the shape of a character depends on the characters before or after it. This might result in incorrect position of some characters.
tr: <guilabel>Sözcük kipi</guilabel> — Bu kipte (bazı) diziler ekranda tek tek karakter yerine bir bütün olarak görüntülenir. Bu, bir karakterin şekli kendisinden önceki veya sonraki karakterlere bağlı olduğunda Qt’un metni doğru şekilde oluşturmasını sağlar. Bu, bazı karakterlerin yanlış konumlandırılmasına neden olabilir.

source: Spaces always break strings, so they are always in the correct positions. This ensures that characters are never too far from their correct position.
tr: Boşluklar her zaman dizileri bozar, dolayısıyla her zaman doğru konumlarda olurlar. Bu, karakterlerin hiçbir zaman doğru konumlarından çok fazla uzaklaşmamasını sağlar.

source: <guilabel>Use the same attributes for each whole word</guilabel> - When this is enabled, words are rendered with the same attributes (text color, bold, italic, etc.). If an attribute changes mid-word, it will only take effect after the end of the word. When this is disabled, a new word starts when attributes change. This results in characters changing shape and position when moving the cursor or selecting text.
tr: <guilabel>Tüm sözcük için aynı öznitelikleri kullan</guilabel> — Bu etkinleştirildiğinde, sözcükler aynı niteliklerle (metin rengi, kalın, yatık vb.) oluşturulur. Bir öznitelik kelimenin ortasında değişirse bu durum; ancak sözcüğün sonundan sonra geçerli olur. Bu devre dışı bırakıldığında, öznitelikler değiştiğinde yeni bir sözcük başlar. Bu, imleci hareket ettirirken veya metni seçerken karakterlerin şekil ve konumunu değiştirmesine neden olur.

source: <guilabel>ASCII characters</guilabel> - Group ASCII characters into words as described above. The most noticeable effect of this option is that enabling this shows programming ligatures (for fonts that support them). E.g. the string &lt;= may be displayed as ⩽.
tr: <guilabel>ASCII karakterler</guilabel> — ASCII karakterlerini yukarıda açıklandığı gibi sözcükler halinde gruplayın. Bu seçeneğin en göze çarpan etkisi, bunun etkinleştirilmesinin programlama bitişik harflerini (bunları destekleyen yazı tipleri için) göstermesidir. Örneğin. &lt;= dizesi ⩽ olarak görüntülenebilir.

source: <guilabel>Brahmic scripts characters</guilabel> - Group Brahmic characters as described above. Without this option (depending on the font) some words may not be connected as they should. With this enabled Brahmic characters may appear out of position. E.g. the third character in the second line might not appear directly under the third character in the first line.
tr: <guilabel>Brahmi yazısı karakterleri</guilabel> — Brahmi karakterlerini yukarıda açıklandığı gibi gruplandırın. Bu seçenek olmadan (yazıtipine bağlı olarak) bazı sözcükler olması gerektiği gibi bağlanmayabilir. Bu etkinleştirildiğinde Brahmi karakterleri konumlarının dışında görünebilir. Örneğin, ikinci satırdaki üçüncü karakter doğrudan birinci satırdaki üçüncü karakterin altında görünmeyebilir.

source: <guilabel>Emoji Font:</guilabel> - This allows specifying the font to use for Unicode Emoji characters. If not set, the default profile font will be used, or some fallback font may be used by the system if the glyphs are missing from this font.
tr: <guilabel>Emoji yazısı:</guilabel> — Bu, Unicode Emoji karakterleri için kullanılacak yazıtipinin belirlenmesine olanak tanır. Ayarlanmazsa öntanımlı profil yazıtipi kullanılır veya bu yazıtipinde glifler eksikse sistem tarafından bazı yedek yazıtipleri kullanılabilir.

source: <guilabel>Bi-Directional text rendering</guilabel> - Reorder right to left characters so Arabic and Hebrew texts appear correctly.
tr: <guilabel>Çift yönlü metin sunumu</guilabel> — Arapça ve İbranice metinlerin doğru görünmesi için sağdan sola karakterleri yeniden sıralayın.

source: <guilabel>force LTR line direction</guilabel> - Lines are always Left to right. Without this, each line's direction is determined by the first character with strong directionality.
tr: <guilabel>Soldan sağa satır yönü zorla</guilabel> — Satırlar her zaman soldan sağadır. Bu olmadan her satırın yönü, güçlü yönlülüğe sahip ilk karakter tarafından belirlenir.

source: <guilabel>Table characters BiDi mode override</guilabel> - Consider graphic table characters as strong LTR characters. This allows table containing RTL characters to display correctly, but might cause incorrect order if those characters are used in RTL texts.
tr: <guilabel>Tablo karakterlerinde çift yönlü kipi geçersiz kıl</guilabel> — Grafik tablo karakterlerini güçlü soldan sağa karakterleri olarak düşünün. Bu, sağdan sola karakterlerini içeren tablonun doğru şekilde görüntülenmesine olanak tanır; ancak bu karakterler sağdan sola metinlerinde kullanılırsa sıralamanın yanlış olmasına neden olabilir.

source: <guilabel>Override wcwidth</guilabel> - Problematic characters follow Unicode standard, rather than glibc's wcwidth(). Currently only soft hyphen (Unicode 0x00AD) which has wcwidth of 1 and Unicode width of 0 is affected by this option. Generally, this option should be disabled when mainly using those characters on the command line, and enabled when they are only displayed.
tr: <guilabel>wcwidth’i geçersiz kıl</guilabel> — Sorunlu karakterler glibc’nin wcwidth() yöntemi yerine Unicode standardını izler. Şu anda yalnızca wc genişliği 1 ve Unicode genişliği 0 olan yumuşak kısa çizgi (Unicode 0x00AD) bu seçenekten etkilenmektedir. Genel olarak bu seçenek, esas olarak komut satırında bu karakterler kullanıldığında devre dışı bırakılmalı ve yalnızca görüntülendiklerinde etkinleştirilmelidir.

source: Visual Hints
tr: Görsel İpuçları

source: In addition to the various visual hints described in <xref linkend="semantic-shell-integration"/>, &konsole; has other visual hints:
tr: <xref linkend="semantic-shell-integration"/> içinde açıklanan çeşitli görsel ipuçlarına ek olarak, &konsole; içinde başka görsel ipuçları da bulunur:

source: A vertical line at column 80 (or another). This is configured in the <guilabel>Miscellaneous</guilabel> tab of the <guilabel>Appearance</guilabel> page in the <guilabel>Edit Profile</guilabel> dialog.
tr: 80. veya başka bir sütunda görsel bir çizgi. Bu, <guilabel>Profili Düzenle</guilabel> iletişim kutusunun <guilabel>Görünüş</guilabel> sayfasındaki <guilabel>Diğer</guilabel> sekmesinde yapılandırılır.

source: Line numbers may be displayed as an overlay of the terminal text. Line numbers appear in red on the right end of each line. The line are numbered consecutively from the first (top) line in the scrollback. Displaying the line numbers can be configured in the <guilabel>Advanced</guilabel> page in the <guilabel>Edit Profile</guilabel> dialog. Cycling between the three displayed modes can also be done by a keyboard shortcut. The default shortcut is <keycombo>&Ctrl;&Alt;<keycap>\</keycap></keycombo>
tr: Satır numaraları, uçbirim metninin üzerine koyulacak biçimde görüntülenebilir. Satır numaraları, her bir satırın sağ ucuna doğru kırmızı renkte görünürler. Satırlar, geçmişteki ilk (en üst) satırdan başlanarak numaralandırılırlar. Satır numaralarının görüntülenmesi, <guilabel>Profili Düzenle</guilabel> iletişim kutusunun <guilabel>Gelişmiş</guilabel> sekmesinde yapılandırılabilir. Görüntülenen üç kip arasında geçiş ise bir klavye kısayoluyla sağlanabilir. Öntanımlı kısayol: <keycombo>&Ctrl;&Alt;<keycap>\</keycap></keycombo>

source: Command Reference
tr: Komut Başvurusu

source: The Menubar
tr: Menü Çubuğu

source: The menubar is at the top of the &konsole; window. If the menubar is hidden, <guimenuitem>Show Menu Bar</guimenuitem> can be reached by <mousebutton>right</mousebutton> clicking in the window (as long as no full screen application is running in that window such as vi, minicom, etc.). The default shortcut is listed after each menu item.
tr: Menü çubuğu, &konsole; penceresinin en üstündedir. Menü çubuğu gizliyse <guimenuitem>Menü Çubuğunu Göster</guimenuitem> ögesine pencerede <mousebutton>sağ</mousebutton> tıklayarak ulaşılabilir (o pencerede vi, minicom vb. gibi tam ekran bir uygulama çalışmadığı sürece). Öntanımlı kısayol her menü ögesinin ardından listelenir.

source: Alternatively you can use the shortcut <keycombo action="simul">&Ctrl;&Shift;<keycap>M</keycap></keycombo> to show or hide the menubar.
tr: Alternatif olarak, menü çubuğunu göstermek veya gizlemek için <keycombo action="simul">&Ctrl;&Shift;<keycap>M</keycap></keycombo> kısayolunu da kullanabilirsiniz.

source: File Menu
tr: Dosya Menüsü

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>N</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>New Window</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>N</keycap></keycombo></shortcut> <guimenu>Dosya</guimenu><guimenuitem>Yeni Pencere</guimenuitem>

source: Opens a new separate &konsole; window with the default profile
tr: Öntanımlı profili kullanan yeni bir &konsole; penceresi açar

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>T</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>New Tab</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>T</keycap></keycombo></shortcut> <guimenu>Dosya</guimenu><guimenuitem>Yeni Sekme</guimenuitem>

source: Opens a new tab with the default profile
tr: Öntanımlı profili kullanan yeni bir sekme açar

source: The first profile in the submenu will always be "Default" which is the built-in profile. All other profiles will be listed below that in alphabetical order. The user specified default profile will be in bold type.
tr: Alt menüdeki ilk profil her zaman yerleşik profil olan "Öntanımlı" olacaktır. Diğer tüm profiller aşağıda abecesel sıraya göre listelenecektir. Kullanıcı tarafından belirlenen öntanımlı profil kalın yazıtipinde gösterilir.

source: <guimenu>File</guimenu> <guimenuitem>Clone Tab</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Sekmeyi Çoğalt</guimenuitem>

source: Attempts to clone the current tab in a new tab
tr: Geçerli sekmeyi yeni bir sekmede klonlamaya çalışır

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>S</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Save Output As...</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>S</keycap></keycombo></shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Çıktıyı Farklı Kaydet…</guimenuitem>

source: Saves the current scrollback as a text or html file
tr: Geçerli geçmişi metin veya HTML dosyası olarak kaydeder

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>P</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Print Screen ...</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>P</keycap></keycombo></shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Ekranı Yazdır…</guimenuitem>

source: <action>Print the current screen.</action> By default the output is scaled to fit the size of the paper being printed on with black text color and no background. In the print dialog these options can be changed on the <guilabel>Output Options</guilabel> tab.
tr: <action>Geçerli ekranı yazdırın.</action> Öntanımlı olarak çıktı, üzerine yazdırılan kağıdın boyutuna uyacak şekilde siyah metin rengiyle ve arka plan olmadan ölçeklendirilir. Yazdırma iletişim kutusunda bu seçenekler <guilabel>Çıktı Seçenekleri</guilabel> sekmesinde değiştirilebilir.

source: <guimenu>File</guimenu> <guimenuitem>Open File Manager</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Dosya Yöneticisini Aç</guimenuitem>

source: <action>Opens &kde;'s file manager at the current directory</action>. By default, that is <ulink url="help:/dolphin/index.html">&dolphin;</ulink>.
tr: <action>Geçerli dizinde &kde; dosya yöneticisini açar</action>. Öntanımlı olarak bu <ulink url="help:/dolphin/index.html">&dolphin;</ulink>’dir.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>W</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Close Session</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>W</keycap></keycombo></shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Oturumu Kapat</guimenuitem>

source: Closes the current session
tr: Geçerli oturumu kapatır

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Q</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Close Window</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Pencereyi Kapat</guimenuitem>

source: Quits &konsole;
tr: &konsole;’dan çıkar

source: &konsole; will display a confirmation dialog if there is more than one session open or if there are certain programs running in any session. These dialogs can be disabled by clicking on the <guibutton>Do not ask again</guibutton> checkbox.
tr: Birden fazla oturum açıksa veya herhangi bir oturumda belirli programlar çalışıyorsa &konsole; bir onay iletişim kutusu görüntüler. Bu iletişim kutuları, <guibutton>Bir daha sorma</guibutton> onay kutusu tıklanarak devre dışı bırakılabilir.

source: Edit Menu
tr: Düzen Menüsü

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>C</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>C</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Kopyala</guimenuitem>

source: Copies the selected text to the clipboard
tr: Seçili metni panoya kopyalar

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>V</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Paste</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>V</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu><guimenuitem>Yapıştır</guimenuitem>

source: Pastes text from the clipboard at the cursor location
tr: Panodaki metni imleç konumuna yapıştırır

source: <guimenu>Edit</guimenu><guimenuitem>Select All</guimenuitem>
tr: <guimenu>Düzen</guimenu><guimenuitem>Tümünü Seç</guimenuitem>

source: <action>Selects all</action> the text in current window
tr: Geçerli penceredeki tüm <action>metni seçer</action>

source: <guimenu>Edit</guimenu><guisubmenu>Copy Input To</guisubmenu><guimenuitem>All Tabs in Current Window</guimenuitem>
tr: <guimenu>Düzen</guimenu><guisubmenu>Girdiyi Şuraya Kopyala</guisubmenu><guimenuitem>Geçerli Penceredeki Tüm Sekmeler</guimenuitem>

source: Allows input from the current session to be sent simultaneously to all sessions in current window
tr: Geçerli oturumdaki girdinin geçerli penceredeki tüm oturumlara aynı anda gönderilmesine izin verir

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>.</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guisubmenu>Copy Input To</guisubmenu><guimenuitem>Select Tabs...</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>.</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu><guisubmenu>Girdiyi Şuraya Kopyala</guisubmenu><guimenuitem>Sekmeler Seç…</guimenuitem>

source: Allows input from the current session to be sent simultaneously to sessions picked by user
tr: Geçerli oturumdaki girdilerin, kullanıcı tarafından seçilen oturumlara aynı anda gönderilmesine olanak tanır

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>/</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guisubmenu>Copy Input To</guisubmenu><guimenuitem>None</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>/</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu><guisubmenu>Girdiyi Şuraya Kopyala</guisubmenu><guimenuitem>Yok</guimenuitem>

source: Stop sending input from current session into other sessions
tr: Geçerli oturumdan diğer oturumlara girdi göndermeyi durdur

source: <guimenu>Edit</guimenu> <guisubmenu>Send Signal</guisubmenu>
tr: <guimenu>Düzen</guimenu> <guisubmenu>Sinyal Gönder</guisubmenu>

source: <action>Send the specified signal to the shell process, or other process, that was launched when the new session was started</action>.
tr: <action>Belirtilen sinyali, yeni oturum başlatıldığında başlatılan kabuk işlemine veya başka bir işleme gönderin</action>.

source: Currently available signals are:
tr: Şu anda kullanılabilir sinyaller:

source: to stop process
tr: süreci durdurmak için

source: continue if stopped
tr: durmuşsa sürmesi için

source: hangup detected on controlling terminal, or death of controlling process
tr: denetleyen uçbirimde kapanma veya denetleyen sürecin ölümü durumunda

source: interrupt from keyboard
tr: klavyeden yarıda kesme

source: termination signal
tr: sonlandırma sinyali

source: kill signal
tr: öldürme sinyali

source: user signal 1
tr: kullanıcı sinyali 1

source: user signal 2
tr: kullanıcı sinyali 2

source: Refer to your system manual pages for further details by giving the command <userinput><command>man</command> <option>7 signal</option></userinput>.
tr: Ayrıntılı bilgi için <userinput><command>man</command> <option>7 signal</option></userinput> komutuyla sistem kılavuz sayfalarına göz atın.

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Configure Tab Settings...</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu><guimenuitem>Sekmeyi Yapılandır/Yeniden Adlandır…</guimenuitem>

source: <action>Opens a dialog box allowing you to change the name format, the remote tab title format and the color of the current tab</action> (<link linkend="configure-tab-settings-dialog">more info</link>)
tr: <action>Geçerli sekmenin ad biçimini, uzak sekme başlık biçimini ve rengini değiştirmenize olanak tanıyan bir iletişim kutusu açar</action> (<link linkend="configure-tab-settings-dialog">daha fazla bilgi</link>)

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>U</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>ZModem Upload...</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>U</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu><guimenuitem>ZModem ile Karşıya Yükle…</guimenuitem>

source: Opens up a dialog to select a file to be uploaded if the required software is installed
tr: Gerekli yazılımın kurulu olması durumunda karşıya yüklenecek dosyayı seçmek için bir iletişim kutusu açar

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Find...</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu><guimenuitem>Bul…</guimenuitem>

source: Opens a search bar at the bottom of &konsole;'s window
tr: &konsole; penceresinin alt kısmında bir arama çubuğu açar

source: This allows for case sensitive, forward or backwards, and regular expressions searches.
tr: Bu, BÜYÜK/küçük harfe duyarlı, ileri veya geri aramalara ve düzenli ifadelerle arama yapılmasına olanak tanır.

source: <shortcut><keycombo><keycap>F3</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Find Next</guimenuitem>
tr: <shortcut><keycombo><keycap>F3</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu><guimenuitem>Sonrakini Bul</guimenuitem>

source: <action>Moves to the next search instance </action>. If the search bar has the focus, you can use the shortcut &Enter; as well.
tr: <action>Sonraki arama örneğine geçer</action>. Arama çubuğu odaktaysa &Enter; kısayolunu da kullanabilirsiniz.

source: <shortcut><keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Find Previous</guimenuitem>
tr: <shortcut><keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu><guimenuitem>Sonrakini Bul</guimenuitem>

source: <action>Moves to the previous search instance </action>. If the search bar has the focus, you can use the shortcut <keycombo action="simul">&Shift;&Enter;</keycombo> as well.
tr: <action>Önceki arama örneğine geçer</action>. Arama çubuğu odaktaysa <keycombo action="simul">&Shift;&Enter;</keycombo> kısayolunu da kullanabilirsiniz.

source: View Menu
tr: Görünüm Menüsü

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>(</keycap></keycombo></shortcut> <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu><guimenuitem>Split View Left/Right</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>(</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu><guisubmenu>Görünümü Böl</guisubmenu><guimenuitem>Görünümü Sol/Sağ Şeklinde Böl</guimenuitem>

source: Splits all the tabs into left and right views
tr: Tüm sekmeleri sol ve sağ görünümlere böler

source: Any output on one view is duplicated in the other view.
tr: Bir görünümdeki herhangi bir çıktı diğer görünüme kopyalanır.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>)</keycap></keycombo></shortcut> <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu><guimenuitem>Split View Top/Bottom</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>)</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu><guisubmenu>Görünümü Böl</guisubmenu><guimenuitem>Görünümü Üst/Alt Şeklinde Böl</guimenuitem>

source: Splits all the tabs into top and bottom views
tr: Tüm sekmeleri üst ve alt görünümlere ayırır

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>]</keycap></keycombo></shortcut> <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu><guimenuitem>Expand View</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>]</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu><guisubmenu>Görünümü Böl</guisubmenu><guimenuitem>Görünümü Genişlet</guimenuitem>

source: Makes the current view larger
tr: Geçerli görünümü daha büyük hale getirir

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>[</keycap></keycombo></shortcut> <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu><guimenuitem>Shrink View</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>[</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu><guisubmenu>Görünümü Böl</guisubmenu><guimenuitem>Görünümü Küçült</guimenuitem>

source: Makes the current view smaller
tr: Geçerli görünümü daha küçük hale getirir

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>E</keycap></keycombo></shortcut> <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu><guimenuitem>Toggle maximize current view</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>E</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu><guisubmenu>Görünümü Böl</guisubmenu><guimenuitem>Geçerli Görünümü Büyüt/Küçült</guimenuitem>

source: Toggles the current view between current size and the maximize size
tr: Geçerli görünümü geçerli boyut ile olası en büyük boyut arasında değiştirir
