Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konsole.po
Languages: tr

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>\</keycap></keycombo></shortcut> <guimenu>View</guimenu><guisubmenu>Split View</guisubmenu><guimenuitem>Equal size to all views</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>\</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu><guisubmenu>Görünümü Böl</guisubmenu><guimenuitem>Tüm Görünümlere Eşit Boyut</guimenuitem>

source: Sets the same size for all views
tr: Tüm görünümleri aynı boyuta ayarlar

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>L</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Detach Current Tab</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>L</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu><guimenuitem>Geçerli Sekmeyi Ayır</guimenuitem>

source: Opens the current tab in a separate window
tr: Geçerli sekmeyi ayrı bir pencerede açar

source: Quitting the previous &konsole; window will not affect the newly created window.
tr: Önceki &konsole; penceresinden çıkmak, yeni oluşturulan pencereyi etkilemeyecektir.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>H</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Detach Current View</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>H</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu><guimenuitem>Geçerli Görünümü Ayır</guimenuitem>

source: Opens the current split view in a separate window
tr: Geçerli bölünmüş görünümü ayrı bir pencerede açar

source: <guimenu>View</guimenu><guimenuitem>Save tab layout to file</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guimenuitem>Sekme Yerleşimini Dosyaya Kaydet</guimenuitem>

source: Allows you to save the tab layout of the current view in a specialized &konsole; layout file which can then be loaded to restore one of your favorite layouts.
tr: Geçerli görünümün sekme yerleşimini, daha sonra sık kullanılan yerleşimlerinizden birini geri yüklemek için yüklenebilecek özel bir &konsole; yerleşim dosyasına kaydetmenizi sağlar.

source: <guimenu>View</guimenu><guimenuitem>Load tab layout from file</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guimenuitem>Dosyadan Sekme Yerleşimi Yükle</guimenuitem>

source: <action>Allows you to load one of your favorite view layouts from the layout file that has been saved using the <menuchoice><guimenu>View</guimenu><guimenuitem>Save tab layout to file</guimenuitem></menuchoice> menu item earlier.</action> The default layouts (2x2, 2x1, and 1x2) can be loaded via toolbar.
tr: Daha önceki <action><menuchoice><guimenu>Görünüm</guimenu><guimenuitem>Sekme Yerleşimini Dosyaya Kaydet</guimenuitem></menuchoice> kullanılarak kaydedilen yerleşim dosyasından sık kullanılan görünüm yerleşimlerinizden birini yüklemenize olanak tanır.</action> Öntanımlı yerleşimler (2 × 2, 2 × 1 ve 1 × 2) araç çubuğu aracılığıyla yüklenebilir.

source: <guimenu>View</guimenu><guimenuitem>One-shot monitors</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guimenuitem>Tek Kerelik Monitörler</guimenuitem>

source: The following monitors only notify once, and are then disabled.
tr: Aşağıdaki monitörler yalnızca bir kez bildirimde bulunur ve ardından devre dışı bırakılır.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>R</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Monitor for Prompt</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>R</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu><guimenuitem>İstemi İzle</guimenuitem>

source: Toggles the monitoring of the current tab for a shell prompt.
tr: Bir kabuk istemi için geçerli sekmenin izlenmesini açar/kapatır.

source: When a shell prompt is displayed, &konsole; will show a notification. This option is shown only when semantic integration is enabled in the shell.
tr: Bir kabuk istemi görüntülendiğinde &konsole; bir bildirim gösterir. Bu seçenek yalnızca kabukta anlamsal tümleşim etkinse gösterilir.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>I</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Monitor for Silence</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>I</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu><guimenuitem>Sessizliği İzle</guimenuitem>

source: Toggles the monitoring of the current tab for lack of activity
tr: Etkinlik eksikliği durumu için geçerli sekmenin izlenmesini açar/kapatır

source: By default, after 10 seconds of inactivity, an info icon will appear on the session's tab. The type of alerts can be changed through <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Notifications</guimenuitem><guimenuitem>Silence in monitored session</guimenuitem></menuchoice>.
tr: Öntanımlı olarak, 10 saniye boyunca herhangi bir işlem yapılmadığında oturumun sekmesinde bir bilgi simgesi görünür. Uyarıların türü <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Bildirimleri Yapılandır</guimenuitem><guimenuitem>İzlenen oturumda sessizlik</guimenuitem></menuchoice> aracılığıyla değiştirilebilir.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Monitor for Activity</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu><guimenuitem>Etkinliği İzle</guimenuitem>

source: Toggles the monitoring of the current tab for activity
tr: Etkinlik için geçerli sekmenin izlenmesini açar/kapatır

source: Upon any activity, an info icon will appear on the session's tab. The type of alerts can be changed through <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Notifications</guimenuitem><guimenuitem>Activity in monitored session</guimenuitem></menuchoice>.
tr: Herhangi bir etkinliğin ardından oturumun sekmesinde bir bilgi simgesi görünür. Uyarıların türü <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Bildirimleri Yapılandır</guimenuitem><guimenuitem>İzlenen oturumdaki etkinlik</guimenuitem></menuchoice> aracılığıyla değiştirilebilir.

source: <guimenu>View</guimenu><guimenuitem>Monitor for Process Finishing</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guimenuitem>Süreç Sonlanmasını İzle</guimenuitem>

source: <action>Toggles the monitoring of the current tab for the process finishing</action>.
tr: <action>Süreç tamamlanması için geçerli sekmenin izlenmesini açar/kapatır</action>.

source: If checked, upon finishing the current process, &konsole; will show a notification <guilabel>The process '<replaceable>name of the process</replaceable>' has finished running in session '<replaceable>name of the session</replaceable>'</guilabel>.
tr: İşaretlenirse geçerli sürecin tamamlanmasının ardından &konsole;, <guilabel>“<replaceable>A</replaceable>” süreci, “<replaceable>B</replaceable>” oturumundaki çalışmayı bitirdi</guilabel> biçiminde bir bildirim gösterir.

source: <guimenu>View</guimenu><guimenuitem>Read-only</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guimenuitem>Saltokunur</guimenuitem>

source: Toggles the session to be read-only: no input is accepted, drag and drop is disabled.
tr: Oturumu saltokunur olarak değiştirir: Hiçbir girdi kabul edilmez, sürükle ve bırak devre dışı bırakılır.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Enlarge Font</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu><guimenuitem>Yazıtipi Boyutunu Büyüt</guimenuitem>

source: Increases the text font size
tr: Metnin yazıtipi puntosunu artırır

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>0</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Reset Font Size</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>0</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu><guimenuitem>Yazıtipi Puntosunu Sıfırla</guimenuitem>

source: Reset the text font size to the profile default
tr: Metnin yazıtipi puntosunu profil öntanımlısına sıfırlar

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Shrink Font</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu><guimenuitem>Yazıtipi Boyutunu Küçült</guimenuitem>

source: Decreases the text font size
tr: Metnin yazıtipi puntosunu azaltır

source: <guimenu>View</guimenu> <guimenuitem>Set Encoding</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Kodlamayı Ayarla</guimenuitem>

source: Sets the character encoding
tr: Karakter kodlamasını ayarlar

source: <guimenu>View</guimenu><guimenuitem>Clear Scrollback</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guimenuitem>Geçmişi Temizle</guimenuitem>

source: Clears the text in the scrollback
tr: Geçmişteki metni temizler

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>K</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Clear Scrollback and Reset</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>K</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu><guimenuitem>Geçmişi Temizle ve Sıfırla</guimenuitem>

source: Clears the text in the current tab and scrollback and resets the terminal
tr: Geçerli sekmedeki ve geçmişteki metni temizler ve uçbirimi sıfırlar

source: <shortcut><keycap>F11</keycap></shortcut> <guimenu>View</guimenu><guimenuitem>Full Screen Mode</guimenuitem>
tr: <shortcut><keycap>F11</keycap></shortcut> <guimenu>Görünüm</guimenu><guimenuitem>Tam Ekran Kipi</guimenuitem>

source: Toggles &konsole; filling the entire screen
tr: &konsole;’nin tüm ekranı kaplamasını açar/kapatır

source: Bookmarks Menu
tr: Yer İmleri Menüsü

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap></keycombo></shortcut> <guimenu>Bookmarks</guimenu><guimenuitem>Add Bookmark</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap></keycombo></shortcut> <guimenu>Yer İmleri</guimenu><guimenuitem>Yer İmi Koy</guimenuitem>

source: Adds the current location
tr: Geçerli konumu ekler

source: <guimenu>Bookmarks</guimenu><guimenuitem>Bookmark Tabs as Folder...</guimenuitem>
tr: <guimenu>Yer İmleri</guimenu><guimenuitem>Sekmeleri Klasör Olarak Yer İmlerine Ekle…</guimenuitem>

source: Adds all tabs to a bookmark folder
tr: Tüm sekmeleri bir yer imleri klasörüne ekler

source: A dialog will open for the bookmark folder name.
tr: Yer imi klasörü adı için bir iletişim kutusu açılacaktır.

source: <guimenu>Bookmarks</guimenu><guimenuitem>New Bookmark Folder...</guimenuitem>
tr: <guimenu>Yer İmleri</guimenu><guimenuitem>Yeni Yer İmi Klasörü…</guimenuitem>

source: Adds a new folder to the bookmark list
tr: Yer imleri listesine yeni bir klasör ekler

source: <guimenu>Bookmarks</guimenu><guimenuitem>Edit Bookmarks</guimenuitem>
tr: <guimenu>Yer İmleri</guimenu><guimenuitem>Yer İmlerini Düzenle</guimenuitem>

source: Opens the bookmark editor
tr: Yer imi düzenleyicisini açar

source: The keditbookmarks program must be installed for this menu item to appear.
tr: Bu menü ögesinin görünebilmesi için keditbookmarks programının kurulu olması gerekir.

source: You can use the bookmark editor to manually add URLs. Currently, &konsole; accepts the following:
tr: URL’leri elle eklemek için yer imi düzenleyicisini kullanabilirsiniz. Şu anda &konsole;, aşağıdakileri kabul eder:

source: ssh://user@host:port
tr: ssh://kullanıcı@makine:kapı

source: telnet://user@host:port
tr: telnet://kullanıcı@makine:kapı

source: Plugins Menu
tr: Eklentiler Menüsü

source: Any installed plugins will be listed or "No plugins available"
tr: Kurulu eklentiler listelenir; kurulu eklenti yoksa "Kullanılabilir eklenti yok" yazar

source: Settings Menu
tr: Ayarlar Menüsü

source: <guimenu>Settings</guimenu><guimenuitem>Edit Current Profile...</guimenuitem>
tr: <guimenu>Ayarlar</guimenu><guimenuitem>Geçerli Profili Düzenle…</guimenuitem>

source: Opens a dialog to configure current profile
tr: Geçerli profili yapılandırmak için bir iletişim kutusu açar

source: <guimenu>Settings</guimenu><guimenuitem>Switch Profile </guimenuitem>
tr: <guimenu>Ayarlar</guimenu><guimenuitem>Profil Değiştir</guimenuitem>

source: Switch current profile to a listed profile
tr: Geçerli profili listedeki bir profille değiştirir

source: <guimenu>Settings</guimenu><guimenuitem>Manage Profiles...</guimenuitem>
tr: <guimenu>Ayarlar</guimenu><guimenuitem>Profilleri Yönet…</guimenuitem>

source: Opens an editor for managing profiles
tr: Profilleri yönetmek için bir düzenleyici açar

source: <guimenu>Settings</guimenu><guimenuitem>Window Color Scheme</guimenuitem>
tr: <guimenu>Ayarlar</guimenu><guimenuitem>Pencere Renk Şeması</guimenuitem>

source: Change &konsole;'s &GUI; to the specified scheme
tr: &konsole; grafik kullanıcı arayüzünü belirtilen şemaya değiştirir

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>M</keycap></keycombo></shortcut> <guimenu>Settings</guimenu><guimenuitem>Show Menu Bar</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>M</keycap></keycombo></shortcut> <guimenu>Ayarlar</guimenu><guimenuitem>Menü Çubuğunu Göster</guimenuitem>

source: Toggles the menubar being visible
tr: Menü çubuğunun görünürlüğünü açar/kapatır

source: <guimenu>Settings</guimenu><guimenuitem>Toolbars Shown</guimenuitem>
tr: <guimenu>Ayarlar</guimenu><guimenuitem>Gösterilen Araç Çubukları</guimenuitem>

source: Allows visibility toggling of the &konsole; toolbars
tr: &konsole; araç çubuklarının görünürlüğünü açar/kapatır

source: <guimenu>Settings</guimenu><guimenuitem>Show Statusbar</guimenuitem>
tr: <guimenu>Ayarlar</guimenu><guimenuitem>Durum Çubuğunu Göster</guimenuitem>

source: Toggles the statusbar being visible
tr: Durum çubuğunun görünürlüğünü açar/kapatır

source: <guimenu>Settings</guimenu><guimenuitem>Configure Language... </guimenuitem>
tr: <guimenu>Ayarlar</guimenu><guimenuitem>Dili Yapılandır…</guimenuitem>

source: Opens window to choose an interface translation of &konsole;.
tr: &konsole;’nin arayüz çevirisini seçmek için bir pencere açar.

source: <guimenu>Settings</guimenu><guimenuitem>Configure Keyboard Shortcuts...</guimenuitem>
tr: <guimenu>Ayarlar</guimenu><guimenuitem>Klavye Kısayollarını Yapılandır…</guimenuitem>

source: <action>Opens the keyboard shortcut editor.</action> More on shortcuts configuration can be found in the <ulink url="help:/fundamentals/shortcuts.html">&kde; Fundamentals</ulink>.
tr: <action>Klavye kısayol düzenleyicisini açar.</action> Kısayol yapılandırmasıyla ilgili daha fazla bilgiyi <ulink url="help:/fundamentals/shortcuts.html">&kde; Temelleri</ulink> bölümünde bulabilirsiniz.

source: Additionally &konsole; has a few special shortcuts with no corresponding menu item:
tr: Ek olarak &konsole;, karşılığı olmayan menü ögeleri için birkaç özel kısayola sahiptir:

source: Shortcut
tr: Kısayol

source: Description
tr: Açıklama

source: &Shift;<keysym>Right</keysym>
tr: &Shift;<keysym>Sağ</keysym>

source: Next Tab
tr: Sonraki Sekme

source: &Shift;<keysym>Left</keysym>
tr: &Shift;<keysym>Sol</keysym>

source: Previous Tab
tr: Önceki Sekme

source: &Ctrl;&Alt;<keysym>Left</keysym>
tr: &Ctrl;&Alt;<keysym>Sol</keysym>

source: Move Tab Left
tr: Sekmeyi Sola Taşı

source: &Ctrl;&Alt;<keysym>Right</keysym>
tr: &Ctrl;&Alt;<keysym>Sağ</keysym>

source: Move Tab Right
tr: Sekmeyi Sağa Taşı

source: &Ctrl;&Shift;<keysym>Ins</keysym>
tr: &Ctrl;&Shift;<keysym>Ekle</keysym>

source: Paste Selection
tr: Seçimi Yapıştır

source: <guimenu>Settings</guimenu><guimenuitem>Configure Toolbars...</guimenuitem>
tr: <guimenu>Ayarlar</guimenu><guimenuitem>Araç Çubuklarını Yapılandır…</guimenuitem>

source: Opens <ulink url="help:/fundamentals/config.html#toolbars-items">the toolbar configuration window</ulink>
tr: <ulink url="help:/fundamentals/config.html#toolbars-items">Araç çubuğu yapılandırma</ulink> penceresini açar

source: <guimenu>Settings</guimenu><guimenuitem>Configure Notifications...</guimenuitem>
tr: <guimenu>Ayarlar</guimenu><guimenuitem>Bildirimleri Yapılandır…</guimenuitem>

source: Opens the notifications editor
tr: Bildirim düzenleyicisini açar

source: <guimenu>Settings</guimenu><guimenuitem>Configure &konsole;...</guimenuitem>
tr: <guimenu>Ayarlar</guimenu><guimenuitem>&konsole; Uygulamasını Yapılandır…</guimenuitem>

source: Opens the &konsole; settings editor
tr: &konsole; ayarları düzenleyicisini açar

source: This dialog has options influencing the appearance and behaviour of the &konsole; window.
tr: Bu iletişim kutusunda, &konsole; görünüşünü ve davranışını etkileyen seçenekler bulunur.

source: The <guilabel>General</guilabel> page allows configuring the menubar visibility, remembering the &konsole; window size, running all &konsole; windows in a single process, enabling menu accelerators, showing window title on the titlebar, removing window titlebar and frame, and focusing terminals when the mouse pointer is moved over them. It is also possible to configure the search case sensitivity, usage of the regular expression, highlighting all matches, and the search direction (<guilabel>Search backwards</guilabel> is the default). The <guilabel>General</guilabel> page is also the place where you can <guibutton>Enable all "Don't Ask Again" messages</guibutton> again if they were switched off before.
tr: <guilabel>General</guilabel> sayfası; menü bar görünürlüğünü, &konsole; penceresi boyutunu anımsamayı, tüm &konsole; pencerelerini tek bir süreçte çalıştırmayı, menü ivmelendiricileri etkinleştirmeyi, başlık çubuğunda pencere başlığını göstermeyi, pencere çerçevesini ve başlık çubuğunu kaldırmayı ve fare işaretçisi üzerilerine geldiğinde uçbirimlere odaklanmayı denetleyen ayarları içerir. Ayrıca harf biçimi duyarlılığını, düzenli ifade kullanımını, tüm eşleşmeleri vurgulamayı ve arama yönünü (<guilabel>Geriye doğru ara</guilabel> öntanımlıdır) de yapılandırabilirsiniz. <guilabel>General</guilabel> sayfası, ayrıca daha önce kapatılmışlarsa <guibutton>Tüm "Bir Daha Sorma" İletilerini Etkinleştir</guibutton>’ebileceğiniz yerdir.

source: The <guilabel>Profiles</guilabel> page is meant for creating and handling <link linkend="profiles">profiles</link>.
tr: <guilabel>Profiller</guilabel> sayfası, <link linkend="profiles">profiller</link> oluşturmak ve onları yönetmek içindir.

source: Using the <guilabel>Tab Bar/Splitters</guilabel> page you can configure the visibility and placement of tab bar, define tabs behavior and fine-tune the tab buttons options. It is possible to configure if you want to <guilabel>Show 'New Tab' button</guilabel> and <guilabel>Expand individual tab widths to full window</guilabel> or configure <guilabel>Use user-defined stylesheet</guilabel>. The <guilabel>Behavior</guilabel> tab can be used to define the place for the new tabs (<guilabel>At the end</guilabel> or <guilabel>After current tab</guilabel>) and closing of tabs with a &MMB; click.
tr: <guilabel>Sekme Çubuğu/Ayırıcılar</guilabel> sayfasını kullanarak, sekme çubuğunun görünürlüğünü ve konumunu, sekme davranışlarını ve sekme düğmelerinin ince ayarlarını yapılandırabilirsiniz. <guilabel>“Yeni Sekme” düğmesini göster</guilabel> ve <guilabel>Bireysel sekme genişliklerini tam pencereye genişlet</guilabel> arasında seçim yapabilir veya <guilabel>Kullanıcı tanımlı biçem sayfası kullan</guilabel> yapılandırmasını yapabilirsiniz. <guilabel>Davranış</guilabel> sekmesinde yeni sekmelerin konumunu (<guilabel>Sona</guilabel> veya <guilabel>Geçerli sekmeden sonra</guilabel>) ve &MMB; ile tıklayarak sekme kapatmayı da ayarlamak olanaklıdır.

source: It is also possible to configure visibility of the split headers (<guilabel>When needed</guilabel> (default), <guilabel>Always</guilabel>, or <guilabel>Never</guilabel>) and define the drag handle size for splits (<guilabel>Small</guilabel> (default), <guilabel>Medium</guilabel>, or <guilabel>Large</guilabel>) using the <guilabel>Splits</guilabel> tab of this configuration page.
tr: Bölünmüş başlıkların görünürlüğünü (<guilabel>Gerektiğinde</guilabel> (öntanımlı), <guilabel>Her zaman</guilabel> veya <guilabel>Asla</guilabel>) ve bölünmüş görünümlerin sürükleme tutacı boyutunu (<guilabel>Küçük</guilabel> (öntanımlı), <guilabel>Orta</guilabel> veya <guilabel>Büyük</guilabel>) bu yapılandırma sayfasının <guilabel>Bölmeler</guilabel> sekmesinden yapılandırmak olanaklıdır.

source: The <guilabel>Temporary Files</guilabel> page is used to define the <link linkend="scrollback">scrollback</link> file location.
tr: <guilabel>Geçici Dosyalar</guilabel> sayfası, <link linkend="scrollback">geçmiş</link> dosyası konumunu tanımlamak için kullanılır.

source: The <guilabel>Thumbnails</guilabel> page can be used to define the thumbnail size and activation options (you can choose the activation control key from &Shift;, &Alt;, and &Ctrl;).
tr: <guilabel>Küçük Görseller</guilabel> sayfası, küçük görsel boyutunu ve etkinleştirme seçeneklerini tanımlamak için kullanılabilir (etkinleştirme denetimi düğmesini &Shift;, &Alt; ve &Ctrl; arasından seçebilirsiniz).

source: To use the thumbnails feature showing image thumbnails in popups when hovering image items with the mouse pointer, you should enable file underlining for your current profile: <menuchoice><guimenu>Settings</guimenu><guimenuitem>Edit Current Profile...</guimenuitem><guimenuitem>Mouse</guimenuitem><guimenuitem>Miscellaneous</guimenuitem><guimenuitem>Underline files</guimenuitem></menuchoice>.
tr: Fare işaretçisiyle ögelerinin üzerine gelindiğinde açılır pencerelerde görsellerin küçük hallerini gösteren küçük görseller özelliğini kullanmak için geçerli profilinizde dosyanın altını çizmeyi etkinleştirmelisiniz: <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Geçerli Profili Düzenle…</guimenuitem><guimenuitem>Fare</guimenuitem><guimenuitem>Diğer</guimenuitem><guimenuitem>Dosyaların altını çiz</guimenuitem></menuchoice>.

source: Help Menu
tr: Yardım Menüsü

source: &konsole; has the some of the common &kde; <guimenu>Help</guimenu> menu items, for more information read the section about the <ulink url="help:/fundamentals/menus.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
tr: &konsole;, ortak &kde; <guimenu>Yardım</guimenu> menüsü ögelerine sahiptir; daha fazla bilgi için &kde; Temelleri’nin <ulink url="help:/fundamentals/menus.html#menus-help">Yardım Menüsü</ulink> bölümüne bakın.

source: &konsole; Dialogs
tr: &konsole; İletişim Kutuları

source: Configure Tab Settings Dialog
tr: Sekme Ayarlarını Yapılandır İletişim Kutusu

source: The name format, the remote tab title format, and the color of the current tab can be changed from this dialog. The dialog can be displayed via the menu, the shortcut <keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap></keycombo> or by double-clicking on the tab in the tab bar. These changes are temporary and can be made permanent by editing the current profile.
tr: Geçerli sekmenin ad biçimi, uzak sekme başlığı biçimi ve geçerli sekmenin rengi bu iletişim kutusundan değiştirilebilir. İletişim kutusu; menüden, <keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap></keycombo> kısayolundan veya sekme çubuğunda sekmenin üzerine çift tıklayarak görüntülenebilir. Bu değişiklikler geçicidir ve geçerli profili düzenleyerek kalıcı yapılabilir.

source: &konsole; will substitute these tokens for local tabs:
tr: &konsole;, yerel sekmelerde bu jetonlardan yararlanacak:

source: %n : program name
tr: %n : Program adı

source: %d : current directory (short)
tr: %d : Geçerli dizin (kısa)

source: %D : current directory (long)
tr: %D : Geçerli dizin (uzun)

source: %h : local host (short)
tr: %h : Yerel makine (kısa)

source: %u : user name
tr: %u : Kullanıcı adı
