Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konsole.po
Languages: tr

source: If this mode is set, the <keycap>Return</keycap> (Enter) key on the keyboard will send both Carriage Return "\r" and New Line "\n" control characters
tr: Bu kip ayarlıysa klavyedeki <keycap>Dönüş</keycap> (Giriş) düğmesi hem Satırbaşı "\r" hem de Yenisatır "\n" denetim karakterlerini gönderecektir.

source: If this mode is reset, the <keycap>Return</keycap> key will send only a Carriage Return "\r"
tr: Bu kip ayarlıysa <keycap>Dönüş</keycap> düğmesi yalnızca bir Satırbaşı "\r" gönderecektir.

source: The same applies to the <keycap>Enter</keycap> key on the Keypad
tr: Aynısı numara düğmeleri takımındaki <keycap>Giriş</keycap> düğmesi için de geçerlidir.

source: This mode emulates the <ulink url="https://www.vt100.net/docs/vt100-ug/chapter3.html#LNM">LNM - Line Feed/New Line Mode</ulink>
tr: Bu kip <ulink url="https://www.vt100.net/docs/vt100-ug/chapter3.html#LNM">LNM — Satır Besleme/Yeni Satır Kipi</ulink>’ne öykünür.

source: Note that each combination of Key and Modes (set/reset) must be unique. For example, consider the following two rules:
tr: Düğmelerin ve Kiplerin her bir kombinasyonunun (ayarlama/sıfırlama) benzersiz olması gerektiğini unutmayın. Örneğin, aşağıdaki iki kuralı göz önünde bulundurun:

source: A+Shift : <quote>A</quote>
tr: A+Üst Karakter : <quote>A</quote>

source: &konsole; will <emphasis>not</emphasis> accept the small letter <quote>a</quote> rule, you have to add a <quote>-Shift</quote> to that rule to make it work.
tr: &konsole; küçük <quote>a</quote> kuralını kabul etmeyecektir, bunu çalıştırmak için bu kurala bir <quote>-Üst Karakter</quote> eklemeniz gerekmektedir.

source: The Output Field
tr: Çıktı Alanı

source: In the Output field you can add the escape sequences or control characters that you want &konsole; to send to the terminal when the associated key combination is pressed.
tr: Çıktı alanında ilgili düğme kombinasyonuna basıldığında &konsole;’nin uçbirime göndermesini istediğiniz kaçış dizilerini veya denetim karakterlerini ekleyebilirsiniz.

source: You can also use any of the following keywords, each of which has a special meaning in &konsole;:
tr: Ayrıca &konsole;’de her biri özel bir anlama sahip olan aşağıdaki anahtar sözcüklerden herhangi birini de kullanabilirsiniz:

source: scrollUpLine : scroll up one line in the shell history scrollback buffer
tr: scrollUpLine : Kabuk geçmişi arabelleğinde bir satır yukarı sar

source: scrollUpPage : scroll up one page in the shell history scrollback buffer
tr: scrollUpPage : Kabuk geçmişi arabelleğinde bir sayfa yukarı sar

source: scrollDownLine : scroll down one line in the shell history scrollback buffer
tr: scrollDownLine : Kabuk geçmişi arabelleğinde bir satır aşağı sar

source: scrollDownPage : scroll down one page in the shell history scrollback buffer
tr: scrollDownPage : Kabuk geçmişi arabelleğinde bir sayfa aşağı sar

source: scrollUpToTop : scroll up to the begining of the shell history scrollback buffer
tr: scrollUpToTop : Kabuk geçmişi arabelleğinin en üstüne sar

source: scrollDownToBottom : scroll down to the end of the shell history scrollback buffer
tr: scrollDownToBottom : Kabuk geçmişi arabelleğinin en altına sar

source: You can also use strings with C-string syntax; you may use the following escapes sequences:
tr: Ayrıca C-string sözdizimi ile de diziler kullanabilirsiniz; aşağıdaki kaçış dizileri kullanılabilirdir:

source: \E : Escape
tr: \E : Vazgeç

source: \\ : Backslash
tr: \\ : Ters eğik çizgi

source: \" : Double quote
tr: \" : Çift tırnak

source: \t : Tab
tr: \t : Sekme

source: \r : Carriage Return
tr: \r : Satırbaşı

source: \n : New line
tr: \n : Yenisatır

source: \b : Backspace
tr: \b : Geri sil

source: \xHH : where HH are two hex digits
tr: \xHH : HH iki adet onaltılık basamaktır

source: This can be used to send &ASCII; control characters, &eg; <quote>\x00</quote> which is the NUL character
tr: Bu, &ASCII; denetim karakterleri göndermek için kullanılabilir; örneğin, <quote>\x00</quote>, NUL karakteridir.

source: Other System Resources
tr: Diğer Sistem Özkaynakları

source: There are other system resources that can affect terminal Key Bindings:
tr: Uçbirim düğme bağıntılarını etkileyebilecek başka sistem özkaynakları da vardır:

source: Consult the <ulink url="man:terminfo(5)">terminfo</ulink> or <ulink url="man:termcap(5)">termcap</ulink> database for the expected escape sequences and control characters that each key combination is supposed to send.
tr: Her bir düğme kombinasyonunun göndermesi gereken kaçış dizileri ve denetim karakterleri hakkında bilgi almak için <ulink url="man:terminfo(5)">terminfo</ulink> veya <ulink url="man:termcap(5)">termcap</ulink> veritabanına başvurun.

source: It is likely that your system has other keyboard databases which have to be in sync too, (&eg; <ulink url="man:bash(1)">/etc/inputrc and readline</ulink> for the <application>BASH shell</application>) as they affect the operations (interactions) bound to key combinations.
tr: Büyük olasılıkla sisteminizde eşzamanlı olması gereken başka klavye veritabanları da olmalıdır (&eg; <application>BASH</application> kabuğu için <ulink url="man:bash(1)">/etc/inputrc ve readline</ulink>); çünkü bunlar düğme kombinasyonlarına bağlı olan işlemleri (etkileşimleri) de etkilerler.

source: Further Reading
tr: Ek Okuma

source: For more information on escape sequences and control characters, check the following documentation:
tr: Kaçış dizileri ve denetim karakterleri üzerine daha fazla bilgi için aşağıdaki belgelendirmeye göz atın:

source: The VT100 user guide
tr: VT100 kullanıcı kılavuzu

source: The VT102 user guide
tr: VT102 kullanıcı kılavuzu

source: The comprehensive and indispensable <ulink url="https://invisible-island.net/xterm/ctlseqs/ctlseqs.html">XTerm Control Sequences</ulink> documentation
tr: Kapsamlı ve eşsiz <ulink url="https://invisible-island.net/xterm/ctlseqs/ctlseqs.html">XTerm Denetim Dizileri</ulink> belgelendirmesi

source: Using Style Sheet for the Tab Bar
tr: Sekme Çubuğu için Biçem Sayfası Kullanımı

source: The default style sheet for the tab bar sets the minimum and maximum tab widths. The user can create a <filename role="extension">.css</filename> file and have &konsole; use that as the style sheet for the tab bar. In the <filename role="extension">.css</filename> file, the widget to use is <userinput>QTabBar::tab</userinput>.
tr: Sekme çubuğunun öntanımlı biçem sayfası, en küçük ve büyük sekme genişliklerini ayarlar. Kullanıcı bir <filename role="extension">.css</filename> dosyası oluşturabilir ve &konsole; bunu sekme çubuğu için biçem sayfası olarak kullanır. <filename role="extension">.css</filename> dosyasında onu kullanacak araç takımı <userinput>QTabBar::tab</userinput>’dır.

source: For more information, consider reading <ulink url="https://doc.qt.io/qt-5/stylesheet.html">&Qt; Style Sheets</ulink>
tr: Daha fazla bilgi için <ulink url="https://doc.qt.io/qt-5/stylesheet.html">&Qt; Biçem Sayfaları</ulink> belgelendirmesini okuyun.

source: Change the selected tab's background to a light gray
tr: Seçili sekmenin arka planını açık gri olarak değiştir

source: Change the selected tab's text to red
tr: Seçili sekmenin metnini kırmızıya çevir

source: All tabs will be at least 200 pixels in width
tr: Tüm sekmeler en az 200 piksel genişliğinde olsun

source: Only the selected tab will be at least 200 pixels in width
tr: Yalnızca seçili sekme en az 200 piksel genişliğinde olsun

source: Any of these can be combined in one file
tr: Bunların tümü bir dosyada birleştirilebilir

source: Did You Know?, Common Issues and More
tr: Biliyor Muydunuz? Genel Sorunlar ve Daha Fazlası

source: Did You Know?
tr: Biliyor Muydunuz?

source: Pressing &Ctrl; while selecting text will cause lines breaks to be converted to spaces when pasted.
tr: Metin seçerken &Ctrl; düğmesine basmak, satır sonlarının yapıştırıldığında boşluklara dönüştürülmesine neden olacaktır.

source: Pressing the <keycombo action="simul">&Ctrl;&Alt;</keycombo> keys while selecting text will select columns.
tr: Metin seçerken <keycombo action="simul">&Ctrl;&Alt;</keycombo> düğmelerine basmak sütunları seçer.

source: The <keycombo action="simul">&Ctrl;<mousebutton>Wheel</mousebutton></keycombo> combination will zoom text size, like in konqueror and firefox.
tr: <keycombo action="simul">&Ctrl;<mousebutton>Fare Tekerleği</mousebutton></keycombo> kombinasyonu, aynı Konqueror ve Firefox’ta olduğu gibi metin boyutunu yakınlaştırır.

source: When a program evaluates either mouse button, pressing the &Shift; key will allow the popup menu to appear.
tr: Bir program fare düğmelerinden herhangi birini değerlendirdiğinde, &Shift; düğmesine basmak açılır menünün görünmesini sağlayacaktır.

source: The <keycombo action="simul">&Ctrl;&Shift;<keycap>F10</keycap></keycombo> shortcut will activate the menu.
tr: <keycombo action="simul">&Ctrl;&Shift;<keycap>F10</keycap></keycombo> kısayolu menüyü etkinleştirir.

source: The <keycombo action="simul">&Shift;<keycap>Insert</keycap></keycombo> keys will insert the clipboard.
tr: <keycombo action="simul">&Shift;<keycap>Ekle</keycap></keycombo> düğmeleri pano içeriğini ekler.

source: Double-clicking will select a whole word. Continuing to hold the mouse button and moving the mouse will extend the selection.
tr: Çift tıklamak sözcüğün tümünü seçer. Fare düğmesini basılı tutmayı sürdürüp fareyi hareket ettirmek, seçimi genişletir.

source: Triple-clicking will select a whole line. Continuing to hold the mouse button and moving the mouse will extend the selection.
tr: Üç tıklama tüm satırı seçer. Fare düğmesini basılı tutmayı sürdürüp fareyi hareket ettirmek seçimi genişletir.

source: There is a hidden feature for the "%d" formatter in tab title. You can tell &konsole; to abbreviate a directory name into its first character. For example, "/path/to/konsole/src" can be abbreviated into "konsole/s". If you want to enable and control this hidden feature, open <filename>konsolerc</filename> in <userinput><command>qtpaths</command> <option>--paths GenericConfigLocation</option></userinput> and add following lines:
tr: Sekme başlığındaki "%d" biçimlendiricisinde gizli bir özellik vardır. &konsole;’a bir dizin adını onun ilk karakterine kısaltmasını söyleyebilirsiniz. Örneğin, "/konsole/ikilisi/yolu", "konsole/i" olarak kısaltılabilir. Bu gizli özelliği etkinleştirmek ve denetlemek isterseniz <userinput><command>qtpaths</command> <option>--paths GenericConfigLocation</option></userinput> içindeki <filename>konsolerc</filename> dosyasını açın ve aşağıdaki satırları ekleyin:

source: [ProcessInfo] CommonDirNames=name1,name2,name3...
tr: [ProcessInfo] CommonDirNames=ad1,ad2,ad3…

source: If you are using <application>Yakuake</application>, you need to edit <filename>yakuakerc</filename> in <userinput><command>qtpaths</command> <option>--paths GenericConfigLocation</option></userinput> instead.
tr: <application>Yakuake</application> kullanıyorsanız <userinput><command>qtpaths</command> <option>--paths GenericConfigLocation</option></userinput> içindeki <filename>yakuakerc</filename> dosyasını düzenlemeniz gerekir.

source: Common Issues
tr: Genel Sorunlar

source: Some fonts might be unavailable for usage in &konsole;, although they are available in other applications. That doesn't mean there is a bug in &konsole;. &konsole; requires monospaced fonts to provide the best visual result, so it asks &Qt; to only list monospaced fonts.
tr: Bazı yazıtipleri, diğer uygulamalarda kullanılabilir olmasına rağmen &konsole;’de kullanılamayabilir. Bu, &konsole;’de bir hata olduğu anlamına gelmez. &konsole;, en iyi görsel sonucu sağlamak eş aralıklı yazıtiplerini gerektirir, bu nedenle &Qt;’den yalnızca eş aralıklı yazıtiplerini listelemesini ister.

source: Starting with version 16.08 (August 2016), &konsole; can be configured to allow selecting any font with the caveat that the display may not be correct.
tr: 16.08 sürümünden (Ağustos 2016) itibaren &konsole;, ekranın doğru görüntülenemeyebileceği uyarısıyla herhangi bir yazıtipinin seçilmesine izin verecek biçimde yapılandırılabilir.

source: Since KDE4 all the tabs use the same process ID. This has the side-effect that if one tab's process has issues, all the other tabs may experience issues as well.
tr: KDE4’ten bu yana tüm sekmeler aynı süreç kimliğini kullanır. Bunun, bir sekmenin işleminde sorun olması durumunda diğer tüm sekmelerde de sorun yaşanması gibi bir yan etkisi vardır.

source: This is most noticeable when a command that connects to an external device or system (ssh, nfs) has issues.
tr: Bu en çok, dış bir aygıta veya sisteme (ssh, nfs) bağlanan bir komutta sorunlar olduğunda fark edilir.

source: &konsole; treats arguments after the <option>-e</option> option as one command and runs it directly, instead of parsing it and possibly dividing it into sub-commands for execution. This is different from xterm.
tr: &konsole;, <option>-e</option> seçeneğinden sonraki argümanları bir komut olarak ele alır ve onları yürütme amaçlı ayrıştırma ve olası bölme yerine doğrudan çalıştırır. Bu, xterm’den farklıdır.

source: <command>konsole -e "command1 ; command2"</command> does not work
tr: <command>konsole -e "komut1 ; komut2"</command> çalışmaz

source: <command>konsole -e $SHELL -c "command1 ; command2"</command> works
tr: <command>konsole -e $SHELL -c "komut1 ; komut2"</command> çalışır

source: &konsole; doesn't provide convenience for running login shell, because developers don't like the idea of running login shell in a terminal emulator.
tr: &konsole;, oturum açma kabuğunu çalıştırma konusunda kolaylık sağlamaz; çünkü geliştiricileri oturum açma kabuğunu bir uçbirim öykünücüsünde çalıştırma fikrinden hoşlanmıyor.

source: Of course, users still can run login shell in &konsole; if they really need to. Edit the profile in use and modify its command to the form of starting a login shell explicitly, such as "<command>bash -l</command>" and "<command>zsh -l</command>".
tr: Tabii ki kullanıcılar çok gerekirse oturum açma kabuğunu &konsole;’da çalıştırabilirler. Kullanımdaki profili düzenleyin ve komutunu bir oturum açma kabuğunu açıkça çağıracak biçimde değiştirin; örneğin, "<command>bash -l</command>" ve "<command>zsh -l</command>".

source: The <option>--new-tab</option> option sometimes behaves strangely. It may create new window, or it may create new tab in another existing &konsole; window instead of the current &konsole; window.
tr: <option>--new-tab</option> seçeneği bazen garipçe davranabilir. Yeni bir pencere oluşturabilir veya geçerli pencere yerine var olan başka bir &konsole; penceresinde yeni bir sekme oluşturabilir.

source: Those behaviors feel strange, but they are not necessarily bugs. The <option>--new-tab</option> option tries to reuse existing &konsole; windows, but not all &konsole; windows are reusable. All &konsole; windows opened through &krunner; are reusable, while most &konsole; windows opened from command line are not.
tr: Bu davranışlar garip gelebilir; ancak bunlara pek hata da denemez. <option>--new-tab</option> seçeneği var olan &konsole; pencerelerini yeniden kullanmaya çalışır; ancak tüm &konsole; pencereleri yeniden kullanılabilir değildir. &krunner; üzerinden açılan &konsole; pencerelerini yeniden kullanmak olanaklıdır; komut satırından açılan çoğu &konsole; penceresi değil.

source: Credits and Copyright
tr: Emeği Geçenler ve Telif Hakkı

source: &konsole; is currently maintained by &Kurt.Hindenburg; &Kurt.Hindenburg.mail;
tr: &konsole; bakımı şu anda &Kurt.Hindenburg; &Kurt.Hindenburg.mail; tarafından yapılmaktadır.

source: Previous &konsole; maintainers include: &Robert.Knight; &Robert.Knight.mail; and &Waldo.Bastian; &Waldo.Bastian.mail;
tr: Önceki &konsole; bakımcıları: &Robert.Knight; &Robert.Knight.mail; ve &Waldo.Bastian; &Waldo.Bastian.mail;

source: The application &konsole; Copyright &copy; 1997-2008 &Lars.Doelle; &Lars.Doelle.mail;
tr: &konsole; uygulaması telif hakkı &copy; 1997–2008 &Lars.Doelle; &Lars.Doelle.mail;

source: This document was originally written by &Jonathan.Singer; &Jonathan.Singer.mail;
tr: Bu belge ilk olarak &Jonathan.Singer; &Jonathan.Singer.mail; tarafından yazılmıştır.

source: This document was updated for &kde; 4.x by &Kurt.Hindenburg; &Kurt.Hindenburg.mail;
tr: Bu belge &kde; 4.x için &Kurt.Hindenburg; &Kurt.Hindenburg.mail; tarafından güncellenmiştir.

source: This document was updated for &kde; 3.4 by &Kurt.Hindenburg; &Kurt.Hindenburg.mail;
tr: Bu belge &kde; 3.4 için &Kurt.Hindenburg; &Kurt.Hindenburg.mail; tarafından güncellenmiştir.

source: Originally converted to DocBook <acronym>SGML</acronym> by &Mike.McBride; and &Lauri.Watts;
tr: DocBook <acronym>SGML</acronym> dönüşümü &Mike.McBride; ve &Lauri.Watts; tarafından yapıldı.

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Kaan Özdinçer <email>kaanozdincer@gmail.com</email></para><para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>

source: Links
tr: Bağlantılar

source: For more information please visit these websites:
tr: Daha fazla bilgi için lütfen bu web sitelerini ziyaret edin:

source: <ulink url="https://userbase.kde.org/Konsole">&konsole;'s homepage on &kde;'s UserBase</ulink>&nbsp;
tr: <ulink url="https://userbase.kde.org/Konsole">&kde; Kullanıcı Tabanı’ndaki &konsole; ana sayfası</ulink>&nbsp;

source: &konsole;'s homepage
tr: &konsole; ana sayfası

source: &konsole;'s mailing list
tr: &konsole; posta listesi

source: &kde; on FreeBSD
tr: FreeBSD üzerinde &kde;

source: &kde; on &Solaris;
tr: &Solaris; üzerinde &kde;
