Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konsole.po
Languages: tr

source: The &konsole; Handbook
tr: &konsole; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit> <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: &konsole; is &kde;'s terminal emulator.
tr: &konsole;, &kde;’nin uçbirim öykünücüsüdür.

source: command
tr: komut

source: line
tr: satır

source: terminal
tr: uçbirim

source: Introduction
tr: Giriş

source: What is a terminal?
tr: Uçbirim nedir?

source: &konsole; is an X terminal emulator, often referred to as a terminal or a shell. It emulates a command line interface in a text only window.
tr: &konsole;, genellikle uçbirim veya kabuk olarak adlandırılan bir X uçbirim öykünücüsüdür. Yalnızca metin penceresindeki bir komut satırı arayüzünü öykünür.

source: &konsole; typically runs a command shell, an application that executes commands that you type. The shell the &konsole; runs depends on your account settings. Consult your operating system documentation to know what the shell is, how to configure it and how to use it.
tr: &konsole;, tipik olarak yazdığınız komutları yürüten bir uygulama olan bir komut kabuğu çalıştırır. &konsole;’nin çalıştığı kabuk hesap ayarlarınıza bağlıdır. Kabuk nedir, nasıl yapılandırılır ve nasıl kullanılır öğrenmek için işletim sistemi belgelerinize bakın.

source: Scrollback
tr: Geçmiş

source: &konsole; uses the notion of scrollback to allow users to view previously displayed output. By default, scrollback is on and set to save 1000 lines of output in addition to what is currently displayed on the screen.
tr: &konsole;, kullanıcıların daha önce görüntülenen çıktıyı görüntülemesine olanak sağlamak için geçmiş kavramını kullanır. Öntanımlı olarak geri sarma açıktır ve ekranda görüntülenene ek olarak 1000 satırlık çıktıyı kaydedecek şekilde ayarlanmıştır.

source: As lines of text scroll off the top of the screen, they can be reviewed by moving the scroll bar upwards, scrolling with a mouse wheel or through the use of the <keycombo action="simul">&Shift;<keycap>Page Up</keycap></keycombo> (to move back), <keycombo action="simul">&Shift;<keycap>Page Down</keycap></keycombo> (to move forward), <keycombo action="simul">&Shift;<keycap>Up Arrow</keycap></keycombo> (to move up a line) and <keycombo action="simul">&Shift;<keycap>Down Arrow</keycap></keycombo> (to move down a line) keys.
tr: Metin satırları ekranın yukarısından sarıldıkça; sarma çubuğunu yukarı taşıyarak, fare tekerleği kullanılarak veya <keycombo action="simul">&Shift;<keycap>Sayfa Yukarı</keycap></keycombo> (geri gitmek için), <keycombo action="simul">&Shift;<keycap>Sayfa Aşağı</keycap></keycombo> (ileri gitmek için), <keycombo action="simul">&Shift;<keycap>Yukarı Ok</keycap></keycombo> (bir satır yukarı gitmek için) ve <keycombo action="simul">&Shift;<keycap>Aşağı Ok</keycap></keycombo> (bir satır aşağı gitmek için) düğmeleriyle gözden geçirilebilirler.

source: The amount of scrolling using <keycombo action="simul">&Shift;<keycap>Page Up/Down</keycap></keycombo> can be switched between half and full page in the <guilabel>Scrolling</guilabel> tab of the profile configuration window (use <menuchoice><guimenu>Settings</guimenu><guimenuitem>Edit Current Profile...</guimenuitem></menuchoice> to open this window).
tr: <keycombo action="simul">&Shift;<keycap>Sayfa Yukarı/Aşağı</keycap></keycombo> kısayolu ile yapılacak sarma miktarı, profil yapılandırma penceresinin <guilabel>Sarma</guilabel> sekmesinde tam veya yarım sayfa olarak ayarlanabilir (Bu pencereyi açmak için <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Geçerli Profili Düzenle…</guimenuitem></menuchoice> yolunu kullanın).

source: Selection Mode
tr: Seçim Kipi

source: &konsole; has a selection by keyboard mode. In this mode it is possible to move around the scrollback and select text without the mouse.
tr: &konsole;’de bir klavyeyle seçim kipi vardır. Bu kipte, geçmişte serbestçe dolanılabilir ve fare olmadan metin seçilebilir.

source: Enter and leave this mode by using the keyboard shortcut (<keycombo action="simul">&Ctrl;&Shift;<keycap>D</keycap></keycombo> by default).
tr: Bu kipe giriş yapıp çıkmak için klavye kısayolunu kullanın (öntanımlı olarak <keycombo action="simul">&Ctrl;&Shift;<keycap>D</keycap></keycombo>).

source: <keycap>Esc</keycap> also leaves the keyboard selection mode.
tr: <keycap>Vazgeç</keycap> düğmesi de klavyeyle seçim kipinden çıkar.

source: Moving the cursor: Arrows, <keycap>PageUp</keycap>, <keycap>PageDown</keycap>, <keycap>Home</keycap>, <keycap>End</keycap>.
tr: İmleci hareket ettirmek: Oklar, <keycap>Sayfa Yukarı</keycap>, <keycap>Sayfa Aşağı</keycap>, <keycap>Baş</keycap>, <keycap>Son</keycap>.

source: Moving the cursor <application>vi</application> style: h,j,k,l, to move one character, <keycap>Ctrl</keycap>+b,f,u,d for page up/down or half page up/down.
tr: İmleci <application>vi</application> biçeminde hareket ettirmek: Bir karakter gitmek için h,j,k,l; sayfa yukarı/aşağı veya yarım sayfa yukarı/aşağı için <keycap>Kontrol</keycap>+b,f,u,d.

source: Select text by using <keycap>Ctrl</keycap> or <keycap>Shift</keycap> with arrows, or by using <keycap>V</keycap> to start selection, moving the cursor and then <keycap>V</keycap> again to end selection. <keycombo>&Shift;<keycap>V</keycap></keycombo> selects whole lines, instead of characters.
tr: Ok düğmeleriyle birlikte <keycap>Kontrol</keycap> veya <keycap>Üst Karakter</keycap> kullanarak metin seçin veya seçimi başlatmak için <keycap>V</keycap> düğmesine basın; imleci hareket ettirin ve seçimi sonlandırmak için yeniden <keycap>V</keycap>’ye basın. <keycombo>&Shift;<keycap>V</keycap></keycombo> kısayolu, karakterler yerine tüm satırı seçer.

source: Profiles
tr: Profiller

source: Profiles allow the user to quickly and easily automate the running of common commands. Examples could include:
tr: Profiller, kullanıcının yaygın kullanılan komutları tez ve kolay bir biçimde otomatikleştirilmesini sağlar. Örnekler:

source: ssh into another machine
tr: başka makineye ssh yapmak

source: starting an irc session
tr: irc oturumu başlatmak

source: use tail to watch a file
tr: bir dosyayı izlemek için tail kullanmak

source: All new and changed profiles are saved in the user's local home folder in <filename>$<envar>XDG_DATA_HOME</envar>/konsole</filename>.
tr: Tüm yeni ve değiştirilen profiller kullanıcının <filename>$<envar>XDG_DATA_HOME</envar>/konsole</filename> yerel ana klasörüne kaydedilir.

source: Procedure to create a new profile:
tr: Yeni bir profil oluşturma yöntemi:

source: Click on the menu entry <menuchoice><guimenu>Settings</guimenu><guimenuitem>Manage Profiles...</guimenuitem> </menuchoice>
tr: <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Profilleri Yönet…</guimenuitem></menuchoice> menü girdisine tıklayın.

source: Switch to the <guibutton>Profiles</guibutton> page.
tr: <guibutton>Profiller</guibutton> sayfasına geçin.

source: Click on the button <guibutton>New Profile...</guibutton>.
tr: <guibutton>Yeni Profil…</guibutton> düğmesine tıklayın.

source: Fill in the first entry with a name. This is the name that will show in the menu, and will be the default label instead of <guilabel>Shell</guilabel> when you start a session of this type.
tr: İlk girişi bir adla doldurun. Bu, menüde görünecek addır ve bu tür bir oturum başlattığınızda <guilabel>Kabuk</guilabel> yerine öntanımlı etiket olacaktır.

source: Enter a command just as you normally would if you opened a new shell and were going to issue that command. For our first example above, you might type <userinput><command>ssh</command> <replaceable>administration</replaceable></userinput>.
tr: Normalde nasıl bir kabuk açıp komut giriyorsanız burada da aynısını yapın. Yukarıdaki ilk örneğimiz için <userinput><command>ssh</command><replaceable>administration</replaceable></userinput> yazabilirsiniz.

source: On the other tabs of the dialog, configure this session's appearance. You can configure a different font, color scheme, $<envar>TERM</envar> type and many other settings for each session.
tr: İletişim kutusunun diğer sekmelerinde bu oturumun görünüşünü yapılandırın. Her oturum için farklı bir yazıtipi, renk şeması, $<envar>TERM</envar> türü ve diğer birçok ayarı yapılandırabilirsiniz.

source: Press the <guibutton>OK</guibutton> button. The new session is now available in the <guilabel>Manage Profiles...</guilabel> dialog.
tr: <guibutton>Tamam</guibutton> düğmesine basın. Yeni oturum artık <guilabel>Profilleri Yönet…</guilabel> iletişim kutusunda görünecektir.

source: Mouse Buttons
tr: Fare Düğmeleri

source: This section details the use of the mouse buttons for the common right handed mouse button order. For the left handed mouse button order, swap left and right in the text below.
tr: Bu bölümde, sağ elle kullanılan fare düğmesi sırası için fare düğmelerinin kullanımı ayrıntılarıyla anlatılmaktadır. Sol elle kullanılan fare düğmesi sırası için aşağıdaki metinde sol ve sağı değiştirin.

source: Left
tr: Sol

source: All &LMB; clicks will be sent to a mouse-aware application running in &konsole;. If an application will react on mouse clicks, &konsole; indicates this by showing an arrow cursor. If not, an I-beam (bar) cursor is shown.
tr: Tüm &LMB; tıklamaları, &konsole;’da çalışan fare uyumlu bir uygulamaya gönderilir. Bir uygulama, fare tıklamasına tepki gösteriyorsa &konsole; bunu bir ok imleci ile gösterir. Değilse bir çubuk imleci gösterilir.

source: Holding the &LMB; down and dragging the mouse over the screen with a mouse-unaware application running will mark a region of the text. While dragging the mouse, the marked text is displayed in reversed color for visual feedback. Select <guimenuitem>Copy</guimenuitem> from the <guimenu>Edit</guimenu> menu to copy the marked text to the clipboard for further use within &konsole; or another application. The selected text can also be dragged and dropped into compatible applications. Hold the &Ctrl; key and drag the selected text to the desired location.
tr: Farenin farkında olmayan bir uygulama çalışırken &LMB; ile basılı tutmak ve fareyi ekran üzerinde sürüklemek metnin bir bölümünü işaretleyecektir. Fareyi sürüklerken, işaretlenen metin görsel geri bildirim için ters renkte görüntülenir. İşaretli metni &konsole; içinde daha sonra kullanmak üzere panoya kopyalamak veya başka bir uygulamaya göndermek için <guimenu>Düzen</guimenu> menüsünden <guimenuitem>Kopyala</guimenuitem> seçeneğini seçin. Seçili metin uyumlu uygulamalara da sürüklenip bırakılabilir. &Ctrl; düğmesini basılı tutun ve seçili metni istediğiniz konuma sürükleyin.

source: Normally, new-line characters are inserted at the end of each line selected. This is best for cut and paste of source code, or the output of a particular command. For ordinary text, the line breaks are often not important. One might prefer, however, for the text to be a stream of characters that will be automatically re-formatted when pasted into another application. To select in text-stream mode, hold down the &Ctrl; key while selecting normally.
tr: Normalde yenisatır karakterleri her seçili satırın sonuna eklenir. Bu, kaynak kodunu kesip yapıştırmak veya belirli bir komutun çıktısı için en iyisidir. Sıradan metinlerde satır sonları çoğu zaman önemli değildir. Ancak metnin başka bir uygulamaya yapıştırıldığında kendiliğinden yeniden biçimlendirilecek bir karakter akışı olması tercih edilebilir. Metin akışı kipinde seçim yapmak için normal bir biçimde seçerken &Ctrl; düğmesini basılı tutun.

source: Pressing the &Ctrl; and &Alt; keys along with the &LMB; will select text in columns.
tr: &Ctrl; ve &Alt; düğmelerine &LMB; ile birlikte basmak, metni sütunlar halinde seçer.

source: Double-click with the &LMB; to select a word; triple-click to select an entire line.
tr: Bir sözcüğü seçmek için &LMB; ile çift tıklayın; bir satırın tamamını seçmek için üç kez tıklayın.

source: If the upper or lower edge of the text area is touched while marking, &konsole; scrolls up or down, eventually exposing text within the history buffer. The scrolling stops when the mouse stops moving.
tr: İmleme sırasında metin alanının üst veya alt kenarına dokunulursa &konsole; yukarı veya aşağı sarar ve geçmiş arabelleğindeki metin görünmeyi sürdürür. Fare hareket etmeyi bıraktığında sarma da durur.

source: After the mouse is released, &konsole; attempts to keep the text in the clipboard visible by holding the marked area reversed. The marked area reverts back to normal as soon as the contents of the clipboard change, the text within the marked area is altered or the &LMB; is clicked.
tr: Fare serbest bırakıldıktan sonra &konsole;, imli alanı ters tutarak panodaki metni görünür tutmaya çalışır. Pano içeriği değiştiğinde, imli alandaki metin değiştirildiğinde veya &LMB; ile tıklandığında imli alan normale döner.

source: To mark text in a mouse-aware application (Midnight Commander, for example) the &Shift; key has to be pressed when clicking.
tr: Fare uyumlu bir uygulamada (örneğin Midnight Commander) metni imlemek için tıklarken &Shift; düğmesine basılması gerekir.

source: Middle
tr: Orta

source: Pressing the &MMB; pastes text currently in the clipboard. Holding down the &Ctrl; key as you press the &MMB; pastes the text and appends a new-line. That is convenient for executing pasted command quickly, but it can be dangerous so use it with caution.
tr: &MMB; ile tıklamak, panodaki geçerli metni yapıştırır. &MMB; ile tıklarken &Ctrl; düğmesine basmak metni yapıştırır ve yeni bir satır ekler. Bu, yapıştırılan komutu tez yürütmek için uygundur; ancak tehlikeli olabilir, bu nedenle dikkatli kullanın.

source: If you have a mouse with only two buttons, pressing both the &LMB; and &RMB; together emulates the &MMB; of a three button mouse.
tr: Yalnızca iki düğmeli bir fareniz varsa hem &LMB; hem de &RMB; ile tıklamak, üç düğmeli bir farede &MMB; ile basılmış gibi davranır.

source: If you have a <mousebutton>wheel</mousebutton> as the middle button, rolling it in a mouse-unaware program will move &konsole;'s scrollbar.
tr: Orta düğme olarak bir <mousebutton>tekerlek</mousebutton> varsa farenin farkında olmadığı bir programda onu yuvarlamak &konsole; sarma çubuğunu hareket ettirecektir.

source: Right
tr: Sağ

source: These items appear in the menu when the &RMB; is pressed:
tr: &RMB; ile tıklandığında menüde aşağıdaki ögeler görünür:

source: Copy
tr: Kopyala

source: Paste
tr: Yapıştır

source: With a text selection a submenu <guisubmenu>Search for</guisubmenu> with a list of the preferred Web Shortcuts and an option to configure web shortcuts.
tr: Metin seçimiyle, tercih edilen web kısayollarının listesini ve web kısayollarını yapılandırma seçeneğini içeren bir <guisubmenu>Arama</guisubmenu> alt menüsü bulunur.

source: Open File Manager
tr: Dosya Yöneticisini Aç

source: Set Encoding
tr: Kodlamayı Ayarla

source: Clear Scrollback
tr: Geçmişi Temizle

source: Adjust Scrollback...
tr: Geçmişi Ayarla…

source: <guimenuitem>Show Menu Bar</guimenuitem>, only when the menubar is hidden
tr: <guimenuitem>Menü Çubuğunu Göster</guimenuitem>, yalnızca menü çubuğu gizli olduğunda görünür.

source: Switch Profile
tr: Profil Değiştir

source: Edit Current Profile...
tr: Geçerli Profili Düzenle…

source: Close Tab
tr: Sekmeyi Kapat

source: In a mouse aware application, press the &Shift; key along with the &RMB; to get the popup menu.
tr: Fare uyumlu bir uygulamada, açılır menüyü açmak için &RMB; ile birlikte &Shift; düğmesine basın.

source: Drag and Drop
tr: Sürükle ve Bırak

source: If you drop a file, folder or &URL; on a &konsole; window, a context menu appears with these actions:
tr: &konsole; penceresine bir dosya, klasör veya &URL; bırakırsanız aşağıdaki eylemleri içeren bir bağlam menüsü görünür:

source: <screeninfo>Drag and Drop Context Menu</screeninfo>
tr: <screeninfo>Sürükle ve Bırak Bağlam Menüsü</screeninfo>

source: <phrase>Drag and Drop Context Menu</phrase>
tr: <phrase>Sürükle ve Bırak Bağlam Menüsü</phrase>

source: <shortcut>&Shift;</shortcut><guimenuitem>Move Here</guimenuitem>
tr: <shortcut>&Shift;</shortcut><guimenuitem>Buraya Taşı</guimenuitem>

source: Move the dropped item into the current folder. This item only appears in the context menu, if you have the rights to delete the dropped file or folder.
tr: Bırakılan ögeyi geçerli klasöre taşıyın. Bu öge yalnızca, bırakılan dosya veya klasörü silme hakkına sahipseniz bağlam menüsünde görünür.

source: <shortcut>&Ctrl;</shortcut><guimenuitem>Copy Here</guimenuitem>
tr: <shortcut>&Ctrl;</shortcut><guimenuitem>Buraya Kopyala</guimenuitem>

source: Copy the dropped item into the current folder.
tr: Bırakılan ögeyi geçerli klasöre kopyalayın.

source: <shortcut><keycombo>&Ctrl;&Shift;</keycombo></shortcut><guimenuitem>Link Here</guimenuitem>
tr: <shortcut><keycombo>&Ctrl;&Shift;</keycombo></shortcut><guimenuitem>Buraya Bağlantıla</guimenuitem>

source: Insert a symbolic link to the dropped item.
tr: Bırakılan ögeye sembolik bir bağlantı ekleyin.

source: Paste Location
tr: Konumu Yapıştır

source: Insert the full file path of the dropped item at the cursor.
tr: İmlece bırakılan ögenin tam dosya yolunu ekleyin.

source: Change Directory To
tr: Dizini Şuna Değiştir

source: If a folder is dropped, this action appears in the context menu and allows you to change the working folder of the &konsole; session.
tr: Bir klasör bırakılırsa bu eylem bağlam menüsünde görünür ve &konsole; oturumunun çalışma klasörünü değiştirmenize olanak tanır.

source: <shortcut>&Esc;</shortcut><guimenuitem>Cancel</guimenuitem>
tr: <shortcut>&Esc;</shortcut><guimenuitem>İptal</guimenuitem>

source: Break the drag and drop action.
tr: Sürükle ve bırak eylemini yarıda kesin.

source: If you press the shortcuts before releasing the &LMB; during drag and drop, no context menu appears and the actions will be executed immediately.
tr: Sürükle ve bırak işlemi sırasında &LMB;’ni bırakmadan önce kısayollara basarsanız herhangi bir bağlam menüsü görünmez ve eylemler hemen yürütülür.

source: If you want to use the &Ctrl; key for drag and drop or disable the context menu to insert &URL;s as text by default, enable the corresponding options on the <guilabel>Mouse</guilabel> tab in the profile settings dialog.
tr: &URL;’leri öntanımlı olarak metin olarak eklemek üzere sürükleyip bırakmak için &Ctrl; düğmesini kullanmak veya bağlam menüsünü devre dışı bırakmak istiyorsanız profil ayarları iletişim kutusundaki <guilabel>Fare</guilabel> sekmesinde ilgili seçenekleri etkinleştirin.

source: Semantic Shell Integration
tr: Anlamsal Kabuk Tümleşimi

source: A shell program running in Konsole may emit escape sequences that partition the text displayed into three types: shell prompt, user input and command output. Using this semantic information enables various enhancements in Konsole.
tr: Konsole’da çalışan bir kabuk programı, görüntülenen metni üç türe bölen kaçış dizileri yayabilir: Kabuk istemi, kullanıcı girişi ve komut çıkışı. Bu anlamsal bilginin kullanılması Konsole’da çeşitli geliştirmelere olanak sağlar.

source: <keycombo action="simul">&Ctrl;&Shift;<keycap>PgUp</keycap></keycombo> and <keycombo action="simul">&Ctrl;&Shift;<keycap>PgDown</keycap></keycombo> scroll up/down to previous/next command prompt.
tr: <keycombo action="simul">&Ctrl;&Shift;<keycap>Sayfa Yukarı</keycap></keycombo> ve <keycombo action="simul">&Ctrl;&Shift;<keycap>Sayfa Aşağı</keycap></keycombo>, önceki/sonraki komut istemine sarar.

source: Visual hints:
tr: Görsel ipuçları:

source: A line is displayed above each prompt, prompt colors are less intense, and output colors are more intense.
tr: Her istemin üzerinde bir çizgi görüntülenir, istem renkleri daha az yoğundur ve çıktı renkleri daha yoğundur.

source: A red bar is displayed to the left of input and output lines of commands that resulted in error
tr: Hatayla sonuçlanan komutların girdi ve çıktı satırlarının solunda kırmızı bir çubuk görüntülenir.

source: A red background for input and output lines of commands that resulted in error
tr: Hatayla sonuçlanan komutların girdi ve çıktı satırları için kırmızı bir arka plan bulunur.

source: A gray bar is displayed to the left of the input and output lines of every other command.
tr: Diğer tüm komutların girdi ve çıktı satırlarının solunda gri bir çubuk görüntülenir.

source: A gray background for the input and output lines of every other command.
tr: Diğer tüm komutların girdi ve çıktı satırları için gri bir arka plan bulunur.

source: Each of those may be configured to never show, always show, or only when URL hints are shown. The configuration is in the <guilabel>Semantic Integration</guilabel> tab of the <guilabel>General</guilabel> page of the profile configuration window.
tr: Bunların her biri; hiçbir zaman gösterilmemesi, her zaman gösterilmesi veya yalnızca URL ipuçları gösterildiğinde gösterilmesi için yapılandırılabilir. Yapılandırma, profil yapılandırma penceresinin <guilabel>Genel</guilabel> sayfasındaki <guilabel>Anlamsal Tümleşim</guilabel> sekmesinde bulunur.

source: Context menu options <guimenuitem>Copy user input</guimenuitem>, <guimenuitem>Copy command output</guimenuitem>, and <guimenuitem>Copy except prompt</guimenuitem> may be used to filter selection when it is copied to the clipboard.
tr: <guimenuitem>Kullanıcı Girdisini Kopyala</guimenuitem>, <guimenuitem>Komut Çıktısını Kopyala</guimenuitem> ve <guimenuitem>İstemler Dışındakileri Kopyala</guimenuitem> bağlam menüsü seçenekleri, panoya kopyalandığında seçimi süzmek için kullanılabilir.

source: When selection is empty, copy to clipboard action copies the current input line if it is not empty, or the last output if there is no current input.
tr: Seçim boş olduğunda panoya kopyala eylemi, boş değilse geçerli girdi satırını veya geçerli girdi yoksa son çıktıyı kopyalar.

source: Pressing Up/Down arrow when editing a long input, will instead place the cursor one line up/down by sending the appropriate number of Left/Right key events to the shell. Configurable in the profile settings.
tr: Uzun bir girdiyi düzenlerken Yukarı/Aşağı ok düğmelerine basmak, kabuğa uygun sayıda Sol/Sağ düğme olayı göndererek imleci bir satır yukarı/aşağı yerleştirir. Profil ayarlarında yapılandırılabilir.

source: Clicking the mouse on text input will place the cursor in the clicked location. Configurable in the profile settings.
tr: Fareyle metin girdisine tıklamak, imleci tıklanan konuma yerleştirecektir. Profil ayarlarında yapılandırılabilir.

source: Pressing the &Ctrl; key while triple clicking the mouse on the output of a command, selects the whole output of that command.
tr: Bir komutun çıktısı üzerinde fareyi üç kez tıklatırken &Ctrl; düğmesine basmak, o komutun tüm çıktısını seçer.

source: Semantic shell integration needs to be setup in the shell. Pressing <keycombo>&Ctrl;&Alt;<keycap>]</keycap></keycombo> will paste the necessary commands needed in bash. For other shells, such as fish, zsh, python, etc. consult the relevant program's documentation.
tr: Anlamsal kabuk tümleşiminin kabukta ayarlanması gerekir. <keycombo>&Ctrl;&Alt;<keycap>]</keycap></keycombo> kısayolunu kullanmak, bash için gereken gerekli komutları kopyalar. fish, zsh, python vb. kabuklar için ilgili programın belgelendirmesine başvurun.

source: Complex Text Layout
tr: Karmaşık Metin Yerleşimi
