Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konversation.po
Languages: tr

source: The &irc; network is recorded because &i18n-nickname;s are unique across a single &irc; network. The &i18n-nickname; in two different &irc; networks is not necessarily the same person, but the same &i18n-nickname; on two different servers within the same &irc; network generally is the same person.
tr: Takma adlar tek bir &irc; ağında benzersiz olduğu için &irc; ağı kaydedilir. İki farklı &irc; ağındaki takma adın aynı kişi olması gerekmez, ancak aynı &irc; ağı içindeki iki farklı sunucudaki aynı takma ad genellikle aynı kişidir.

source: This is why it is important to use the same <guilabel>Network</guilabel> for all servers in the same &irc; network, when <link linkend="serverlist"> defining networks, servers, and auto join channels</link>.
tr: Bu nedenle, aynı &irc; ağındaki tüm sunucular için <link linkend="serverlist">ağları, sunucuları ve kendiliğinden katılınacak kanalları tanımlarken</link> aynı <guilabel>ağı</guilabel> kullanmak çok önemlidir.

source: To activate the &i18n-nickname; watching feature, choose <menuchoice> <guisubmenu>Window</guisubmenu> <guisubmenu>Watched Nicks</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Watched Nicks</guilabel> screen will appear.</action>
tr: Takma ad izleme özelliğini etkinleştirmek için ana menüden <menuchoice><guisubmenu>Pencere</guisubmenu> <guisubmenu>İzlenen Takma Adlar</guisubmenu></menuchoice> özelliğini etkinleştirin. <action><guilabel>İzlenen Takma Adlar</guilabel> ekranı görünür.</action>

source: Watched Nicks.
tr: İzlenen Takma Adlar.

source: Watched Nicks
tr: İzlenen Takma Adlar

source: The &i18n-nickname;s in your watch list are listed here. They are listed under their associated &irc; network. If no &i18n-nickname;s are listed, either you haven't specified any &i18n-nickname;s to watch, or you need to activate the &i18n-nickname; watching feature (see below). Expand each online &i18n-nickname; to see a list of channels the &i18n-nickname; has joined. The icons next to each channel are the same as the icons that appear in the <interface>Nick Panel</interface> in the <link linkend="channel-screen-tour">channel</link> screens.
tr: İzleme listenizdeki takma adlar burada; ilişkili &irc; ağlarının altında listelenir. Hiçbir takma ad listelenmiyorsa izlemek için herhangi bir takma ad belirtmemişsinizdir veya takma ad izleme özelliğini etkinleştirmeniz gerekir (aşağıya bakın). Takma adın katıldığı kanalların bir listesini görmek için her bir çevrimiçi takma adı genişletin. Her kanalın yanındaki simgeler, <link linkend="channel-screen-tour">kanal</link> ekranlarındaki <interface>Takma Ad Paneli</interface>’nde görünen simgelerle aynıdır.

source: The information known about the &i18n-nickname; is displayed here. When the <guilabel>Watched Nicks</guilabel> screen is first displayed, this information is sparse. Every 20 seconds, one <userinput><command>WHOIS</command></userinput> command is automatically sent to the server to request information for &i18n-nickname;s that do not have any information. This continues until all &i18n-nickname;s have information.
tr: Takma ad hakkında bilinen bilgiler burada görüntülenir. <guilabel>İzlenen Takma Adlar</guilabel> ekranı ilk görüntülendiğinde bu bilgiler seyrektir. Her 20 saniyede bir, bir <userinput><command>WHOIS</command></userinput> komutu kendiliğinden sunucuya gönderilir ve herhangi bir bilgisi olmayan takma adlar için bilgi istenir. Bu, tüm takma adlar hakkında bilgi sahibi olunana kadar sürer.

source: To add a single &i18n-nickname; to watch, open the context menu in the <guilabel>Nick List</guilabel> by clicking with the &RMB; on a &i18n-nickname; and select <guilabel>Add to Watched Nicks</guilabel>. If you want to add several &i18n-nickname;s choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> from the main menu, expand <guilabel>Notifications</guilabel> and click on <guilabel>Watched Nicknames</guilabel>. The <guilabel>Watched Nicknames</guilabel> screen appears.
tr: İzlemek için tek bir takma ad eklemek üzere, <guilabel>Takma Ad Listesinde</guilabel> bir takma ada &RMB; ile tıklayın ve <guilabel>İzlenen Takma Adlara Ekle</guilabel> yapın. Birkaç tane takma ad eklemek istiyorsanız ana menüden <menuchoice><guisubmenu>Ayarlar</guisubmenu> <guisubmenu>Konversation Uygulamasını Yapılandır…</guisubmenu></menuchoice> yolunu izleyip <guilabel>Bildirimler</guilabel>, <guilabel>İzlenen Takma Adlar</guilabel> seçimini yapın. <guilabel>İzlenen Takma Adlar</guilabel> ekranı görünür.

source: <screeninfo>Watched Nicknames</screeninfo>
tr: <screeninfo>İzlenen Takma Adlar</screeninfo>

source: <phrase>Watched Nicknames</phrase>
tr: <phrase>İzlenen Takma Adlar</phrase>

source: Check this box to activate the &i18n-nickname; watcher feature.
tr: Takma ad izleyicisi özelliğini etkinleştirmek için bu kutuyu işaretleyin.

source: If you want the <guilabel>Watched Nicks</guilabel> screen to automatically display when you open &konversation;, check this box.
tr: &konversation; açıldığında <guilabel>İzlenen Takma Adlar</guilabel> ekranının kendiliğinden görüntülenmesini istiyorsanız bu kutuyu işaretleyin.

source: In the <guilabel>Watched Nicks</guilabel> screen, you may double click on any &i18n-nickname; and this command will be sent to the server. <userinput><command>%u</command></userinput> will be replaced with the &i18n-nickname;. The <userinput><command>%n</command></userinput> is required at the end of the command.
tr: <guilabel>İzlenen Takma Adlar</guilabel> ekranında herhangi bir takma ad üzerinde çift tıklayın ve bu komut sunucuya gönderilir. <userinput><command>%u</command></userinput>, takma ad ile değiştirilecektir. Komutun sonuna <userinput><command>%n</command></userinput> eklenmesi gerekir.

source: The <guilabel>Watched Nicks</guilabel> feature works by periodically polling the server. This box sets how often that occurs. Avoid numbers less than 20 seconds because it places excessive load on the server.
tr: <guilabel>İzlenen Takma Adlar</guilabel> özelliği, sunucuyu periyodik olarak yoklayarak çalışır. Bu kutu bunun ne sıklıkta gerçekleşeceğini ayarlar. Sunucuya aşırı yük bindirdiği için 20 saniyeden daha az sayılardan kaçının.

source: Click the <guibutton>OK</guibutton> button when you have finished adding or removing &i18n-nickname;s.
tr: Takma adlar eklemeyi veya kaldırmayı bitirdiğinizde <guibutton>Tamam</guibutton> düğmesine tıklayın.

source: <emphasis>Note: </emphasis>Whenever you display the <guilabel>Watched Nicks</guilabel> screen, it may take a while before any &i18n-nickname;s are displayed until &konversation; has polled the server. Normally, you leave the <guilabel>Watched Nicks</guilabel> screen running.
tr: <emphasis>Not: </emphasis><guilabel>İzlenen Takma Adlar</guilabel> ekranını her görüntülediğinizde, &konversation; sunucuyu yoklamayı bitirene dek herhangi bir takma adın görüntülenmesi biraz zaman alabilir. Siz <guilabel>İzlenen Takma Adlar</guilabel> ekranını açık bırakın.

source: &konversation; also displays a message in all the <link linkend="channel-screen-tour">channels</link> whenever a user in your <guilabel>Watched Nicknames</guilabel> list connects or disconnects from the server. The message looks like this:
tr: &konversation;, ayrıca <guilabel>İzlenen Takma Adlar</guilabel> listenizdeki bir kullanıcı sunucuya bağlandığında veya sunucudan ayrıldığında tüm kanallarda bir ileti görüntüler. İleti aşağıdaki gibi görünür:

source: [17:52] [Notify] psn is online (irc.kde.org).
tr: [17:52] [Notify] psn çevrimiçi (irc.kde.org).

source: Message highlighting
tr: İletileri vurgulamak

source: You can control how messages are displayed in channel and query screens.
tr: İletilerin kanal ve sorgu ekranlarında nasıl görüntüleneceğini denetleyebilirsiniz.

source: To activate the highlighting feature, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure &konversation;</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Configure</guilabel> screen will appear.</action>
tr: Vurgulama özelliğini etkinleştirmek için ana menüden <menuchoice><guisubmenu>Ayarlar</guisubmenu> <guisubmenu>&konversation; Uygulamasını Yapılandır…</guisubmenu></menuchoice> yolunu izleyin. <action><guilabel>Yapılandır</guilabel> ekranı görünür.</action>

source: The Highlighting screen.
tr: Vurgulama ekranı.

source: The Highlighting screen
tr: Vurgulama ekranı

source: Click here to select the <guilabel>Highlight</guilabel> screen.
tr: <guilabel>Vurgu</guilabel> ekranını seçmek için buraya tıklayın.

source: Click here to add a new item to the <guilabel>Highlight list</guilabel>. When an item in the list is selected, you may edit it in the panel below.
tr: <guilabel>Vurgu listesine</guilabel> yeni bir öge eklemek için buraya tıklayın. Listedeki bir öge seçildiğinde, aşağıdaki panelde onu düzenleyebilirsiniz.

source: Enter a string pattern here. Any message received that matches this pattern, anywhere in the message, will activate the highlighting for the message.
tr: Buraya bir dizi dizgisi girin. İletinin herhangi bir yerinde bu kalıpla eşleşen herhangi bir ileti alındığında, iletiyi vurgulama etkinleştirilecektir.

source: If the pattern is found in a message, the entire message will be displayed in the color you select here.
tr: Dizgi bir iletide bulunursa iletinin tümü burada seçtiğiniz renkte görüntülenecektir.

source: If you wish, &konversation; will play a sound when the pattern is matched. Click the button to choose an audio file to be played. Click the test button to hear the sound.
tr: İsterseniz &konversation;, dizgi eşleştiğinde bir ses çalabilir. Çalınacak bir ses dosyası seçmek için düğmeye tıklayın. Sesi duymak için sınama düğmesine tıklayın.

source: If you'd like for &konversation; to automatically send a reply message when the pattern is matched, enter the message here. Use this feature with caution, as you may annoy &irc; users with too much chatter if not careful. You can also enter &irc; or &konversation; commands here.
tr: Eğer &konversation;’un dizgi eşleştiğinde kendiliğinden bir yanıt göndermesini istiyorsanız iletiyi buraya girin. Dikkatli olmazsanız &irc; kullanıcılarını çok fazla gevezelikle rahatsız edebileceğiniz için bu özelliği dikkatli kullanın. Ayrıca &irc; veya &konversation; komutlarını da buraya girebilirsiniz.

source: If you have configured sounds for any of your highlights, you can disable all of them by unchecking this box.
tr: Vurgularınızdan herhangi biri için ses yapılandırdıysanız bu kutunun işaretini kaldırarak hepsini devre dışı bırakabilirsiniz.

source: This highlight will only be searched for in chat windows listed here by name, or in all chat windows if the field is left empty. Multiple names have to be separated by commas.
tr: Bu vurgu yalnızca burada ada göre listelenen sohbet pencerelerinde veya alan boş bırakılırsa tüm sohbet pencerelerinde aranacaktır. Birden fazla ad virgülle ayrılmalıdır.

source: If you check this box, whenever someone mentions your &i18n-nickname; in a message, the message will be displayed in the color you choose at the right.
tr: Bu kutuyu işaretlerseniz birisi bir iletide takma adınızdan söz ettiğinde ileti, sağ tarafta seçtiğiniz renkte görüntülenecektir.

source: Normally, highlighting does not apply to messages you type. If you wish to highlight the messages you type, check this box and choose a color at the right.
tr: Normalde, vurgulama yazdığınız iletiler için geçerli değildir. Yazdığınız iletileri vurgulamak istiyorsanız bu kutuyu işaretleyin ve sağ taraftan bir renk seçin.

source: Configuring On Screen Display (&osd;)
tr: Ekran Üzeri Görüntü’yü yapılandırmak (&osd;)

source: <acronym>On Screen Display</acronym> (&osd;) is a unique feature of &konversation;. With &osd; turned on, channel messages will appear on your desktop screen, even if &konversation; is minimized. Here's an example of &osd; in action. The message in the upper lefthand part of the screen is from &konversation;, which is running minimized in the system tray.
tr: <acronym>Ekran Üzeri Görüntü</acronym> (&osd;), &konversation;’un benzersiz özelliklerinden biridir. &osd; açıkken, &konversation; simge durumuna küçültülmüş olsa bile kanal iletileri masaüstünüzde görünür. Burada &osd; çalışırken bir örneğini görebilirsiniz. Ekranın sol üst köşesindeki ileti, sistem tepsisine küçültülmüş olarak çalışmayı sürdüren &konversation;’a aittir.

source: <screeninfo>Example of On Screen Display</screeninfo>
tr: <screeninfo>Ekran Üzeri Görüntü Örneği</screeninfo>

source: <phrase>Example of On Screen Display</phrase>
tr: <phrase>Ekran Üzeri Görüntü Örneği</phrase>

source: To activate &osd;, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure &konversation;</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Configure</guilabel> screen will appear.</action>
tr: Ekran Üzeri Görüntü’yü (&osd;) etkinleştirmek için ana menüden <menuchoice><guisubmenu>Ayarlar</guisubmenu> <guisubmenu>&konversation; Uygulamasını Yapılandır…</guisubmenu></menuchoice> yolunu izleyin. <action><guilabel>Yapılandır</guilabel> ekranı görünür.</action>

source: The On Screen Display screen.
tr: Ekran Üzeri Görüntü ekranı.

source: The On Screen Display screen
tr: Ekran Üzeri Görüntü ekranı

source: Click here to expand the <guilabel>Notification</guilabel> item.
tr: <guilabel>Bildirim</guilabel> ögesini genişletmek için buraya tıklayın.

source: Click here to select the <guilabel>On Screen Display</guilabel> screen.
tr: <guilabel>Ekran Üzeri Görüntü</guilabel> ekranını seçmek için buraya tıklayın.

source: Check this box to activate &osd;.
tr: &osd;’yi etkinleştirmek için bu kutuyu işaretleyin.

source: Click this button to choose a font for &osd;. (<emphasis>Note: </emphasis> Not all fonts work. Luxi Sans 22 and Impact 22 are known to work.)
tr: &osd; için bir yazıtipi seçmek üzere bu düğmeye tıklayın (<emphasis>Not: </emphasis> Tüm yazıtipleri çalışmaz. Luxi Sans 22 ve Impact 22 çalıştığı bilinen yazıtiplerindendir).

source: Check the boxes here to select the types of messages you'd like to appear on screen.
tr: Ekranda görünmesini istediğiniz ileti türlerini seçmek için buradaki kutuları işaretleyin.

source: Drag the <interface>&osd; Preview</interface> to your desired position, then click the <guibutton>Apply</guibutton> button.
tr: <interface>Ekran Üzeri Görüntü Önizlemesi</interface> ögesini arzu ettiğiniz konuma sürükleyin, sonrasında <guibutton>Uygula</guibutton> düğmesine tıklayın.

source: Sending colorful messages
tr: Renkli iletiler göndermek

source: You can add color to the messages you send in any channel. In the <interface>Input Line</interface> of any channel, start typing your message. Click the <inlinemediaobject> <imageobject> <imagedata fileref="format-text-color.png" format="PNG"/> </imageobject> <textobject> <phrase>Insert &irc; Color Button</phrase> </textobject> </inlinemediaobject> <guibutton>&irc; Color</guibutton> button or choose <menuchoice> <guisubmenu>Insert</guisubmenu> <guisubmenu>&irc; Color</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>&irc; Color Chooser</guilabel> screen will appear.</action>
tr: Herhangi bir kanalda gönderdiğiniz iletilere renk ekleyebilirsiniz. Herhangi bir kanalın <interface>Giriş Satırı</interface>’nda iletinizi yazmaya başlayın. <inlinemediaobject> <imageobject> <imagedata fileref="format-text-color.png" format="PNG"/> </imageobject> <textobject> <phrase>IRC Rengi Ekle…</phrase> </textobject> </inlinemediaobject> <guibutton>&irc; Rengi</guibutton> düğmesine tıklayın veya ana menüden <menuchoice><guisubmenu>Ekle</guisubmenu> <guisubmenu>IRC Rengi…</guisubmenu></menuchoice> seçimini yapın. <action><guilabel>&irc; Rengi Seçicisi</guilabel> ekranı görünür.</action>

source: The &irc; Color Chooser screen.
tr: &irc; Rengi Seçicisi ekranı.

source: The &irc; Color Chooser screen
tr: &irc; Rengi Seçicisi ekranı.

source: Choose a color and click <guibutton>OK</guibutton>. Continue typing your message in the <interface>Input Line</interface>. To change the color again, click the <guibutton>&irc; Color</guibutton> button. Choose a different color and click <guibutton>OK</guibutton>.
tr: Bir renk seçin ve <guibutton>Tamam</guibutton> düğmesine tıklayın. <interface>Giriş Satırı</interface>’nda iletinizi yazmayı sürdürün. Rengi değiştirmek için <guibutton>&irc; Rengi…</guibutton> düğmesine tıklayın. Başka bir renk seçip <guibutton>Tamam</guibutton> ile sürdürün.

source: Configuring &i18n-nickname; themes
tr: Takma ad temalarını yapılandırmak

source: You can change the icons displayed next to &i18n-nickname;s in the <interface>Nick Panel</interface> of channel tabs. To change the &i18n-nickname; theme, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Configure</guilabel> screen will appear.</action> Click <guilabel>Interface</guilabel> to expand it, then click <guilabel>Nicklist Themes</guilabel> to display the <guilabel>Nicklist Themes</guilabel> screen.
tr: Kanal sekmelerinin <interface>Takma Ad Paneli</interface>’nde takma adların yanında görüntülenen simgeleri değiştirebilirsiniz. Takma ad temasını değiştirmek için ana menüden <menuchoice><guisubmenu>Settings</guisubmenu> <guisubmenu>Konversation Uygulamasını Yapılandır…</guisubmenu></menuchoice> seçimini yapın. <action><guilabel>Yapılandır</guilabel> ekranı görünecektir.</action> <guilabel>Arayüz</guilabel> sayfasına tıklayın ve <guilabel>Takma Ad Listesi Temaları</guilabel> ekranını görüntülemek için <guilabel>Takma Ad Listesi Temaları</guilabel>’nı kullanın.

source: The Themes screen.
tr: Temalar ekranı.

source: The Themes screen
tr: Temalar ekranı

source: Click here to select the <guilabel>Nicklist Themes</guilabel> screen.
tr: <guilabel>Takma Ad Temaları</guilabel> ekranını seçmek için buraya tıklayın.

source: Select a theme.
tr: Bir tema seçin.

source: Sample icons are displayed here in the chosen theme.
tr: Örnek simgeler burada seçilen temada görüntülenir.

source: If you have downloaded a nick theme from elsewhere, click to install it.
tr: Başka bir yerden bir takma ad teması indirdiyseniz, kurmak için tıklayın.

source: Configuring Quick Buttons
tr: Tez Düğmeler’i yapılandırmak

source: You can enable a feature to display <interface>Quick Buttons</interface> on the <link linkend="channel-screen-tour">Main</link> screen, eight <interface>Quick Buttons</interface> appear. To display the Quick Buttons, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Configure</guilabel> screen will appear.</action> Click <guilabel>Interface</guilabel> to expand it, then click <guilabel>Chat Window</guilabel>. Check the <guilabel>Show quick buttons</guilabel> box and click <guibutton>OK</guibutton>.
tr: <link linkend="channel-screen-tour">Ana</link> ekranda <interface>Tez Düğmeler</interface>’i görüntülemek üzere bir özelliği etkinleştirebilirsiniz; sonrasında sekiz adet <interface>Tez Düğme</interface> görünür. Tez Düğmeler’i görüntülemek için ana menüden <menuchoice><guisubmenu>Ayarlar</guisubmenu> <guisubmenu>Konversation Uygulamasını Yapılandır…</guisubmenu></menuchoice> yolunu izleyin. <action><guilabel>Yapılandır</guilabel> ekranı görünür.</action> <guilabel>Arayüz</guilabel>, <guilabel>Sohbet Penceresi</guilabel> sayfasına geçin. <guilabel>Tez düğmeleri göster</guilabel> kutusunu işaretleyip <guibutton>Tamam</guibutton> düğmesine basın.

source: The buttons may be customized to your liking for performing often-used &irc; commands. To customize the <interface>Quick Buttons</interface>, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Configure</guilabel> screen will appear.</action> Click <guilabel>Interface</guilabel> to expand it, then click <guilabel>Quick Buttons</guilabel> to display the <guilabel>Quick Buttons</guilabel> screen.
tr: Düğmeler, sık kullanılan &irc; komutlarına atanmak üzere isteğinize göre özelleştirilebilir. <interface>Tez Düğmeler</interface>’i özelleştirmek için ana menüden <menuchoice><guisubmenu>Ayarlar</guisubmenu> <guisubmenu>Konversation Uygulamasını Yapılandır…</guisubmenu></menuchoice> yolunu izleyin. <action><guilabel>Yapılandır</guilabel> ekranı görünür.</action> <guilabel>Arayüz</guilabel> sayfasına tıklayın ve <guilabel>Tez Düğmeler</guilabel> ekranını görüntülemek için <guilabel>Tez Düğmeler</guilabel>’e tıklayın.

source: <screeninfo>The Quick Buttons screen</screeninfo>
tr: <screeninfo>Tez Düğmeler ekranı</screeninfo>

source: <phrase>The Quick Buttons screen</phrase>
tr: <phrase>Tez Düğmeler ekranı</phrase>

source: There are 8 default <interface>Quick Button</interface>s. Click on an entry to change it or use the buttons at the right side of the list to add or remove <interface>Quick Button</interface>s. The <guilabel>Button Name</guilabel> column is the name that will appear on the button in the <link linkend="channel-screen-tour">Main</link> screen. Keep the names short. The <guilabel>Button Action</guilabel> column is the action that will be performed when you click the <interface>Quick Button</interface>. Tips for creating actions are given on the screen.
tr: Öntanımlı olarak sekiz adet <interface>Tez Düğme</interface> vardır. Onu değiştirmek için bir girdiye tıklayın veya <interface>Tez Düğme</interface> eklemek için listenin sağındaki düğmeleri kullanın. <guilabel>Düğme Adı</guilabel> sütunu, <link linkend="channel-screen-tour">Ana</link> ekrandaki düğmede görünecek addır. Adları kısa tutun. <guilabel>Düğme Eylemi</guilabel> ise, <interface>Tez Düğme</interface>’ye tıkladığınızda yürütülecek eylemin kendisidir. Eylem yaratma ipuçları ekranda verilir.

source: Click <guibutton>OK</guibutton> to complete the changes.
tr: Değişiklikleri tamamlamak için <guibutton>Tamam</guibutton> düğmesine tıklayın.

source: Example:
tr: Örnek:

source: <guilabel>Button Name</guilabel>: <userinput><replaceable>Msg</replaceable></userinput>
tr: <guilabel>Düğme adı</guilabel>: <userinput><replaceable>İleti</replaceable></userinput>

source: <guilabel>Button Action</guilabel>: <userinput><replaceable>Msg %u </replaceable></userinput> (there is a space after <userinput><replaceable>%u</replaceable></userinput>)
tr: <guilabel>Düğme eylemi</guilabel>: <userinput><replaceable>Msg %u </replaceable></userinput> (<userinput><replaceable>%u</replaceable></userinput> sonrası bir boşluk var)

source: To use this button in the <link linkend="channel-screen-tour">Main</link> screen, click on a &i18n-nickname; in the <interface>Nick Panel</interface>, then click the button. <computeroutput>/MSG </computeroutput> will appear in the <interface>Input Line</interface> followed by the chosen &i18n-nickname;. Type a message you want to send to that person and press &Enter;. The message will be sent to the user. Only that user will see the message.
tr: <link linkend="channel-screen-tour">Ana</link> ekranda bu düğmeyi kullanmak için <interface>Takma Ad Paneli</interface>’ndeki bir takma ada tıklayın ve sonrasında düğmeye basın. <interface>Giriş Satırı</interface>’nda <computeroutput>/MSG </computeroutput> ve ardından seçili takma ad görünür. Bu kişiye göndermek istediğiniz iletiyi yazın ve &Enter; düğmesine basın. İleti, kullanıcıya gönderilecektir. İletiyi sadece o kullanıcı görür.

source: Sending and receiving files
tr: Dosya göndermek ve almak

source: You may send files via &irc; to other users online, or they may send you files.
tr: Çevrimiçi olarak diğer kullanıcılara &irc; aracılığıyla dosya gönderebilirsiniz veya onlar size dosya gönderebilir.
