Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konversation.po
Languages: tr

source: WARNING: Never open a file someone sends you unless they are a trusted source. It could be a virus.
tr: UYARI: Güvenilir bir kaynak olmadığı sürece birinin size gönderdiği bir dosyayı asla açmayın. Virüs olabilir.

source: To send a file to someone in a channel, click with the &RMB; on the &i18n-nickname; of the person in the <interface>Nick Panel</interface> of the <link linkend="channel-screen-tour">Main</link> screen. Choose <menuchoice> <guisubmenu>Send File</guisubmenu> </menuchoice> <action>. A dialog appears for you to choose a file to send.</action> Next, a new <guilabel>DCC Status</guilabel> tab appears.
tr: Kanaldaki birisine bir dosya göndermek için <link linkend="channel-screen-tour">Ana</link> ekranın <interface>Takma Ad Paneli</interface> görünümünde bir takma adın üzerine &RMB; ile tıklayın. <menuchoice><guisubmenu>Dosya Gönder</guisubmenu></menuchoice> ögesini seçin. <action>Göndermek istediğiniz dosyayı seçmenizi söyleyen bir iletişim kutusu görünür.</action> Sonrasında, yeni bir <guilabel>DCC Durumu</guilabel> sekmesi ortaya çıkar.

source: <screeninfo>DCC Status tab</screeninfo>
tr: <screeninfo>DCC Durumu sekmesi</screeninfo>

source: <phrase>DCC Status tab</phrase>
tr: <phrase>DCC Durumu sekmesi</phrase>

source: The &i18n-nickname; of the recipient and file name appear here.
tr: Alıcının takma adı ve dosya adı burada görünür.

source: The <guilabel>Status</guilabel> column indicates the status of the file send or receive as follows:
tr: <guilabel>Durum</guilabel> sütunu, dosya gönderme veya alma durumunu aşağıdaki gibi gösterir:

source: Preparing
tr: Hazırlanıyor

source: A receiving transfer is checking for resumable files or a sending transfer is acquiring the data to send.
tr: Bir alıcı aktarımı sürdürülebilir dosyaları denetliyor veya bir gönderici aktarımı gönderilecek verileri alıyor.

source: Connecting
tr: Bağlanılıyor

source: &konversation; is trying to establish a connection with the other end.
tr: &konversation; diğer uç ile bağlantı kurmaya çalışıyor.

source: Sending
tr: Gönderiliyor

source: &konversation; is sending the file to the other end.
tr: &konversation; dosyayı diğer uca gönderiyor.

source: Receiving
tr: Alınıyor

source: &konversation; is receiving the file from the other end.
tr: &konversation; dosyayı diğer uçtan alıyor.

source: Done
tr: Tamamlandı

source: The file has been successfully transferred.
tr: Dosya başarıyla aktarıldı.

source: Pending
tr: Beklemede

source: The transfer is waiting for the partner to accept or reject it.
tr: Aktarım, ortağın kabul etmesini veya reddetmesini bekliyor.

source: Aborted
tr: İptal Edildi

source: Either you clicked the <guibutton>Abort</guibutton> button, or the other person aborted the transfer.
tr: Ya siz <guibutton>İptal Et</guibutton> düğmesine tıkladınız ya da diğer kişi aktarımı iptal etti.

source: Failed
tr: Başarısız

source: An error occurred and the transfer was not successful.
tr: Bir hata oluştu ve aktarım başarılı olmadı.

source: Queued
tr: Kuyrukta

source: Transfer is waiting for you to accept or reject it.
tr: Aktarım, kabul etmeniz veya reddetmeniz için sizi bekliyor.

source: Resuming
tr: Sürdürülüyor

source: When a transfer begins but the file already exists on the user's system, the user will be prompted <interface>File already exists. Resume transfer?</interface> This status indicates the user resumed the transfer.
tr: Bir aktarım başladığında; ancak dosya kullanıcının sisteminde halihazırda varsa kullanıcıya <interface>Dosya halihazırda var. Aktarım sürdürülsün mü?</interface> iletisi gösterilir. Bu durum, kullanıcının aktarımı sürdürdüğünü gösterir.

source: When someone wants to send you a file, the <guilabel>DCC Status</guilabel> tab will be created (if not already created). Click the <guilabel>DCC Status</guilabel> tab to display it. Click the file to select it, then click this button to accept the file and the transfer will begin. <emphasis>Note: </emphasis>You may configure &konversation; to automatically accept sends from other people by choosing <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> on the main menu. Click <guilabel>Behavior</guilabel> to expand it, then click <guilabel>DCC</guilabel> to display the <guilabel>DCC</guilabel> screen.
tr: Birisi size bir dosya göndermek istediğinde, <guilabel>DCC Durumu</guilabel> sekmesi oluşturulacaktır (henüz oluşturulmamışsa). Görüntülemek için <guilabel>DCC Durumu</guilabel> sekmesine tıklayın. Seçmek için dosyaya tıklayın, ardından dosyayı kabul etmek için bu düğmeye tıklayın ve aktarım başlayacaktır. <emphasis>Not: </emphasis>&konversation;’un kendiliğinden başkalarından gelen dosyaları kabul etmesini istiyorsanız ana menüden <menuchoice><guisubmenu>Ayarlar</guisubmenu> <guisubmenu>Konversation Uygulamasını Yapılandır…</guisubmenu></menuchoice> seçimini yapın. <guilabel>Davranış</guilabel>, <guilabel>DCC</guilabel> sayfasından <guilabel>DCC</guilabel> ekranına geçin.

source: If you have trouble sending or receiving files, your firewall or router may be blocking DCC ports. See <link linkend="faq">Questions and Answers</link>.
tr: Dosya gönderme veya alma konusunda sorun yaşıyorsanız güvenlik duvarınız veya yönlendiriciniz DCC kapılarını engelliyor olabilir. <link linkend="faq">Sorular ve Yanıtlar</link> bölümüne bakın.

source: Capturing &URL;s from messages
tr: İletilerdeki &URL;’leri yakalamak

source: In any <link linkend="channel-screen-tour">channel</link>, users sometimes post the &URL;s of interesting websites or other resources on the web. You can double-click any such &URL; and &konversation; will launch the application associated with the &URL;. The application launched depends upon the &MIME; type of the &URL;. For example, a &URL; beginning with <interface>https:</interface> will activate your default web browser and display the web page. (You can also specify the <link linkend="webbrowser">web browser</link> to use.) If the &URL; scrolls off the screen, you might have trouble finding it again. &konversation; can keep a convenient list of all &URL;s for you. To activate this feature, choose <menuchoice> <guisubmenu>Window</guisubmenu> <guisubmenu>&URL; Catcher</guisubmenu> </menuchoice> on the main menu. <action>A new tab called <guilabel>&URL; Catcher</guilabel> is created.</action>
tr: Herhangi bir <link linkend="channel-screen-tour">kanalda</link>, kullanıcılar web üzerindeki ilginç web sitelerinin veya başka özkaynakların &URL;’lerini gönderirler. Herhangi bir &URL;’nın üzerine çift tıklayın ve &konversation; &URL; ile ilişkilendirilmiş uygulamayı açacaktır. Başlatılacak uygulama, &URL;’nin &MIME; türü ile doğrudan ilişkilidir. Örneğin, <interface>https:</interface> ile başlayan bir &URL;, öntanımlı web tarayıcısını etkinleştirir ve web sayfasını görüntüler (Ayrıca, kullanılacak <link linkend="webbrowser">web tarayıcısını</link> da belirtebilirsiniz). &URL; ekranın dışına çıkarsa onu bulmada zorluk çekebilirsiniz. &konversation; sizin için gönderilen tüm &URL;’lerin bir listesini tutar. Bu özelliği etkinleştirmek için ana menüden <menuchoice><guisubmenu>Pencere</guisubmenu> <guisubmenu>&URL; Yakalayıcısı</guisubmenu></menuchoice> seçimini yapın. <action><guilabel>&URL; Yakalayıcısı</guilabel> sekmesi oluşturulur.</action>

source: <screeninfo>The &URL; Catcher tab.</screeninfo>
tr: <screeninfo>&URL; Yakalayıcısı sekmesi.</screeninfo>

source: <phrase>The &URL; Catcher tab.</phrase>
tr: <phrase>&URL; Yakalayıcısı sekmesi.</phrase>

source: This is the list of &URL;s seen since you started &konversation;. The <guilabel>From</guilabel> column is the &i18n-nickname; of the person who posted the &URL; or the name of the channel or server, where the &URL; was posted. (&URL;s appearing in join and leave messages are not listed.) Click on a &URL; to select it.
tr: Bu, &konversation; başlatıldığından bu yana görülen &URL;’lerin listesidir. <guilabel>Kimden</guilabel> sütunu, &URL;’yi gönderen kişinin takma adı veya &URL;’nin gönderildiği kanalın veya sunucunun adıdır (katılma ve ayrılma iletilerinde görünen &URL;’ler listelenmez). Seçmek için bir &URL;’ye tıklayın.

source: Click here to activate the application associated with the selected &URL;. The application launched depends upon the &MIME; type of the &URL;. For example, a &URL; beginning with <interface>https:</interface> will activate your default web browser and display the web page. For web pages, you can also specify the <link linkend="webbrowser">web browser</link> to use.
tr: Seçili &URL; ile ilişkili uygulamayı etkinleştirmek için buraya tıklayın. Başlatılan uygulama &URL;’nin &MIME; türüne bağlıdır. Örneğin, <interface>https:</interface> ile başlayan bir &URL;, öntanımlı web tarayıcınızı etkinleştirecek ve web sayfasını görüntüleyecektir. Web sayfaları için kullanılacak <link linkend="webbrowser">web tarayıcısını</link> da belirtebilirsiniz.

source: Click here to copy the selected &URL; to the clipboard.
tr: Seçili &URL;’yi panoya kopyalamak için buraya tıklayın.

source: Click here to delete the selected &URL; from the list.
tr: Seçili &URL;’yi listeden silmek için buraya tıklayın.

source: Click here to save the list of &URL;s to a file.
tr: &URL; listesini dosyaya kaydetmek için buraya tıklayın.

source: Click here to clear the list.
tr: Listeyi temizlemek için buraya tıklayın.

source: Setting your preferred web browser
tr: Tercih edilen web tarayıcısını ayarlamak

source: When you click on a highlighted &URL; anywhere in &konversation;, it will launch the default application associated with the &MIME; type of the &URL;. For example, when clicking on a &URL; beginning with <interface>https</interface>, &konqueror; is launched to display the web page. You can specify an application different from the <guilabel>Default Applications</guilabel> module of the &systemsettings;. For example, you can use <application>Firefox</application> instead.
tr: &konversation;’da herhangi bir yerde vurgulanmış bir &URL;’ye tıkladığınızda, &URL;’nin &MIME; türüyle ilişkili öntanımlı uygulama başlatılacaktır. Örneğin, <interface>https</interface> ile başlayan bir &URL;’ye tıklandığında, web sayfasını görüntülemek için &konqueror; açılır. &systemsettings;’nın <guilabel>Öntanımlı Uygulamalar</guilabel> modülünde tanımlı uygulamadan bir başkasını belirtebilirsiniz. Örneğin, bunların yerine <application>Firefox</application> kullanabilirsiniz.

source: To choose a different web browser from &konversation; app, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure &konversation;</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Configure</guilabel> screen will appear.</action>
tr: &konversation; içinden başka bir web tarayıcısı seçmek için ana menüden <menuchoice> <guisubmenu>Ayarlar</guisubmenu><guisubmenu>&konversation; Uygulamasını Yapılandır…</guisubmenu></menuchoice> seçimini yapın. <action><guilabel>Yapılandır</guilabel> ekranı görünür.</action>

source: <screeninfo>The General screen</screeninfo>
tr: <screeninfo>Genel ekranı.</screeninfo>

source: <phrase>The General screen</phrase>
tr: <phrase>Genel ekranı</phrase>

source: Click here to display the <guilabel>General</guilabel> screen.
tr: <guilabel>Genel</guilabel> ekranını görüntülemek için buraya tıklayın.

source: Click here to specify that you want to use a custom web browser.
tr: Özel bir web tarayıcısı kullanmak istediğinizi belirtmek için buraya tıklayın.

source: Enter the command to launch your desired web browser. When you click on a &URL; <userinput><replaceable>%u</replaceable></userinput> will be replaced with the &URL;.
tr: İstediğiniz web tarayıcısını başlatmak için komutu girin. &URL;’ye tıkladığınızda, <userinput><replaceable>%u</replaceable></userinput>, &URL; ile değiştirilir.

source: <emphasis>Note: </emphasis>The web browser setting does not apply to <interface>mailto:</interface> &URL;s. <interface>mailto:</interface> &URL;s always launch the default mailer.
tr: <emphasis>Not: </emphasis>Web tarayıcısı ayarı, <interface>mailto:</interface> &URL;’leri için geçerli değildir. <interface>mailto:</interface> &URL;’leri, her zaman öntanımlı postalayıcı ile açılır.

source: Click <guibutton>Apply</guibutton> to save your changes. You must reconnect to each server and channel for the changes to take effect. The easiest way to do this is to quit and restart &konversation;.
tr: Değişikliklerinizi kaydetmek için <guibutton>Uygula</guibutton>’ya tıklayın. Değişikliklerin etkili olması için her sunucuya ve kanala yeniden bağlanmanız gerekir. Bunu yapmanın en kolay yolu, &konversation;’dan çıkmak ve onu yeniden açmaktır.

source: Marking Channel and Query Logs
tr: Kanal ve sorgu günlüklerini imlemek

source: You can insert a marker into <link linkend="channel-screen-tour">channel</link> and <link linkend="query">query</link> screens to help you quickly locate information. To do this, choose <menuchoice> <guisubmenu>Insert</guisubmenu> <guisubmenu>Marker Line</guisubmenu> </menuchoice> on the main menu, or press <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo>. <action>A line will appear at the bottom of the text on the screen. The line will scroll with the rest of the text on the screen.</action>
tr: Tez bir biçimde bilgiye erişmek için <link linkend="channel-screen-tour">kanallara</link> ve <link linkend="query">sorgulara</link> imleyiciler ekleyebilirsiniz. Bunu yapmak için ana menüden <menuchoice><guisubmenu>Ekle</guisubmenu> <guisubmenu>İmleyici Satır</guisubmenu></menuchoice> seçimini yapın veya <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> kısayolunu kullanın. <action>Ekrandaki metnin altında bir çizgi belirecektir. Bu çizgi, ekrandaki metnin geri kalanıyla birlikte sarılır.</action>

source: To make the <interface>Maker Line</interface> be inserted in all channels and queries at once, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> from the main menu, expand <guilabel>Behavior</guilabel>, click on <guilabel>Chat Window</guilabel>, and check the <guilabel>Show manually inserted lines in all chat windows</guilabel> box.
tr: <interface>İmleyici Çizgi</interface>’nin tüm kanallara ve sorgulara aynı anda eklenmesi için ana menüden <menuchoice><guisubmenu>Ayarlar</guisubmenu> <guisubmenu>Konversation Uygulamasını Yapılandır…</guisubmenu> </menuchoice> seçimini yapın; <guilabel>Davranış</guilabel>, <guilabel>Sohbet Penceresi</guilabel> sayfasında <guilabel>Elle girilen çizgileri tüm sohbet pencerelerinde göster</guilabel> kutusunu işaretleyin.

source: To make &konversation; automatically insert a <interface>Marker Line</interface> whenever you do an <userinput><command>/away</command> <replaceable>msg</replaceable></userinput> command, see <link linkend="identity-away">Setting your identity</link>.
tr: &konversation;’un her <userinput><command>/away</command> <replaceable>ileti</replaceable></userinput> yaptığınızda kendiliğinden bir <interface>İmleyici Çizgi</interface> eklemesini istiyorsanız <link linkend="identity-away">Kimliğinizi ayarlamak</link> bölümüne bakın.

source: Logging
tr: Günlükleme

source: If logging is enabled, &konversation; keeps a log of each <interface>Server</interface>, <link linkend="channel-screen-tour">Channel</link>, and <link linkend="query">Private conversation (query)</link> session. Each session is stored in a log file on disk. When you open the same session again, &konversation; appends to the log.
tr: Günlükleme etkinleştirilmişse &konversation;, her bir <interface>Sunucu</interface>, <link linkend="channel-screen-tour">Kanal</link> ve <link linkend="query">Özel Konuşma (Sorgu)</link> oturumunun bir günlüğünü tutar. Her bir oturum, diskteki bir günlük dosyasında depolanır. Aynı oturumu yeniden açtığınızda &konversation;, günlüğe eklemeyi sürdürür.

source: Whenever you open a session again, approximately the last 1024 characters of the previous session are read from the tail of the log and shown on the screen.
tr: Bir oturumu yeniden açtığınızda, önceki oturumun yaklaşık son 1024 karakteri günlüğün kuyruğundan okunur ve ekranda gösterilir.

source: As your session continues, messages scroll off the top of the display. You can scroll backwards to view these messages. Eventually, in order to conserve memory, the oldest messages are discarded from the scroll. This is called the <guilabel>Scrollback limit</guilabel>. Messages that disappear from the display because of the <guilabel>Scrollback limit</guilabel> are still available in the log file, if logging is enabled.
tr: Oturumunuz sürerken, iletiler ekranın üst kısmından kayar. Bu iletileri görüntülemek için geriye doğru sarabilirsiniz. Sonunda, belleği korumak için en eski iletiler sarmadan atılır. Buna <guilabel>Geri sarma sınırı</guilabel> denir. <guilabel>Geri sarma sınırı</guilabel> nedeniyle ekrandan kaybolan iletiler, günlük kaydı etkinleştirilmişse günlük dosyasında hâlâ bulunur.

source: To view the logfile for a session, click the tab for the session to make it the current session and choose <menuchoice> <guisubmenu>Window</guisubmenu> <guisubmenu>Open Logfile</guisubmenu> </menuchoice> from the main menu. <action>A new tab appears</action> displaying the log file.
tr: Bir oturum için olan günlük dosyasını görüntülemek üzere, bakmak istediğiniz oturum sekmesine tıklayıp onu etkin sekme yapın ve ana menüden <menuchoice><guisubmenu>Pencere</guisubmenu> <guisubmenu>Günlük Dosyasını Aç</guisubmenu></menuchoice> seçimini yapın. Günlük dosyasını görüntüleyen <action>yeni bir sekme</action> açılır.

source: <screeninfo>Logfile</screeninfo>
tr: <screeninfo>Günlük Dosyası</screeninfo>

source: <phrase>Logfile</phrase>
tr: <phrase>Günlük Dosyası</phrase>

source: The messages in the log file are displayed here. The oldest messages are at the top and the most recent are at the bottom.
tr: Günlük dosyasındaki iletiler burada görüntülenir. En eski iletiler en üstte ve en yenileri en altta yer alır.

source: Click this button to save the log file to another file.
tr: Günlük dosyasını başka bir dosyaya kaydetmek için bu düğmeye tıklayın.

source: Click to refresh the log file display. While you are viewing a log file, newer messages in the corresponding session are <emphasis>not</emphasis> automatically added to the log file display. Use this button to view the most recent messages.
tr: Günlük dosyası görüntüsünü yenilemek için tıklayın. Siz bir günlük dosyasını görüntülerken, ilgili oturumdaki yeni iletiler kendiliğinden günlük dosyası ekranına eklenmez. En son iletileri görüntülemek için bu düğmeyi kullanın.

source: Click to erase the log file display and the log file on disk.
tr: Günlük dosyası görüntüsünü ve diskteki günlük dosyasını silmek için tıklayın.

source: Use this box to set the maximum size of the scroll. This setting does take effect only for newly opened log tabs. The last changed value of the scroll size will be used on &konversation;'s next start. Each log file may have a separate setting.
tr: En büyük sarma boyutunu ayarlamak için bu kutuyu kullanın. Bu ayar yalnızca yeni açılan günlük sekmeleri için geçerli olur. Sarma boyutunun son değiştirilen değeri &konversation;’un bir sonraki başlangıcında kullanılacaktır. Her günlük dosyası ayrı bir ayara sahip olabilir.

source: The <guilabel>Scrollback limit</guilabel> can be changed by choosing <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure &konversation;</guisubmenu> </menuchoice> on the main menu, then expand <guilabel>Behavior</guilabel> and click on <guilabel>Chat Window</guilabel>. The <guilabel>Scrollback limit</guilabel> box appears on this screen. If you set it to <guilabel>Unlimited</guilabel> (&ie; zero), messages are not discarded from the scroll.
tr: <guilabel>Geri sarma sınırı</guilabel> ayarını değiştirmek için ana menüden <menuchoice><guisubmenu>Ayarlar</guisubmenu> <guisubmenu>&konversation; Uygulamasını Yapılandır…</guisubmenu></menuchoice> seçimini yapın, sonrasında <guilabel>Davranış</guilabel>, <guilabel>Sohbet Penceresi</guilabel> sayfasına tıklayın. <guilabel>Geri sarma sınırı</guilabel> kutusu ekranda görünür. <guilabel>Sınırsız</guilabel> (&ie; sıfır) olarak ayarlarsanız iletiler sarma ekranından atılmaz.

source: You can enable or disable logging and set other logging options, by choosing <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure &konversation;</guisubmenu> </menuchoice> on the main menu, then expand <guilabel>Behavior</guilabel> and click on <guilabel>Logging</guilabel>.
tr: Ana menüden <menuchoice><guisubmenu>Ayarlar</guisubmenu> <guisubmenu>&konversation; Uygulamasını Yapılandır…</guisubmenu></menuchoice> seçimini yapıp <guilabel>Davranış</guilabel>, <guilabel>Günlükleme</guilabel> sayfasından günlüklemeyi etkinleştirebilir/devre dışı bırakabilir ve başka günlükleme seçeneklerini ayarlayabilirsiniz.

source: &konversation; commands
tr: &konversation; komutları

source: The following commands are interpreted by &konversation; and may differ from standard &irc; commands. Items inside square brackets are optional. Items separated by bar (|) are alternate forms of the command. Commands not listed here are sent to the server as entered.
tr: Aşağıdaki komutlar &konversation; tarafından yorumlanır ve standart &irc; komutlarından farklı olabilir. Köşeli parantez içindeki öğeler isteğe bağlıdır. Çubuk (|) ile ayrılmış ögeler komutun alternatif biçimleridir. Burada listelenmeyen komutlar girildiği gibi sunucuya gönderilir.

source: <command>/me</command> <replaceable>msg</replaceable>
tr: <command>/me</command> <replaceable>ileti</replaceable>

source: <command>/ame</command> <replaceable>msg</replaceable>
tr: <command>/ame</command> <replaceable>ileti</replaceable>

source: Like the <userinput><command>/me</command></userinput> command above except that the message is sent to all the channels and queries you have open on all the servers you have connected in &konversation;.
tr: Yukarıdaki <userinput><command>/me</command></userinput> komutu gibidir; ancak ileti &konversation; içinde bağlandığınız tüm sunucularda açık olan tüm kanallara ve sorgulara gönderilir.

source: <command>/join</command> <replaceable>channel</replaceable> <replaceable>[pwd]</replaceable>
tr: <command>/join</command> <replaceable>kanal</replaceable> <replaceable>[parola]</replaceable>

source: Joins <userinput><replaceable>channel</replaceable></userinput>. If the server permits it, and if the channel does not already exist, it is created and you are the channel operator. If the channel requires a password in order to join, specify as <userinput><replaceable>pwd</replaceable></userinput>. Most channel names begin with <userinput><replaceable>#</replaceable></userinput>.
tr: <userinput><replaceable>Kanala</replaceable></userinput> katılır. Sunucu izin veriyorsa ve kanal halihazırda yoksa kanal oluşturulur ve siz de kanal operatörü olursunuz. Kanala katılmak için bir parola gerekiyorsa <userinput><replaceable>parola</replaceable></userinput> olarak belirtin. Çoğu kanal adı <userinput><replaceable>#</replaceable></userinput> ile başlar.

source: <command>/j</command> <replaceable>channel</replaceable> <replaceable>[pwd]</replaceable>
tr: <command>/j</command> <replaceable>kanal</replaceable> <replaceable>[parola]</replaceable>

source: Same as <userinput><command>/join</command></userinput> above.
tr: Üstteki <userinput><command>/join</command></userinput> ile aynıdır.

source: <command>/part</command> <replaceable>[channel]</replaceable> <replaceable>[reason]</replaceable>
tr: <command>/part</command> <replaceable>[kanal]</replaceable> <replaceable>[gerekçe]</replaceable>
