Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konversation.po
Languages: tr

source: Leaves <userinput><replaceable>channel</replaceable></userinput> with <userinput><replaceable>reason</replaceable></userinput> and closes the corresponding <interface>channel</interface> tab. Within a &konversation; channel or query tab, you can just enter <userinput><command>/part</command></userinput> which closes that channel or query with your default reason as given in the <link linkend="identity">Settings</link>.
tr: <userinput><replaceable>Kanaldan</replaceable></userinput> <userinput><replaceable>gerekçe</replaceable></userinput> ile çıkar ve ilgili <interface>kanal</interface> sekmesini kapatır. Bir &konversation; kanalında veya sorgu sekmesinde <userinput><command>/part</command></userinput> girerseniz o sekme, <link linkend="identity">Ayarlar</link>’da belirlediğiniz öntanımlı gerekçe ile kapatılır.

source: <command>/leave</command> <replaceable>[channel]</replaceable> <replaceable>[reason]</replaceable>
tr: <command>/leave</command> <replaceable>[kanal]</replaceable> <replaceable>[gerekçe]</replaceable>

source: Same as <userinput><command>/part</command></userinput> above.
tr: Üstteki <userinput><command>/part</command></userinput> ile aynıdır.

source: When entered in any channel, query, or DCC tab, disconnects from the corresponding server and closes all channel, query, or DCC tabs open on that server.
tr: Herhangi bir kanal, sorgu veya DCC sekmesine girildiğinde, ilgili sunucuyla bağlantıyı keser ve bu sunucuda açık olan tüm kanal, sorgu veya DCC sekmelerini kapatır.

source: <command>/notice</command> <replaceable>nick|channel</replaceable> <replaceable>msg</replaceable>
tr: <command>/notice</command> <replaceable>takma ad|kanal</replaceable> <replaceable>ileti</replaceable>

source: Sends <userinput><replaceable>msg</replaceable></userinput> to the user with &i18n-nickname; <userinput><replaceable>nick</replaceable></userinput> or to everyone in the <userinput><replaceable>channel</replaceable></userinput>. The following is an example of what appears to you in the channel tab
tr: <userinput><replaceable>takma ad</replaceable></userinput> takma adlı kullanıcıya veya <userinput><replaceable>kanaldaki</replaceable></userinput> herkese <userinput><replaceable>ileti</replaceable></userinput> gönderir. Aşağıda, kanal sekmesinde size görünenlere bir örnek verilmiştir

source: [17:14] [Notice] Sending notice "I think I understand" to #konversation
tr: [17:14] [Notice] “Her şey tamam” duyurusu şuraya gönderiliyor: #konversation.

source: And this is what the recipients see
tr: Alıcılar şöyle görür:

source: [17:15] [Notice] -Eisfuchs- I think I understand
tr: [17:15] [Notice] -Eisfuchs- Her şey tamam

source: Creates a new tab with the user's <userinput><replaceable>nick</replaceable></userinput> for private conversation, commonly known on &irc; as a <link linkend="query">Query</link>. Everything written here is only visible to you and your query partner. You may enter more than one &i18n-nickname; separated by spaces and a query tab will be opened for each &i18n-nickname;. Each such query tab will be private between you and the query partner.
tr: Genellikle &irc;’de <link linkend="query">Sorgu</link> olarak bilinen özel sohbet için kullanıcının <userinput><replaceable>takma adı</replaceable></userinput> ile yeni bir sekme oluşturur. Burada yazılan her şey yalnızca siz ve sorgu ortağınız tarafından görülebilir. Boşluklarla ayrılmış birden fazla takma ad girebilirsiniz ve her takma ad için bir sorgu sekmesi açılır. Bu tür her sorgu sekmesi siz ve sorgu ortağı arasında özel olacaktır.

source: <userinput><command>/msg </command><replaceable>nick|channel</replaceable></userinput> <userinput><replaceable>message</replaceable></userinput>
tr: <userinput><command>/msg </command><replaceable>takma ad|kanal</replaceable></userinput> <userinput><replaceable>ileti</replaceable></userinput>

source: Sends a private message to the user with &i18n-nickname; <userinput><replaceable>nick</replaceable></userinput> or to all users in <userinput><replaceable>channel</replaceable></userinput>. Unlike <userinput><command>/query</command></userinput>, does not open a new tab. If <userinput><replaceable>message</replaceable></userinput> begins with <userinput><command>/me </command></userinput>, the message is formatted in the same manner as a <userinput><command>/me</command></userinput> command.
tr: <userinput><replaceable>Takma ad</replaceable></userinput> adına sahip kullanıcıya veya <userinput><replaceable>kanaldaki</replaceable></userinput> tüm kullanıcılara bir özel ileti gönderir. <userinput><command>/query</command></userinput>’den farklı olarak yeni bir sekme açmaz. <userinput><replaceable>İleti</replaceable></userinput> <userinput><command>/me</command></userinput> ile başlıyorsa ileti, <userinput><command>/me</command></userinput> komutu ile aynı olarak biçimlendirilir.

source: Examples
tr: Örnekler

source: /msg Eisfuchs I need some help with the msg command
tr: /msg Eisfuchs msg komutu ile ilgili yardım gerek

source: /msg #konversation New version of Konvi is online!
tr: /msg #konversation Konvi’nin yeni sürümü çıktı!

source: /msg Eisfuchs /me is compiling the Handbook right now.
tr: /msg Eisfuchs /me şimdi El Kitabı’nı derliyor.

source: <userinput><command>/smsg </command><replaceable>nick|channel</replaceable></userinput> <userinput><replaceable>message</replaceable></userinput>
tr: <userinput><command>/smsg </command><replaceable>takma ad|kanal</replaceable></userinput> <userinput><replaceable>ileti</replaceable></userinput>

source: Same as <userinput><command>/msg</command></userinput> except the message is not displayed on your screen. This is useful for preventing passwords and other sensitive information from remaining exposed on your screen or being logged.
tr: <userinput><command>/msg</command></userinput> aynıdır; ancak ileti ekranınızda görüntülenmez. Bu, parola gibi hassas bilgilerin ekranınızda kalmasını veya günlüklenmesini önler.

source: <userinput><command>/amsg </command><replaceable>nick|channel</replaceable></userinput> <userinput><replaceable>message</replaceable></userinput>
tr: <userinput><command>/amsg </command><replaceable>takma ad|kanal</replaceable></userinput> <userinput><replaceable>ileti</replaceable></userinput>

source: Like the <userinput><command>/msg</command></userinput> command above except that the message is sent to all the channels and queries you have open on all the servers you have connected in &konversation;.
tr: Yukarıdaki <userinput><command>/msg</command></userinput> komutu gibidir; ancak ileti, &konversation;’da açık olan tüm sunuculara, kanallara ve sorgulara gönderilir.

source: <command>/op </command> <replaceable>nick</replaceable>
tr: <command>/op </command> <replaceable>takma ad</replaceable>

source: When entered into a channel tab, attempts to give <userinput><replaceable>nick</replaceable></userinput> operator privilege for the channel. May not work if you lack sufficient privilege in the channel (you must be a channel operator yourself). You may enter more than one &i18n-nickname; separated by spaces.
tr: Bir kanal sekmesine girildiğinde, kanal için <userinput><replaceable>takma ad</replaceable></userinput> kullanıcısına operatör ayrıcalığı vermeye çalışır. Kanalda yeterli ayrıcalığa sahip değilseniz çalışmayabilir (kendiniz bir kanal operatörü olmalısınız). Boşluklarla ayrılmış birden fazla takma ad girebilirsiniz.

source: <command>/deop </command><replaceable>nick</replaceable>
tr: <command>/deop </command><replaceable>takma ad</replaceable>

source: When entered into a channel tab, takes away channel operator privilege from <userinput><replaceable>nick</replaceable></userinput>. You may enter more than one &i18n-nickname; separated by spaces.
tr: Bir kanal sekmesine girildiğinde, <userinput><replaceable>takma ad</replaceable></userinput> kullanıcısından kanal operatörü ayrıcalığını alır. Boşluklarla ayrılmış birden fazla takma ad girebilirsiniz.

source: <command>/oper </command><replaceable>[nick]</replaceable>
tr: <command>/oper </command><replaceable>[takma ad]</replaceable>

source: Grants the user with &i18n-nickname; <userinput><replaceable>nick</replaceable></userinput> &irc;-Op (Administrator) privilege. This only works if the &i18n-nickname; is listed in the server's O: line. &irc;-Ops have the privilege to <userinput><command>/kill</command></userinput> &i18n-nickname;s, <userinput><command>/connect</command></userinput> servers to the &irc; network, and more. If <userinput><replaceable>nick</replaceable></userinput> is not entered, attempts to grant yourself &irc;-Op privilege. You will be prompted for your &irc;-Op user name and password in either case.
tr: <userinput><replaceable>Takma ad</replaceable></userinput> kullanıcısına &irc;-Op (Yönetici) ayrıcalığı tanır. Bu yalnızca, takma ad sunucunun O: satırında giriliyse çalışır. &irc;-Op’ları, kullanıcı adlarını <userinput><command>/kill</command></userinput>, sunucuları &irc; ağına <userinput><command>/connect</command></userinput> ve çok daha fazlasını yapabilir. <userinput><replaceable>Takma ad</replaceable></userinput> girilmezse kendinize &irc;-Op ayrıcalığı verilmeye çalışılır. Her iki durumda da &irc;-Op kullanıcı adınız ve parolanız sorulacaktır.

source: <command>/voice </command> <replaceable>nick</replaceable>
tr: <command>/voice </command> <replaceable>takma ad</replaceable>

source: In certain channels (with +m flag), users cannot send messages unless they have voice privilege. This command attempts to give <userinput><replaceable>nick</replaceable></userinput> voice privilege. You must have channel operator privilege to execute this command. This command is mostly used when you are an operator for a moderated channel.
tr: Kimi kanallarda kullanıcılar (+m bayrağı ile), ses ayrıcalıkları olmadan ileti gönderemezler. Bu komut, <userinput><replaceable>takma ad</replaceable></userinput> kullanıcısına ses ayrıcalığı vermeye çalışır. Bu komutu yürütmek için operatör ayrıcalığınızın olması gerekir. Bu komut en çok yönetilen bir kanalda operatörseniz kullanılır.

source: <command>/unvoice </command> <replaceable>nick</replaceable>
tr: <command>/unvoice </command> <replaceable>takma ad</replaceable>

source: Takes away voice privilege from <userinput><replaceable>nick</replaceable></userinput> in the channel.
tr: Kanalda <userinput><replaceable>takma ad</replaceable></userinput> kullanıcısından ses ayrıcalığını alır.

source: <command>/topic </command><replaceable>[channel]</replaceable> <replaceable>[message]</replaceable>
tr: <command>/topic </command><replaceable>[kanal]</replaceable> <replaceable>[ileti]</replaceable>

source: Attempts to set the topic of <userinput><replaceable>channel</replaceable></userinput> to <userinput><replaceable>message</replaceable></userinput>. When entered in a channel tab, <userinput><replaceable>channel</replaceable></userinput> may be omitted and defaults to the channel active in the tab. If <userinput><replaceable>message</replaceable></userinput> is omitted, displays the current topic of the channel. Changing a channel topic may fail if you lack sufficient privilege.
tr: <userinput><replaceable>Kanal</replaceable></userinput> konusunu <userinput><replaceable>ileti</replaceable></userinput> olarak ayarlamaya çalışır. Bir kanal sekmesinde girildiğinde <userinput><replaceable>kanal</replaceable></userinput> girilmesi gerekmez ve sekmede etkin olan kanal öntanımlı olarak kullanılır. <userinput><replaceable>İleti</replaceable></userinput> boş bırakılırsa kanalın şu anki konusunu görüntüler. Yeterli ayrıcalığınız yoksa kanal konusunu değiştiremeyebilirsiniz.

source: <command>/away </command> <replaceable>reason</replaceable>
tr: <command>/away </command> <replaceable>gerekçe</replaceable>

source: If anyone tries to send you a private message or invite you to a channel, they will be told that you are away from your workstation for <userinput><replaceable>reason</replaceable></userinput>. To change your state back to normal, enter <userinput><command>/away</command></userinput> without a <userinput><replaceable>reason</replaceable></userinput>.
tr: Herhangi biri size özel ileti göndermeye veya sizi bir kanala davet etmeye çalışırsa onlara <userinput><replaceable>gerekçe</replaceable></userinput> nedeniyle iş istasyonunuzdan uzakta olduğunuz söylenecektir. Durumunuzu normale geri döndürmek için bir <userinput><replaceable>gerekçe</replaceable></userinput> olmadan <userinput><command>/away</command></userinput> yazın.

source: <command>/aaway </command><replaceable>reason</replaceable>
tr: <command>/aaway </command><replaceable>gerekçe</replaceable>

source: Like the <userinput><command>/away</command></userinput> command above except that the command is sent to all the servers you have connected in &konversation;.
tr: Yukarıdaki <userinput><command>/away</command></userinput> komutu gibidir; ancak &konversation;’da bağlı olduğunuz tüm sunuculara gönderilir.

source: <command>/invite </command><replaceable>nick</replaceable> <replaceable>[channel]</replaceable>
tr: <command>/invite </command><replaceable>takma ad</replaceable> <replaceable>[kanal]</replaceable>

source: Invites the user with &i18n-nickname; <userinput><replaceable>nick</replaceable></userinput> to join <userinput><replaceable>channel</replaceable></userinput>. This command is especially useful if the channel is invite-only. When entered in a channel tab, <userinput><replaceable>channel</replaceable></userinput> may be omitted.
tr: <userinput><replaceable>Takma ad</replaceable></userinput> kullanıcısını, <userinput><replaceable>kanalına</replaceable></userinput> katılması için davet eder. Bu komut, kanala yalnızca davetle girilebiliyorsa yararlıdır. Bir kanal sekmesinde giriliyorsa <userinput><replaceable>kanal</replaceable></userinput> boş bırakılabilir.

source: <command>/exec </command><replaceable>script</replaceable> <replaceable>[parameters]</replaceable>
tr: <command>/exec </command><replaceable>betik</replaceable> <replaceable>[parametreler]</replaceable>

source: Executes the &konversation;-compatible shell script named <userinput><replaceable>script</replaceable></userinput>, passing it <userinput><replaceable>parameters</replaceable></userinput>. See <link linkend="scripting">Scripting</link> for more information on using and writing scripts.
tr: &konversation; ile uyumlu olan <userinput><replaceable>betik</replaceable></userinput> betiğini çalıştırır, ona <userinput><replaceable>parametreler</replaceable></userinput> geçirir. Betik yazımı ve kullanımı hakkında ayrıntılı bilgi için <link linkend="scripting">Betik yazımı</link> bölümüne bakın.

source: Examples:
tr: Örnekler:

source: Sends your system's &konversation;, &Qt;, &kde-frameworks; and &plasma; version numbers to the channel.
tr: Sisteminizin &konversation;, &Qt;, &kde-frameworks; ve &plasma; sürüm numaralarını kanala gönderir.

source: Sends your &Linux; version string (the output of <quote>uname -a</quote>) to the channel.
tr: &Linux; sürümünüzün dizisini (<quote>uname -a</quote> çıktısı) kanala gönderir.

source: <command>/notify </command><replaceable>[nick]</replaceable>
tr: <command>/notify </command><replaceable>[takma ad]</replaceable>

source: Adds or removes <userinput><replaceable>nick</replaceable></userinput> from your <link linkend="nicksonline">Watched Nicks</link> list. If the &i18n-nickname; is already in the list, it is removed. If it is not in the list, it is added. If <userinput><replaceable>nick</replaceable></userinput> is omitted, displays the current list of watched &i18n-nickname;s.
tr: <link linkend="nicksonline">İzlenen Takma Adlar</link> listenize <userinput><replaceable>takma ad</replaceable></userinput> ekler veya var olanları kaldırır. Takma ad halihazırda listedeyse kaldırılır. Listede değilse eklenir. <userinput><replaceable>Takma ad</replaceable></userinput> boş bırakılırsa geçerli izlenen takma adlar listesi görüntülenir.

source: <command>/kick </command><replaceable>nick</replaceable> <replaceable>reason</replaceable>
tr: <command>/kick </command><replaceable>takma ad</replaceable> <replaceable>gerekçe</replaceable>

source: When entered in a channel tab, attempts to kick the user with &i18n-nickname; <userinput><replaceable>nick</replaceable></userinput> from the channel with <userinput><replaceable>reason</replaceable></userinput>. If <userinput><replaceable>reason</replaceable></userinput> is not entered, defaults to the reason in the <link linkend="identity">Settings</link>. This command may only be used in a channel tab.
tr: Bir kanal sekmesinde girildiğinde <userinput><replaceable>takma ad</replaceable></userinput> kullanıcısını <userinput><replaceable>gerekçe</replaceable></userinput> ile kovmaya çalışır. <userinput><replaceable>Gerekçe</replaceable></userinput> girilmemişse <link linkend="identity">Ayarlar</link>’da belirlediğiniz öntanımlı gerekçe kullanılır. Bu komut yalnızca bir kanal sekmesinde kullanılabilir.

source: <command>/ban </command> [<command>-host</command>|<command>-domain</command>| <command>-userhost</command>|<command>-userdomain</command>] <replaceable>[channel]</replaceable> <replaceable>user</replaceable>|<replaceable>mask</replaceable>
tr: <command>/ban </command> [<command>-host</command>|<command>-domain</command>| <command>-userhost</command>|<command>-userdomain</command>] <replaceable>[kanal]</replaceable> <replaceable>kullanıcı</replaceable>|<replaceable>maske</replaceable>

source: Attempts to ban the <userinput><replaceable>user</replaceable></userinput> or <userinput><replaceable>mask</replaceable></userinput> from <userinput><replaceable>channel</replaceable></userinput>. When entered in a channel tab, <userinput><replaceable>channel</replaceable></userinput> may be omitted. For more information on hosts, domains, and masks, see the documents at <ulink url="https://www.irchelp.org/">irchelp.org</ulink>. To get the current ban list for a channel, enter <userinput><command>/mode </command><replaceable>channel</replaceable> <command>b</command></userinput>.
tr: <userinput><replaceable>Kanaldan</replaceable></userinput> <userinput><replaceable>kullanıcıyı</replaceable></userinput> veya <userinput><replaceable>maskeyi</replaceable></userinput> yasaklamaya çalışır. Bir kanal sekmesinde girildiğinde <userinput><replaceable>kanal</replaceable></userinput> boş bırakılabilir. Makineler, etki alanları ve maskeler hakkında daha fazla bilgi için <ulink url="https://www.irchelp.org/">irchelp.org</ulink> adresindeki belgelere bakın. Bir kanal için geçerli yasak listesini almak için <userinput><command>/mode </command><replaceable>kanal</replaceable> <command>b</command></userinput> girin.

source: <command>/unban </command> <replaceable>[channel]</replaceable> <replaceable>pattern</replaceable>
tr: <command>/unban </command> <replaceable>[kanal]</replaceable> <replaceable>dizgi</replaceable>

source: Reverts a previous banning from a channel. When entered in a channel tab, <userinput><replaceable>channel</replaceable></userinput> may be omitted.
tr: Kanaldan bir önceki yasaklamayı geri alır. Bir kanal sekmesinde girildiğinde <userinput><replaceable>kanal</replaceable></userinput> boş bırakılabilir.

source: <command>/ignore </command> [<command>-all</command>] <replaceable>nick</replaceable>
tr: <command>/ignore </command> [<command>-all</command>] <replaceable>takma ad</replaceable>

source: Adds <userinput><replaceable>nick</replaceable></userinput> to your Ignore list. You may specify more than one &i18n-nickname; separated by spaces. Channel messages from users on your Ignore list are not displayed. In addition, if you enter <userinput><command>-all</command></userinput>, all message types (queries, notices, &CTCP;, DCC, and Exceptions) from the user are ignored as well as channel messages.
tr: <userinput><replaceable>Takma adı</replaceable></userinput> yok sayma listesine ekler. Boşluklarla ayrılmış olarak birden çok takma ad belirtebilirsiniz. Yok sayma listesindeki kullanıcılardan olan kanal listeleri görüntülenmez. Ek olarak, <userinput><command>-all</command></userinput> girerseniz kullanıcıdan olan tüm ileti türleri (sorgular, duyurular, &CTCP;, DCC ve istisnalar) ve kanal iletileri yok sayılır.

source: <command>/quote </command> <replaceable>cmd</replaceable>
tr: <command>/quote </command> <replaceable>komut</replaceable>

source: Sends <userinput><replaceable>cmd</replaceable></userinput> to the server.
tr: <userinput><replaceable>Komutu</replaceable></userinput> sunucuya gönderir.

source: <command>/say </command> <replaceable>msg</replaceable>
tr: <command>/say </command> <replaceable>ileti</replaceable>

source: When entered in a channel tab, sends <userinput><replaceable>msg</replaceable></userinput> to the channel. This is the same as entering <userinput><replaceable>msg</replaceable></userinput> in the channel <interface>Input Line</interface>. Useful for sending &irc; commands when you don't want to execute the command. Two command characters (//) in a row does the same thing as <userinput><command>/say</command></userinput>. Also used by <link linkend="scripting">scripts</link> to send messages.
tr: Bir kanal sekmesinde girildiğinde, <userinput><replaceable>iletiyi</replaceable></userinput> kanala gönderir. Bu, kanal <interface>Giriş Satırı</interface>’na <userinput><replaceable>iletiyi</replaceable></userinput> girmekle aynıdır. Komutu yürütmeden &irc; komutları girmek istediğiniz zaman yararlıdır. İki adet komut karakterini (//) ard arda girmek de <userinput><command>/say</command></userinput> ile aynı şeydir. Ayrıca <link linkend="scripting">betiklerle</link> iletiler göndermek için kullanılır.

source: Places the server log in raw mode (<command>open</command>) or stops raw mode (<command>close</command>). If neither <command>open</command> or <command>close</command> is entered, defaults to <command>open</command>. In raw mode, the log displays every message received from the server in native &irc; format.
tr: Sunucu günlüğünü ham kipe sokar (<command>open</command>) veya çıkarır (<command>close</command>). Ne <command>open</command> ne de <command>close</command> girilmemişse <command>open</command> komutuna geri döner. Ham kipte günlük, sunucudan alınan her iletiyi yerel &irc; biçiminde görüntüler.

source: Opens a new tab running a &konsole;.
tr: &konsole; çalıştıran bir sekme açar.

source: <command>/server </command> <replaceable>[url]</replaceable> <replaceable>[pwd]</replaceable>
tr: <command>/server </command> <replaceable>[url]</replaceable> <replaceable>[parola]</replaceable>

source: Connects to the server at address <userinput><replaceable>url</replaceable></userinput>. If <userinput><replaceable>url</replaceable></userinput> is omitted, connects to the server associated with the tab where you enter the command. This is useful for re-connecting to a server when disconnected. If the server requires a password in order to connect to it, enter it for <userinput><replaceable>pwd</replaceable></userinput>. If the server requires a port number other than the default (6667), enter the <userinput><replaceable>url</replaceable></userinput> like this: <replaceable>irc.kde.org:6665</replaceable>.
tr: <userinput><replaceable>url</replaceable></userinput> adresindeki sunucuya bağlanır. <userinput><replaceable>url</replaceable></userinput> boş bırakılmışsa komutu girdiğiniz sekme ile ilişkili sunucuya bağlanır. Bu, bağlantı kesildiğinde bir sunucuya yeniden bağlanmak için yararlıdır. Sunucuya bağlanmak için bir parola gerekiyorsa onu <userinput><replaceable>parola</replaceable></userinput> yerine girin. Sunucu öntanımlıdan farklı bir kapı numarası gerektiriyorsa <userinput><replaceable>url</replaceable></userinput>’yi şöyle girin: <replaceable>irc.kde.org:6665</replaceable>.
