Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konversation.po
Languages: tr

source: Click here to close the current tab. Closing a <interface>Channel</interface> tab will leave the channel. Closing a <interface>Server Messages</interface> tab will leave all channels you've joined, close all open queries at that server and disconnect from the server.
tr: Geçerli sekmeyi kapatmak için buraya tıklayın. Bir <interface>Kanal</interface> sekmesinin kapatılması kanalı terk edecektir. Bir <interface>Sunucu İletileri</interface> sekmesini kapatmak, katıldığınız tüm kanallardan ayrılacak, o sunucudaki tüm açık sorguları kapatacak ve sunucuyla bağlantıyı kesecektir.

source: Click this button to change your own &i18n-nickname;. It appears only when the current tab is a channel. To hide this button, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> from the main menu, expand <guilabel>Interface</guilabel>, click on <guilabel>Chat Window</guilabel>, and uncheck <guilabel>Show box to change own nickname</guilabel> box.
tr: Kendi takma adınızı değiştirmek için bu düğmeye tıklayın. Yalnızca geçerli sekme bir kanal ise görünür. Bu düğmeyi gizlemek için ana menüden <menuchoice><guisubmenu>Ayarlar</guisubmenu> <guisubmenu>Konversation Uygulamasını Yapılandır…</guisubmenu></menuchoice> yolunu izleyin; <guilabel>Arayüz</guilabel>, <guilabel>Sohbet Penceresi</guilabel> sayfasında <guilabel>Kendi takma adını değiştirmek için kutu göster</guilabel> kutusunun işaretini kaldırın.

source: The channel topic is displayed here. Hover the mouse over the topic to see long topics. You can change the topic by clicking the button to the left of the topic. To hide channel topics, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> from the main menu, expand <guilabel>Interface</guilabel>, click on <guilabel>Chat Window</guilabel>, and uncheck the <guilabel>Show channel topic</guilabel> box.
tr: Kanal konusu burada görüntülenir. Uzun konuları görmek için fareyi konunun üzerine getirin. Konunun solundaki düğmeye tıklayarak konuyu değiştirebilirsiniz. Kanal konularını gizlemek için ana menüden <menuchoice> <guisubmenu>Ayarlar</guisubmenu> <guisubmenu>Konversation Uygulamasını Yapılandır…</guisubmenu></menuchoice> yolunu izleyin; <guilabel>Arayüz</guilabel>, <guilabel>Sohbet Penceresi</guilabel> sayfasında <guilabel>Kanal konusunu göster</guilabel> kutusunun işaretini kaldırın.

source: These buttons display the current state of channel modes. A button is down if that mode is on. If you have the correct privileges, you can also change channel modes by clicking on these buttons, or click the button to the left of the topic. To hide channel mode buttons, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> from the main menu, expand <guilabel>Interface</guilabel>, click on <guilabel>Chat Window</guilabel>, and uncheck the <guilabel>Show channel mode buttons</guilabel> box.
tr: Bu düğmeler kanal kiplerinin geçerli durumunu gösterir. Bir düğme, o kip açıksa aşağıdadır. Doğru ayrıcalıklara sahipseniz bu düğmelere tıklayarak veya konunun solundaki düğmeye tıklayarak da kanal kiplerini değiştirebilirsiniz. Kanal kipi düğmelerini gizlemek için ana menüden <menuchoice><guisubmenu>Ayarlar</guisubmenu> <guisubmenu>Konversation Uygulamasını Yapılandır…</guisubmenu></menuchoice> yolunu izleyin ve <guilabel>Arayüz</guilabel>, <guilabel>Sohbet Penceresi</guilabel> sayfasında <guilabel>Kanal kipi düğmelerini göster</guilabel> kutusunun işaretini kaldırın.

source: This is called the <interface>Nick Panel</interface>. It is displayed whenever the current tab is a channel. It lists the &i18n-nickname;s of all the users who have joined the channel, including yourself. Hover the mouse pointer over a &i18n-nickname; to display additional information about the user. You may change how the icons are displayed next to each &i18n-nickname; by changing the &i18n-nickname; icon theme. See <link linkend="nickthemes">Configuring &i18n-nickname; themes</link> for more information. The <guilabel>Default Theme</guilabel>, as shown in the screen above, uses the following icons:
tr: Buna <interface>Takma Ad Paneli</interface> adı verilir. Geçerli sekme bir kanal olduğunda görüntülenir. Kendiniz de içerilmek üzere kanala katılan tüm kullanıcıların takma adlarını listeler. Kullanıcı hakkında ek bilgi görüntülemek için fare imlecini bir takma adın üzerine getirin. Takma ad simgesi temasını değiştirerek her takma adın yanında simgelerin nasıl görüntüleneceğini değiştirebilirsiniz. Daha fazla bilgi için <link linkend="nickthemes">Takma ad temalarını yapılandırmak</link> bölümüne bakın. Yukarıdaki ekranda gösterildiği gibi <guilabel>Öntanımlı tema</guilabel>, aşağıdaki simgeleri kullanır:

source: normal user
tr: normal kullanıcı

source: voiced user. User may talk in a moderated channel.
tr: sesli kullanıcı. Kullanıcı, modere edilen bir kanalde konuşabilir.

source: channel halfop
tr: kanal yarı operatörü

source: channel operator
tr: kanal operatörü

source: channel owner
tr: kanal sahibi

source: channel admin
tr: kanal yöneticisi

source: In addition, if a user is away, a small clock will be drawn in the corner of the icon.
tr: Ayrıca bir kullanıcı uzaktaysa simgenin köşesine küçük bir saat çizilecektir.

source: Click with the &RMB; on any &i18n-nickname; to display a context menu of operations you can perform with that &i18n-nickname;. For example, you can <link linkend="dcc">send a file</link> to the &i18n-nickname;.
tr: Herhangi bir takma ada &RMB; ile tıklayarak o takma adla gerçekleştirebileceğiniz işlemlerin bağlam menüsünü görüntüleyin. Örneğin, takma ada bir <link linkend="dcc">dosya</link> gönderebilirsiniz.

source: To hide the <interface>Nick Panel</interface>, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Show Nicklist</guisubmenu> </menuchoice> from the main menu.
tr: <interface>Takma Ad Paneli</interface>’ni gizlemek için ana menüden <menuchoice><guisubmenu>Ayarlar</guisubmenu> <guisubmenu>Takma Ad Listesini Göster</guisubmenu></menuchoice>’i seçin.

source: These are called the <interface>Quick Buttons</interface>. By default, they are not shown. To display them, see <link linkend="quick-buttons">Configuring Quick Buttons</link>. You can customize their definitions to whatever commands you wish.
tr: Bunlar, <interface>Tez Düğmeler</interface> olarak adlandırılır. Öntanımlı olarak gösterilmezler. Bunları görüntülemek için <link linkend="quick-buttons">Tez düğmeleri yapılandırmak</link> bölümüne bakın. Tanımlarını istediğiniz komutlara göre özelleştirebilirsiniz.

source: You can control how messages are displayed in the message scroll of channel and query tabs. For example, you can change the color of messages, play a sound when a message containing a string is received, or automatically reply to messages. See <link linkend="highlighting"> Message highlighting</link> for more information.
tr: Kanal ve sorgu sekmelerinin geçmişinde iletilerin nasıl görüntüleneceğini denetleyebilirsiniz. Örneğin, iletilerin rengini değiştirebilir, bir diziyi içeren bir ileti alındığında bir ses çalabilir veya iletileri kendiliğinden yanıtlayabilirsiniz. Daha fazla bilgi için <link linkend="highlighting">İletileri vurgulamak</link> bölümüne bakın.

source: Channel names sometimes begin with <userinput>&amp;</userinput>, <userinput>&plus;</userinput>, or <userinput>!</userinput>. The first character of a channel name determines the type of channel (RFC 2811) as follows: <itemizedlist> <listitem><para> <userinput>#</userinput> - Regular channels. </para></listitem> <listitem><para> <userinput>!</userinput> - Regular channels. </para></listitem> <listitem><para> <userinput>&amp;</userinput> - Local. Channels that can only be joined from the server hosting the channel. All other channels can be joined from any server in the network. </para></listitem> <listitem><para> <userinput>&plus;</userinput> - Channels that do not support channel modes. This means that all the modes are unset, with the exception of the 't' channel flag which is set. </para></listitem> </itemizedlist> Channel names are up to 50 characters long and may contain any characters except for space, comma, and Ctrl-G (^G or ASCII 7).
tr: Kanal adları bazen <userinput>&amp;</userinput>, <userinput>&plus;</userinput> veya <userinput>!</userinput> ile başlar. Bir kanal adının ilk karakteri kanalın türünü (RFC 2811) aşağıdaki gibi belirler: <itemizedlist> <listitem><para> <userinput>#</userinput> — Normal kanallar. </para></listitem> <listitem><para> <userinput>!</userinput> — Düzenli kanallar. </para></listitem> <listitem><para> <userinput>&amp;</userinput> — Yerel. Yalnızca kanalı barındıran sunucudan katılabilen kanallar. Diğer tüm kanallara ağdaki herhangi bir sunucudan katılınabilir. </para></listitem> <listitem><para> <userinput>&plus;</userinput> — Kanal kiplerini desteklemeyen kanallar. Bu, ayarlanmış olan “t” kanal bayrağı dışında tüm kiplerin ayarlanmadığı anlamına gelir.</para></listitem></itemizedlist> Kanal adları en fazla 50 karakter uzunluğundadır ve boşluk, virgül ve Kontrol-G (^G veya ASCII 7) dışında herhangi bir karakter içerebilir.

source: Quick Connect
tr: Tez Bağlan

source: Sometimes you want to connect to a server without going through the trouble of creating a new server in the <link linkend="serverlist">Server List</link>.
tr: <link linkend="serverlist">Sunucu Listesi</link> içinde bir sunucu oluşturma derdine katlanmadan tez bir sunucuya bağlanmak istersiniz.

source: Choose <menuchoice> <guisubmenu>File</guisubmenu> <guisubmenu>Quick Connect</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Quick Connect</guilabel> screen will appear.</action>
tr: Ana menüden <menuchoice> <guisubmenu>Dosya</guisubmenu> <guisubmenu>Tez Bağlan</guisubmenu> </menuchoice> ögesini seçin. <action><guilabel>Tez Bağlan</guilabel> ekranı görünür.</action>

source: The Quick Connect screen.
tr: Tez Bağlan ekranı.

source: The Quick Connect screen
tr: Tez Bağlan ekranı

source: Enter the server address in the <guilabel>Server host</guilabel> box, your desired &i18n-nickname; in the <guilabel>Nick</guilabel> box, and click the <guibutton>Connect</guibutton> button. When &konversation; has connected to the server, enter command <userinput><command>/join</command> <replaceable>#channelname</replaceable></userinput> to join a channel.
tr: <guilabel>Sunucu makine</guilabel> kutusuna sunucu adresini ve <guilabel>Takma ad</guilabel> kutusuna istediğiniz takma adı girip <guibutton>Bağlan</guibutton> düğmesine tıklayın. &konversation; sunucuya bağlandığında bir kanala bağlanmak için <userinput><command>/join</command> <replaceable>#kanaladı</replaceable></userinput> komutunu girin.

source: Frequently-used &irc; commands
tr: Sıkça kullanılan &irc; komutları

source: The following is a short list of frequently-used &irc; commands. See <ulink url="http://www.faqs.org/rfcs/rfc2812.html">RFC 2812</ulink> for a complete list of all commands, or visit <ulink url="https://www.irchelp.org/">irchelp.org</ulink>. For a list of commands treated specially by &konversation;, see <link linkend="konvi-cmds">&konversation; commands</link>.
tr: Aşağıda sık kullanılan &irc; komutlarının kısa bir listesi bulunmaktadır. Tüm komutların bir listesi için <ulink url="http://www.faqs.org/rfcs/rfc2812.html">RFC 2812</ulink> veya <ulink url="https://www.irchelp.org/">irchelp.org</ulink> sayfasına bakın. &konversation; tarafından özel olarak davranılan komutların bir listesi için <link linkend="konvi-cmds">&konversation; komutları</link> sayfasına bakın.

source: Lists commands available on the current server. Not supported by all servers.
tr: Geçerli sunucuda bulunan komutları listeler. Tüm sunucular tarafından desteklenmez.

source: <command>/help </command><replaceable>cmd</replaceable>
tr: <command>/help </command><replaceable>komut</replaceable>

source: Provides help for <userinput><replaceable>cmd</replaceable></userinput>. Not supported by all servers.
tr: <userinput><replaceable>komut</replaceable></userinput> için yardım sağlar. Tüm sunucular tarafından desteklenmez.

source: /join <replaceable>#channel</replaceable>
tr: /join <replaceable>#kanal</replaceable>

source: Joins <userinput><replaceable>#channel</replaceable></userinput>. If the channel does not already exist, it is created and you are the channel operator.
tr: <userinput><replaceable>#kanal</replaceable></userinput>’a katılır. Kanal halihazırda yoksa oluşturulur ve kanal operatörü siz olursunuz.

source: Leaves the current channel and closes the <interface>channel</interface> tab.
tr: <interface>Kanal</interface> sekmesini kapatır ve geçerli kanaldan çıkar.

source: <command>/part </command> <replaceable>#channel</replaceable>
tr: <command>/part </command> <replaceable>#kanal</replaceable>

source: Leaves <userinput><replaceable>#channel</replaceable></userinput> and closes the corresponding <interface>channel</interface> tab. Synonym for <userinput><command>/leave</command></userinput>
tr: <userinput><replaceable>#kanal</replaceable></userinput>’dan ayrılır ve ilgili<interface>kanal</interface> sekmesini kapatır. <userinput><command>/leave</command></userinput> ile eşanlamlıdır.

source: <command>/me </command><replaceable>msg</replaceable>
tr: <command>/me </command><replaceable>ileti</replaceable>

source: Sends <userinput><replaceable>msg</replaceable></userinput> to the channel preceded by your &i18n-nickname;. For example, if your &i18n-nickname; were <userinput><replaceable>Tux</replaceable></userinput>, typing <userinput><replaceable>/me brews a cup of tea.</replaceable></userinput> displays the message <interface>Tux brews a cup of tea.</interface> Unless they've filtered against these types of messages, all users see it. This kind of message is typically used to convey non-verbal information, such as your current emotional state, or what you are physically doing. If you are leaving your workstation for a short time, use the <userinput><command>/away</command></userinput> command instead.
tr: Önüne takma adınız gelecek biçimde kanala <userinput><replaceable>ileti</replaceable></userinput> gönderir. Örneğin, takma adınız <userinput><replaceable>Tux</replaceable></userinput> ise <userinput><replaceable>/me çay demliyor.</replaceable></userinput> yazarsanız <interface>Tux çay demliyor.</interface> olarak görünür. Özellikle engellenmediği sürece tüm kullanıcılar bu iletileri görürler. Bu tür iletiler genellikle sözlü olmayan bilgiyi aktarmak için kullanılır; örneğin, şu anki duygu durumunuz veya fiziksel olarak ne yaptığınız. İş istasyonunuzdan kısa bir süreliğine ayrılıyorsanız bunun yerine <userinput><command>/away</command></userinput> komutunu kullanın.

source: <command>/away </command> <replaceable>msg</replaceable>
tr: <command>/away </command> <replaceable>ileti</replaceable>

source: If anyone tries to send you a private message or invite you to a channel, they will be told that you are away from your workstation with <userinput><replaceable>msg</replaceable></userinput>.
tr: Herhangi biri size özel ileti göndermeye veya sizi bir kanala davet etmeye çalışırsa iş istasyonunuzdan uzakta olduğunuz <userinput><replaceable>ileti</replaceable></userinput> ile bildirilecektir.

source: Cancels an <userinput><command>/away </command> <replaceable>msg</replaceable></userinput> command.
tr: <userinput><command>/away </command> <replaceable>ileti</replaceable></userinput> komutunu iptal eder.

source: <command>/query </command><replaceable>nick</replaceable>
tr: <command>/query </command><replaceable>takma ad</replaceable>

source: Creates a new tab with the user's <userinput><replaceable>nick</replaceable></userinput> for private conversation, commonly known on &irc; as a <link linkend="query">Query</link>. Everything written here is only visible to you and your query partner.
tr: Genellikle &irc;’de <link linkend="query">sorgu</link> olarak bilinen özel sohbet için kullanıcının <userinput><replaceable>takma adı</replaceable></userinput> ile yeni bir sekme oluşturur. Burada yazılan her şey yalnızca siz ve sorgu ortağınız tarafından görülebilir.

source: <command>/msg </command><replaceable>nick</replaceable> <replaceable>msg</replaceable>
tr: <command>/msg </command><replaceable>takma ad</replaceable> <replaceable>ileti</replaceable>

source: Sends <userinput><replaceable>msg</replaceable></userinput> to the user with &i18n-nickname; <userinput><replaceable>nick</replaceable></userinput>. Only <userinput><replaceable>nick</replaceable></userinput> sees the message. Use <userinput><command>/query</command></userinput> for longer conversations.
tr: <userinput><replaceable>takma adlı</replaceable></userinput> kullanıcıya <userinput><replaceable>ileti</replaceable></userinput> gönderir. Yalnızca <userinput><replaceable>takma ad</replaceable></userinput> iletiyi görür. Daha uzun konuşmalar için <userinput><command>/query</command></userinput> komutunu kullanın.

source: <command>/invite </command><replaceable>nick</replaceable>
tr: <command>/invite </command><replaceable>takma ad</replaceable>

source: Invites the user with &i18n-nickname; <userinput><replaceable>nick</replaceable></userinput> to join a channel. This command is especially useful if the channel is invite-only.
tr: Şu <userinput><replaceable>takma adlı</replaceable></userinput> kullanıcıyı bir kanala katılmaya davet eder. Bu komut özellikle kanal yalnızca davetliyse kullanışlıdır.

source: Private conversations (queries)
tr: Özel Sohbetler (Sorgular)

source: A private conversation is one that only you and one other person can see. Private conversations are called "queries" in &konversation;. To initiate a private conversation, type <userinput><command>/query </command><replaceable>nick</replaceable></userinput> in any input line, where <replaceable>nick</replaceable> is the &i18n-nickname; of the person you want to talk with. You can also click with the &RMB; on the person's &i18n-nickname; in the <interface>Nick Panel</interface> and choose <menuchoice> <guisubmenu>Open Query</guisubmenu> </menuchoice>. <action>A new tab will be created.</action> Announce yourself by sending a message.
tr: Özel bir sohbet, yalnızca sizin ve bir başkasının görebileceği bir görüşmedir. Özel sohbetler, &konversation; içinde “sorgular” olarak bilinirler. Özel bir sohbet başlatmak için lütfen herhangi bir giriş satırında <userinput><command>/query </command><replaceable>takma ad</replaceable></userinput> girin; burada <replaceable>takma ad</replaceable>, konuşmak istediğiniz kişinin takma adıdır. Ayrıca bu kişinin <interface>takma ad panelindeki</interface> adına &RMB; ile tıklayabilir ve <menuchoice><guisubmenu>Sorgu Aç</guisubmenu></menuchoice> da diyebilirsiniz. <action>Yeni bir sekme oluşturulur.</action> Bir ileti göndererek kendinizi tanıtın.

source: Queries are just like channels, except that only you and the other person can participate in the channel.
tr: Sorgular tıpkı kanallar gibidir; ancak kanala yalnızca siz ve diğer kişi katılabilirsiniz.

source: To leave the query, just close the tab. Note however, that if the other person sends you another message in the query, the tab will open again.
tr: Sorgudan çıkmak için sekmeyi kapatmanız yeterlidir. Ancak, diğer kişi sorguda size başka bir ileti gönderirse sekmenin yeniden açılacağını unutmayın.

source: To leave all queries, choose <menuchoice> <guisubmenu>Window</guisubmenu> <guisubmenu>Close All Open Queries</guisubmenu> </menuchoice> on the main menu, or press <keycap>F11</keycap> key.
tr: Tüm sorgulardan ayrılmak için ana menüden <menuchoice><guisubmenu>Pencere</guisubmenu> <guisubmenu>Tüm Açık Sorguları Kapat</guisubmenu></menuchoice> yapın veya <keycap>F11</keycap> düğmesine basın.

source: When someone else initiates a query with you, &konversation; creates a new tab with their &i18n-nickname;. If you don't wish to talk with the person, close the tab.
tr: Başka biri sizinle bir sorgu başlattığında, &konversation; bu kişinin takma adıyla yeni bir sekme oluşturur. Eğer bu kişiyle konuşmak istemiyorsanız sekmeyi kapatın.

source: Setting notifications
tr: Bildirim ayarları

source: <guilabel>Notifications</guilabel> are actions that &konversation; will perform whenever an event occurs. Suppose you have &konversation; running, but minimized or hidden behind other application windows on your desktop. If someone wants to communicate with you, or your buddy joins a channel, you'd like to be alerted. Notifications will accomplish this.
tr: <guilabel>Bildirimler</guilabel>, bir olay meydana geldiğinde &konversation;’un gerçekleştireceği eylemlerdir. Diyelim ki &konversation; çalışıyor; ancak masaüstünüzdeki diğer uygulama pencerelerinin arkasına gizlenmiş veya simge durumuna küçültülmüş durumda. Birisi sizinle iletişim kurmak isterse veya arkadaşınız bir kanala katılırsa uyarılmak istersiniz. Bildirimler bunu gerçekleştirecektir.

source: To configure notifications, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Notifications</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Notification Settings</guilabel> screen will appear.</action>
tr: Bildirimleri yapılandırmak için ana menüden <menuchoice><guisubmenu>Ayarlar</guisubmenu> <guisubmenu>Bildirimleri Yapılandır</guisubmenu></menuchoice> yolunu izleyin. <action><guilabel>Bildirim Ayarları</guilabel> ekranı görünür olur.</action>

source: The Notification Settings screen.
tr: Bildirim Ayarları ekranı.

source: The Notification Settings screen
tr: Bildirim Ayarları ekranı

source: Click here to select an event.
tr: Bir olay seçmek için buraya tıklayın.

source: Check the types of notifications you'd like to happen when the event occurs. (<guilabel>Mark taskbar entry</guilabel> causes the entry in the taskbar to flash when the event occurs.)
tr: Olay gerçekleştiğinde olmasını istediğiniz bildirim türlerini işaretleyin (<guilabel>Görev çubuğu girdisini imle</guilabel>, olay gerçekleştiğinde görev çubuğundaki girdinin yanıp sönmesine neden olur).

source: Repeat by selecting another event and checking the notifications desired. When you've configured all the desired notifications, click the <guibutton>OK</guibutton> button.
tr: Başka bir olay seçerek ve istediğiniz bildirimleri denetleyerek yineleyin. İstediğiniz tüm bildirimleri yapılandırdığınızda <guibutton>Tamam</guibutton> düğmesine tıklayın.

source: Once you've set up your notifications, you can enable or disable all notifications using <menuchoice> <guisubmenu>Window</guisubmenu> <guisubmenu>Enable Notifications</guisubmenu> </menuchoice> on the main menu.
tr: Bildirimlerinizi ayarladıktan sonra, ana menüdeki <menuchoice><guisubmenu>Pencere</guisubmenu> <guisubmenu>Bildirimleri Etkinleştir</guisubmenu></menuchoice> seçeneğini kullanarak tüm bildirimleri etkinleştirebilir veya devre dışı bırakabilirsiniz.

source: You can also alert yourself when someone mentions your &i18n-nickname; in a message using &konversation;'s <link linkend="highlighting">highlighting feature</link>.
tr: Ayrıca &konversation;’un <link linkend="highlighting">vurgulama özelliğini</link> kullanarak bir iletide takma adınızdan söz edildiğinde kendinizi uyarabilirsiniz.

source: Monitoring who is online
tr: Kimin çevrimiçi olduğunu izlemek

source: &konversation; will keep you informed when your buddies are connected to the &irc; network or not.
tr: &konversation;, arkadaşlarınız &irc; ağına bağlı olduğunda veya olmadığında sizi bilgilendirecektir.
