Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konversation.po
Languages: tr

source: <!ENTITY i18n-nickname "<acronym>nickname</acronym>">
tr: <!ENTITY i18n-nickname "<acronym>takma ad</acronym>">

source: <!ENTITY i18n-Nickname "<acronym>Nickname</acronym>">
tr: <!ENTITY i18n-Nickname "<acronym>Takma ad</acronym>">

source: The &konversation; Handbook
tr: &konversation; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>İşbaran</firstname><surname>Akçayır</surname><affiliation><address><email>isbaran@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit> <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: &konversation; is a user-friendly &irc; client built on &Qt; and &kf5-full;.
tr: &konversation;, &Qt; ve &kf5-full; üzerine yapılı, kullanıcı dostu bir &irc; istemcisidir.

source: chat
tr: sohbet

source: communications
tr: iletişim

source: Introduction
tr: Giriş

source: &konversation; is an &irc; client built on &Qt; and &kf5-full;. It offers the following features:
tr: &konversation;, &Qt; ve &kf5-full; üzerine yapılı bir &irc; istemcisidir. Aşağıdaki özellikleri sunar:

source: SSL support.
tr: SSL desteği.

source: User-friendly tabbed interface.
tr: Kullanıcı dostu sekmeli arabirim.

source: Customizable Quick Buttons for often-used commands.
tr: Sık kullanılan komutlar için özelleştirilebilir Tez Düğmeler.

source: Automatic reconnect and rejoin.
tr: Kendiliğinden yeniden bağlanma ve katılma.

source: DCC send and receive.
tr: DCC ile gönder/al.

source: &i18n-Nickname; watch list.
tr: Takma ad izleme listesi.

source: Visual and auditory notifications for a wide variety of events, such as messages containing your &i18n-nickname;, or &i18n-nickname;s on your watch list going online or offline.
tr: Takma adınızı içeren iletiler veya izleme listenizdeki takma adların çevrimiçi veya çevrimdışı olması gibi çok çeşitli olaylar için görsel ve işitsel bildirimler.

source: Customizable highlighting of messages by &i18n-nickname; or regular expression pattern.
tr: İletilerin takma ad veya düzenli ifade dizgisine göre özelleştirilebilir şekilde vurgulanması.

source: &i18n-Nickname; completion.
tr: Takma ad tamamlaması.

source: Capture and save all &URL;s appearing in messages.
tr: İletilerinizde görülen tüm &URL;’lerin yakalanıp kaydedilmesi.

source: On-screen display of messages, even when minimized.
tr: Küçültülmüş olsalar bile iletilerinizin ekranda görüntülenmesi.

source: &i18n-Nickname; ignore list.
tr: Takma ad yok sayma listesi.

source: Automatic logging and log management.
tr: Kendiliğinden oturum açma ve oturum yönetimi.

source: Marking of lines in logs.
tr: Günlüklerde satırların imlenmesi.

source: Scripting.
tr: Betik yazımı desteği.

source: The &konversation; website is <ulink url="&konviwebsite;">&konviwebsite;</ulink>. Further information like a FAQ and tips and tricks you find in the <ulink url="https://userbase.kde.org/Konversation">&konversation; UserBase page</ulink>.
tr: &konversation; web sitesi <ulink url="&konviwebsite;">&konviwebsite;</ulink> adresindedir. SSS veya ipuçları gibi ek bilgileri <ulink url="https://userbase.kde.org/Konversation">&konversation; UserBase</ulink> sayfasında bulabilirsiniz.

source: Developers for &konversation; can often be contacted via &irc; at <ulink url="irc://irc.libera.chat/konversation">irc.libera.chat channel #konversation</ulink>.
tr: &konversation; geliştiricilerine genelde &irc; üzerinde <ulink url="irc://irc.libera.chat/konversation">irc.libera.chat sunucusunun #konversation kanalında</ulink> ulaşabilirsiniz.

source: Using &konversation;
tr: &konversation; Kullanımı

source: If you haven't used &irc; before...
tr: Daha önce hiç &irc; kullanmadıysanız…

source: Simply put, &irc; is a chat protocol, defined by official Internet standards, and capable of stealing many hours of your life. To use &irc;, you must connect to a server, and then join a channel (equivalent to a chat room) or just engage in private conversations.
tr: Basitçe söylemek gerekirse &irc;, resmi İnternet standartları tarafından tanımlanan ve hayatınızın birçok saatini çalabilecek bir sohbet protokolüdür. &irc;’yi kullanmak için yalnızca bir sunucuya bağlanmanız gerekir. Ardından bir kanala (sohbet odasına eşdeğer) katılabilir veya başkalarıyla doğrudan konuşabilirsiniz.

source: To connect to a server and channel, open &konversation;. The <guilabel>Server List</guilabel> screen appears.
tr: Bir sunucuya ve kanala katılmak için &konversation;’u açın. <guilabel>Sunucu Listesi</guilabel> ekranı görünür.

source: <screeninfo>Server List</screeninfo>
tr: <screeninfo>Sunucu Listesi</screeninfo>

source: <phrase>Server List</phrase>
tr: <phrase>Sunucu Listesi</phrase>

source: The list of configured &irc; <guilabel>Networks</guilabel> are listed here. An &irc; network is a collection of cooperating servers. You need only connect to one of the servers in the network to be connected to the entire &irc; network. Once connected, &konversation; will automatically join the <guilabel>Channels</guilabel> shown. When &konversation; is started for the first time, the <userinput><replaceable>Libera</replaceable></userinput> network and <userinput><replaceable>#kde</replaceable></userinput> channel are already entered for you. Click on a network to select it.
tr: Yapılandırılmış &irc; <guilabel>ağları</guilabel> burada listelenir. Bir &irc; ağı, gerekli koşulları yerine getiren bir sunucular topluluğudur. Tüm &irc; ağına bağlanabilmek için yalnızca ağdaki sunuculardan birine bağlanmanız yeterlidir. Bağlandıktan sonra &konversation; kendiliğinden gösterilen <guilabel>kanallara</guilabel> katılır. &konversation; ilk kez başlatıldığında, <userinput><replaceable>Libera</replaceable></userinput> ağı ve <userinput><replaceable>#kde</replaceable></userinput> kanalı sizin için önceden girilmiştir. Kendisini seçmek için bir ağa tıklayın.

source: Click here to define a new <guilabel>Network</guilabel>, including the server to connect to, and the <guilabel>Channels</guilabel> to automatically join once connected. See <link linkend="serverlist">Defining new networks, servers, and auto join channels</link> for more information.
tr: Bağlanılacak sunucuyu içeren yeni bir <guilabel>ağ</guilabel> tanımlamak ve <guilabel>kanallara</guilabel> bağlandıktan sonra kendiliğinden katılmak için buraya tıklayın. Daha fazla bilgi için <link linkend="serverlist">Yeni ağlar, sunucular ve kendiliğinden katılınacak kanallar tanımlamak</link> bölümüne bakın.

source: Click here to connect to the selected &irc; network and channel.
tr: Seçili &irc; ağına ve kanalına bağlanmak için buraya tıklayın.

source: When you click the <guibutton>Connect</guibutton> button the first time you open &konversation;, you may see the following message, telling you that your default <guilabel>identity</guilabel> is not set up correctly.
tr: &konversation;’u ilk kez açıp <guibutton>Bağlan</guibutton> düğmesine tıkladığınızda, öntanımlı <guilabel>kimliğinizin</guilabel> doğru ayarlanmadığını gösteren bir iletiyle karşılaşabilirsiniz.

source: <screeninfo>Check Identities</screeninfo>
tr: <screeninfo>Kimlikleri Denetle</screeninfo>

source: <phrase>Check Identities</phrase>
tr: <phrase>Kimlikleri Denetle</phrase>

source: The first time you open &konversation; it obtains information about the current user from the operating system and fills in defaults for the Identity. If the operating system user information is not complete, for example, no Full Name is defined, you may see the message above. To correct this problem, click <guibutton>Edit Identity...</guibutton> and see <link linkend="identity">Setting your identity</link> for more information.
tr: &konversation;’u ilk kez açtığınızda, işletim sisteminizden geçerli kullanıcı hakkında bilgiler toplar ve kimliğiniz için olacak öntanımlıları doldurur. Sistem kullanıcısı hakkında işletim sisteminde yeterli bilgi yoksa; örneğin, tam adınız belirtilmemişse yukarıdaki iletiyi görebilirsiniz. Bu sorunu düzeltmek için <guibutton>Kimliği Düzenle…</guibutton> düğmesine tıklayın ve daha fazla bilgi için <link linkend="identity">Kimliğinizi ayarlamak</link> bölümüne bakın.

source: The <interface>Main</interface> screen will be displayed showing the messages sent by the server to the client. (If &konversation; will not connect to the server, see <link linkend="faq">Questions and Answers</link>.) When the server messages have finished scrolling past, &konversation; will join the channel or channels chosen.
tr: <interface>Ana</interface> ekranda, sunucu tarafından istemciye gönderilen iletileri görebilirsiniz (&konversation; sunucuya bağlanamazsa <link linkend="faq">Sorular ve Yanıtlar</link> bölümüne bakın). Sunucu iletileri gönderilmesi bittiğinde &konversation;, seçili kanala veya kanallara katılır.

source: Channel.
tr: Kanal.

source: <phrase>Channel</phrase>
tr: <phrase>Kanal</phrase>

source: This is called the <interface>Input Line</interface>. To send a message to everyone in the channel, type the message here and press &Enter;. Your message, as well as everyone else's messages appear in the channel scroll above. Each message is preceded by the time and the user's &i18n-nickname;.
tr: Buna <interface>Giriş Satırı</interface> denir. Kanaldaki herkese bir ileti göndermek için iletinizi buraya yazın ve &Enter; düğmesine basın. İletiniz ve diğer herkesin iletileri yukarıdaki kanal geçmişinde görünür. Her iletinin önünde saat ve kullanıcının takma adı bulunur.

source: You may join additional servers and channels. Each server, channel, channel list, and other screen gets a separate tab here. To display a list of available channels, see <link linkend="list-channels">Listing available channels</link>. To join a channel, type: <userinput><command>/join</command> <replaceable>#channelname</replaceable></userinput> in the Input Line. (The <userinput>#</userinput> is required.) You may also type <userinput><command>/j</command></userinput> as a shorthand to <userinput><command>/join</command></userinput>. To leave a channel, just type <userinput><command>/part</command></userinput>. To switch the display to a different server or channel, click the corresponding tab.
tr: Başka kanallara ve sunuculara da katılabilirsiniz. Her bir sunucu, kanal, kanal listesi ve başka bir olası ekran kendi sekmesine iyedir. Kullanılabilir kanalların bir listesini görmek için <link linkend="list-channels">Kullanılabilir kanalları listelemek</link> bölümüne bakın. Bir kanala katılmak için giriş satırına <userinput><command>/join</command> <replaceable>#kanaladı</replaceable></userinput> yazın (<userinput>#</userinput> gereklidir). <userinput><command>/join</command></userinput> komutunun kısaltılmış bir hali olarak <userinput><command>/j</command></userinput> de yazabilirsiniz. Bir kanaldan ayrılmak için yalnızca <userinput><command>/part</command></userinput> yazın. Görüntüyü başka bir sunucuya veya kanala değiştirmek için ilgili sekmeye tıklayın.

source: This is called the <interface>Nick Panel</interface>. It lists the &i18n-nickname;s of all the users who have joined the channel, including yourself.
tr: Buna <interface>Takma Ad Paneli</interface> denir. Sizi de içerecek biçimde, kanala katılan tüm kullanıcıların takma adlarını listeler.

source: That's the basics, for more detailed information, read on...
tr: Bunlar temel bilgilerdir; daha ayrıntılı bilgi için okumayı sürdürün…

source: Setting your identity
tr: Kimliğinizi ayarlamak

source: Before you start using &konversation; regularly, you should set how you will be identified on the network.
tr: &konversation;’u düzenli olarak kullanmaya başlamadan önce, ağ üzerinde nasıl tanımlanacağınızı ayarlamalısınız.

source: Click <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Identities</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Identities</guilabel> screen will appear. You can also display the <guilabel>Identities</guilabel> screen by clicking the <guibutton>Edit</guibutton> button on the <guilabel>Edit Network</guilabel> or <guilabel>New Network</guilabel> screen.</action>
tr: Ana menüden <menuchoice> <guisubmenu>Ayarlar</guisubmenu> <guisubmenu>Kimlikler</guisubmenu> </menuchoice> bölümüne tıklayın. <action><guilabel>Kimlikler</guilabel> ekranı görünür. Ayrıca, <guilabel>Kimlikler</guilabel> ekranını <guilabel>Ağı Düzenle</guilabel> veya <guilabel>Yeni Ağ</guilabel> ekranındaki <guibutton>Düzenle</guibutton> düğmesini kullanarak da çağırabilirsiniz.</action>

source: <screeninfo>Identities (General tab)</screeninfo>
tr: <screeninfo>Kimlikler (Genel Sekme)</screeninfo>

source: <phrase>Identities (General tab)</phrase>
tr: <phrase>Kimlikler (Genel Sekme)</phrase>

source: Click here to select an <guilabel>Identity</guilabel> to edit.
tr: Düzenlemek üzere bir <guilabel>kimlik</guilabel> seçmek için buraya tıklayın.

source: Use these buttons to <guibutton>Add</guibutton>, <guibutton>Duplicate</guibutton>, <guibutton>Rename</guibutton>, or <guibutton>Remove</guibutton> an <guilabel>Identity</guilabel>.
tr: Bir <guilabel>kimlik</guilabel> <guibutton>eklemek</guibutton>, <guibutton>çoğaltmak</guibutton>, <guibutton>yeniden adlandırmak</guibutton> veya <guibutton>kaldırmak</guibutton> için bu düğmeleri kullanın.

source: Enter your real name here. &irc; is not intended to keep you hidden from your friends or enemies. Keep this in mind if you are tempted to behave maliciously. A fake "real name" can be a good way to mask your gender from all the nerds out there, but the PC you use can always be traced so you will never be truly anonymous.
tr: Buraya gerçek adınızı girin. &irc; sizi arkadaşlarınızdan veya düşmanlarınızdan gizlemek için tasarlanmamıştır. Kötü niyetli davranmak isterseniz bunu aklınızda bulundurun. Sahte bir “gerçek ad”, cinsiyetinizi dışarıdaki tüm ineklerden gizlemek için iyi bir yol olabilir; ancak kullandığınız bilgisayar her zaman izlenebilir, bu nedenle asla gerçekten anonim olmayacaksınız.

source: Use these buttons to <guibutton>Add</guibutton> or <guibutton>Remove</guibutton> a &i18n-nickname;.
tr: Bir takma ad <guibutton>eklemek</guibutton> veya <guibutton>kaldırmak</guibutton> için bu düğmeleri kullanın.

source: This is your list of &i18n-nickname;s. A &i18n-nickname; is the name that other users will know you by. You may use any name you desire. The first character must be a letter. Other characters may be letters, numbers, or the special characters <literal>-[]\`_^{}|</literal>.
tr: Bu, sizin takma adlar listenizdir. Bir takma ad, sizi başkalarının tanımak için kullanacağı addır. İstediğiniz herhangi bir adı kullanabilirsiniz. İlk karakter bir harf olmalıdır. Diğer karakterler harfler, sayılar veya <literal>-[]\`_^{}|</literal> özel karakterleri olabilir.

source: Since &i18n-nickname;s must be unique across an entire &irc; network, your desired name may be rejected by the server because someone else is already using that &i18n-nickname;. Enter alternate &i18n-nickname;s for yourself. If your first choice is rejected by the server, &konversation; will try the alternate &i18n-nickname;s.
tr: Takma adların tüm &irc; ağında benzersiz olması gerektiğinden, istediğiniz ad, o adı başkası kullandığından dolayı sunucu tarafından reddedilebilir. Bu durumda başka alternatif takma adlar deneyin. İlk denemeniz sunucu tarafından reddedilirse &konversation;, sizin için alternatif takma adlar dener.

source: According to RFC 2812, the maximum &i18n-nickname; length is 9, but this is actually determined by the server. To determine the maximum for a server, connect to the server. In the <interface>Server Messages</interface> tab, look for a <computeroutput>[Support]</computeroutput> message. For example:
tr: RFC 2812’ye göre, en çok takma ad uzunluğu 9’dur; ancak bu aslında sunucu tarafından belirlenir. Bir sunucu için en büyük uzunluğu belirlemek için sunucuya bağlanın. <interface>Sunucu İletileri</interface> sekmesinde, bir <computeroutput>[Support]</computeroutput> iletisi arayın. Örneğin:

source: The <computeroutput>NICKLEN</computeroutput> parameter specifies the maximum &i18n-nickname; length.
tr: <computeroutput>NICKLEN</computeroutput> parametresi, en büyük takma ad uzunluğunu belirtir.

source: Use these buttons to change the order of the &i18n-nickname;s. The top &i18n-nickname; is tried first, then the next &i18n-nickname;, and so on.
tr: Takma adların sırasını değiştirmek için bu düğmeleri kullanın. Önce takma ad, sonra bir sonraki takma ad denenir ve bu böyle sürer.

source: If you have registered your &i18n-nickname; with the &irc; network, enter the service and password to authenticate your &i18n-nickname;. When &konversation; connects, it will automatically send <userinput><command>/msg</command> <replaceable>service</replaceable> <command>IDENTIFY</command> <replaceable>password</replaceable></userinput> to the server. If you don't know what this is, leave these boxes blank.
tr: Takma adınızı &irc; ağında kaydettiyseniz kimlik doğrulama için hizmet ve parolanızı girin. &konversation; bağlandığında, <userinput><command>/msg</command> <replaceable>hizmet</replaceable> <command>IDENTIFY</command> <replaceable>parola</replaceable></userinput> komutunu sunucuya gönderir. Bunun ne olduğunu bilmiyorsanız boş bırakın.

source: Click the <guilabel>Away</guilabel> tab.
tr: <guilabel>Uzakta</guilabel> sekmesine tıklayın.

source: <screeninfo>Identities (Away tab)</screeninfo>
tr: <screeninfo>Kimlikler (Uzakta Sekmesi)</screeninfo>

source: <phrase>Identities (Away tab)</phrase>
tr: <phrase>Kimlikler (Uzakta Sekmesi)</phrase>

source: Enter a &i18n-nickname; that indicates you are away. Whenever you perform an <userinput><command>/away </command><replaceable>msg</replaceable></userinput> command in any channel joined with this <guilabel>Identity</guilabel>, &konversation; will automatically change your &i18n-nickname; to the <guilabel>Away nickname</guilabel>. Other users will be able to tell you are away from your computer. Whenever you perform an <userinput><command>/away</command></userinput> command in any channel in which you are away, &konversation; will automatically change your &i18n-nickname; back to the original. If you do not wish to automatically change your &i18n-nickname; when going away, leave blank.
tr: Sizin uzakta olduğunuzu belirten bir takma ad girin. Bu <guilabel>kimlikle</guilabel> bağlandığınız herhangi bir kanalda <userinput><command>/away </command><replaceable>ileti</replaceable></userinput> komutu girdiğinizde, &konversation; takma adınızı kendiliğinden <guilabel>Uzakta Takma Ad</guilabel> olarak değiştirir. Diğer kullanıcılar artık sizin bilgisayarınızdan uzakta olduğunuzu anlayabileceklerdir. Uzakta olduğunuz herhangi bir kanalda <userinput><command>/away</command></userinput> komutunu girdiğinizde, &konversation; takma adınızı özgün haline geri döndürecektir. Uzağa giderken takma adınızı kendiliğinden değiştirmek istemiyorsanız bunu boş bırakın.

source: If you check this box, whenever you perform an <userinput><command>/away</command></userinput> command, a horizontal line will appear in the channel, marking the point where you went away. Other &irc; users do not see this horizontal line.
tr: Bu kutuyu işaretlerseniz her <userinput><command>/away</command></userinput> komutu verdiğinizde, kanalda uzaklaştığınız noktayı işaretleyen yatay bir çizgi belirecektir. Diğer &irc; kullanıcıları bu yatay çizgiyi görmez.

source: If you check this box, &konversation; will automatically send the <guilabel>Away command</guilabel> to all channels joined with this <guilabel>Identity</guilabel>. <userinput><replaceable>%s</replaceable></userinput> is replaced with <userinput><replaceable>msg</replaceable></userinput>. Whenever you perform an <userinput><command>/away</command></userinput> command, the <guilabel>Return command</guilabel> will be displayed in all channels joined with this <guilabel>Identity</guilabel>.
tr: Bu kutuyu işaretlerseniz &konversation;, bu <guilabel>kimlikle</guilabel> bağlandığınız tüm kanallara kendiliğinden <guilabel>uzakta komutunu</guilabel> gönderir. <userinput><replaceable>%s</replaceable></userinput>, <userinput><replaceable>msg</replaceable></userinput> ile değiştirilir. Ne zaman bir <userinput><command>/away</command></userinput> komutunu verirseniz bu <guilabel>kimlikle</guilabel> bağlandığınız tüm kanallarda <guilabel>dönüş</guilabel> komutu görüntülenir.

source: Away messages are often considered annoying by other users. Use this option carefully, with consideration for your fellow &irc; users.
tr: Uzakta iletileri genellikle diğer kullanıcılar tarafından rahatsız edici olarak değerlendirilir. Bu seçeneği diğer &irc; kullanıcılarını düşünerek dikkatli bir şekilde kullanın.

source: Click the <guilabel>Advanced</guilabel> tab.
tr: <guilabel>Gelişmiş</guilabel> sekmesine tıklayın.

source: <screeninfo>Identities (Advanced tab)</screeninfo>
tr: <screeninfo>Kimlikler (Gelişmiş Sekmesi)</screeninfo>

source: <phrase>Identities (Advanced tab)</phrase>
tr: <phrase>Kimlikler (Gelişmiş Sekmesi)</phrase>

source: You can enter a command here that will be executed before connecting to the server. If this identity is used for more than one server, the command will be executed for each server.
tr: Buraya sunucuya bağlanmadan önce yürütülecek bir komut girebilirsiniz. Bu kimlik birden fazla sunucu için kullanılıyorsa komut her sunucu için yürütülecektir.

source: This setting affects how characters you type are encoded for sending to the server. It also affects how messages are displayed. When you first open &konversation;, it automatically retrieves this setting from the operating system. If you seem to be having trouble seeing other user's messages correctly, try changing this setting.
tr: Bu ayar, yazdığınız karakterlerin sunucuya gönderilmek üzere nasıl kodlanacağını ve iletilerin nasıl görüntüleneceğini etkiler. &konversation;’u ilk açtığınızda, bu ayarı işletim sisteminden kendiliğinden alır. Diğer kullanıcıların iletilerini doğru şekilde görmekte sorun yaşıyorsanız bu ayarı değiştirmeyi deneyin.

source: When you connect, many servers query your computer for an IDENT response. If your computer is not running an IDENT server, this response is sent by &konversation;. No spaces are allowed. Your first name is suggested.
tr: Bağlandığınızda, birçok sunucu IDENT yanıtı için bilgisayarınızı sorgular. Bilgisayarınız bir IDENT sunucusu çalıştırmıyorsa bu yanıt &konversation; tarafından gönderilir. Boşluğa izin verilmez. İlk adınız önerilmektedir.

source: Whenever you leave a channel, this message is sent to the channel.
tr: Bir kanaldan her ayrıldığınızda, bu ileti kanala gönderilir.

source: Whenever you are kicked from a channel (usually by an &irc; operator), this message is sent to the channel.
tr: Bir kanaldan kovulduğunuzda (genellikle bir &irc; operatörü tarafından), bu ileti kanala gönderilir.

source: Click to apply your changes. In order for all the changes to take effect, you must disconnect from the server and re-connect. The easiest way to do that is to quit &konversation; and restart.
tr: Değişikliklerinizi uygulamak için tıklayın. Tüm değişikliklerin etkili olması için sunucuyla bağlantınızı kesmeli ve yeniden bağlanmalısınız. Bunu yapmanın en kolay yolu &konversation;’dan çıkmak ve yeniden başlatmaktır.

source: Defining new networks, servers and auto join channels
tr: Yeni ağlar, sunucular ve kendiliğinden katılım kanalları tanımlamak
