Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konversation.po
Languages: tr

source: <guimenu>Bookmarks</guimenu> <guimenuitem>New Bookmark Folder...</guimenuitem>
tr: <guimenu>Yer İmleri</guimenu><guimenuitem>Yeni Yer İmi Klasörü…</guimenuitem>

source: Creates a new bookmark folder.
tr: Yeni bir yer imi klasörü oluşturur.

source: <guimenu>Bookmarks</guimenu> <guimenuitem>Edit Bookmarks...</guimenuitem>
tr: <guimenu>Yer İmleri</guimenu> <guimenuitem>Yer İmlerini Düzenle…</guimenuitem>

source: Opens bookmark editor.
tr: Yer imi düzenleyicisini açar.

source: The Settings Menu
tr: Ayarlar Menüsü

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Nicklist</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Ayarlar</guimenu> <guimenuitem>Takma Ad Listesini Göster</guimenuitem>

source: Hides (or displays) the panel of &i18n-nickname;s in channel tabs.
tr: Kanal sekmelerindeki takma adlar panelini gizler veya görüntüler.

source: <shortcut><keycap>F8</keycap></shortcut> <guimenu>Settings</guimenu> <guimenuitem>Identities...</guimenuitem>
tr: <shortcut><keycap>F8</keycap></shortcut> <guimenu>Ayarlar</guimenu> <guimenuitem>Kimlikler…</guimenuitem>

source: Displays the <link linkend="identity">Identities</link> screen for setting your identification information.
tr: Kimlik bilginizi girebilmeniz için <link linkend="identity">Kimlikler</link> ekranını görüntüler.

source: The Window Menu
tr: Pencere Menüsü

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>,</keycap></keycombo> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Previous Tab</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>,</keycap></keycombo> </shortcut> <guimenu>Pencere</guimenu> <guimenuitem>Önceki Sekme</guimenuitem>

source: Displays the screen corresponding to the previous tab.
tr: Önceki sekmeye karşılık gelen ekranı görüntüler.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>.</keycap></keycombo> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Next Tab</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>.</keycap></keycombo> </shortcut> <guimenu>Pencere</guimenu> <guimenuitem>Sonraki Sekme</guimenuitem>

source: Displays the screen corresponding to the next tab.
tr: Sonraki sekmeye karşılık gelen ekranı görüntüler.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Close Tab</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>Pencere</guimenu> <guimenuitem>Sekmeyi Kapat</guimenuitem>

source: Closes the current screen. If closing a channel, leaves the channel. If closing a <interface>Server Messages</interface> tab, closes all open channels on that server and disconnects from the server.
tr: Geçerli ekranı kapatır. Bir kanal kapatılıyorsa o kanaldan ayrılır. <interface>Sunucu İletileri</interface> sekmesini kapatmak, o sunucudaki tüm açık kanalları kapatır ve sunucu bağlantısını keser.

source: <shortcut> <keycap>F11</keycap> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Close All Open Queries</guimenuitem>
tr: <shortcut> <keycap>F11</keycap> </shortcut> <guimenu>Pencere</guimenu> <guimenuitem>Tüm Açık Sohbetleri Kapat</guimenuitem>

source: Closes all <link linkend="query">Private conversations (queries)</link>.
tr: Tüm <link linkend="query">özel konuşmaları (sorguları)</link> kapatır.

source: <shortcut> <keycap>F4</keycap> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Watched Nicks</guimenuitem>
tr: <shortcut> <keycap>F4</keycap> </shortcut> <guimenu>Pencere</guimenu> <guimenuitem>İzlenen Takma Adlar</guimenuitem>

source: Displays the <guilabel>Watched Nicks</guilabel> screen. See <link linkend="nicksonline">Monitoring who is online</link>.
tr: <guilabel>İzlenen Takma Adlar</guilabel> ekranını görüntüler. <link linkend="nicksonline">Kimin çevrimiçi olduğunu izlemek</link> bölümüne bir göz atın.

source: <shortcut> <keycap>F6</keycap> </shortcut> <guimenu>Window</guimenu> <guimenuitem>&URL; Catcher</guimenuitem>
tr: <shortcut> <keycap>F6</keycap> </shortcut> <guimenu>Pencere</guimenu> <guimenuitem>&URL; Yakalayıcısı</guimenuitem>

source: Displays the <link linkend="urlcatcher">&URL; Catcher</link> screen.
tr: <link linkend="urlcatcher">&URL; Yakalayıcısı</link> ekranını görüntüler.

source: <shortcut> <keycap>F9</keycap> </shortcut> <guimenu>Window</guimenu> <guimenuitem>DCC Status</guimenuitem>
tr: <shortcut> <keycap>F9</keycap> </shortcut> <guimenu>Pencere</guimenu> <guimenuitem>DCC Durumu</guimenuitem>

source: Displays the <link linkend="dcc">DCC Status</link> tab with information about file transfers.
tr: <link linkend="dcc">DCC Durumu</link> sekmesini, dosya aktarımları bilgisiyle birlikte gösterir.

source: <guimenu>Window</guimenu> <guimenuitem>New Konsole</guimenuitem>
tr: <guimenu>Pencere</guimenu> <guimenuitem>Yeni Konsole</guimenuitem>

source: Displays a terminal screen. You may open as many <guilabel>Konsole</guilabel> tabs as you like.
tr: Bir uçbirim ekranı görüntüler. İstediğiniz sayıda <guilabel>Konsole</guilabel> sekmesi açabilirsiniz.

source: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Channel List for</guimenuitem>
tr: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>Pencere</guimenu> <guimenuitem>… Kanalları Listesi</guimenuitem>

source: Displays a <link linkend="list-channels">list of channels</link> available on the server.
tr: Sunucuda bulunabilecek <link linkend="list-channels">kanalların listesini</link> görüntüler.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Open Logfile for</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Pencere</guimenu> <guimenuitem>… Günlük Dosyasını Aç</guimenuitem>

source: Displays a screen with the log of messages from the current tab. Only works for <interface>Channel</interface>, <interface>Server Messages</interface>, and <interface>Query</interface> tabs. Logging must be enabled in <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> <guisubmenu>Behavior</guisubmenu> <guisubmenu>Logging</guisubmenu> </menuchoice> on the main menu.
tr: Geçerli sekmeden günlük iletileri olan bir ekram görüntüler. Yalnızca <interface>kanal</interface>, <interface>sunucu iletileri</interface> ve <interface>sohbet</interface> sekmelerinde çalışır. Günlükleme davranışı, ana menüden <menuchoice> <guisubmenu>Ayarlar</guisubmenu> <guisubmenu>Konversation Uygulamasını Yapılandır…</guisubmenu> <guisubmenu>Davranış</guisubmenu> <guisubmenu>Günlükleme</guisubmenu> </menuchoice> sayfasından değiştirilebilir.

source: The Help Menu
tr: Yardım Menüsü

source: &konversation; has the common &kde; <guimenu>Help</guimenu> menu item, for more information read the section about the <ulink url="help:/fundamentals/menus.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
tr: &konversation;, ortak &kde; <guimenu>Yardım</guimenu> menü ögesini kullanır, daha fazla bilgi için &kde; Temelleri’nin <ulink url="help:/fundamentals/menus.html#menus-help">Yardım Menüsü</ulink> bölümüne bakın.

source: Questions and Answers
tr: Sorular ve Yanıtlar

source: When I start &konversation;, I'd like to connect to a server without joining any channels. How do I do that?
tr: &konversation;’u başlattığımda herhangi bir kanala bağlanmadan kendiliğinden bir sunucuya bağlanmak istiyorum. Bunu nasıl yaparım?

source: In the <link linkend="serverlist-addnetwork">Edit Server</link> screen, leave the <guilabel>Channels</guilabel> frame empty.
tr: <link linkend="serverlist-addnetwork">Sunucuyu Düzenle</link> ekranında <guilabel>Kanallar</guilabel> çerçevesini boş bırakın.

source: &konversation; won't connect to any servers. What is wrong?
tr: &konversation; hiçbir sunucuya bağlanamıyor. Sorun nedir?

source: There are several things that could be wrong.
tr: Yanlış gidebilecek birçok şey vardır.

source: Make sure that you have entered the correct <guilabel>Server name</guilabel> and the correct <guilabel>Port</guilabel> in the <link linkend="serverlist-addserver">Add Server</link> screen.
tr: <link linkend="serverlist-addserver">Sunucu Ekle</link> ekranında doğru <guilabel>sunucu adını</guilabel> ve doğru <guilabel>kapı</guilabel> numarasını girdiğinizden emin olun.

source: Check the output in the <link linkend="channel-screen-tour">Server Messages</link> screen for any error messages. Did the server reject the connection because of a bad password? Did the server reject the connection because it requires <acronym>IDENTD</acronym> and your computer did not respond to the <acronym>IDENT</acronym> request? Did you check the SSL protocol box but the server does not support SSL?
tr: <link linkend="channel-screen-tour">Sunucu İletileri</link> ekranında herhangi bir hata iletisi var mı diye bakın. Sunucu kötü bir parola nedeniyle mi bağlantıyı reddetti? Sunucu, <acronym>IDENTD</acronym> gerektirdiği ve bilgisayarınız <acronym>IDENT</acronym> isteğine yanıt vermediği için mi bağlantıyı reddetti? SSL protokol kutusunu denetlediniz; ancak sunucu SSL’yi desteklemiyor mu?

source: If you are behind a firewall, make sure the correct ports are enabled. &konversation; needs the following ports enabled:
tr: Bir güvenlik duvarı arkasındaysanız lütfen doğru kapıların açık olduğundan emin olun. &konversation;’a aşağıdaki kapılar gerekir:

source: Outgoing TCP 6667 (or the port of the server you connect to)
tr: Giden TCP 6667 (veya bağlandığınız sunucunun kapısı)

source: Incoming TCP 113 (if the server requires IDENTD)
tr: Gelen TCP 113 (IDENTD gerektiriyorsa)

source: For more information on &irc; connection problems, see <ulink url="https://github.com/irchelp/wio/blob/gh-pages/networks/connectprob.md">irchelp.org</ulink>.
tr: &irc; bağlantı sorunları için <ulink url="https://github.com/irchelp/wio/blob/gh-pages/networks/connectprob.md">irchelp.org</ulink> adresine bir bakın.

source: When I go to <menuchoice> <guimenu>Window</guimenu> <guisubmenu>Channel List</guisubmenu> </menuchoice>, I cannot select it. Why is that?
tr: <menuchoice> <guimenu>Pencere</guimenu> <guisubmenu>Kanal Listesi</guisubmenu> </menuchoice> ögesine gittiğimde onu seçemiyorum. Neden ki?

source: The <menuchoice> <guimenu>Window</guimenu> <guisubmenu>Channel List</guisubmenu> </menuchoice> menu entry will be grayed-out if a non-channel tab, &eg; <guilabel>Watched Nicks</guilabel>, is currently being viewed. To make it selectable again go back to a channel tab or the server tab.
tr: <menuchoice> <guimenu>Pencere</guimenu> <guisubmenu>Kanal Listesi</guisubmenu> </menuchoice> menü girdisi, şu anda kanal olmayan bir pencere görüntüleniyorsa devre dışı olacaktır; örneğin, <guilabel>İzlenen Takma Adlar</guilabel> gibi. Onu yeniden seçilebilir yapmak için bir kanal veya sunucu sekmesine geri gitmeniz yeterlidir.

source: How do I have &konversation; automatically mark me as away after a period of inactivity?
tr: Belirli bir süre hareketsiz kaldıktan sonra &konversation;’un beni kendiliğinden uzakta olarak imlemesini nasıl sağlarım?

source: Auto-away messages are configured on a per-identity basis. To enable auto-away select <menuchoice><guimenu>Settings</guimenu><guimenuitem>Identities</guimenuitem></menuchoice>. Choose the identity for which you want to enable auto-away from the drop down list at the top of the dialog and go to the <guilabel>Away</guilabel> tab. Check the <guilabel>Automatic Away</guilabel> option.
tr: Kendiliğinden uzakta iletileri, kimliğe bağlı olarak yapılandırılır. Kendiliğinden uzakta işlevini etkinleştirmek için <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Kimlikler</guimenuitem></menuchoice> sayfasına gidin. Kendiliğinden uzakta işlevini etkinleştirmek için kullandığınız kimliği seçin ve <guilabel>Uzakta</guilabel> sekmesine gidin. <guilabel>Kendiliğinden uzakta</guilabel> kutusunu işaretleyin.

source: How to avoid the <guilabel>Auto Replace</guilabel> feature of the <interface>Input Line</interface>?
tr: <interface>Giriş Satırı</interface>’nın <guilabel>kendiliğinden değiştir</guilabel> özelliğini nasıl kapatırım?

source: Use <keycombo action="simul">&Ctrl;&Enter;</keycombo> instead of just &Enter; to avoid parsing and automatically replacing the text in the <interface>Input Line</interface> according to the options in the settings dialog page <menuchoice><guimenu>Behavior</guimenu> <guimenuitem>Auto Replace</guimenuitem></menuchoice>.
tr: Ayarlar’dan <menuchoice><guimenu>Davranış</guimenu> <guimenuitem>Kendiliğinden Değiştir</guimenuitem></menuchoice> sayfasındaki ayarlara göre yalnızca &Enter; yerine <keycombo action="simul">&Ctrl;&Enter;</keycombo> kullanarak <interface>Giriş Satırı</interface>’ndaki metnin kendiliğinden ayrıştırılıp bir değiştirme uygulanmasını engelleyebilirsiniz.

source: Where can I find the scripts included with &konversation;?
tr: &konversation; ile gelen betikler nerede?

source: Run this command in &konversation;'s input line (using the media script as an example, since it comes with any &konversation; installation):
tr: Bu komutu &konversation;’ın giriş satırında çalıştırın (&konversation;’da geldiği için ortam betiğini örnek olarak kullanarak):

source: Sample output: <replaceable>The script file 'media' was found at: /usr/share/konversation/scripts/media</replaceable>
tr: Örnek çıktı: <replaceable>The script file 'media' was found at: /usr/share/konversation/scripts/media</replaceable>

source: How do I make my text bold/italicized/underlined?
tr: Metini nasıl kalın/yatık/altı çizgili yapabilirim?

source: Example: <userinput>This is my %Bbold%B text.</userinput>
tr: Örnek: <userinput> Bu %Bsözcük%B kalın.</userinput>

source: Output:
tr: Çıktı:

source: Example: <userinput>This is my %Iitalicized%I text.</userinput>
tr: Örnek: <userinput> Bu %Isözcük%I yatık.</userinput>

source: Example: <userinput>This is my %Uunderlined%U text.</userinput>
tr: Örnek: <userinput> Bu %Usözcüğün%U altı çizili.</userinput>

source: Example: <userinput>This is my %Sstruck-out%S text.</userinput>
tr: Örnek: <userinput> Bu %Ssözcüğün%S üzeri çizili.</userinput>

source: Example: <userinput>This is my %Mmonospace%M text.</userinput>
tr: Örnek: <userinput> Bu %Msözcüğün%M yazıtipi eş aralıklı.</userinput>

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Program copyright 2002-2005 by the &konversation; team.
tr: Program telif hakkı &konversation; takımı, 2002–2005.

source: Contributors:
tr: Katkıcılar:

source: Ismail Donmez <email>ismail.donmez@boun.edu.tr</email>
tr: İsmail Dönmez <email>ismail.donmez@boun.edu.tr</email>

source: Thanks to:
tr: Teşekkürler:

source: Documentation Copyright &copy; 2003-2005 Gary R. Cramblitt <email>garycramblitt@comcast.net</email>
tr: Belgelendirme telif hakkı &copy; 2003–2005 Gary R. Cramblitt <email>garycramblitt@comcast.net</email>

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Kaan Özdinçer<email>kaanozdincer@gmail.com</email></para> <para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
