Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konversation.po
Languages: tr

source: The <guilabel>Server List</guilabel> screen appears when you open the &konversation; program. It also appears when you choose <menuchoice> <guisubmenu>File</guisubmenu> <guisubmenu>Server List</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Server List</guilabel></action> screen lists your existing defined &irc; <guilabel>Network</guilabel>s, listed by group. An &irc; network is a collection of cooperating servers. When you connect to any server in a network, you have access to all the channels of the network. Examples of &irc; networks are <userinput><replaceable>Libera</replaceable></userinput> and <userinput><replaceable>Undernet</replaceable></userinput>.
tr: &konversation; programını açtığınızda <guilabel>Sunucu Listesi</guilabel> ekranı görünür. Ayrıca ana menüden <menuchoice><guisubmenu>Dosya</guisubmenu> <guisubmenu>Sunucu Listesi</guisubmenu></menuchoice> ile de açabilirsiniz. <action><guilabel>Sunucu Listesi</guilabel></action> ekranı, sizin halihazırda tanımlı &irc; <guilabel>ağlarınızı</guilabel> gruba göre listeli olarak listeler. Bir &irc; ağı, birbiriyle işbirliğinde bulunan bir sunucular koleksiyonudur. Bir ağdaki herhangi bir sunucuya bağlandığınızda, ağdaki tüm kanallara erişiminiz olur. &irc; ağlarına örnek olarak <userinput><replaceable>Libera</replaceable></userinput> ve <userinput><replaceable>Undernet</replaceable></userinput> verilebilir.

source: Your existing defined <guilabel>Network</guilabel>s are listed here along with the <guilabel>Identity</guilabel> used to connect to the network, and the <guilabel>Channels</guilabel> automatically joined when connected. If you have specified a group for your networks, networks are listed indented under the group. Click on a network to select it.
tr: Sizin halihazırda tanımlı <guilabel>ağlarınız</guilabel>, ağa bağlanmak için kullandığınız <guilabel>kimlik</guilabel> ile burada listelenir; buna, bağlandığınızda kendiliğinden katılınılan <guilabel>kanallar</guilabel> da dahildir. Ağlarınız için bir grup belirlediyseniz ağlar grubun altında girintili olarak listelenir. Seçmek için bir ağın üzerine tıklayın.

source: Use these buttons to <guibutton>Add</guibutton> a new network, <guibutton>Edit</guibutton> a highlighted network, or <guibutton>Delete</guibutton> a highlighted network.
tr: Bir ağ <guibutton>eklemek</guibutton>, vurgulanan bir ağı <guibutton>düzenlemek</guibutton> veya <guibutton>silmek</guibutton> için bu düğmeleri kullanın.

source: Click this button to connect to the highlighted <guilabel>Network</guilabel> and close the <guilabel>Server List</guilabel> screen. You may highlight more than one network if you wish, which will connect to all the highlighted networks.
tr: Vurgulanan <guilabel>ağa</guilabel> bağlanmak ve <guilabel>Sunucu Listesi</guilabel> ekranını kapatmak için bu düğmeye tıklayın. İsterseniz birden fazla ağı vurgulayabilirsiniz; bu durumda vurgulanan tüm ağlara bağlanılacaktır.

source: Clicking this button does not discard the changes you have made. It merely means you do not wish to connect to any networks at this time.
tr: Bu düğmeye tıklamak yaptığınız değişiklikleri iptal etmez. Yalnızca şu anda herhangi bir ağa bağlanmak istemediğiniz anlamına gelir.

source: When you click the <guibutton>New</guibutton> button, the <guilabel>New Network</guilabel> screen appears.
tr: <guibutton>Yeni</guibutton> düğmesine tıkladığınızda, <guilabel>Yeni Ağ</guilabel> ekranı görüntülenir.

source: <screeninfo>New Network</screeninfo>
tr: <screeninfo>Yeni Ağ</screeninfo>

source: <phrase>New Network</phrase>
tr: <phrase>Yeni Ağ</phrase>

source: Enter the <guilabel>Network name</guilabel> here. You may create as many entries in the <guilabel>Server List</guilabel> screen with the same <guilabel>Network</guilabel> as you like.
tr: <guilabel>Ağ adını</guilabel> buraya girin. <guilabel>Sunucu Listesi</guilabel> ekranında aynı <guilabel>Ağ</guilabel> ile istediğiniz kadar girdi oluşturabilirsiniz.

source: Choose an existing <guilabel>Identity</guilabel> or click the <guibutton>Edit</guibutton> button to add a new Identity or edit an existing one. The <guilabel>Identity</guilabel> will identify you and determine your &i18n-nickname; when you connect to the network.
tr: Var ola bir <guilabel>Kimlik</guilabel> seçin veya yeni bir kimlik eklemek veya var olan bir kimliği düzenlemek için <guibutton>Düzenle</guibutton> düğmesine tıklayın. <guilabel>Kimlik</guilabel> sizi tanımlar ve ağa bağlandığınızda takma adınızı belirleyecektir.

source: Optional. This command will be sent to the server after connecting. Example: <userinput>/msg NickServ IDENTIFY <replaceable>konvirocks</replaceable></userinput>. This example is for the Libera network, which requires users to register their &i18n-nickname; with a password and login when connecting. <userinput><replaceable>konvirocks</replaceable></userinput> is the password for the &i18n-nickname; given in <guilabel>Identity</guilabel>. You may enter more than one command by separating them with semicolons.
tr: İsteğe bağlı. Bu komut bağlandıktan sonra sunucuya gönderilecektir. Örnek: <userinput>/msg NickServ IDENTIFY <replaceable>konvirocks</replaceable></userinput>. Bu örnek, kullanıcıların bağlanırken takma adlarını bir parola ile kaydetmelerini ve giriş yapmalarını gerektiren Libera ağı içindir. <userinput><replaceable>konvirocks</replaceable></userinput>, <guilabel>kimlik</guilabel> içinde verilen takma adın parolasıdır. Noktalı virgülle ayırarak birden fazla komut girebilirsiniz.

source: Check here if you want &konversation; to automatically connect to this network whenever you open &konversation;.
tr: &konversation;’u her açtığınızda &konversation;’ın kendiliğinden bu ağa bağlanmasını istiyorsanız burayı işaretleyin.

source: This is a list of &irc; <guilabel>Servers</guilabel> in the network. When connecting to the network, &konversation; will attempt to connect to the top server first. If this fails, it will attempt the second server. If this fails, it will attempt the third, and so on. At least one server must be specified. Click a server to highlight it.
tr: Bu, ağdaki &irc; <guilabel>Sunucular</guilabel>’ın bir listesidir. Ağa bağlanırken, &konversation; önce en üstteki sunucuya bağlanmayı deneyecektir. Eğer bu başarısız olursa ikinci sunucuyu deneyecektir. Bu başarısız olursa üçüncüyü deneyecek ve bu böyle sürecektir. En az bir sunucu belirtilmelidir. Vurgulamak için bir sunucuya tıklayın.

source: Use these buttons to <guibutton>Add</guibutton> a server, <guibutton>Edit</guibutton> a highlighted server, or <guibutton>Delete</guibutton> a highlighted server. You can also adjust the order of the server list and therefore the order of connection attempts.
tr: Bir sunucu <guibutton>eklemek</guibutton>, vurgulanan bir sunucuyu <guibutton>düzenlemek</guibutton> veya <guibutton>silmek</guibutton> için bu düğmeleri kullanın. Sunucu listesinin sırasını ve dolayısıyla bağlantı denemelerinin sırasını da ayarlayabilirsiniz.

source: Optional. This is a list of the channels that will be automatically joined once &konversation; has connected to a server. You may leave this blank if you wish to not automatically join any channels.
tr: İsteğe bağlı. Bu, &konversation; bir sunucuya bağlandığında kendiliğinden katılacak kanalların bir listesidir. Herhangi bir kanala kendiliğinden katılmak istemiyorsanız bunu boş bırakabilirsiniz.

source: Use these buttons to <guibutton>Add</guibutton> a channel, <guibutton>Edit</guibutton> a highlighted channel, or <guibutton>Delete</guibutton> a highlighted channel. You may also change the order the channels are joined.
tr: Bir kanal <guibutton>eklemek</guibutton>, vurgulanan bir kanalı <guibutton>düzenlemek</guibutton> veya <guibutton>silmek</guibutton> için bu düğmeleri kullanın. Kanallara katılma sırasını da değiştirebilirsiniz.

source: Avoid mixing servers on different &irc; networks under the same <guilabel>Network</guilabel>. Avoid entering the same server under two different <guilabel>Network</guilabel>s. Otherwise, <link linkend="nicksonline">monitoring of online &i18n-nickname;s</link> will not function correctly.
tr: Farklı &irc; <guilabel>ağlarındaki</guilabel> sunucuları aynı <guilabel>ağ</guilabel> altında karıştırmaktan kaçının. Aynı sunucuya iki farklı ağ altında girmekten kaçının. Aksi takdirde, çevrimiçi <link linkend="nicksonline">takma adların izlenmesi</link> düzgün çalışmayacaktır.

source: When you click the <guibutton>Add</guibutton> button in the <guilabel>Servers</guilabel> frame, the <guilabel>Add Server</guilabel> screen appears.
tr: <guilabel>Servers</guilabel> çerçevesindeki <guibutton>Ekle</guibutton> düğmesine tıkladığınızda, <guilabel>Sunucu Ekle</guilabel> ekranı görünür.

source: <screeninfo>Add Server</screeninfo>
tr: <screeninfo>Sunucu Ekle</screeninfo>

source: <phrase>Add Server</phrase>
tr: <phrase>Sunucu Ekle</phrase>

source: The name or IP number of the server. irchelp.org maintains a <ulink url="https://www.irchelp.org/networks/">list</ulink> of servers.
tr: Sunucunun adı veya IP adresi. irchelp.org, sunucuların bir <ulink url="https://www.irchelp.org/networks/">listesini</ulink> tutar.

source: Enter the port number required to connect to the server. For most servers, this should be <userinput>6667</userinput>.
tr: Sunucuya bağlanmak için gereken kapı numarasını girin. Çoğu sunucu için bu <userinput>6667</userinput> olmalıdır.

source: If the server requires a password in order to connect, enter it here, otherwise leave blank.
tr: Sunucu bağlanmak için bir parola gerektiriyorsa parolayı buraya girin, aksi takdirde boş bırakın.

source: Check if you want to use Secure Socket Layer (SSL) protocol to communicate with the server. This protects the privacy of your communications between your computer and the &irc; server. The server must support SSL protocol for this to work. In most cases, if the server does not support SSL, the connection will fail.
tr: Sunucu ile iletişim kurmak için Güvenli Yuva Katmanı (SSL) protokolünü kullanmak isteyip istemediğinizi denetleyin. Bu, bilgisayarınız ve &irc; sunucusu arasındaki iletişiminizin gizliliğini korur. Bunun çalışması için sunucunun SSL protokolünü desteklemesi gerekir. Çoğu durumda, sunucu SSL’yi desteklemiyorsa bağlantı başarısız olur.

source: When you click the <guibutton>Add</guibutton> button in the <guilabel>Auto Join Channels</guilabel> frame, the <guilabel>Add Channel</guilabel> screen appears.
tr: <guilabel>Kanallara kendiliğinden katıl</guilabel> çerçevesindeki <guibutton>Ekle</guibutton> düğmesine tıkladığınızda <guilabel>Kanal Ekle</guilabel> ekranı görünür.

source: <screeninfo>Add Channel</screeninfo>
tr: <screeninfo>Kanal Ekle</screeninfo>

source: <phrase>Add Channel</phrase>
tr: <phrase>Kanal Ekle</phrase>

source: Enter a channel name. Do not forget leading <userinput><replaceable>#</replaceable></userinput>. If the channel requires a password in order to join, enter it, otherwise leave blank.
tr: Bir kanal adı girin. Başına <userinput><replaceable>#</replaceable></userinput> koymayı unutmayın. Kanala katılmak için bir parola gerekiyorsa parolayı girin, aksi takdirde boş bırakın.

source: Listing available channels
tr: Kullanılabilir kanalları listelemek

source: To display a list of available channels, choose <menuchoice> <guisubmenu>Window</guisubmenu> <guisubmenu>Channel List</guisubmenu> </menuchoice> on the main menu. <action>After a warning screen, a new tab is created called the <guilabel>Channel List</guilabel>.</action>
tr: Kullanılabilir kanalların bir listesini görüntülemek için ana menüden <menuchoice><guisubmenu>Pencere</guisubmenu> <guisubmenu>Kanal Listesi</guisubmenu></menuchoice> yolunu izleyin. <action>Bir uyarı ekranı sonrası, <guilabel>Kanal Listesi</guilabel> adında yeni bir sekme oluşturulur.</action>

source: <screeninfo>The Channel List tab.</screeninfo>
tr: <screeninfo>Kanal Listesi sekmesi</screeninfo>

source: <phrase>The Channel List tab.</phrase>
tr: <phrase>Kanal Listesi sekmesi</phrase>

source: Enter a filter string here.
tr: Buraya bir süzgeç dizisi girin.

source: You can limit the channel list to those channels with a minimum or maximum number of users here. Choosing <guilabel>No Limit</guilabel> disables the respective criteria.
tr: Burada kanal listesini en az veya en çok kullanıcı sayısına sahip kanallarla sınırlayabilirsiniz. <guilabel>Sınırsız</guilabel> seçimi, ilgili kriterleri devre dışı bırakır.

source: Click here to retrieve the list of channels from the server and apply the filter.
tr: Kanal listesini sunucudan almak ve süzgeci uygulamak için buraya tıklayın.

source: The filtered list of channels is displayed here. Notice that if you don't use regular expressions, &konversation; lists any channel whose name contains the filter string you entered. The channel name does not have to start with the string you entered.
tr: Süzülmüş kanal listesi burada görüntülenir. Düzenli ifadeler kullanmazsanız &konversation;’un adını girdiğiniz süzgeç dizisini içeren tüm kanalları listelediğine dikkat edin. Kanal adının girdiğiniz diziyle başlaması gerekmez.

source: Select a channel you want to join by clicking on it. Right click on the channel to get a list of all web addresses mentioned in the channel's topic.
tr: Katılmak istediğiniz kanalı üzerine tıklayarak seçin. Kanalın başlığında belirtilen tüm web adreslerinin bir listesini almak için kanala sağ tıklayın.

source: Click here to join the channel. A new tab is created for the channel.
tr: Kanala katılmak için buraya tıklayın. Kanal için yeni bir sekme oluşturulur.

source: Sometimes there are "secret" channels on servers. Such channels are not listed in the <guilabel>Channel List</guilabel>. You can still join these channels if you know their name. In any <interface>Input Line</interface>, type: <userinput><command>/join</command> <replaceable>#channelname</replaceable></userinput>. (The <userinput>#</userinput> is required.) A new tab is created for the channel. If you join a channel and the Nick Panel lists only your &i18n-nickname;, it means that the channel did not exist before. The server created the channel and you are the operator. In this case, you probably want to close the channel by typing: <userinput><command>/part</command></userinput>.
tr: Bazen sunucularda “gizli” kanallar olabilir. Bu tür kanallar <guilabel>Kanal Listesi</guilabel>’nde listelenmez. Adlarını biliyorsanız bu kanallara yine de katılabilirsiniz. Herhangi bir <interface>giriş satırında</interface> şunu yazın: <userinput><command>/join</command> <replaceable>#kanaladı</replaceable></userinput>. (<userinput>#</userinput> gereklidir.) Kanal için yeni bir sekme oluşturulur. Bir kanala katılırsanız ve takma ad panelinde yalnızca takma adınız listelenirse bu kanalın daha önce var olmadığı anlamına gelir. Kanalı sunucu oluşturmuştur ve siz de operatörsünüzdür. Bu durumda, büyük olasılıkla şunu yazarak kanalı kapatmak istersiniz: <userinput><command>/part</command></userinput>.

source: A tour of the main screen
tr: Ana pencerede bir gezinti

source: Let's learn more about the <interface>Main</interface> screen. The screen is shown below with a channel tab selected.
tr: <interface>Ana</interface> ekran hakkında daha fazla bilgi edinelim. Ekran aşağıda bir kanal sekmesi seçili olarak gösterilmektedir.

source: The Main screen.
tr: Ana ekran.

source: The Main screen
tr: Ana ekran

source: This is called the <interface>Input Line</interface>. It appears only when the current tab is a channel. To send a message to everyone in the channel, type the message here and press &Enter;. Your message, as well as everyone else's messages appear in the channel scroll above. Each message is preceded by the time and the user's &i18n-nickname;.
tr: Buna <interface>Giriş Satırı</interface> denir. Yalnızca geçerli sekme bir kanal ise görünür. Kanaldaki herkese bir ileti göndermek için iletiyi buraya yazın ve &Enter; düğmesine basın. İletiniz ve diğer herkesin iletileri yukarıdaki kanal geçmişinde görünür. Her iletinin önünde saat ve kullanıcının takma adı yer alır.

source: You can also paste text from the clipboard. If the pasted text has more than one line (newlines), a dialog box appears. Edit the text as desired and click <guibutton>OK</guibutton>.
tr: Panodan da metin yapıştırabilirsiniz. Yapıştırılan metinde birden fazla satır (yenisatır) varsa bir iletişim kutusu görüntülenir. Metni istediğiniz gibi düzenleyin ve <guibutton>Tamam</guibutton>’a tıklayın.

source: If the pasted text is longer than 256 characters, or it contains more than one line, a warning message appears advising you that large postings can cause connection resets and flooding. You can still proceed with the input, but doing so is a bad idea, as flooding will annoy other users in the channel, or you may be disconnected from the server. It is better to send the message in shorter chunks.
tr: Yapıştırılan metin 256 karakterden uzunsa veya birden fazla satır içeriyorsa büyük gönderilerin bağlantı sıfırlamalarına ve taşmaya neden olabileceğini bildiren bir uyarı iletisi görüntülenir. Yine de girişi sürdürebilirsiniz; ancak bunu yapmak kötü bir fikirdir; çünkü taşma kanaldaki diğer kullanıcıları rahatsız eder veya sunucuyla bağlantınız kesilebilir. İletiyi daha kısa parçalar halinde göndermek daha iyidir.

source: A convention used in many channels is to precede messages directed at one user with their &i18n-nickname;. &konversation; provides a convenient &i18n-nickname; completion feature. Start typing the user's &i18n-nickname;, then press &Tab;. &konversation; will complete the rest of the user's &i18n-nickname; followed by a colon. To customize the completion feature, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> from the main menu, expand <guilabel>Behavior</guilabel>, click on <guilabel>General</guilabel>, and select a <guilabel>Completion mode</guilabel>.
tr: Birçok kanalda kullanılan bir gelenek, bir kullanıcıya yönelik iletilerin önüne takma adlarının eklenmesidir. &konversation;, kullanışlı bir takma ad tamamlama özelliği sağlar. Kullanıcının takma adını yazmaya başlayın ve ardından &Tab; düğmesine basın. &konversation; kullanıcının takma adının geri kalanını ve ardından iki nokta üst üste işaretini tamamlayacaktır. Tamamlama özelliğini özelleştirmek için ana menüden <menuchoice><guisubmenu>Ayarlar</guisubmenu> <guisubmenu>Konversation Uygulamasını Yapılandır…</guisubmenu></menuchoice> yolunu izleyin; <guilabel>Davranış</guilabel>, <guilabel>Genel</guilabel> sayfasından bir <guilabel>Tamamlama kipi</guilabel> seçin.

source: You can also enter an &irc; command here by first typing <userinput><command>/</command></userinput> followed by a valid &irc; command. See <link linkend="irc-cmds">Frequently-used &irc; commands</link>. On some servers, you can type <userinput><command>/help</command></userinput> for a list of available commands, or type <userinput><command>/help </command><replaceable>command</replaceable></userinput> for help on a specific command.
tr: Burada ayrıca <userinput><command>/</command></userinput> yazıp ardından bir &irc; komutu koyarak &irc; komutlarını yürütebilirsiniz. <link linkend="irc-cmds">Sıkça kullanılan &irc; komutları</link> bölümüne bakın. Bazı sunucularda kullanılabilir komutların bir listesi için <userinput><command>/help</command></userinput> yazabilir veya belirli bir komut üzerine yardım için <userinput><command>/help </command><replaceable>komut</replaceable></userinput> yapabilirsiniz.

source: You may join additional servers and channels. Each server and each channel gets a separate tab here. To display a list of available channels, see <link linkend="list-channels">Listing available channels</link>. To join a channel, type: <userinput><command>/join</command> <replaceable>#channelname</replaceable></userinput> in the Input Line. (The <userinput>#</userinput> is required.) To leave a channel, just type <userinput><command>/part</command></userinput>. Tabs also appear here if you open a <link linkend="list-channels">Channel List</link>, participate in a <link linkend="query">private conversation (query)</link>, open the <link linkend="urlcatcher">&URL; Catcher</link>, or open one or more <guilabel>Konsole</guilabel>s. To switch the display to a different screen, click the corresponding tab, or use the mouse wheel to cycle through the tabs.
tr: Ek sunuculara ve kanallara katılabilirsiniz. Her sunucu ve her kanal burada ayrı bir sekme alır. Kullanılabilir kanalların bir listesini görüntülemek için <link linkend="list-channels">Kullanılabilir kanalları listelemek</link> bölümüne bakın. Bir kanala katılmak için giriş satırında şunu yazın: <userinput><command>/join</command> <replaceable>#kanaladı</replaceable></userinput> (<userinput>#</userinput> gereklidir). Bir kanaldan ayrılmak için yalnızca <userinput><command>/part</command></userinput> yazın. Sekmeler; bir <link linkend="list-channels">Kanal Listesi</link> açar, <link linkend="query">özel bir konuşmaya (sorguya)</link> katılır, <link linkend="urlcatcher">&URL; Yakalayıcısı</link>’nı veya bir veya birden çok <guilabel>Konsole</guilabel>’u açarsanız burada görünürler. Ekranı farklı bir ekrana geçirmek için ilgili sekmeye tıklayın veya sekmeler arasında geçiş yapmak için fare tekerleğini kullanın.

source: To set other options for tabs, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> from the main menu, expand <guilabel>Interface</guilabel>, click on <guilabel>Tabs</guilabel> or expand <guilabel>Notifications</guilabel> and click on <guilabel>Tabs</guilabel>.
tr: Sekmeler için başka seçeneklere bakmak üzere ana menüden <menuchoice> <guisubmenu>Ayarlar</guisubmenu> <guisubmenu>Konversation Uygulamasını Yapılandır…</guisubmenu></menuchoice> yolunu izleyip <guilabel>Arayüz</guilabel>, <guilabel>Sekmeler</guilabel> sayfasına gidin veya <guilabel>Bildirimler</guilabel>’i seçip <guilabel>Sekmeler</guilabel>’e tıklayın.

source: These &led;s will blink when there is something you haven't seen in that tab. The &led; will blink slower when the only unseen messages are <command>join</command>, <command>part</command>, <command>quit</command>, or &i18n-nickname; changes. They blink faster if there are unseen regular messages. The colors are as follows:
tr: Bu &led;’ler, o sekmede görmediğiniz bir şey olduğunda yanıp sönecektir. Görülmeyen tek ileti <command>join</command>, <command>part</command>, <command>quit</command> komutları veya takma ad değişiklikleri olduğunda &led; daha yavaş yanıp sönecektir. Görünmeyen normal iletiler varsa daha hızlı yanıp sönerler. Renkler aşağıdaki gibidir:

source: <para>Channel</para>
tr: <para>Kanal</para>

source: <interface>Server Messages</interface>, <link linkend="list-channels">Channel List</link>, or <link linkend="urlcatcher">&URL; catcher</link>.
tr: <interface>Sunucu İletileri</interface>, <link linkend="list-channels">Kanal Listesi</link> veya <link linkend="urlcatcher">&URL; Yakalayıcısı</link>.

source: <guilabel>Konsole</guilabel> or <link linkend="dcc">DCC Status</link>.
tr: <guilabel>Konsole</guilabel> veya <link linkend="dcc">DCC Durumu</link>.

source: <link linkend="query">Private Message (Query)</link>.
tr: <link linkend="query">Özel İleti (Sorgu)</link>.
