Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/konversation.po
Languages: tr

source: <command>/dcc </command> <command>SEND </command><replaceable>nick</replaceable> <replaceable>[filename]</replaceable>
tr: <command>/dcc </command> <command>SEND </command><replaceable>takma ad</replaceable> <replaceable>[dosya adı]</replaceable>

source: Sends <userinput><replaceable>filename</replaceable></userinput> to the user with &i18n-nickname; <userinput><replaceable>nick</replaceable></userinput>. If <userinput><replaceable>filename</replaceable></userinput> is omitted, a dialog appears for you to select a file.
tr: <userinput><replaceable>Dosya adını</replaceable></userinput> <userinput><replaceable>takma adlı</replaceable></userinput> kullanıcıya gönderir. <userinput><replaceable>Dosya adı</replaceable></userinput> boş bırakılmışsa bir dosya seçmeniz için bir iletişim kutusu ortaya çıkar.

source: Opens the <guilabel>DCC Status</guilabel> tab.
tr: <guilabel>DCC Durumu</guilabel> sekmesini açar.

source: <command>/ctcp </command><replaceable>nick|channel</replaceable> <command>ping</command>
tr: <command>/ctcp </command><replaceable>takma ad|kanal</replaceable> <command>ping</command>

source: Sends a PING message to <userinput><replaceable>nick</replaceable></userinput> or <userinput><replaceable>channel</replaceable></userinput>. This is useful for determining if someone you are talking with has a high network lag, or (when sent to a channel) if your system has a high lag.
tr: <userinput><replaceable>Takma ada</replaceable></userinput> veya <userinput><replaceable>kanala</replaceable></userinput> PING iletisi çeker. Bu, konuştuğunuz birinin yüksek bir ağ gecikmesine sahip olup olmadığını veya sisteminizin yüksek bir gecikmeye sahip olup olmadığını (bir kanala gönderildiğinde) belirlemek için kullanışlıdır.

source: <command>/ctcp </command><replaceable>nick|channel</replaceable> <replaceable>msg</replaceable>
tr: <command>/ctcp </command><replaceable>takma ad|kanal</replaceable> <replaceable>ileti</replaceable>

source: Sends a message to <userinput><replaceable>nick</replaceable></userinput> or all users in <userinput><replaceable>channel</replaceable></userinput>. This is similar to the <userinput><command>/msg</command></userinput> command above, except that the message is sent using the &CTCP; protocol. The response on the other end depends on the &irc; client program the user is running. For example, when conversing with another &konversation; user, <userinput><replaceable>/ctcp Eisfuchs TIME</replaceable></userinput> will return the system time on Eisfuch's computer. <userinput><replaceable>/ctcp Eisfuchs VERSION</replaceable></userinput> will return the &konversation; version number from Eisfuch's computer.
tr: <userinput><replaceable>Takma ad</replaceable></userinput> kullanıcısına veya <userinput><replaceable>kanaldaki</replaceable></userinput> tüm kullanıcılara bir ileti gönderir. Bu, yukarıdaki <userinput><command>/msg</command></userinput> komutuna benzerdir, yalnızca ileti &CTCP; protokolü kullanılarak gönderilir. Diğer uçtaki yanıt, kullanılan &irc; istemcisi programına bağlıdır. Örneğin, başka bir &konversation; kullanıcıyla konuşuyorsanız <userinput><replaceable>/ctcp Eisfuchs TIME</replaceable></userinput>, Eisfuch’un bilgisayarındaki sistem zamanını döndürür. <userinput><replaceable>/ctcp Eisfuchs VERSION</replaceable></userinput>, Eisfuchs’un bilgisayarındaki &konversation; sürüm numarasını yazdırır.

source: Scripting
tr: Betik yazma

source: &konversation; comes with some handy scripts you can run from the program. To run a script, in a channel, query, DCC, or server tab, type a command of the form
tr: &konversation;, programdan çalıştırabileceğiniz bazı kullanışlı betiklerle birlikte gelir. Bir betiği kanal, sorgu, DCC veya sunucu sekmesinde çalıştırmak için formun bir komutunu yazın

source: <command>/exec </command> <replaceable>script</replaceable> [<replaceable>parameters</replaceable>]
tr: <command>/exec </command> <replaceable>betik</replaceable> [<replaceable>parametreler</replaceable>]

source: which executes the script named <userinput><replaceable>script</replaceable></userinput> passing it (optional) <userinput><replaceable>parameters</replaceable></userinput>.
tr: Bu, <userinput><replaceable>betik</replaceable></userinput>’i çalıştırır ve isteğe bağlı olarak <userinput><replaceable>parametreler</replaceable></userinput> geçirir.

source: For example, type the following command in a channel tab
tr: Örneğin, aşağıdaki komutu bir kanal sekmesine yazın:

source: to send your &konversation;, &Qt;, &kde-frameworks; and &plasma; version numbers to the channel.
tr: Bu, &konversation;, &Qt;, &kde-frameworks; ve &plasma; sürüm numaralarını kanala yazdırır.

source: executes the <userinput><replaceable>cmd</replaceable></userinput> script, passing it <userinput><replaceable>uname -a</replaceable></userinput>. This sends your &Linux; version string to the channel.
tr: Bu, <userinput><replaceable>komut</replaceable></userinput> betiğini yürütür, ona <userinput><replaceable>uname -a</replaceable></userinput> geçirir. Bu komut ile, &Linux; sürümünüz kanala yazdırılır.

source: To learn more about the scripts installed with &konversation; please see the <link linkend="scripts_ref">Script Reference Guide</link>
tr: &konversation; ile kurulu gelen betikler hakkkında daha fazla öğrenmek için lütfen <link linkend="scripts_ref">Betik başvuru kılavuzu</link>’na bakın.

source: To get a list of all available scripts, type the following command in a &konversation; screen.
tr: Kullanılabilir tüm betik dosyalarının listesini almak için aşağıdaki komutu &konversation; ekranına girin.

source: Then browse to folder from the output to see the list.
tr: Listeyi görmek için çıktıdaki klasöre bir göz atın.

source: You can write your own scripts. Scripts are shell scripts and can be written in any shell language, such as bash, perl, or python. When &konversation; runs a script, the first two parameters sent to the script are:
tr: Kendi betiklerinizi de yazabilirsiniz. Betikler kabukta çalışırlar ve Bash, Perl veya Python gibi herhangi bir kabuk dilinde yazılabilirler. &konversation; ne zaman bir betik çalıştırsa betiğe gönderilen ilk iki parametreler şunlardır.

source: The address of the server.
tr: Sunucunun adresi.

source: The channel name.
tr: Kanal adı.

source: Here is a sample shell script (cmd).
tr: Örnek bir kabuk betiği (cmd).

source: #!/bin/sh # Executes a command and prints the output into Konversation. SERVER=$1; TARGET=$2; shift;shift; $@ | while read line; do qdbus org.kde.konversation /irc say $SERVER "$TARGET" "$@: $line"; done
tr: #!/bin/sh # Bir komut yürütür ve çıktıyı Konversation’a yazdırır. SERVER=$1; TARGET=$2; shift;shift; $@ | while read line; do qdbus org.kde.konversation /irc say $SERVER "$TARGET" "$@: $line"; done

source: Notice that the script uses qdbus to communicate with &konversation;. The <computeroutput>say</computeroutput> command causes the output to be sent to the channel as a normal message. To display something in the tab without sending it to other users, use <computeroutput>info</computeroutput> instead. Look at the existing script files for more examples of writing scripts.
tr: &konversation;’un betikle iletişim kurmak için qdbus kullandığına dikkat edin. <computeroutput>say</computeroutput> komutu, çıktının kanala normal bir ileti gibi gönderilmesine neden olur. Diğer kullanıcılara göndermeden sekmede bir şeyler görüntülemek için <computeroutput>info</computeroutput> komutunu kullanın. Ek betik yazımı örnekleri için var olan betik dosyalarına bakın.

source: To be able to run a script you have written, you must install it by copying it to <filename class="directory">$(qtpaths --paths GenericDataLocation)/konversation/scripts</filename>. You must also give the file execute privilege, for example <userinput><replaceable>chmod a+x myscript</replaceable></userinput>.
tr: Yazdığınız bir betiği çalıştırabilmek için onu öncelikle <filename class="directory">$(qtpaths --paths GenericDataLocation)/konversation/scripts</filename> konumuna kopyalayarak kurmalısınız. Ayrıca dosyanın yürütülebilir olması gerekir; örneğin, <userinput><replaceable>chmod a+x betiğim</replaceable></userinput> komutu ile.

source: Script Reference Guide
tr: Betik başvuru kılavuzu

source: &konversation; comes with several scripts installed by default, please refer to this guide to learn how to use them.
tr: &konversation; birkaç betik öntanımlı olarak kurulu halde gelir. Onları kullanmayı öğrenmek için bu kılavuzu okumayı sürdürün.

source: <command>/exec </command> <replaceable>bug</replaceable> [<replaceable>Bug Number|Search String</replaceable>]
tr: <command>/exec </command> <replaceable>bug</replaceable> [<replaceable>hata numarası|arama dizisi</replaceable>]

source: This script is used to open your browser to search for the given string or bug number on <ulink url="https://bugs.kde.org/">&kde;'s Bugzilla</ulink>.
tr: Bu betik ile, verilen diziyi veya hata numarasını <ulink url="https://bugs.kde.org/">&kde;’nin Bugzilla’sında</ulink> arayabilirsiniz.

source: Example: To open your browser to search for bug 123456
tr: Örnek: 123456 numaralı hata kaydına tarayıcınızda gidin.

source: Sample action: The default browser in your &systemsettings; should open to <replaceable>https://bugs.kde.org/show_bug.cgi?id=123456</replaceable>
tr: Örnek eylem: &systemsettings;’nızdaki öntanımlı tarayıcı, <replaceable>https://bugs.kde.org/show_bug.cgi?id=123456</replaceable> URL’sini açmalıdır.

source: <command>/exec </command> <replaceable>cmd</replaceable> [<replaceable>command line arguments</replaceable>]
tr: <command>/exec </command> <replaceable>cmd</replaceable> [<replaceable>komut satırı argümanları</replaceable>]

source: This script is used to have the output of the command line arguments to be written to your current channel.
tr: Bu betik, geçerli kanalınıza yazılacak komut satırı argümanlarının çıktısına sahip olmak için kullanılır.

source: Example: To show everyone in your current channel what version of &konversation; you have installed.
tr: Örnek: Geçerli kanaldaki herkese bilgisayarınızda &konversation;’un hangi sürümünün kurulu olduğunu gösterin.

source: Sample output: <replaceable>Konversation: 1.6</replaceable>
tr: Örnek çıktı: <replaceable>Konversation: 1.6</replaceable>

source: WARNING! The output of the entire command is posted to everyone in the current channel tab! Please use with care.
tr: UYARI! Tüm komutun çıktısı, geçerli kanal sekmesindeki herkese gönderilir! Lütfen dikkatli kullanın.

source: This script when run will output a Random Fortune.
tr: Bu betik, falınıza bakar.

source: Example: To output a random fortune to your current channel tab.
tr: Örnek: Geçerli kanal sekmenizde falınıza bakın.

source: Sample output: <replaceable>Random Fortune: Never make any mistaeks. -- Anonymous, in a mail discussion about to a kernel bug report</replaceable>
tr: Örnek çıktı: <replaceable>Random Fortune: Never make any mistakes. -- Anonymous, in a mail discussion about to a kernel bug report</replaceable>

source: <command>/exec </command> <replaceable>gauge</replaceable> [<replaceable>percentage</replaceable>]
tr: <command>/exec </command> <replaceable>gauge</replaceable> [<replaceable>yüzde</replaceable>]

source: This script shows a simple text based progress bar for the given percentage.
tr: Bu betik, verilen yüzde için basit bir metin tabanlı ilerleme çubuğu gösterir.

source: Example: To output a progress bar with 50% completion to the current channel tab.
tr: Örnek: Geçerli kanal sekmesine %​50 tamamlanmış bir ilerleme çubuğu çıktısı almak için.

source: Sample output: <replaceable>Beer load [ | ] 50%</replaceable>
tr: Örnek çıktı: <replaceable>Bira dolumu [ | ] 50%</replaceable>

source: <command>/exec </command> <replaceable>media</replaceable> [<replaceable>audio|video|{player}</replaceable>]
tr: <command>/exec </command> <replaceable>media</replaceable> [<replaceable>ses|video|{oynatıcı/çalar}</replaceable>]

source: This is a Now Playing script for various media players. It also features a method to show Now Playing information for only audio players, or only video players via the optional command arguments <replaceable>audio</replaceable> and <replaceable>video</replaceable>. Additionally, it's possible to specify the media player you wish to query.
tr: Bu, çeşitli ortam oynatıcıları/çalarlar için “Şimdi Çalınıyor/Oynatılıyor” betiğidir. Ayrıca, yalnızca ses çalarlar veya video oynatıcıları için bu bilgiyi sunma olanağı da tanır. <replaceable>Ses</replaceable> ve <replaceable>video</replaceable> argümanlarıyla bunu belirtebilirsiniz. Ayrıca yeğlediğiniz programı da belirtmeniz olanaklıdır.

source: The following media players are supported: Amarok (audio), JuK (audio), Kaffeine (video, audio), KMPlayer (video, audio), KPlayer (video, audio), kdetv (video), Yammi (audio), Audacious (audio), MPD (audio).
tr: Aşağıdaki yazılımlar desteklenir: Amarok (ses), JuK (ses), Kaffeine (video, ses), KMPlayer (video, ses), KPlayer (video, ses), kdetv (video), Yammi (ses), Audacious (ses), MPD (ses).

source: Example: To output your currently playing song in Amarok.
tr: Örnek: Amarok’ta şu anda çalınan şarkıyı çıktılayın.

source: Sample output: <replaceable>* user is listening to You Give Love A Bad Name by Bon Jovi on Slippery When Wet [Amarok]</replaceable>
tr: Örnek çıktı: <replaceable>* user is listening to Haliç’te Gün Batışı by Moğollar on Anadolu Pop [Amarok]</replaceable>

source: This script outputs some detailed information about your system by combining the outputs of several commands and formatting them appropriately.
tr: Bu betik, birkaç komutun çıktılarını birleştirerek ve bunları uygun şekilde biçimlendirerek sisteminiz hakkında bazı ayrıntılı bilgiler verir.

source: Example: To output some information about your system to the current channel tab.
tr: Örnek: Sisteminizle ilgili bazı bilgileri geçerli kanal sekmesine vermek için.

source: Sample output: <replaceable>Sysinfo for 'user-desktop': Running inside KDE Plasma 5.6.5 on Ubuntu 16.04.1 LTS (Xenial Xerus) powered by Linux 4.4.0-47-generic, CPU: Intel(R) Core(TM) i7-4910MQ CPU @ 2.90GHz at 2996-3338/3900 MHz, RAM: 15795/15967 MB, Storage: 1591/2281 GB, 406 procs, 47.59h up</replaceable>
tr: Örnek çıktı: <replaceable>Sysinfo for 'user-desktop': Running inside KDE Plasma 5.6.5 on Ubuntu 16.04.1 LTS (Xenial Xerus) powered by Linux 4.4.0-47-generic, CPU: Intel(R) Core(TM) i7-4910MQ CPU @ 2.90GHz at 2996-3338/3900 MHz, RAM: 15795/15967 MB, Storage: 1591/2281 GB, 406 procs, 47.59h up</replaceable>

source: <command>/exec </command> <replaceable>tinyurl</replaceable> [<replaceable>Link Address</replaceable>]
tr: <command>/exec </command> <replaceable>tinyurl</replaceable> [<replaceable>bağlantı adresi</replaceable>]

source: This script uses Tinyurl's api to turn the given link into a tinyurl that is then sent to the current channel tab.
tr: Bu betik, verilen bağlantıyı daha sonra geçerli kanal sekmesine gönderilen bir kısa URL’ye dönüştürmek için Tinyurl’un API’sini kullanır.

source: Example: To give someone a short link to https://konversation.kde.org
tr: Örnek: Birisine https://konversation.kde.org adresine kısa bir bağlantı vermek için.

source: Sample output: <replaceable>https://tinyurl.com/y4rk8wa3</replaceable>
tr: Örnek çıktı: <replaceable>https://tinyurl.com/y4rk8wa3</replaceable>

source: This script outputs the result of the command "uptime" and formats it appropriately.
tr: Bu betik, “uptime” komutunun sonucunu çıkarır ve uygunca biçimlendirir.

source: Example: To show off your rock solid 98 day uptime.
tr: Örnek: 98 günlük kesintisiz çalışma sürenizi göstermek için.

source: Sample output: <replaceable>Uptime: 98 days, 15 hours and 2 minutes</replaceable>
tr: Örnek çıktı: <replaceable>Uptime: 98 days, 15 hours and 2 minutes</replaceable>

source: All these scripts have predefined command aliases. In &konversation;'s settings dialog select <menuchoice><guimenu>Behavior</guimenu> <guimenuitem>Command Aliases</guimenuitem></menuchoice> to view, add, remove or edit command aliases.
tr: Tüm bu betiklerin önceden tanımlanmış komut armaları vardır. Bunları görüntülemek, yeni eklemek veya var olanları kaldırmak/düzenlemek için &konversation; ayarları iletişim kutusunda <menuchoice><guimenu>Davranış</guimenu> <guimenuitem>Komut Armaları</guimenuitem></menuchoice> yolunu izleyin.

source: For more information about scripting please read the <ulink url="https://userbase.kde.org/Konversation/Scripts/Scripting_guide">Userbase Scripting guide</ulink>
tr: Betik yazımı üzerine daha fazla bilgi almak için <ulink url="https://userbase.kde.org/Konversation/Scripts/Scripting_guide">Userbase Scripting guide</ulink> sayfasına bir göz atın.

source: Command Reference
tr: Komut başvuruları

source: The main &konversation; window
tr: Ana &konversation; penceresi

source: The File Menu
tr: Dosya Menüsü

source: <shortcut> <keycap>F2</keycap> </shortcut> <guimenu>File</guimenu> <guimenuitem>Server List</guimenuitem>
tr: <shortcut> <keycap>F2</keycap> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Sunucu Listesi</guimenuitem>

source: Displays the <link linkend="irc-basics">list of servers and channels</link>.
tr: <link linkend="irc-basics">Sunucuların ve kanalların bir listesini</link> görüntüler.

source: <shortcut> <keycap>F7</keycap> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quick Connect</guimenuitem>
tr: <shortcut> <keycap>F7</keycap> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Tez Bağlan</guimenuitem>

source: Displays the <link linkend="quickconnect">Quick Connect</link> screen for connecting to a server.
tr: Bir sunucuya bağlanmak için <link linkend="quickconnect">Tez Bağlan</link> ekranını görüntüler.

source: <guimenu>File</guimenu> <guimenuitem>Disconnect</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Bağlantıyı Kes</guimenuitem>

source: Disconnects from all servers.
tr: Tüm sunucuların bağlantısını keser.

source: <guimenu>File</guimenu> <guimenuitem>Reconnect</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Yeniden Bağlan</guimenuitem>

source: Reconnects to all servers that were disconnected by a network error or other problem.
tr: Bir ağ hatası veya başka bir sorun nedeniyle bağlantısı kesilen tüm sunuculara yeniden bağlanır.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>J</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Join Channel</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>J</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Kanala Katıl</guimenuitem>

source: Displays a dialog for you to enter the name of a channel to join. Does the same thing as entering <command>/join <userinput>#channelname</userinput></command> in a channel or server tab.
tr: Katılmak için bir kanalın adını girmeniz için bir iletişim kutusu görüntüler. Bir kanal veya sunucu sekmesinde <command>/join <userinput>#kanaladı</userinput></command> girmekle eşdeğerdir.

source: <shortcut> <keycombo action="simul">&Ctrl; &Shift;<keycap>A</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Global Away</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl; &Shift;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Her Yerde Uzakta</guimenuitem>

source: Changes your &i18n-nickname; status to away in all channels.
tr: Takma adınızın durumunu tüm kanallarda uzakta yapar.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Çık</guimenuitem>

source: <action>Quits</action> &konversation;.
tr: &konversation;’dan <action>çıkar</action>.

source: The Edit Menu
tr: Düzen Menüsü

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find Text...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Metin Bul…</guimenuitem>

source: Searches for text strings in the current screen.
tr: Geçerli ekranda metin dizileri arar.

source: <shortcut> <keycap>F3</keycap> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find Next</guimenuitem>
tr: <shortcut> <keycap>F3</keycap> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Sonrakini Bul</guimenuitem>

source: Searches again for text strings in the current screen using the previous search string.
tr: Önceki arama dizisini kullanarak geçerli ekranda yeniden metin dizileri arar.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Clear Window</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Pencereyi Temizle</guimenuitem>

source: Clears the current screen.
tr: Geçerli ekranı temizler.

source: <shortcut> <keycombo action="simul">&Ctrl; &Shift;<keycap>L</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Clear All Windows</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl; &Shift;<keycap>L</keycap></keycombo> </shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Tüm Pencereleri Temizle</guimenuitem>

source: Clears all screens.
tr: Tüm ekranları temizler.

source: The Insert Menu
tr: Ekleme Menüsü

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>K</keycap></keycombo> </shortcut> <guimenu>Insert</guimenu> <guimenuitem>&irc; Color...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>K</keycap></keycombo> </shortcut> <guimenu>Ekleme</guimenu> <guimenuitem>&irc; Rengi…</guimenuitem>

source: See <link linkend="color-msgs">Sending colorful messages</link>.
tr: <link linkend="color-msgs">Renkli iletiler göndermek</link> bölümüne göz atın.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Insert</guimenu> <guimenuitem>Marker Line</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Ekleme</guimenu> <guimenuitem>İmleyici Çizgi</guimenuitem>

source: See <link linkend="rememberlines">Marking Channel and Query Logs</link>.
tr: <link linkend="rememberlines">Kanal ve sorgu günlüklerini imlemek</link> bölümüne bir göz atın.

source: <shortcut> <keycombo action="simul">&Alt; &Shift;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Insert</guimenu> <guimenuitem>Special Character...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Alt; &Shift;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Ekleme</guimenu> <guimenuitem>Özel Karakter…</guimenuitem>

source: Used to enter special characters, such as foreign characters.
tr: Yabancı dillerdeki karakterler gibi özel karakterler girmek için kullanılır.

source: The Bookmarks Menu
tr: Yer İmleri Menüsü

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Bookmarks</guimenu> <guimenuitem>Add Bookmark</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Yer İmleri</guimenu> <guimenuitem>Yer İmi Koy</guimenuitem>

source: Bookmarks current network &amp; channel.
tr: Geçerli ağa ve kanala yer imi koyar.

source: <guimenu>Bookmarks</guimenu> <guimenuitem>Bookmark Tabs as Folder...</guimenuitem>
tr: <guimenu>Yer İmleri</guimenu> <guimenuitem>Sekmelere Klasör Olarak Yer İmi Koy…</guimenuitem>

source: <action>Adds</action> all channels to a new menu item at the end of the bookmarks menu.
tr: Yer imleri menüsünün sonuna, tüm kanalları yeni bir menü ögesi olarak <action>ekler</action>.
