Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/korganizer.po
Languages: tr

source: To customize the set of tools available on the bar, choose the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Toolbars... </guimenuitem></menuchoice> menu item and read the Section <ulink url="help:/fundamentals/config.html#toolbars">Customizing Toolbars</ulink> in the &kde; Fundamentals.
tr: Çubuktaki kullanılabilir araçlar kümesini özelleştirmek için <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Araç Çubuklarını Yapılandır…</guimenuitem></menuchoice> menü ögesini kullanın ve &kde; Temelleri içindeki <ulink url="help:/fundamentals/config.html#toolbars">Araç Çubuklarını Yapılandırmak</ulink> bölümünü okuyun.

source: Localization information like date and time formats can be configured from &systemsettings; within the modules <guilabel>Language</guilabel>, and <guilabel>Formats</guilabel>. These control modules can be accessed from within &korganizer;: just choose the <menuchoice><guimenu> Settings</guimenu><guimenuitem>Configure Date &amp; Time...</guimenuitem></menuchoice> menu item. &korganizer; has to be restarted for changes done in &systemsettings; to take effect.
tr: Tarih ve zaman biçimleri gibi yerel ayarlar &systemsettings; içindeki <guilabel>Dil</guilabel> ve <guilabel>Biçimler</guilabel> modüllerinden yapılandırılabilir. Bu denetim modüllerine &korganizer; içinden ulaşabilirsiniz; yalnızca <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Tarih ve Zamanı Yapılandır…</guimenuitem></menuchoice> menü ögesini kullanın. &systemsettings; içinde yapılan değişikliklerin geçerli olması için &korganizer;’ün yeniden başlatılması gerekir.

source: To configure where &korganizer; stores and retrieves calendar events, journal entries and to-dos, (in local files, groupware servers &etc;), please check <xref linkend="managing-resources"/>.
tr: &korganizer;’ün takvim, günce ve yapılacak ögelerini nerede depoladığını (yerel dosyalarda, grup yazılımı sunucularında &etc;) yapılandırmak için <xref linkend="managing-resources"/> bölümüne bakın.

source: &korganizer; Main Configuration
tr: &korganizer; Temel Yapılandırması

source: The options dialog lets you configure a number of different areas of &korganizer;.
tr: Seçenekler iletişim kutusu, &korganizer;’ün farklı bölümlerini yapılandırmanıza olanak tanır.

source: General page
tr: Genel sayfası

source: Personal tab
tr: Kişisel sekmesi

source: The personal options relate to your personal identity, and other miscellaneous things that do not fall under any of the other general categories.
tr: Kişisel seçenekleri, kişisel kimliğinizle ve diğer genel kategorilerin hiçbirine girmeyen diğer çeşitli şeylerle ilgilidir.

source: Full name
tr: Tam ad

source: <guilabel>Full name</guilabel> is initially set to <quote>Anonymous</quote> with an email address of <quote>nobody@nowhere</quote>. You can change your name by directly entering it here. This name will be displayed by default as <guilabel>Organizer</guilabel> in to-dos and Events.
tr: <guilabel>Tam ad</guilabel> ilk olarak <quote>Anonim</quote> adına ve <quote>hiçkimse@hiçbiryer</quote> olarak ayarlıdır. Adınızı, doğrudan buraya girerek değiştirebilirsiniz. Bu ad, yapılacaklarda ve etkinliklerde öntanımlı <guilabel>Organizatör</guilabel> olarak görüntülenecektir.

source: Email address
tr: E-posta adresi

source: <guilabel>Email address</guilabel> will be used to identify the owner of the calendar. When another person opens your calendar or events, he/she will not be able to modify it because it will be read-only.
tr: <guilabel>E-posta adresi</guilabel>, takvimin sahibini tanımlamak için kullanılır. Başka bir kişi sizin takviminizi veya etkinliklerinizi açtığında onların üzerinde değişiklik yapamaz; çünkü saltokunur olacaklardır.

source: Default Email Attachment Method
tr: Öntanımlı e-posta eki yöntemi

source: This option allows you to select the way an email is attached to an event. You can attach an email as the complete email including attachments, the email excluding attachments or only a link to the email.
tr: Bu seçenek, bir e-postanın bir etkinliğe nasıl ekleneceğini seçmenize olanak tanır. Bir e-postayı, ekler içerilmek üzere tam e-posta olarak, ekler dışında e-posta olarak veya yalnızca e-postaya bir bağlantı olarak ekleyebilirsiniz.

source: Note that attaching an email without attachments might invalidate its signature.
tr: Eksiz bir e-postayı eklemenin imzayı geçersiz kılabileceğini unutmayın.

source: Save tab
tr: Kaydet sekmesi

source: Confirm deletes
tr: Silmeleri onayla

source: When you check <guilabel>Confirm deletes</guilabel> box, &korganizer; will ask you to confirm each deletion. If this is not checked, &korganizer; will not ask before deleting events.
tr: <guilabel>Silmeleri onayla</guilabel> kutusunu işaretlediğinizde &korganizer;, her bir silme işlemini onaylamanızı isteyecektir. Bu işaretli değilse &korganizer; etkinlikleri silmeden önce size sorguda bulunmaz.

source: New Events, To-dos and Journal Entries Should
tr: Yeni etkinlikler, yapılacaklar ve günce girdileri şunları sağlamalı

source: This option lets you choose between adding new items to the default calendar or making &korganizer; ask you which calendar should be used to save each new item.
tr: Bu seçenek, yeni ögeleri doğrudan öntanımlı takvime eklenip eklenmeyeceğini veya &korganizer;’ün her bir yeni ögenin hangi takvime kaydedileceğini sormasını sağlar.

source: Kolab2 server specificity: It is recommended to choose <guilabel>Be asked which calendar to use</guilabel>, if you intend to use the shared folder functionality of the <guilabel>Kolab</guilabel> server. This will allow you to keep control of which information is available only to you, and which information is published in the shared folders.
tr: Kolab2 sunucusu belirliliği: <guilabel>Kolab</guilabel> sunucusunun paylaşılan klasör işlevselliğini kullanacaksanız <guilabel>Hangi takvimin kullanılacağını sor</guilabel> seçeneğinin seçilmesi önerilir. Bu, hangi bilgilerin yalnızca size açık olacağını ve hangi bilgilerin paylaşılan klasörlerde yayınlanacağını denetlemenizi sağlayacaktır.

source: Time and Date
tr: Zaman ve Tarih

source: Regional tab
tr: Bölgesel sekmesi

source: Day begins at
tr: Gün şu saatte başlar

source: Select the time you start your day from the drop down list. It could be the time when you usually get up, or the time when you start working. This setting does not prevent you from adding or viewing items before this time, it just sets the time that will be displayed by default on the top of the calendar view. Use the scrollbar to display earlier or later events in the Agenda view.
tr: Açılır listeden güne başladığınız saati seçin. Bu, normalde uyandığınız saat veya çalışmaya başladığınız saat olabilir. Bu ayar, bu saatten önce öge eklemenizi veya görüntülemenizi engellemez; yalnızca takvim görünümünün en üstünde öntanımlı olarak görüntülenecek saati ayarlar. Ajanda görünümünde önceki veya sonraki etkinlikleri görüntülemek için sarma çubuğunu kullanın.

source: Holidays
tr: Tatiller

source: Select your country from the drop down list, or if it is not listed, select <guilabel>(None)</guilabel>. If your country is selected, &korganizer; will recognize and display its important dates and holidays in the calendar view.
tr: Açılır listeden ülkenizi veya listede yoksa <guilabel>(Yok)</guilabel>’u seçin. Ülkenizi seçtiyseniz &korganizer;,takvim görünümünde önemli günleri ve tatilleri tanır ve görüntüler.

source: Weekly Schedule
tr: Haftalık program

source: The options <guilabel>Daily starting hour</guilabel> and <guilabel>Daily ending hour</guilabel> let you specify when your typical day starts and when it ends. &korganizer; sets the hours apart by marking them with a different color from the hours outside of your regular routine and from holidays.
tr: <guilabel>Günlük başlama saati</guilabel> ve <guilabel>Günlük bitiş saati</guilabel>, tipik bir günün ne zaman başlayacağını belirlemenize olanak tanır. &korganizer; saatleri, normal rutininizin dışındaki saatlerden ve tatillerden farklı bir renkle işaretleyerek ayırır.

source: Additionally, you have check boxes beside each day of the week. Check the week days that are part of your regular schedule, typically excluding weekends. &korganizer; will mark hours that are part of your daily schedule (perhaps your weekly work schedule) differently from hours outside of your regular schedule. Checking <guilabel>Exclude holidays</guilabel> prevents &korganizer; from marking regular schedule (or work) hours for the holiday days in the region defined in the <guilabel>Use holiday region</guilabel> drop down above.
tr: Ayrıca, haftanın her gününün yanında onay kutuları bulunur. Normal programınızın bir parçası olan hafta günlerini, genellikle hafta sonlarını dışlayarak işaretleyin. &korganizer;, günlük programınızın (belki de haftalık çalışma programınızın) bir parçası olan saatleri, normal programınızın dışındaki saatlerden farklı olarak işaretler. <guilabel>Tatilleri dışla</guilabel> seçeneğini işaretlemek, &korganizer;’ün yukarıdaki <guilabel>Tatil bölgesini kullan</guilabel> açılır menüsünde tanımlanan bölgedeki tatil günleri için normal program (veya çalışma) saatlerini işaretlemesini engeller.

source: Weekly Start Day
tr: Haftanın ilk günü

source: Select the first day of each week. Normally, you can ignore this since it is set in your locale.
tr: Her haftanın ilk gününü seçin. Normalde, yerel ayarlarınızda ayarlı olduğu için bunu göz ardı edebilirsiniz.

source: Default Values tab
tr: Öntanımlı Değerler sekmesi

source: Default appointment time
tr: Öntanımlı randevu zamanı

source: Select the default start time for events from the drop down list. When you choose <link linkend="menu-actions-new-event">New Event</link> from the <link linkend="entering-data-events">Actions Menu</link>, or create an event in some other manner such that &korganizer; cannot guess when you would like your event to start, &korganizer; will put this hour in the start time editor as the default value.
tr: Etkinliklerin öntanımlı başlangıç saatini açılır listeden seçin. <link linkend="entering-data-events">Eylemler</link> menüsünden <link linkend="menu-actions-new-event">Yeni Etkinlik</link>’i seçtiğinizde veya from the &korganizer;’ün etkinliğinizin ne zaman başlamasını istediğizi tahmin edemediği bir durumda &korganizer;, başlangıç zamanına öntanımlı olarak bu değeri koyar.

source: Default duration of new appointment (HH:MM):
tr: Yeni randevunun öntanımlı süresi (SS:DD):

source: Select the default duration for events using the spin box. When you choose <link linkend="menu-actions-new-event">New Event</link> from the <link linkend="entering-data-events">Actions Menu</link>, or create an event in some other manner such that &korganizer; cannot guess its duration, &korganizer; will use this as the default value.
tr: Olaylar için öntanımlı süreyi dönen kutuyu kullanarak seçin. <link linkend="entering-data-events">Eylemler</link> menüsünden <link linkend="menu-actions-new-event">Yeni Etkinlik</link>’i seçtiğinizde veya from the &korganizer;’ün etkinliğinizin ne zaman başlamasını istediğizi tahmin edemediği bir durumda &korganizer;, başlangıç zamanına öntanımlı olarak bu değeri koyar.

source: Reminders
tr: Anımsatıcılar

source: Select a <guilabel>Default reminder time</guilabel> to determine how long before the actual event's scheduled time the reminder will activate.
tr: Anımsatıcının gerçek etkinliğin planlanan saatinden ne kadar önce etkinleştirileceğini belirlemek için <guilabel>Öntanımlı anımsatma zamanı</guilabel>’nı seçin.

source: Set a file to be used as the default sound file for new reminders. You can always specify another file in the Advanced Reminder accessible from the event or to-do editors.
tr: Yeni anımsatıcılar için öntanımlı ses dosyası olarak kullanılacak bir dosya ayarlayın. Etkinlik veya yapılacaklar düzenleyicilerinden erişilebilen Gelişmiş Anımsatıcı’da istediğiniz zaman başka bir dosya belirleyebilirsiniz.

source: Check the next two boxes if you want to enable reminders for all newly created events or to-dos. You can always turn-off the reminders in the editor dialogs.
tr: Yeni oluşturulan tüm etkinlikler veya yapılacaklar için anımsatıcıları etkinleştirmek istiyorsanız sonraki iki kutuyu işaretleyin. Anımsatıcıları istediğiniz zaman düzenleyici iletişim kutularından kapatabilirsiniz.

source: Views
tr: Görünümler

source: These options let you configure &korganizer; views:
tr: Bu seçenekler, &korganizer; görünümlerini yapılandırmanızı sağlar:

source: General tab
tr: Genel sekmesi

source: Next x days:
tr: Sonraki x gün:

source: This option allows you to change the number of days shown by the <guimenu>Next x Days</guimenu> menu item in the <guimenu>Go</guimenu> menu.
tr: Bu seçenek, <guimenu>Git</guimenu> menüsündeki <guimenu>Sonraki X Gün</guimenu> menü ögesinde gösterilen günlerin sayısını yapılandırmanıza olanak tanır.

source: Enable tooltips for displaying summaries
tr: Özetleri görüntülemek için araç ipuçlarını etkinleştir

source: If your summary for an event is longer than would fit in the current View, the remaining characters are not displayed. Check <guilabel>Enable tooltips for displaying summaries</guilabel> if you want the full summary displayed when hovering the mouse pointer over the appointment for a few seconds.
tr: Bir etkinlik için özetiniz geçerli görünüme sığacaktan daha uzunsa kalan karakterler görüntülenmez. Randevu üzerinde fare işaretçisini birkaç saniye gezdirdiğinizde tam özetin görüntülenmesini istiyorsanız <guilabel>Özetleri görüntülemek için araç ipuçlarını etkinleştir</guilabel> seçeneğini işaretleyin.

source: To-dos use tag colors
tr: Yapılacaklar künye renklerini kullanır

source: Check this box so that to-dos will use tag colors and not colors specific to their due, due today or overdue state.
tr: Yapılacakların, bitiş tarihi gelen, bugün teslim tarihi gelen veya gecikmiş durumlarına özgü renkleri değil, künye renklerini kullanması için bu kutuyu işaretleyin.

source: <link linkend="description-view">Date Navigator</link> options:
tr: <link linkend="description-view">Tarih Gezgini</link> seçenekleri:

source: Show items that recur daily
tr: Günlük yinelenen ögeleri göster

source: If the <guilabel>Show items that recur daily</guilabel> box is checked, the days containing daily recurring events are shown in bold typeface in the Date Navigator.
tr: <guilabel>Günlük yinelenen ögeleri göster</guilabel> kutusu işaretlenirse günlük olarak yinelenen etkinlikleri içeren günler Tarih Gezgini’nde kalın yazıyüzüyle gösterilir.

source: Show items that recur weekly
tr: Haftalık yinelenen ögeleri göster

source: If the <guilabel>Show items that recur weekly</guilabel> box is checked, the days containing weekly recurring events are shown in bold typeface in the Date Navigator.
tr: <guilabel>Haftalık yinelenen ögeleri göster</guilabel> kutusu işaretlenirse günlük olarak yinelenen etkinlikleri içeren günler Tarih Gezgini’nde kalın yazıyüzüyle gösterilir.

source: Show to-dos instead of events when in Todo View
tr: Yapılacaklar görünümündeyken etkinlikler yerine yapılacakları göster

source: Check this box to show the days containing to-dos in bold typeface in the Date Navigator when in To-do view.
tr: Yapılacaklar görünümündeyken Tarih Gezgini’nde yapılacaklar içeren günleri kalın yazıyüzüyle göstermek için bu kutuyu işaretleyin.

source: Show journals instead of events when in Journal View
tr: Günce görünümündeyken etkinlikler yerine günceleri göster

source: Check this box to show the days containing journals in bold typeface in the Date Navigator when in Journal view.
tr: Günce görünümündeyken Tarih Gezgini’nde günceler içeren günleri kalın yazıyüzüyle göstermek için bu kutuyu işaretleyin.

source: Week numbers select a work week when in work week mode
tr: Çalışma haftası kipindeyken hafta numaraları bir çalışma haftası seçer

source: If the <guilabel>Week numbers select a work week when in work week mode</guilabel> box is checked, clicking on the week numbers along the side of the Date Navigator will navigate through work weeks rather than through normal 7-day weeks.
tr: <guilabel>Çalışma haftası kipindeyken hafta numaraları bir çalışma haftası seçer</guilabel> kutusu işaretliyse Tarih Gezgini’nin yan tarafındaki hafta numaralarına tıklamak, normal 7 günlük haftalar yerine çalışma haftaları arasında gezinmenizi sağlar.

source: <link linkend="agenda-view">Agenda View</link> options:
tr: <link linkend="agenda-view">Ajanda Görünümü</link> seçenekleri:

source: Hour size:
tr: Saat boyutu:

source: By using this you can control the height of the rows in the Agenda view.
tr: Ajanda görünümünde, bunu kullanarak satırların yüksekliğini kontrol edebilirsiniz.

source: Show icons in agenda view items
tr: Ajanda görünümü ögelerinde simgeleri göster

source: Check this box to display icons (reminder, recursion &etc;) in Agenda view items
tr: Ajanda görünümü ögelerinde simgeleri (hatırlatıcı, tekrar &vb;) görüntülemek için bu kutuyu işaretleyin

source: Show to-dos
tr: Yapılacak ögelerini göster

source: This check box toggles the display of to-dos in the Day, Week and Month views in the Agenda view. If you have too many to-dos which have a due date associated, you may want to turn them off to avoid clutter.
tr: Bu kutu, Ajanda görünümünde Gün, Hafta ve Ay görünümlerinde yapılacaklar listesini görüntüler arasında geçiş yapar. Bitiş tarihini ilişkilendiren çok fazla yapacağınız varsa dağınıklığı önlemek için bunları kapatmak isteyebilirsiniz.

source: Show current-time (Marcus Bains) line
tr: Mevcut zaman (Marcus Bains) çizgisini göster

source: This check box toggles on or off a red line in the Day or Week view indicating the current time (Marcus Bains line). This line gives you an indication of how much time is left &eg; until a meeting takes place.
tr: Bu kutusu, Gün veya Hafta görünümünde mevcut saati gösteren (Marcus Bains çizgisi) kırmızı bir çizgi açar veya kapatır. Bu satır size kalan süreyi, &örn; bir toplantı gerçekleşene kadar ne kadar zaman kaldığını belirtir.

source: Time range selection in agenda view starts event editor
tr: Ajanda görünümünde zaman aralığı seçimi etkinlik düzenleyicisini başlatır

source: Check this box to start the event editor automatically when you select a time range in the daily and weekly view. To select a time range, drag the mouse from the start time to the end time of the event you are about to plan.
tr: Günlük ve haftalık görünümlerde bir zaman aralığı seçtiğinizde etkinlik düzenleyicisini kendiliğinden başlatmak için bu kutuyu işaretleyin. Bir zaman aralığı seçmek için fareyi başlangıç zamanından planlamak istediğiniz etkinliğin bitiş zamanına sürükleyin.

source: Color Usage
tr: Renk Kullanımı

source: Select the <guilabel>Only calendar</guilabel> option if you would like to draw calendar items (both inside and border) in the color of their calendar.
tr: Takvim ögelerini (içini ve kenarlıklarını) takvimlerinin rengi ile boyamak için <guilabel>Sadece takvim</guilabel> seçeneğini seçin.

source: Please use the <link linkend="config-main-colors">Colors and Fonts</link> configuration page for setting these colors.
tr: Bu renkleri ayarlamak için <link linkend="config-main-colors">Renkler ve Yazı Tipleri</link> yapılandırma sayfasını kullanın.

source: Color busy days with a different background color
tr: Dolu günleri farklı arkaplan rengi ile boya

source: Check this box if you want Agenda view's background to be filled with a different color on days which have at least one all day event marked as busy.
tr: Ajanda görünümünün arka planının, dolu olarak işaretlenmiş en az bir gün boyu etkinliğinin olduğu günlerde farklı bir renkle doldurulmasını istiyorsanız bu kutuyu işaretleyin.

source: Please look in the Colors configuration area to select the Agenda view background busy color of your choosing.
tr: İstediğiniz Ajanda görünümü arka plan dolu rengini seçmek için lütfen Renkler yapılandırma alanına bakın.

source: Multiple Calendar Display
tr: Çoklu Takvim Görünümü

source: Select if all calendars should be merged into one Agenda view, each calendar should be displayed in its own Agenda view or if each view should be available via tabs. The side by side view can be customized with <guimenuitem>Configure View</guimenuitem> from the context menu.
tr: Eğer tüm takvimlerin bir Ajanda görünümüne birleştirilmesi gerekiyorsa, her takvim kendi Ajanda görünümünde gösterilmeli ya da her görünüm sekmeler ile erişilebilir olmalı. Bu yan yana görünüm içerik menüsünüde <guimenuitem>Görünümü Yapılandır</guimenuitem> altından özelleştirilebilir.

source: Month View tab
tr: Ay Görünümü sekmesi

source: <link linkend="month-view">Month view</link> options:
tr: <link linkend="month-view">Ay görünümü</link> seçenekleri:

source: Display Options
tr: Görünüm Seçenekleri

source: Use the first four check boxes to display the time, icons (reminder, recursion &etc;), to-dos or journals in Month view.
tr: Ay görünümünde zaman, simgeler (hatırlatıcı, tekrar, &vb;), yapıalcak ve günlükleri göstermek için ilk dört kutuyu işaretleyin.

source: Check this box if you want Month view's background to be filled with a different color on days which have at least one all day event marked as busy.
tr: Ay görünümünde en az bir tam gün etkinliği dolu olarak işaretlenmiş gün varsa onun arkaplanını farklı bir renge boyamak için bu kutuyu işaretleyin.

source: Please look in the Colors configuration area to select the Agenda/Month view background busy color of your choosing.
tr: Ajanda/Ay görünümü arkaplanı dolu rengini seçmek için Renkler yapılandırma alanına bakın.

source: Configure the colors for the Month view as in <link linkend="config-main-views-agenda">Agenda view</link>.
tr: Ay görünümündeki renkleri <link linkend="config-main-views-agenda">Ajanda görünümü</link> gibi yapılandır.

source: Todo View tab
tr: Yapılacak Görünümü sekmesi

source: <link linkend="todo-view">Todo view</link> options:
tr: <link linkend="todo-view">Yapılacak görünümü</link> seçenekleri:

source: Always display completed to-dos at the bottom of the list
tr: Tamamlanmış olan yapılacak işleri her zaman listenin altında göster

source: If you enable this option, all completed to-dos will be always grouped at the bottom of the To-do List.
tr: Eğer bu seçeneği etkinleştirirseniz, tüm tamamlanmış yapılacaklar, Yapılacak Listesinin en altında gruplanacaktır.

source: Record completed to-dos in journal entries
tr: Tamamlanmış yapılacakları günlük girdilerinde kaydet

source: If you check this box, &korganizer; will automatically add a journal entry for every completed to-do.
tr: Bu kutuyu işaretlerseniz, &korganizer; kendiliğinden her tamamlanmış yapılacak için bir günlük girdisi ekler.

source: Colors and Fonts
tr: Renkler ve Yazı Tipleri

source: Colors
tr: Renkler

source: Holiday color
tr: Tatil rengi

source: This button opens the <guilabel>Select Color</guilabel> dialog, allowing you to select the holiday color. The holiday color will be used for the holiday name in the Month view and the holiday date in the Date Navigator.
tr: Bu buton, tatil günlerinin rengini seçmenize izin veren <guilabel>Renk Seç</guilabel> penceresini açar. Tatil rengi, Ay görünümünde tatil ismi için ve Tarih Gezgininde tatil tarihi için kullanılır.

source: Agenda view background color
tr: Ajanda görünümü arkaplan rengi

source: This button opens the <guilabel>Select Color</guilabel> dialog, allowing you to select the Agenda view background color.
tr: Bu buton, Ajanda görünümü arkaplan rengini seçmeye izin veren <guilabel>Renk Seç</guilabel> penceresini açar.

source: Busy days background color
tr: Meşgul günler arkaplan rengi
