Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/korganizer.po
Languages: tr

source: An example: you are playing in a band and, from time to time, you give live concerts. To notify your fans about the concerts, you maintain a mailing list. If you use &korganizer; to organize your concert dates, you can just choose the <menuchoice><guimenu>Schedule</guimenu> <guimenuitem>Publish Item Information...</guimenuitem></menuchoice> menu item, put in the address of the mailing list and the event gets sent. Mailing list subscribers who use &korganizer; get the concert date automatically inserted in their calendar.
tr: Bir örnek: Bir grupta çalıyorsunuz ve zaman zaman canlı konserler veriyorsunuz. Hayranlarınızı konserler hakkında bilgilendirmek için bir e-posta listesi tutuyorsunuz. Konser tarihlerinizi düzenlemek için &korganizer; kullanıyorsanız yalnızca <menuchoice><guimenu>Program</guimenu> <guimenuitem>Öge Bilgilerini Yayımla…</guimenuitem></menuchoice> menü ögesini seçebilir, e-posta listesinin adresini girebilirsiniz ve etkinlik gönderilir. &korganizer; kullanan e-posta listesi aboneleri, konser tarihini kendiliğinden takvimlerine ekleyebilirler.

source: Publishing an event as described above will only inform the receiver about the event, but not give her the option to ask for attendance. Use <menuchoice><guimenu>Schedule</guimenu><guimenuitem>Send as iCalendar...</guimenuitem></menuchoice> if you want to provide that option instead.
tr: Yukarıda açıklandığı gibi bir etkinlik yayımlamak, alıcıyı yalnızca etkinlik hakkında bilgilendirir; ancak katılım isteme seçeneği sunmaz. Bunun yerine bu seçeneği sağlamak istiyorsanız <menuchoice><guimenu>Program</guimenu> <guimenuitem>iCalendar Olarak Gönder…</guimenuitem></menuchoice> ögesini kullanın.

source: Acting as Organizer in Group Scheduling
tr: Grup Programında Organizatör Olarak Görev Almak

source: When you create <link linkend="entering-data-events">an event</link> or <link linkend="entering-data-to-do">a to-do</link>, and <link linkend="entering-data-events-attendees">add attendees to it</link>, you are acting as the event organizer. To add attendees, use the <link linkend="entering-data-events-attendees"> attendee tab</link>, in the <guilabel>Edit Event</guilabel>, or <guilabel>Edit To-do</guilabel> dialog. In the <link linkend="agenda-view">Agenda view</link>, a little icon <inlinemediaobject> <imageobject> <imagedata fileref="organizer.png" format="PNG"/> </imageobject> <textobject> <phrase>Organizer Icon</phrase> </textobject> </inlinemediaobject> is placed in the event, if you are the organizer of a group scheduling event.
tr: Bir <link linkend="entering-data-events">etkinlik</link> veya <link linkend="entering-data-to-do">yapılacak</link> oluşturduğunuzda ve onlara <link linkend="entering-data-events-attendees">katılımcılar eklediğinizde</link>, etkinlik organizatörü olarak görev almış olursunuz. Katılımcılar eklemek için <guilabel>Etkinliği Düzenle</guilabel> veya <guilabel>Yapılacağı Düzenle</guilabel> iletişim kutusundaki <link linkend="entering-data-events-attendees">katılımcılar sekmesini</link> kullanın. Bir grup progamı etkinliğinin organizatörüyseniz <link linkend="agenda-view">Ajanda Görünümü</link>’nde etkinlikte bir <inlinemediaobject> <imageobject> <imagedata fileref="organizer.png" format="PNG"/> </imageobject> <textobject> <phrase>Organizatör Simgesi</phrase> </textobject> </inlinemediaobject> yerleştirilir.

source: The organizer is responsible for sending the invitations, collecting the attendees responses, and for keeping the data of the event or to-do up to date for all people involved.
tr: Organizatör, davetleri göndermek, katılımcıların yanıtlarını toplamak ve etkinlik veya yapılacaklar ile ilgili verileri ilgili herkes için güncel tutmaktan sorumludur.

source: Sending Invitations and Processing Responses
tr: Davetiye Gönderme ve Yanıtları İşleme

source: To organize an event or to-do, <link linkend="entering-data-events">create it</link> in &korganizer; and add all the people that should attend using the attendees tab. &korganizer; can send invitations to the attendees, either automatically (depending on <link linkend="config-main-groupscheduling">&korganizer; group scheduling configuration</link>), or by selecting the event or to-do and choosing the <menuchoice><guimenu>Schedule</guimenu><guimenuitem>Send Invitation to Attendees</guimenuitem></menuchoice> menu item. The attendees get an email containing all the relevant information for the event or to-do. They can respond to the meeting proposal by accepting or rejecting it or by making a counter proposal. They can also delegate or forward the invitation. All this information is sent to you by email again and, if you have configured &kmail; appropriately, the attendees responses are automatically inserted in your calendar. If there are additional attendees willing to participate (e.g. by accepting a forwarded invitation) you will be asked to accept the new attendees.
tr: Bir etkinlik veya yapılacak organize etmek için öncelikle onu &korganizer;’de <link linkend="entering-data-events">oluşturun</link> ve katılımcıları, katılımcılar sekmesini kullanarak ekleyin. &korganizer; katılımcılara davetiyeler gönderebilir. Gönderim işlemi kendiliğinden (<link linkend="config-main-groupscheduling">&korganizer; grup programı yapılandırmasını</link> kullanarak) veya etkinliği veya yapılacağı seçip <menuchoice><guimenu>Program</guimenu> <guimenuitem>Katılımcılara Davetiye Gönder</guimenuitem></menuchoice> menü ögesini kullanarak yapılabilir. Katılımcılar, etkinlik veya yapılacaklar için tüm ilgili bilgileri içeren bir e-posta alırlar. Toplantı teklifine kabul ederek veya reddederek veya karşı teklifte bulunarak yanıt verebilirler. Ayrıca daveti devredebilir veya iletebilirler. Tüm bu bilgiler size tekrar e-postayla gönderilir ve &kmail; yazılımını uygun şekilde yapılandırdıysanız katılımcıların yanıtları kendiliğinden takviminize eklenir. Katılmaya istekli ek katılımcılar varsa (örneğin, iletilen bir daveti kabul ederek) yeni katılımcıları kabul etmeniz istenecektir.

source: Cancelling an Event or To-do
tr: Bir Etkinliği veya Yapılacakları İptal Etmek

source: To cancel an event or to-do you have to be the organizer. If you checked the <guilabel>Use Groupware Communication</guilabel> box in the <link linkend="config-main-groupscheduling">&korganizer; group scheduling configuration</link>, just delete the item, and &korganizer; will ask you to send the cancellation. If not, simply select the item, and choose the <menuchoice><guimenu>Schedule</guimenu> <guimenuitem>Send Cancellation to Attendees</guimenuitem></menuchoice> menu item.
tr: Bir etkinliği veya yapılacağı iptal etmek için onun organizatörü olmanız gerekir. <link linkend="config-main-groupscheduling">&korganizer; grup programı yapılandırmasındaki</link> <guilabel>Grup Yazılımı iletişimini kullan</guilabel> kutusunu işaretlediyseniz yalnızca ögeyi silin ve &korganizer; size iptal göndermeniz için soracaktır. Aksi takdirde yalnızca ögeyi seçin ve <menuchoice><guimenu>Program</guimenu> <guimenuitem>Katılımcılara İptal Gönder</guimenuitem></menuchoice> menü ögesini seçin.

source: This action will send a cancel-message to all attendees, so they can remove the item from their calendars too.
tr: Bu eylem, tüm katılımcılara bir iptal iletisi gönderir, böylece katılımcılar da ögeyi takvimlerinden kaldırabilirler.

source: Acting as the Attendee
tr: Katılımcı Gibi Davranmak

source: When you get an email with an invitation and accept it, the event or to-do is added to your calendar. If it is an event, a little icon <inlinemediaobject> <imageobject> <imagedata fileref="meeting-attending.png" format="PNG"/> </imageobject> <textobject> <phrase>Attendee Icon</phrase> </textobject> </inlinemediaobject> is placed in the event in the <link linkend="agenda-view">Agenda view</link>.
tr: Bir davetiye içeren bir e-posta aldığınızda ve onu kabul ettiğinizde, etkinlik veya yapılacak takviminize eklenir. Bu bir etkinlikse <link linkend="agenda-view">Ajanda Görünümü</link>’nde küçük bir <inlinemediaobject> <imageobject> <imagedata fileref="meeting-attending.png" format="PNG"/> </imageobject> <textobject> <phrase>Katılımcı Simgesi</phrase> </textobject> </inlinemediaobject> etkinliğe eklenir.

source: Answering an Invitation
tr: Bir Davetiyeyi Yanıtlamak

source: If you have an invitation in your &kmail; inbox you can either press <guibutton>Reject</guibutton> to ignore the request, or press <guibutton>Accept</guibutton> or <guibutton>Accept Cond.</guibutton>. The last two actions will insert the item into your calendar. In any case, &kmail; will send your response to the organizer automatically.
tr: &kmail; gelen kutunuzda bir davetiyeniz varsa isteği yok saymak için <guibutton>Reddet</guibutton> düğmesine, kabul etmek içinse <guibutton>Kabul Et</guibutton> veya <guibutton>Koşullu Kabul Et</guibutton> düğmesine basın. Son iki eylem ögeyi takviminize ekler. Her durumda &kmail;, yanıtınızı kendiliğinden organizatöre gönderir.

source: You can also <guibutton>Delegate</guibutton> or <guibutton>Forward</guibutton> the invitation. When delegating, you can suggest another person as your proxy. Using <guibutton>Forward</guibutton> you can forward the invitation to one or more people not yet invited. When the receiver of the delegation or forward accepts the invitation, the organizer will be asked to approve the new attendee.
tr: Davetiyeyi <guibutton>Delege Et</guibutton> veya <guibutton>İlet</guibutton> yapabilirsiniz. Delege ederken, başka bir kişiyi vekiliniz olarak önerebilirsiniz. <guibutton>İlet</guibutton>’u kullanarak daveti henüz davet edilmemiş bir veya daha fazla kişiye iletebilirsiniz. Delege etme veya iletme alıcısı daveti kabul ettiğinde, organizatörden yeni katılımcıyı onaylaması istenecektir.

source: If for any reason you changed your mind, edit your status in the item's <link linkend="entering-data-events-attendees">attendee tab</link>. If you checked the <guilabel>Use Groupware Communication</guilabel> box in the <link linkend="config-main-groupscheduling">&korganizer; group scheduling configuration</link>, &korganizer; will ask you to send an email updating your attendee status. If not, choose the <menuchoice> <guimenu>Schedule</guimenu><guimenuitem>Send Status Update</guimenuitem> </menuchoice> menu item to send your status update.
tr: Herhangi bir nedenden olayı fikrinizi değiştirirseniz durumunuzu, ögenin <link linkend="entering-data-events-attendees">katılımcı sekmesinden</link> düzenleyin. <link linkend="config-main-groupscheduling">&korganizer; grup programı yapılandırması</link> bölümünde <guilabel>Grup yazılımı iletişimini kullan </guilabel> kutusunu işaretlediyseniz &korganizer; size, katılım durumunuzu güncellediğinizi bildiren bir e-posta göndermek isteyip istemediğinizi soracaktır. İstemezseniz <menuchoice> <guimenu>Program</guimenu><guimenuitem>Durum Güncellemesi Gönder</guimenuitem> </menuchoice> menü ögesinden durum güncellemenizi kendiniz gönderebilirsiniz.

source: Sending an Alternative Proposal
tr: Alternatif Bir Teklif Yollamak

source: If you are not satisfied with some of the characteristics of the event or to-do you got invited to, and want to send a counter proposal to the organizer (for instance an alternative location or time), just edit the item and send it back as your proposal, by selecting the item and choosing the <menuchoice> <guimenu>Schedule</guimenu><guimenuitem>Request Change</guimenuitem> </menuchoice> menu item.
tr: Davet edildiğiniz etkinlik veya yapılacak işin bazı özelliklerinden memnun kalmazsanız ve organizatöre karşı bir teklif göndermek isterseniz (örneğin alternatif bir yer veya zaman) öğeyi düzenleyip ve seçip <menuchoice> <guimenu>Program</guimenu><guimenuitem>Değişiklik İste</guimenuitem> </menuchoice> menü ögesini seçerek bir teklif olarak geri gönderebilirsiniz.

source: The organizer of the event will get your proposal by email, and will be able to accept it or decline.
tr: Etkinlik organizatörü teklifinizi e-posta yoluyla alacak ve kabul veya ret edebilecektir.

source: Requesting the Latest Version of an Event or To-do
tr: Bir Etkinliğin veya Yapılacağın En Son Sürümünü İstemek

source: To request the latest version of an event or to-do, select the item, and choose the <menuchoice><guimenu>Schedule</guimenu> <guimenuitem>Request Update</guimenuitem></menuchoice> menu item. The organizer should then send you back the latest version of the item.
tr: Bir etkinliğin veya yapılacağın en son sürümünü istemek için ögeyi seçin ve <menuchoice><guimenu>Program</guimenu> <guimenuitem>Güncelleme İste</guimenuitem></menuchoice> menü ögesini kullanın. Organizatör, ögenin güncel sürümünü size yollamalıdır.

source: Free Busy information
tr: Uygun/Meşgul Bilgisi

source: The free/busy information represents an availability schedule. By presenting the intervals when one already has previous commitments, others can avoid arranging appointments for these periods. Note that only the times are published, not the events, reasons or attendees.
tr: Uygun/Meşgul bilgisi, bir müsaitlik programını temsil eder. Birinin daha önceden taahhütleri olduğu aralıkları sunarak, diğerleri bu dönemler için randevu ayarlamaktan kaçınabilir. Yalnızca zamanların yayınlandığını, etkinliklerin, nedenlerin veya katılımcıların yayınlanmadığını unutmayın.

source: &korganizer; supports publishing and retrieving free/busy information, either manually or automatically.
tr: &korganizer;, uygun/meşgul bilgilerinin elle veya kendiliğinden yayınlanmasını ve alınmasını destekler.

source: To email your free/busy information, choose the <menuchoice><guimenu>Schedule</guimenu> <guimenuitem>Mail Free Busy Information...</guimenuitem></menuchoice> menu item. Enter the email addresses you want to send the information to in the dialog and press <guilabel>OK</guilabel>.
tr: Uygun/Meşgul bilginizi e-posta ile göndermek için <menuchoice><guimenu>Program</guimenu> <guimenuitem>Uygun/Meşgul Bilgisini E-posta ile Gönder…</guimenuitem></menuchoice> menü ögesini seçin. İletişim kutusunda göndermek istediğiniz e-posta adreslerini girin ve <guilabel>Tamam</guilabel> düğmesine basın.

source: Groupware servers usually have a standard location for uploading your free busy information, so that other users can access your data, and you can access other user's free busy schedule. You can configure &korganizer; to upload and download free busy information automatically, using the <link linkend="config-main-free-busy">Free Busy preferences</link>, in the &korganizer; <guilabel>Configure</guilabel> dialog.
tr: Grup Yazılımı sunucuları genellikle uygun/meşgul bilgilerinizi yüklemek için standart bir konuma sahiptir, böylece diğer kullanıcılar verilerinize erişebilir ve siz de diğer kullanıcıların uygun/meşgul programlarına erişebilirsiniz. &korganizer;’ün uygun/meşgul bilgisini kendiliğinden indirmesini/yüklemesini istiyorsanız bunu &korganizer; <guilabel>Yapılandırma</guilabel> iletişim kutusunun <link linkend="config-main-free-busy">Uygun/Meşgul Tercihleri</link> sayfasından yapılandırabilirsiniz.

source: To upload your free/busy information to the server set in &korganizer; preferences, choose the <menuchoice><guimenu>Schedule</guimenu> <guimenuitem>Upload Free Busy Information</guimenuitem></menuchoice> menu item.
tr: &korganizer; tercihlerinde ayarlanan sunucuya uygun/meşgul bilgilerinizi yüklemek için <menuchoice><guimenu>Program</guimenu> <guimenuitem>Uygun/Meşgul Bilgisini Yükle</guimenuitem></menuchoice> menü ögesini seçin.

source: Examples
tr: Örnekler

source: Entering a New Group Event
tr: Yeni Bir Grup Etkinliği Girmek

source: In this example, you'll enter an event. You need to arrange a meeting on <emphasis>the next Monday</emphasis> regarding launch of your new Product. Your boss <emphasis>Joan Holden</emphasis> will be the event chairwoman <emphasis>owner</emphasis>, and you, Jack Smith, will be the event <emphasis>organizer</emphasis>. There will be two more <emphasis>attendees</emphasis> (participants): <emphasis>Peter Krzinski</emphasis> and <emphasis>Kirsten Friese</emphasis>. Joan gave you the program of the meeting. The appointment will start at <emphasis>12 noon</emphasis> and end at <emphasis>1 pm</emphasis>. The same appointment should be scheduled <emphasis>(recurred)</emphasis> each Monday.
tr: Bu örnekte bir etkinlik gireceksiniz. <emphasis>Önümüzdeki Pazartesi</emphasis>, yeni çıkacak ürününüzle ilgili bir toplantı ayarlamanız gerekiyor. Patronunuz <emphasis>Ayça Korkmaz</emphasis> toplantı <emphasis>başkanı</emphasis> ve siz Alp Demirtaş, etkinlik <emphasis>organizatörü</emphasis> olacaksınız. Ek olarak iki tane daha <emphasis>katılımcı</emphasis> olacak: <emphasis>Tunç Yıldırım</emphasis> ve <emphasis>Gökçe Yıldız</emphasis>. Ayça size toplantı programını verdi. Etkinlik <emphasis>öğlen 12</emphasis>’de başlayacak ve <emphasis>saat 1</emphasis>’de bitecek. Aynı etkinliğin her Pazartesi <emphasis>yinelenmesi</emphasis> gerekiyor.

source: Using the Date Navigator, go to the next Monday.
tr: Tarih Gezgini’ni kullanarak gelecek Pazartesi’ye gidin.

source: Choose the <menuchoice><guimenu>Actions</guimenu><guimenuitem>New Event...</guimenuitem></menuchoice>, or select the area between <emphasis>12 noon</emphasis> and end at<emphasis>1 pm</emphasis>, and start typing the event summary.
tr: <menuchoice><guimenu>Eylemler</guimenu><guimenuitem>Yeni Etkinlik…</guimenuitem></menuchoice> menü ögesini seçin veya <emphasis>öğlen 12</emphasis> ve <emphasis>saat 1</emphasis> arasındaki alanı seçip etkinlik özetini yazmaya başlayın.

source: Enter a suitable summary. It's important to choose the right brief description, because it appears in many places. We suggest that you enter <userinput>Product launch event</userinput>.
tr: Uygun bir özet girin. Kısa ve öz bir açıklama yazmak önemlidir; çünkü birden çok yerde görünür. Bu etkinlik için <userinput>Ürün Lansmanı</userinput> yazabiliriz.

source: Enter the detailed event program into the largest rectangle area. For the sake of this simple example, enter <userinput>Introduction, The Plan, Conclusion</userinput> on three separate lines.
tr: Ayrıntılı etkinlik programını en büyük dikdörtgen alana girin. Bu basit örnek için, <userinput>Giriş, Plan, Sonuç</userinput> sözcüklerini üç ayrı alana yazın.

source: Go to the <guilabel>Reminder</guilabel> tab. Set the reminder time to 15 minutes, just long enough to brew a cup of tea prior to the meeting start.
tr: <guilabel>Anımsatıcı</guilabel> sekmesine gidin. Anımsatma süresini 15 dakikaya ayarlayın, toplantı başlamadan önce bir bardak çay içmek için yeterli bir süre.

source: Go to the <guilabel>General</guilabel> tab. Select <guilabel>Appointment</guilabel> from the <guilabel>Manage Tags</guilabel> dialog.
tr: <guilabel>Genel</guilabel> sekmesine gidin. <guilabel>Künyeleri Yönet</guilabel> iletişim kutusundan <guilabel>Randevu</guilabel>’yu seçin.

source: Go to the <guilabel>Recurrence</guilabel> tab and select the <guilabel>Weekly</guilabel> repeats.
tr: <guilabel>Yineleme</guilabel> sekmesine gidin ve <guilabel>Haftalık</guilabel> yinelemeyi seçin.

source: Most work has been done for you automatically. &korganizer; defaults to recurring weekly. Also note that <guilabel>Ends:</guilabel> <guilabel>never</guilabel> is chosen. This means that this event will be repeated each Monday (starting, of course, on Monday August 30, 2010) until the end of time (that is, until you delete it).
tr: İşin çoğu sizin için kendiliğinden yapılır. &korganizer; öntanımlı olarak haftalık yineleme kullanır. Ayrıca, <guilabel>Bitiş:</guilabel> bölümünün <guilabel>asla</guilabel> olarak seçildiğine dikkat edin. Bu, etkinliğin her Pazartesi yineleneceğini belirtir (tabii ki ilk ayarladığınız Pazartesi’den başlayarak).

source: Since everything is all right here, click the <guilabel>Attendees</guilabel> tab.
tr: Buradaki işimiz bittiğine göre <guilabel>Katılımcılar</guilabel> sekmesine geçelim.

source: In the <guilabel>Attendees</guilabel> tab you should do the following:
tr: <guilabel>Katılımcılar</guilabel> sekmesinde şunları yapmalısınız:

source: You will see that you are the organizer of the event.
tr: Etkinliğin organizatörü olduğunuzu göreceksiniz.

source: In the first input field enter the email in the <userinput>Name &#060;email&#062;</userinput> format. In our example, enter <userinput>Joan Holden &#060;jholden@thiscompany.com&#062;</userinput>.
tr: İlk giriş alanında e-postayı <userinput>Ad &#060;e-posta&#062;</userinput> biçiminde girin. Bizim örneğimizde, <userinput>Ayça Korkmaz &#060;akorkmaz@bufirma.com&#062;</userinput> gibi olacak.

source: If the attendees are already in your &kde; address book, instead of typing the names and emails, you can press the <guibutton>Select Attendees...</guibutton> button to add them.
tr: Katılımcılar halihazırda &kde; adres defterinizde varsa adları ve e-postaları elle yazmak yerine <guibutton>Katılımcılar Seç…</guibutton> düğmesine tıklayarak listeden seçebilirsiniz.

source: Choose <emphasis>Chair</emphasis> as the role.
tr: Rol olarak <emphasis>Başkan</emphasis> seçin.

source: In the next input field enter <userinput>Peter Krzinski &#060;pkrzinski@thiscompany.com&#062;</userinput>.
tr: Bir sonraki giriş alanına <userinput>Tunç Yıldırım &#060;tyildirim@bufirma.com&#062;</userinput> girin.

source: In the next input field enter <userinput>Kirsten Friese &#060;kfriese@thiscompany.com&#062;</userinput>.
tr: Bir sonraki giriş alanına <userinput>Gökçe Yıldız &#060;gyildiz@bufirma.com&#062;</userinput> girin.

source: If you have configured &korganizer; to use groupware communication, you will be asked if you want to send an email to the attendees, with details of the event and asking for a response if the <guilabel>Request response</guilabel> box from the <guilabel>Attendees</guilabel> tab is checked. Else, you can send the invitations choosing the <menuchoice><guimenu>Schedule</guimenu> <guimenuitem>Send Invitation to Attendees</guimenuitem></menuchoice> menu item.
tr: &korganizer;’ü grup yazılımı iletişimini kullanmak için yapılandırdıysanız katılımcılara e-posta göndermeyi isteyip istemediğinizi soran bir iletişim kutusu açılacak. Bu iletişim kutusunda etkinliğin ayrıntıları ve <guilabel>Katılımcılar</guilabel> sekmesinde <guilabel>Yanıt iste</guilabel> kutusu işaretliyse yanıt istenip istenmeyeceği içerilir. Bunların dışında, <menuchoice><guimenu>Program</guimenu> <guimenuitem>Katılımcılara Davet Gönder</guimenuitem></menuchoice> menü ögesini kullanarak davetiyeleri gönderebilirsiniz.

source: Review the event setup by clicking on the tabs. If you are satisfied, click <guibutton>OK</guibutton>.
tr: Sekmelere tıklayarak etkinlik ayarlarını gözden geçirin. Memnunsanız <guibutton>Tamam</guibutton> düğmesine basın.

source: Congratulations, you've scheduled your first event!
tr: Tebrikler, ilk etkinliğinizi planladınız!

source: &korganizer; Configuration
tr: &korganizer; Yapılandırması

source: To change &korganizer;'s look and behavior, choose the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &korganizer;...</guimenuitem></menuchoice> menu item. You can get more information about all the configure options and possibilities in <xref linkend="config-main"/>.
tr: &korganizer;’ün görünüşünü ve davranışını değiştirmek için <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>&korganizer; Uygulamasını Yapılandır…</guimenuitem></menuchoice> menü ögesini seçin. Tüm yapılandırma seçenekleri ve olasılıkları için <xref linkend="config-main"/> bölümüne bakın.
