Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/korganizer.po
Languages: tr

source: <action>Choose this menu item to open the <guilabel>Edit Filters</guilabel> dialog</action>. Using this dialog, you can create, delete and edit filters that will affect which items will be displayed by &korganizer;.
tr: <action><guilabel>Filtreleri Düzenle</guilabel> penceresini açmak için bu menü ögesini seçin</action>. Bu pencereyi kullanarak, &korganizer; tarafından gösterilen ögeleri etkileyen filtreleri oluşturabilir, silebilir ve düzenleyebilirsiniz.

source: Other Features
tr: Diğer Özellikler

source: In this chapter, you'll learn of other useful features of &korganizer;: what tricks you can do with a click of your mouse.
tr: Bu bölümde, &korganizer;'ın diğer faydalı özelliklerini öğreneceksiniz: bir fare tıkı ile neler yapabilirsiniz.

source: Command Line
tr: Komut Satırı

source: A nice program to access a &kde; calendar from the command line is konsolekalendar.
tr: &kde; takvimine komut satırından ulaşmak için güzel bir program: konsolekalendar.

source: Drag and Drop Operations
tr: Sürükle Bırak İşlemleri

source: &korganizer; can be easily controlled with your mouse. The supported drag-and-drop operations are detailed below.
tr: &korganizer;, farenizle kolaylıkla kontro ledilebilir. Desteklenen sürükle-bırak işlemleri aşağıda açıklanmıştır.

source: Any event can be re-sized with your mouse. Simply move the mouse pointer near the top or bottom edge of the event, and drag the edge up or down. This way you can visually modify the starting and ending time of your appointment. This works in the Day, Week and Work Week views.
tr: Herhangi bir etkinlik farenizle yeniden boyutlandırılabilir. Basitçe fare işaretçisini etkinliğin, üst ya da alt kenarlarına taşıyın, ve kenarı yukarı ya da aşağı taşıyın. Bu yöntemle, görsel olarak randevunuzun başlangıç ve bitiş zamanını düzenlersiniz. Bu, Gün, Hafta ve İş Haftası görünümlerinde çalışır.

source: Any event can be rescheduled with your mouse. Move the mouse pointer over the event, and drag it to a new time location. This works in the Day, Week and Work Week views.
tr: Herhangi bir etkinlik fare ile yeniden programlanabilir. Fare işaretçisini etkinliğin üzerine getirin ve yeni bir saat konumuna sürükleyin. Bu, Gün, Hafta ve İş Haftası görünümlerinde çalışır.

source: Events can be copied to other, presently non-visible dates. Move the mouse pointer over the event, and drag it to the Date Navigator on the left side of the current calendar, or to the Date Navigator of a different calendar.
tr: Etkinlikler diğer, şu anda görünmeyen tarihlere kopyalanabilir. Fare işaretçisini olayın üzerine getirin ve onu geçerli takvimin solundaki Tarih Gezginine veya farklı bir takvimin Tarih Gezgini’ne sürükleyin.

source: However, you cannot drag from Agenda view in one calendar to Agenda view in another calendar.
tr: Ancak, bir takvimin Ajanda görünümünden başka bir takvimin Ajanda görünümüne sürükleyemezsiniz.

source: Toolbars can be dragged on the screen. Move the mouse pointer over the toolbar's handle, and drag it to a new location on your screen.
tr: Araç çubukları ekranda sürüklenebilir. Fare işaretçisini araç çubuğunun sapına getirin ve ekranınızdaki yeni bir konuma sürükleyin.

source: Questions and Answers
tr: Sorular ve Cevaplar

source: Can I use freebusy-time with &korganizer;?
tr: &korganizer; ile freebusy-time kullanabilir miyim?

source: Yes, follow the instructions in <link linkend="config-main-free-busy">Free/Busy</link>.
tr: Evet, şuradaki yönergeleri takip edin: <link linkend="config-main-free-busy">Uygun/Dolu</link>.

source: Credits and License
tr: Hazırlayanlar ve Lisans

source: Program copyright 2000-2010, The &kde; Developers
tr: Program telif hakkı 2000–2010, &kde; Geliştiricileri

source: Contributors:
tr: Katkıda Bulunanlar:

source: CREDIT_FOR_TRANSLATORS
tr: <othercredit role="translator"><firstname>Mesutcan</firstname><surname>Kurt</surname><affiliation><address><email>mesutcank@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Glossary
tr: Sözlük

source: Calendar Widget
tr: Takvim Parçacığı

source: A tool for choosing the date inside certain entry windows, such as the event editing window. It is displayed as a small button to the right of the date field. When you click the button, you will see a month calendar. Use the arrows to go to a desired date, or click the month name or year number to go directly to the desired month or year.
tr: Etkinlik düzenleme penceresi gibi belirli giriş pencerelerindeki tarih seçimi için bir araç. Tarih alanının sağında küçük bir buton olarak görüntülenir. Butona tıkladığınızda, bir ay takvimi görürsünüz. İstenilen tarihe gitmek için okları kullanın veya doğrudan istediğiniz ay veya yıla gitmek için ayın adını veya yıl numarasını tıklayın.

source: Date Navigator
tr: Tarih Gezgini

source: The calendar that is in the upper-left corner of the &korganizer; window. It is the main way provided to navigate among dates, and to select from them. The single-arrow icons move forwards and backwards in time by increments of a month, while the double-arrows allow moving by a year at a time. Today's date will be outlined with a small box. Dates which have events scheduled on them will be bold. If you want to select a date, simply click it. Hold down the &Ctrl; key and click the dates if you wish to select multiple neighboring dates at once. The dates will be displayed in the main panel.
tr: &korganizer;'ın penceresinin sol üst köşesindeki takvim. Tarihler arasında gezinmenin ve onlardan seçim yapmanın ana yoludur. Tek ok simgeleri bir ay art arda ileriye doğru ve geriye doğru hareket ederken çift oklar bir defada bir yıl hareket etmeyi sağlar. Bugünün tarihi küçük bir kutu ile gösterilecek. Üzerinde etkinlikler planlanan tarihler koyu olacak. Bir tarih seçmek isterseniz tıklayın. Aynı anda birden fazla komşu tarih seçmek isterseniz, &Ctrl; tuşuna basın ve tarihlere tıklayın. Tarihler ana panelde görüntülenir.

source: Recurring events are not always displayed. You can prevent the display of recurring appointments in the Date Navigator. Get more information in the <link linkend="config-main-views">Views chapter</link>.
tr: Tekrarlanan etkinlikler he zaman gösterilmezler. Tarih Gezgininde tekrarlanan randevularınızın gösterimini engelleyebilirsiniz. Daha fazla bigiyi <link linkend="config-main-views">Görünüm bölümünden</link> alabilirsiniz.

source: Due Date
tr: Bitiş Tarihi

source: A due date is simply the date when your to-do must be finished. For instance, if your to-do is that you must return your books to the library by 16th November, that date is called <quote>the to-do due date</quote>
tr: Bitiş tarihi, bitmesi gereken yapılacak ögenizin tarihidir. Örneğin, 16 Kasım’da kütüphaneye kitapları götürmek bir yapılacak öge ise, o tarih <quote>yapılacak ögenin bitiş tarihidir</quote>

source: Main panel
tr: Ana panel

source: Normally the largest part of the screen, to the right of the Date Navigator. It displays the View of the Day, Workdays, Week or Month, the List View or the To-do List view.
tr: Tarih Gezgininin sağındaki, normalde ekrandaki en büyük parçadır. Gün, İş günleri, Hafta ya da Ay, Liste Görünümü ya da Yapılacak Listesi görünümünü gösterir.

source: The right mouse button can be used in the List view and To-do List view only. It displays a local menu. The left mouse button can be used in any view.
tr: Sağ fare düğmesi, yalnızca Liste görünümü ve Yapılacak Listesi görünümünde kullanılabilir. Yerel bir menü görüntüler. Farenin sol düğmesi herhangi bir görünümde kullanılabilir.

source: Free/busy
tr: Boş/meşgul

source: The free/busy information is a set of busy time intervals. By presenting the intervals when one already has previous commitments, others can avoid arranging appointments for these periods. Note that only the times are published, not the event titles, descriptions or attendees. In other words, the free/busy information is the availability schedule.
tr: Uygun/dolu bilgisi yoğun zaman aralıkları dizisidir. Birinin önceden taahhüt ettiği zaman aralıkları sunarak, diğerleri bu dönemler için randevu almayı önleyebilir. Yalnızca etkinlik başlıkları, açıklamaları veya katılımcıları değil, yalnızca zamanların yayınlandığını unutmayın. Başka bir deyişle, uygun/dolu bilgileri kullanılabilirlik zamanlamasıdır.

source: When adding attendees to your event, you need to know if they are busy or free at that particular time before sending the invitations. If the attendees make their free/busy information available, &korganizer; can retrieve this information and display it in the <guilabel>Free/Busy</guilabel> tab of the <guilabel>Edit Event</guilabel> dialog.
tr: Etkinliğinize katılımcı eklerken, onlara davetiye göndermeden önce onların o zamanda uygun mu dolu mu olduğunu bilmeniz gerekir. Eğer katılımcılar kendi uygun/dolu bilgisini kullanılabilir yaparsa, &korganizer; bu bilgiyi getirebilir ve onu <guilabel>Etkinlik Düzenle</guilabel> penceresindeki <guilabel>Uygun/Dolu</guilabel> sekmesinde gösterebilir.
