Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/korganizer.po
Languages: tr

source: Adding a New &korganizer; Resource
tr: Yeni Bir &korganizer; Özkaynağı Eklemek

source: Open &korganizer;'s settings dialog with <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &korganizer;...</guimenuitem></menuchoice> and select the <guilabel>Calendars</guilabel> tab from the <guilabel>General</guilabel> page.
tr: <menuchoice><guimenu>Ayarlar</guimenu> <guimenuitem>&korganizer;’ü Yapılandır…</guimenuitem></menuchoice> menü ögesiyle &korganizer;’ün ayarlar iletişim kutusunu açın ve <guilabel>Genel</guilabel> panelinden <guilabel>Takvimler</guilabel> sekmesine geçin.

source: Alternatively open the context menu in the <guilabel>Calendar Manager</guilabel> sidebar with a &RMB; click and select <guilabel>Add Calendar...</guilabel>
tr: Alternatif olarak, <guilabel>Takvim Yöneticisi</guilabel> kenar çubuğunda &RMB; ile tıklayın ve <guilabel>Takvim Ekle…</guilabel>’yi seçin.

source: If the <guilabel>Calendar Manager</guilabel> is not displayed on the sidebar, choose the <menuchoice><guimenu>Settings</guimenu><guisubmenu>Sidebar</guisubmenu> <guimenuitem>Show Calendar Manager</guimenuitem></menuchoice> menu item to display it.
tr: Kenar çubuğunda <guilabel>Takvim Yöneticisi</guilabel> görüntülenmiyorsa onu görüntülemek için <menuchoice><guimenu>Ayarlar</guimenu> <guisubmenu>Kenar Çubuğu</guisubmenu> <guimenuitem>Takvim Yöneticisini Göster</guimenuitem></menuchoice> menü ögesini seçin.

source: Press the <guibutton>Add...</guibutton> button to add new resources to the list of available resources.
tr: Kullanılabilir özkaynaklar listesine yeni özkaynaklar eklemek için <guibutton>Ekle…</guibutton> düğmesine basın.

source: Select the resource to enable it.
tr: Etkinleştirmek için özkaynağı seçin.

source: Later, if you want to edit or delete a resource, select it on the <guilabel>Calendar Manager</guilabel> sidebar and press <guibutton>Delete Calendar</guibutton> to delete it or <guibutton>Calendar Properties...</guibutton> to modify it.
tr: Daha sonra bir özkaynağı düzenlemek veya silmek isterseniz onu <guilabel>Takvim Yöneticisi</guilabel> kenar çubuğunda seçin ve silmek için <guibutton>Takvimi Sil</guibutton>’e veya üzerinde değişiklik yapmak için <guibutton>Takvim Özellikleri…</guibutton> ögesini kullanın.

source: Among the existing resources, you can find in &korganizer;:
tr: &korganizer;’de kullanılabilir olan özkaynaklar içinde şunları bulabilirsiniz:

source: Birthdays &amp; Anniversaries
tr: Doğum Günleri ve Yıldönümleri

source: Provides access to birthday and anniversary dates of contacts in your address book as calendar events.
tr: Adres defterinizdeki kişilerin doğum günü ve yıldönümü tarihlerine takvim etkinlikleri olarak erişim sağlar.

source: DAV groupware resource
tr: DAV group yazılımı özkaynağı

source: Resource to manage DAV calendars and address books (CalDAV, GroupDAV).
tr: DAV takvimlerini ve adres defterlerini yönetmek için özkaynak (CalDAV, GroupDAV).

source: Google Calendars and Tasks
tr: Google Takvim ve Görevler

source: Access your Google Calendars and Tasks.
tr: Google Takvim ve Görevlerinize erişin.

source: iCal Calendar File
tr: iCal Takvim Dosyası

source: Loads data from an iCal file.
tr: iCal dosyasından veri yükler.

source: iCal Calendar Folder
tr: iCal Takvim Klasörü

source: Provides access to calendar items, each stored in a single file, in a given directory.
tr: Belirli bir dizinde her biri tek bir dosyada saklanan takvim ögelerine erişim sağlar.

source: KAlarm Calendar File
tr: K Alarm Takvim Dosyası

source: Loads data from a KAlarm calendar file.
tr: K Alarm takvim dosyasından veri yükler.

source: KAlarm Calendar Directory
tr: K Alarm Takvim Dizini

source: Loads data from a local KAlarm folder.
tr: Yerel K Alarm dizininden veri yükler.

source: Kolab Groupware Server
tr: Kolab Grup Yazılımı Sunucusu

source: Provides access to Kolab groupware folders and e-mail on a Kolab IMAP Server.
tr: Bir Kolab IMAP Sunucusu üzerinde Kolab grup yazılımı klasörlerine ve e-postaya erişim sağlar.

source: Open-Xchange Groupware Server
tr: Open-Xchange Grup Yazılımı Sunucusu

source: Provides access to the appointments, tasks, and contacts of an Open-Xchange groupware server.
tr: Open-Xchange grup yazılımı sunucusundaki toplantı, yapılacaklar ve kişilere erişimi sağlar.

source: Importing, Exporting and Maintaining Calendars
tr: Takvimler İçe Aktarmak, Takvimleri Dışa Aktarmak ve Yönetmek

source: While local files are just one among many other resources that can be used by &korganizer;, they are the most convenient way to share calendars, save copies, or import items from your old calendar program.
tr: Yerel dosyalar, &korganizer; tarafından kullanılabilecek diğer birçok özkaynaktan yalnızca biri olsa da, takvimleri paylaşmanın, kopyaları kaydetmenin veya eski takvim programınızdan ögeler içe aktarmanın en uygun yoludur.

source: Importing Calendars
tr: Takvim İçe Aktarmak

source: If you have an iCalendar or vCalendar file, and you would like to import it, choose the <menuchoice><guimenu>File</guimenu> <guisubmenu>Import</guisubmenu><guimenuitem>Import Calendar...</guimenuitem> </menuchoice> menu item. &korganizer; will ask you if you want to <guilabel>Add as new calendar</guilabel>, which adds the calendar file as a new local file resource or <guilabel>Merge into existing calendar</guilabel>, which merges the calendar items into an existing resource.
tr: Bir iCalendar veya vCalendar dosyanız varsa ve onu içe aktarmak istiyorsanız <menuchoice><guimenu>Dosya</guimenu> <guisubmenu>İçe Aktar</guisubmenu> <guimenuitem>Takvim İçe Aktar</guimenuitem></menuchoice> menü ögesini kullanın. &korganizer; size takvimi yeni bir yerel özkaynak olarak ekleyen <guilabel>Yeni Takvim Olarak Ekle</guilabel> mi yoksa takvim ögelerini var olan bir özkaynağa birleştiren <guilabel>Var Olan Takvime Birleştir</guilabel> mi yapmak istediğinizi soracaktır.

source: A good time to do this would be if you received a vCalendar with a few entries via email, for instance, or if you are planning to import your calendar from another application. In the latter case, the first thing to do is to use that application to export the calendar data in one of the formats above, or use a tool to convert from the application's native format.
tr: Örneğin, e-posta yoluyla birkaç girdisi olan bir vCalendar aldıysanız veya takviminizi başka bir uygulamadan içe aktarmayı planlıyorsanız bunu yapmak için iyi bir zaman olacaktır. İkinci durumda yapılması gereken ilk şey, takvim verilerini yukarıdaki biçimlerden birinde dışa aktarmak için söz konusu uygulamayı kullanmak veya uygulamanın yerel biçiminden dönüştürmek için bir araç kullanmaktır.

source: Exporting Calendars
tr: Takvimleri Dışa Aktarmak

source: You can export your data as an iCalendar file, which is supported by most scheduling applications. &korganizer; will export all calendar items from the enabled (checked) resources which are <link linkend="filters-view">not filtered out</link> (let's call these items <quote>active</quote> items). In other words, if you cannot see a calendar item, it won't be in the exported file. To filter out the undesired items before exporting them, you can create <link linkend="filters-view">filters</link>. Filters are even more effective if you classify your events and to-dos with <link linkend="categories-view">tags</link>. To enable and disable resources, check or uncheck the resource box in the <link linkend="managing-resources"><guilabel>Calendar Manager</guilabel> </link> sidebar.
tr: Verilerinizi, çoğu planlama uygulaması tarafından desteklenen bir iCalendar dosyası olarak dışa aktarabilirsiniz. &korganizer;, <link linkend="filters-view">işareti kaldırılmamış</link> (bunlara <quote>etkin</quote> ögeler diyelim) tüm özkaynaklardaki takvim ögelerini dışa aktaracaktır. Başka bir deyişle, bir takvim ögesini göremiyorsanız bu öge dışa aktarılan dosyada yer almayacaktır. İstenmeyen ögeleri dışa aktarmadan önce süzmek istiyorsanız <link linkend="filters-view">süzgeçler</link> oluşturabilirsiniz. Etkinliklerinizi ve yapılacaklarınızı <link linkend="categories-view">künyelerle</link> sınıflandırırsanız süzgeçler daha da etkili olurlar. Özkaynakları etkinleştirmek veya devre dışı bırakmak için <link linkend="managing-resources"><guilabel>Takvim Yöneticisi</guilabel></link> kenar çubuğundaki özkaynak kutusunu işaretleyin veya işaretini kaldırın.

source: To export all your <quote>active</quote> events, to-dos and journal entries (independent of to what resource they belong) as a new iCalendar file, choose the <menuchoice><guimenu>File</guimenu><guisubmenu>Export</guisubmenu> <guimenuitem>Export as iCalendar...</guimenuitem></menuchoice> menu item. The <guilabel>Save As</guilabel> dialog will pop up. Enter the file name and location for the new file to complete the export action.
tr: Tüm <quote>etkin</quote> etkinliklerinizi, yapılacaklarınızı ve günce girdilerinizi (hangi özkaynağa ait olduklarından bağımsız olarak) yeni bir iCalendar dosyası olarak dışa aktarmak için <menuchoice><guimenu>Dosya</guimenu> <guisubmenu>Dışa Aktar</guisubmenu> <guimenuitem>iCalendar Olarak Dışa Aktar…</guimenuitem></menuchoice> menü ögesini kullanın. <guilabel>Farklı Kaydet</guilabel> iletişim kutusu açılır. Dışa aktarma eylemini tamamlamak için yeni dosya için olan adı ve konumu girin.

source: Maintaining Your Calendars
tr: Takvimlerinizin Bakımını Yapmak

source: Contemporary computers have ample storage space. However, if you synchronize your &korganizer; calendar with a limited-memory machine like the Palm device, you will find archiving useful. The performance of &korganizer; can also become worse when there are many events. To archive old items, follow the procedure below:
tr: Çağdaş bilgisayarlar geniş depolama alanına sahiptir. Bununla birlikte, &korganizer; takviminizi Palm aygıtı gibi sınırlı bellekli bir makineyle eşzamanlarsanız arşivleme özelliğini yararlı bulacaksınız. Çok sayıda etkinlik olduğunda &korganizer;’ün başarımı kötüleşebilir. Eski ögeleri arşivlemek için aşağıdaki prosedürü izleyin:

source: Choose the <menuchoice><guimenu>File</guimenu><guimenuitem>Archive Old Incidences...</guimenuitem></menuchoice> menu item.
tr: <menuchoice><guimenu>Dosya</guimenu> <guimenuitem>Eski Olayları Arşivle…</guimenuitem></menuchoice> menü ögesini kullanın.

source: Fill in the date in <guilabel>Archive now items older than</guilabel> field or use the Calendar Widget to choose the date. Alternatively, you can automatically archive all items older than a certain period of time.
tr: <guilabel>Şundan daha eski olayları arşivle</guilabel> alanındaki tarihi doldurun veya bir tarih seçmek için takvim araç takımını kullanın. Alternatif olarak, belirli bir periyottan daha eski ögeleri kendiliğinden arşivleyebilirsiniz.

source: If you have chosen archiving, you must also provide a filename for the archive in the <guilabel>Archive File</guilabel> field. If you want to reuse an older archive file, press the <guilabel>Open file dialog</guilabel> button and find an existing archive. The entries will be added to the file, so any item already in the file will not be modified.
tr: Arşivlemeyi seçtiyseniz <guilabel>Arşiv dosyası</guilabel> alanındaki arşiv için bir dosya adı sağlamalısınız. Daha eski bir arşiv dosyasını yeniden kullanmak istiyorsanız <guilabel>Dosya İletişim Kutusunu Aç</guilabel> düğmesine basın ve var olan bir arşivi bulun. Girdiler dosyaya eklenir ve var olan girdilerde herhangi bir değişiklik yapılmaz.

source: Archiving will keep all old items in a file, including completed to-dos. But if you do not want to keep completed to-dos at all, choose the <menuchoice><guimenu>File</guimenu><guimenuitem>Purge Completed To-dos</guimenuitem> </menuchoice> menu item to remove all the completed to-dos from your active resources. If you want to keep your completed to-dos, but do not wish to view them in the to-do lists, consider <link linkend="filters-view">filtering them out</link> instead of purging them.
tr: Arşivlemek, tamamlanmış yapılacaklar da içerilmek üzere tüm eski ögeleri bir dosyada tutar. Tamamlanmış yapılacakları tutmak istemiyorsanız <menuchoice><guimenu>Dosya</guimenu> <guimenuitem>Tamamlanmış Yapılacakları Temizle</guimenuitem></menuchoice> menü ögesini kullanarak tüm tamamlanmış yapılacakları etkin özkaynaklarınızdan silin. Bunları tutmak; ancak listelerde görüntülemek istemiyorsanız onları silmek yerine <link linkend="filters-view">süzmeyi</link> düşünün.

source: Views and Filters
tr: Görünümler ve Süzgeçler

source: While calendars (resources) can hold events, to-dos and/or journal entries, these items are very different in nature. To-dos may have no date associated with them, so a schedule view is not suitable to them. Journal entries are a collection your reflections, occurrences or experiences. They require their own view mode, as they are not related with the list of upcoming events or the list of to-dos, &etc;
tr: Takvimler (özkaynaklar) etkinlikleri, yapılacakları ve/veya günce girdilerini tutabilirler; ancak bu ögelerin doğası çok farklıdır. Yapılacak işlerin kendileriyle ilişkilendirilmiş bir tarihi olmayabilir, bu nedenle bir program görünümü bunlara uygun değildir. Günce girdileri düşüncelerinizin, olaylarınızın veya deneyimlerinizin bir koleksiyonudur. Yaklaşan etkinlikler listesi veya yapılacaklar listesi vb. ile ilişkili olmadıkları için kendi görünüm kiplerini gerektirirler.

source: To solve the challenge of displaying your information in a useful and intuitive fashion, &korganizer; offers different views, filters and search capabilities. You can also assign tags to related events and to-dos, which will help you to view them later, using filters or colors.
tr: Bilgilerinizi kullanışlı ve sezgisel bir şekilde görüntülemenin zorluğunu çözmek için &korganizer; farklı görünümler, süzgeçler ve arama özellikleri sunar. Ayrıca ilgili etkinliklere ve yapılacak işlere künyeler atayabilirsiniz, bu da daha sonra süzgeçler veya renkler kullanarak bunları görüntülemenize yardımcı olur.

source: &korganizer; Views
tr: &korganizer; Görünümleri

source: In this section, we describe the different view modes, and present an overview of how to browse your personal data using &korganizer;.
tr: Bu bölümde, farklı görüntüleme kiplerini açıklıyoruz ve &korganizer; kullanarak kişisel verilerinize nasıl göz atacağınıza dair bir genel bakış sunuyoruz.

source: The &korganizer; window can be divided into two main areas: the main window and the sidebar. The main window displays the main views and the sidebar displays the Date Navigator, the To-do View, the Item Viewer and the Calendar Manager View. To show or hide the sidebar components, check or uncheck the menu items under the <menuchoice><guimenu>Settings</guimenu> <guisubmenu>Sidebar</guisubmenu></menuchoice> submenu.
tr: &korganizer; penceresi iki ana alana ayrılabilir: Ana pencere ve kenar çubuğu. Ana pencere ana görünümleri, kenar çubuğu ise Tarih Gezgini’ni, Yapılacaklar Görünümü’nü, Öğe Görüntüleyicisi’ni ve Takvim Yöneticisi Görünümü’nü görüntüler. Kenar çubuğu bileşenlerini gösterip gizlemek için <menuchoice><guimenu>Ayarlar</guimenu> <guisubmenu>Kenar Çubuğu</guisubmenu></menuchoice> alt menüsü altındaki menü ögelerini kullanın.

source: The Date Navigator is provided to browse and select dates. Today's date will be outlined with a small box, dates which have events scheduled on them will be bold (daily or weekly recurring events may not be marked as bold, <link linkend="config-main-views">depending on the view configuration</link>), and holidays will be colored red. If you want to jump to a date, simply click on it. Hold down the mouse to select multiple contiguous dates at once. The <guilabel>What's Next</guilabel>, <guilabel>List</guilabel>, <guilabel>Agenda</guilabel> and <guilabel>Journal</guilabel> views will only show events, to-dos or journals items from the dates selected in the Date Navigator. The <guilabel>Month</guilabel> view will show events or to-dos from the first month shown in the Date Navigator (the selected days in the month won't change the Month view, only month changes).
tr: Tarih Gezgini, tarihlerde gezmek ve onları seçmek için kullanılır. Bugünün tarihi küçük bir kutu içinde gösterilir, etkinlikleri olan günler kalın olur (<link linkend="config-main-views">görünüm yapılandırmasına bağlı olarak</link> günlük veya haftalık etkinlikler kalın ile imlenmemiş olabilir) ve tatiller kırmızı ile imlenir. Bir tarihe atlamak istiyorsanız yalnızca üzerine tıklayın. Aynı anda birden fazla bitişik tarih seçmek için fareyi basılı tutun. <guilabel>Sırada Ne Var</guilabel>, <guilabel>Liste</guilabel>, <guilabel>Ajanda</guilabel> ve <guilabel>Günce</guilabel> görünümleri, yalnızca Tarih Gezgini’nde seçili tarihlerdeki etkinlikleri, yapılacakları ve günce girdilerini gösterir. <guilabel>Ay</guilabel> görünümü, Tarih Gezgini’nde gösterilen ilk aydan itibaren etkinlikleri veya yapılacak işleri gösterir (ayın seçili günleri Ay görünümünü değiştirmez, yalnızca ay değişir).

source: The To-do View sidebar component lists your to-dos, just like the <link linkend="todo-view">To-do view</link>. It is useful if you want to see your to-dos while using the other views.
tr: Yapılacaklar kenar çubuğu bileşeni, aynı <link linkend="todo-view">Yapılacaklar Görünümü</link>’nde olduğu gibi yapılacaklarınızı listeler. Diğer görünümleri kullanırken yapılacak işlerinizi görmek istiyorsanız kullanışlıdır.

source: The Item Viewer sidebar component shows details of the currently selected events, to-dos or journal entries.
tr: Öge Görüntüleyicisi kenar çubuğu bileşeni, şu anda seçili olan etkinliklerin, yapılacakların veya günce girdilerinin ayrıntılarını gösterir.

source: Finally, Calendar Manager Viewer sidebar component allow you to enable or disable the resources on the list, by checking or unchecking the resource box, and to manage your resources. For more information, please check <xref linkend="managing-resources"/>.
tr: Son olarak, Takvim Yöneticisi Görüntüleyicisi kenar çubuğu bileşeni, özkaynak kutusunu işaretleyerek veya işaretini kaldırarak listedeki özkaynakları etkinleştirmenize veya devre dışı bırakmanıza ve özkaynaklarınızı yönetmenize olanak tanır. Daha fazla bilgi için lütfen <xref linkend="managing-resources"/> bölümüne bakın.

source: You can also browse your calendar view by choosing the <menuchoice><guimenu>Go</guimenu> <guimenuitem>Backward</guimenuitem></menuchoice> menu item (or pressing the <inlinemediaobject><imageobject><imagedata fileref="go-previous.png" format="PNG"/></imageobject></inlinemediaobject>toolbar button), which goes to the previous day, week, month or year, choosing the <menuchoice><guimenu> Go</guimenu><guimenuitem>Forward</guimenuitem></menuchoice> menu item (or pressing the <inlinemediaobject><imageobject> <imagedata fileref="go-next.png" format="PNG"/></imageobject> </inlinemediaobject>toolbar button), which goes to the next day, week, month or year (depending on the view), or choosing the <menuchoice><guimenu>Go</guimenu><guimenuitem>To Today</guimenuitem> </menuchoice> menu item (or pressing the <inlinemediaobject><imageobject> <imagedata fileref="go-jump-today.png" format="PNG"/></imageobject> </inlinemediaobject>toolbar button), which will include the current day in the current view.
tr: Takvimlerinizde ayrıca (görünüme bağlı olarak); önceki gün, hafta, ay veya yıl aralığında geri gitmek için <menuchoice><guimenu>Git</guimenu> <guimenuitem>Geri</guimenuitem></menuchoice> menü ögesini (veya <inlinemediaobject><imageobject><imagedata fileref="go-previous.png" format="PNG"/></imageobject></inlinemediaobject> araç çubuğunu düğmesini); önceki gün, hafta, ay veya yıl aralığında ileri gitmek için <menuchoice><guimenu>Git</guimenu><guimenuitem>İleri</guimenuitem></menuchoice> menü ögesini (veya <inlinemediaobject><imageobject><imagedata fileref="go-next.png" format="PNG"/></imageobject></inlinemediaobject> araç çubuğu düğmesini) veya geçerli görünümde bugünü içerecek olan <menuchoice><guimenu>Git</guimenu> <guimenuitem>Bugüne</guimenuitem></menuchoice> menü ögesini (veya <inlinemediaobject><imageobject><imagedata fileref="go-jump-today.png" format="PNG"/></imageobject></inlinemediaobject> araç çubuğunu düğmesini) kullanabilirsiniz.

source: What's Next View
tr: Sırada Ne Var Görünümü

source: This view displays events and to-dos in a simple format you can quickly read. All open to-dos will be displayed, but only the events from the days selected in the <guilabel>Date Navigator</guilabel> sidebar will be shown. Events and to-dos are displayed one per line.
tr: Bu görünüm, etkinlikleri ve yapılacak işleri tez okuyabileceğiniz basit bir biçimde görüntüler. Tüm açık yapılacaklar görüntülenir; ancak yalnızca <guilabel>Tarih Gezgini</guilabel> kenar çubuğunda seçilen günlerdeki etkinlikler gösterilir. Etkinlikler ve yapılacaklar her satırda bir tane gösterilir.

source: Switch to the What's Next view by choosing the <menuchoice><guimenu>View</guimenu> <guimenuitem>What's Next</guimenuitem></menuchoice> menu item.
tr: Sırada Ne Var görünümüne, <menuchoice><guimenu>Görünüm</guimenu> <guimenuitem>Sırada Ne Var</guimenuitem></menuchoice> menü ögesini seçerek geçin.

source: Event List View
tr: Etkinlik Listesi Görünümü

source: This view displays all your to-dos, events and journal entries for the dates selected in the Date Navigator as a list. Open to-dos that are not due on the selected dates are not shown. This view is good for displaying many different items in a compact fashion. It is also useful if your events are spread out over a long time period that would not be displayed completely on the screen when using one of the other views.
tr: Bu görünüm, Tarih Gezgini’nde seçilen tarihler için tüm yapılacak işlerinizi, etkinliklerinizi ve günce girdilerinizi bir liste olarak görüntüler. Seçilen tarihlerde bitiş tarihi gelmemiş olan açık yapılacak işler gösterilmez. Bu görünüm, birçok farklı ögeyi kompakt bir şekilde görüntülemek için iyidir. Ayrıca, etkinlikleriniz uzun bir zaman dilimine yayılmışsa ve diğer görünümlerden biri kullanıldığında ekranda tümüyle görüntülenemeyecekse de kullanışlıdır.

source: The items are displayed one per line. Columns show if a reminder is set (a bell icon displayed in it means the reminder is set), if it repeats multiple times (a chasing-arrows icon means a repeating event), the start and end time information. Hovering the mouse over an item will bring up a tooltip with detailed information about the item.
tr: Ögeler her satırda bir tane görüntülenir. Sütunlar bir anımsatıcının ayarlanıp ayarlanmadığını (içinde görüntülenen bir zil simgesi anımsatıcının ayarlandığı anlamına gelir), birden çok kez yinelenip yinelenmediğini (takip eden oklar simgesi yinelenen bir etkinlik olduğu anlamına gelir), başlangıç ve bitiş zamanı bilgilerini gösterir. Fareyi bir ögenin üzerine getirdiğinizde, öge hakkında ayrıntılı bilgi içeren bir araç ipucu görüntülenir.

source: Switch the display to the list view by choosing the <menuchoice><guimenu>View</guimenu> <guimenuitem>Event List</guimenuitem></menuchoice> menu item.
tr: <menuchoice><guimenu>Görünüm</guimenu> <guimenuitem>Etkinlik Listesi</guimenuitem></menuchoice> menü ögesini kullanarak görüntüyü liste yapın.

source: Agenda View
tr: Ajanda Görünümü
