Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/korganizer.po
Languages: tr

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu> Edit</guimenu> <guimenuitem>Redo</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu> Düzenle</guimenu> <guimenuitem>Tekrarla</guimenuitem>

source: <action>Redo the latest action</action>, or in other words, return the calendar to the state it was immediately before the latest undo.
tr: <action>Son eylemi tekrarlar</action>, ya da diğer bir deyişle, takvimi son geri almadan hemen önceki duruma getirir.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu> Edit</guimenu> <guimenuitem>Cut</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu> Düzenle</guimenu> <guimenuitem>Kes</guimenuitem>

source: Cuts the currently selected event(s) to the clipboard, removing them from your calendar.
tr: Mevcut seçili etkinlik(ler)i panoya keser, onları takviminizden siler.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu> Edit</guimenu> <guimenuitem>Copy</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu> Düzenle</guimenu> <guimenuitem>Kopyala</guimenuitem>

source: Copies the currently selected item(s) to the clipboard, but leaving them untouched.
tr: Mevcut seçili öge(ler)i panoya kopyalar, onlara bir şey yapmaz.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu> Edit</guimenu> <guimenuitem>Paste</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu> Düzenle</guimenu> <guimenuitem>Yapıştır</guimenuitem>

source: <guimenuitem>Paste</guimenuitem> <action>inserts the contents of the clipboard into your calendar</action>. The clipboard must contain a valid vCalendar or iCalendar item, provided either by a previous Cut/Copy operation or from a selection made outside of &korganizer;. You will be warned if the contents of the clipboard cannot be understood.
tr: <guimenuitem>Yapıştır</guimenuitem>, <action>pano içeriğini takvimin içine ekler</action>. Panoda, önceki Kes/Yapıştır işleminden ya da &korganizer; dışından seçilmiş geçerli bir vCalendar ya da iCalendar ögesi olması lazım. Pano içeriği anlaşılmadıysa uyarılacaksınız.

source: However, you can safely use <keycombo action="simul">&Ctrl; <keycap>C</keycap></keycombo> and <keycombo action="simul">&Ctrl; <keycap>V</keycap></keycombo> hotkeys to copy text data from any outside application to a &korganizer; Edit Event window and vice versa.
tr: Ancak, <keycombo action="simul">&Ctrl; <keycap>C</keycap></keycombo> ve <keycombo action="simul">&Ctrl; <keycap>V</keycap></keycombo> kısayollarını kullanarak uygulama dışından bir veriyi &korganizer; Etkinlik Düzenleme penceresine kopyalayabilir ya tersini yapabilirsiniz.

source: <guimenu> Edit</guimenu> <guimenuitem>Delete</guimenuitem>
tr: <guimenu>Düzenle</guimenu> <guimenuitem>Sil</guimenuitem>

source: Delete the currently selected item(s), removing them from your calendar.
tr: Mevcut seçilmiş öge(ler)i sil, onları takviminizden siler.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu> Edit</guimenu> <guimenuitem>Find</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu> Düzenle</guimenu> <guimenuitem>Bul</guimenuitem>

source: For more information about this action, please refer to <xref linkend="search-view"/>.
tr: Bu eylem hakkında daha fazla bilgi için bkz. <xref linkend="search-view"/>.

source: View
tr: Görünüm

source: There are several different <quote>views</quote> available for displaying your events, to-dos and journal entries. &korganizer; is smart enough to remember in between sessions what the last active view was, and the next time it is started, it will display that view.
tr: Etkinliklerinizi, yapılacaklarınızı ve günlük girdilerinizi görüntülemek için birkaç farklı <quote>görünüm</quote> vardır. &korganizer;, oturumlar arası son etkin görünümüzü hatırlayacak kadar akıllıdır ve yeniden başlatıldığında, bu görünümü gösterir.

source: In general, each view will provide a way of displaying your journal entries, to-dos and events, constrained to a particular time period or style of display. Click any item to select it for further action. <mousebutton>Right</mousebutton> click an item to bring up a menu with options such as <guimenuitem>Edit</guimenuitem>, <guimenuitem>Delete</guimenuitem>, and so on. You can also use the <guimenu>Action</guimenu> menu to perform similar operations.
tr: Genel olarak, her görünümün kendine has, belli bir zaman aralığı ya da gösterim biçemi ile günlük girdilerinizi, yapılacaklarınızı ve etkinliklerinizi gösterecek bir yol sağlar. Daha fazla eylem için herhangi bir ögeye tıklayın. <mousebutton>Sağ</mousebutton> tuş, <guimenuitem>Düzenle</guimenuitem>, <guimenuitem>Sil</guimenuitem> gibi seçenekleri olan bir menü açar. Benzer işlemleri gerçekleştirmek için <guimenu>Eylem</guimenu> menüsünü de kullanabilirsiniz.

source: <guimenu>View</guimenu> <guimenuitem>Agenda</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Ajanda</guimenuitem>

source: Switch the display to the Agenda view.
tr: Görünümü Ajanda görünümüne değiştir.

source: For more information about this action, please refer to <xref linkend="agenda-view"/>.
tr: Bu eylem hakkında daha fazla bilgi için bkz. <xref linkend="agenda-view"/>.

source: <guimenu>View</guimenu> <guimenuitem>Month View</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Ay Görünümü</guimenuitem>

source: Switch the display to the Month view.
tr: Ay görünümüne geç.

source: For more information about this action, please refer to <xref linkend="month-view"/>.
tr: Bu eylem hakkında daha fazla bilgi için bkz. <xref linkend="month-view"/>.

source: <guimenu>View</guimenu> <guimenuitem>Timeline</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Zaman Çizelgesi</guimenuitem>

source: Switch the display to the Timeline view.
tr: Zaman çizelgesi görünümüne geç.

source: For more information about this action, please refer to <xref linkend="timeline-view"/>.
tr: Bu eylem hakkında daha fazla bilgi için bkz. <xref linkend="timeline-view"/>.

source: <guimenu>View</guimenu> <guimenuitem>To-do List</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Yapılacaklar Listesi</guimenuitem>

source: Switch the display to the To-do List view.
tr: Görünümü Yapılacaklar Lİstesi görünümüne değiştir.

source: For more information about this action, please refer to <xref linkend="todo-view"/>.
tr: Bu eylem hakkında daha fazla bilgi için bkz. <xref linkend="todo-view"/>.

source: <guimenu> View</guimenu><guimenuitem>Event List</guimenuitem>
tr: <guimenu> Görünüm</guimenu><guimenuitem>Olay Listesi</guimenuitem>

source: Switch the display to the list view.
tr: Görünümü liste görünümü olarak değiştir.

source: For more information about this action, please refer to <xref linkend="list-view"/>.
tr: Bu eylem hakkında daha fazla bilgi için bkz. <xref linkend="list-view"/>.

source: <guimenu> View</guimenu><guimenuitem>What's Next</guimenuitem>
tr: <guimenu> Görünüm</guimenu><guimenuitem>Sonraki Nedir</guimenuitem>

source: Switch the display to the what's next view.
tr: Görünümü sonraki nedir görünümüne değiştir.

source: This view displays your next events and to-dos. Events and to-dos are displayed one per line.
tr: Bu görünüm, sonraki etkinlikler ve yapılacaklarınızı gösterir. Etkinlikler ve yapılacaklar her satırda bir tane şeklinde gösterilir.

source: For more information about this action, please refer to <xref linkend="whatsnext-view"/>.
tr: Bu eylem hakkında daha fazla bilgi için bkz. <xref linkend="whatsnext-view"/>.

source: <guimenu>View</guimenu> <guimenuitem>Journal</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>günlük</guimenuitem>

source: Switch the display to the Journal view.
tr: Görünümü Günlük görünümüne değiştir.

source: For more information about this action, please refer to <xref linkend="journal-view"/>.
tr: Bu eylem hakkında daha fazla bilgi için bkz. <xref linkend="journal-view"/>.

source: <guimenu>View</guimenu> <guimenuitem>Refresh</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Yenile</guimenuitem>

source: Updates or refreshes the currently displayed view.
tr: Mevcut görüntülenen görünümü günceller ya da yeniler.

source: <guimenu>View</guimenu><guisubmenu>Zoom</guisubmenu>
tr: <guimenu>Görünüm</guimenu><guisubmenu>Yakınlaştır</guisubmenu>

source: Use this submenu to adjust the current view to show more or less data.
tr: Mevcut görünümün daha fazla ya da daha az veri göstermesini ayarlamak için alt menüyü kullanın.

source: In the Agenda view (Day(s) or Week view), you can use the zoom actions to show more or less days (<menuchoice><guisubmenu>Zoom</guisubmenu> <guimenuitem>In Horizontally</guimenuitem></menuchoice> and <menuchoice> <guisubmenu>Zoom</guisubmenu><guimenuitem>Out Horizontally</guimenuitem></menuchoice>), or more or less hours in the day (<menuchoice><guisubmenu>Zoom</guisubmenu> <guimenuitem>In Vertically</guimenuitem></menuchoice> and <menuchoice><guisubmenu>Zoom</guisubmenu><guimenuitem>Out Vertically</guimenuitem> </menuchoice>).
tr: Ajanda görünümünde (Gün(ler) ya da Hafta görünümü), daha fazla ya da daha az gün göstermek için yakınlaştırma eylemini kullanabilirsiniz (<menuchoice><guisubmenu>Yakınlaştır</guisubmenu> <guimenuitem>Yatay İçeri</guimenuitem></menuchoice> ve <menuchoice> <guisubmenu>Yakınlaştır</guisubmenu><guimenuitem>Yatay Dışarı</guimenuitem></menuchoice>), ya da günde fazla ya da daha az saat için (<menuchoice><guisubmenu>Yakınlaştır</guisubmenu> <guimenuitem>Dikey İçeri</guimenuitem></menuchoice> ve <menuchoice><guisubmenu>Yakınlaştır</guisubmenu><guimenuitem>Dikey Dışarı</guimenuitem> </menuchoice>).

source: <guimenu>View</guimenu> <guisubmenu>Filter</guisubmenu>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Filtre</guisubmenu>

source: This submenu offers access to the filters already created using the <link linkend="menu-settings-edit-filters"><guilabel>Edit Calendar Filters</guilabel></link> dialog. <action>Select on this submenu the filter that will be used in &korganizer; view</action>. If you do not want to use a filter, choose <guilabel>No filter</guilabel>.
tr: Bu alt menü, <link linkend="menu-settings-edit-filters"><guilabel>Takvim Filtrelerini Düzenle</guilabel></link> penceresi ile oluşturulmuş filtrelere erişim sağlar. <action>&korganizer; görünümünde kullanılan filtreyi bu alt menüde seçin</action>. Eğer filtre kullanmak istemezseniz, <guilabel>Filtre yok</guilabel> seçin.

source: <title>Go</title>
tr: <title>Git</title>

source: For more information about browsing &korganizer; views, please refer to <xref linkend="description-view"/>.
tr: &korganizer; görünümlerini gezmek hakkında daha fazla bilgi için bkz. <xref linkend="description-view"/>.

source: <guimenu> Go</guimenu><guimenuitem>Backward</guimenuitem>
tr: <guimenu> Git</guimenu><guimenuitem>Geri</guimenuitem>

source: Go to the previous day, week or month, depending on the view.
tr: Görünüme göre, önceki güne, haftaya ya da aya git.

source: <guimenu> Go</guimenu><guimenuitem>Forward</guimenuitem>
tr: <guimenu> Git</guimenu><guimenuitem>İleri</guimenuitem>

source: Go to the next day, week, or month, depending on the view.
tr: Görünüme göre, sonraki güne, haftaya ya da aya git.

source: <guimenu> Go</guimenu><guimenuitem>To Today</guimenuitem>
tr: <guimenu> Git</guimenu><guimenuitem>Bugüne</guimenuitem>

source: Go to the period of time that includes the current day.
tr: Mevcut günü de içeren zaman periyoduna git.

source: <guimenu> Go</guimenu><guimenuitem>Day</guimenuitem>
tr: <guimenu> Git</guimenu><guimenuitem>Gün</guimenuitem>

source: Switch the display to the Day view.
tr: Görünümü Gün görünümüne değiştir.

source: <guimenu> Go</guimenu><guimenuitem>Next x Days</guimenuitem>
tr: <guimenu> Git</guimenu><guimenuitem>Sonraki x Gün</guimenuitem>

source: Switch the display to the Next x Day view, where x is defined in &korganizer; main configuration.
tr: Görünümü Sonraki x Gün görünümüne değiştir, x, &korganizer;'in ana yapıalndırmasında tanımlanır.

source: <guimenu>Go</guimenu><guimenuitem>Work Week</guimenuitem>
tr: <guimenu>Git</guimenu><guimenuitem>Çalışma Haftası</guimenuitem>

source: Switch the display to the Work Week view.
tr: Görünümü Çalışma Haftası görünümüne değiştir.

source: This is the same as the Week view, except only the working days of the week are shown.
tr: Bu, Hafta görünümü ile aynıdır, tek fark burada sadece çalışma günleri görünürdür.

source: <guimenu> Go</guimenu> <guimenuitem>Week</guimenuitem>
tr: <guimenu> Git</guimenu> <guimenuitem>Hafta</guimenuitem>

source: Switch the display to the Week view.
tr: Görünümü Hafta görünümüne değiştir.

source: The Week view provides a view similar to the Day view. Events for seven days are shown next to each other. All of the functions available for the Day view are available in the Week view, too.
tr: Hafta görünümü, Gün görünümüne benzer bir görünüm sağlar. Yedi gün içni etkinlikler birbirinin yanında görünür. Gün görünümünde mevcut tüm fonksiyonlar, Hafta görünümünde de mevcuttur.

source: Actions
tr: Eylemler

source: <guimenu>Actions</guimenu> <guimenuitem>New Event...</guimenuitem>
tr: <guimenu>Eylemler</guimenu> <guimenuitem>Yeni Olay...</guimenuitem>

source: Choose <guilabel>New Event...</guilabel> to <action>create a new event</action>.
tr: <action>yeni bir etkinlik oluşturmak</action> için <guilabel>Yeni Etkinlik...</guilabel> seçin.

source: You can get a detailed description of the event window in <link linkend="entering-data-events">the Entering Events</link> section.
tr: Etkinlik penceresi ile ilgili detaylı açıklamayı <link linkend="entering-data-events">Etkinlik Girme</link> bölümünde bulabilirsiniz.

source: <guimenu>Actions</guimenu> <guimenuitem>New To-do...</guimenuitem>
tr: <guimenu>Eylemler</guimenu> <guimenuitem>Yeni Yapılacak...</guimenuitem>

source: Choose <guilabel>New To-do...</guilabel> to <action>create a new to-do</action>. Initially the to-do has no due date, but you can specify one.
tr: <action>yeni bir yapılacak oluşturmak</action> için <guilabel>Yeni Yapılacak...</guilabel> seçin. Başlangıçta yapılacağın bitiş tarihi yoktur, fakat belirtebilirsiniz.

source: You can get a detailed description of the to-do window in <link linkend="entering-data-to-do">the Entering To-dos</link> section.
tr: Yapılacak penceresi ile ilgili detaylı açıklama için <link linkend="entering-data-to-do">Yapılacak Girmek</link> bölümüne bakabilirsiniz.

source: <guimenu>Actions</guimenu> <guimenuitem>New Sub-to-do...</guimenuitem>
tr: <guimenu>Eylemler</guimenu> <guimenuitem>Yeni Alt Yapılacak...</guimenuitem>

source: Choose <guilabel>New Sub-to-do...</guilabel> to <action>start writing a new sub-to-do. The currently selected to-do will be the sub-to-do parent</action>. Initially the to-do has no due date, but you can specify one.
tr: <action>Yeni bir alt yapılacak yazmak için <guilabel>Yeni Alt Yapılacak...</guilabel> seçin. Mevcut seçili yapılacak, bu alt yapılacağın üstü olacaktır</action>. Başlangıçta yapılacakların bitiş tarihi yoktur, fakat belirtebilirsiniz.

source: You can get a detailed description of the to-do window in <link linkend="entering-data-to-do">Entering To-dos</link> section.
tr: Yapılacak penceresi hakkında detaylı açıklama için <link linkend="entering-data-to-do">Yapılacak Girmek</link> bölümüne bakın.

source: <guimenu>Actions</guimenu> <guimenuitem>New Journal...</guimenuitem>
tr: <guimenu>Eylemler</guimenu> <guimenuitem>Yeni Günlük...</guimenuitem>

source: Choose <guilabel>New Journal...</guilabel> to <action>start writing a new journal entry</action>.
tr: <action>yeni bir günlük girdisi yazmaya başlamak</action> için <guilabel>Yeni Günlük...</guilabel> seçin.

source: <guimenu>Actions</guimenu> <guimenuitem>Show</guimenuitem>
tr: <guimenu>Eylemler</guimenu> <guimenuitem>Göster</guimenuitem>

source: Choose <guilabel>Show</guilabel> to <action>open a dialog showing the details of the currently selected journal entry, event or to-do.</action>
tr: <action>Seçili günlük, etkinlik veya yapılacak hakkında ayrıntılı bilgi gösteren pencereyi açmak</action> için <guilabel>Göster</guilabel>'e tıklayın.

source: <guimenu>Actions</guimenu> <guimenuitem>Edit...</guimenuitem>
tr: <guimenu>Eylemler</guimenu> <guimenuitem>Düzenle...</guimenuitem>

source: Choose <guilabel>Edit...</guilabel> to <action>edit the currently selected journal entry, event or to-do.</action>
tr: <action>Seçili günlük girdisi, etkinlik ya da yapılacak düzenlemek</action> için <guilabel>Düzenle...</guilabel>'yi seçin.

source: <shortcut> &Del; </shortcut> <guimenu>Actions</guimenu> <guimenuitem>Delete</guimenuitem>
tr: <shortcut> &Del; </shortcut> <guimenu>Eylemler</guimenu> <guimenuitem>Sil</guimenuitem>

source: Choose <guilabel>Delete</guilabel> to <action>remove the currently selected journal entry, event or to-do.</action>
tr: <action>Seçili günük girdisi, etkinlik ya da yapılacağı silmek</action> için <guilabel>Sil</guilabel>'i seçin.

source: <guimenu>Actions</guimenu> <guimenuitem>Make Sub-to-do Independent</guimenuitem>
tr: <guimenu>Eylemler</guimenu> <guimenuitem>Bağımsız Alt Yapılacak Yap</guimenuitem>

source: Choose <guilabel>Make Sub-to-do Independent</guilabel> to detach the currently selected sub-to-do item from its parent and make it an independent to-do item.
tr: Mevcut seçili alt yapılacağı, üstünden ayırıp bağımsız yapılacak yapmak için <guilabel>Alt Yapılacağı Bağımsız Yap</guilabel>'ı seçin.

source: Schedule
tr: Programla

source: <guimenu>Schedule</guimenu> <guimenuitem>Publish Item Information...</guimenuitem>
tr: <guimenu>Programla</guimenu> <guimenuitem>Öge Bilgisini Yayımla...</guimenuitem>

source: Email the selected event, to-do or journal entry in the iCalendar format.
tr: Seçili etkinlik, yapılacak ya da günlük girdisini iCalendar biçiminde eposta atın.

source: For more information about this action, please refer to <xref linkend="publish"/>.
tr: Bu eylem hakkında daha fazla bilgi için bkz. <xref linkend="publish"/>.

source: <guimenu>Schedule</guimenu> <guimenuitem>Send Invitation to Attendees</guimenuitem>
tr: <guimenu>Programla</guimenu> <guimenuitem>Katılımcılara Davetiye Yolla</guimenuitem>

source: Send the selected to-do or event to the attendees, and, if necessary, request a response from them.
tr: Seçili yapılacak ya da etkinliği katılımcılara yolla ve gerekiyorsa onlardan bir cevap iste.

source: For more information about this action, please refer to <xref linkend="request"/>.
tr: Bu eylem hakkında daha fazla bilgi için bkz. <xref linkend="request"/>.

source: <guimenu>Schedule</guimenu> <guimenuitem>Send Status Update</guimenuitem>
tr: <guimenu>Programla</guimenu> <guimenuitem>Durum Güncellemesi Yolla</guimenuitem>

source: If you changed your status as an attendee, choose this menu item to send your updated status (accepted, tentative, &etc;) to the item's organizer.
tr: Eğer bir katılımcı olarak durumunuzu değiştirdiyseniz, bu menü ögesini kullanarak, ögenin düzenleyicisine güncellenmiş durumunuzu (kabul edildi, belirsiz, &vb;) gönderebilirsiniz.

source: For more information about this action, please refer to <xref linkend="reply"/>.
tr: Bu eylem hakkında daha fazla bilgi için bkz. <xref linkend="reply"/>.

source: <guimenu>Schedule</guimenu> <guimenuitem>Send Cancellation to Attendees</guimenuitem>
tr: <guimenu>Programla</guimenu> <guimenuitem>Katılımcılara İptal Yolla</guimenuitem>

source: If you plan to cancel an event or to-do, select it, and choose this menu item to notify the attendees about the cancellation.
tr: Eğer etkinliğinizi ya da yapılacağınızı iptal etmeyi planlıyorsanız bunu seçin, ve katılımcıları iptal hakkında bilgilendirmek istiyorsanız bu menü ögesini seçin.

source: For more information about this action, please refer to <xref linkend="cancel"/>.
tr: Bu eylem hakkında daha fazla bilgi için bkz. <xref linkend="cancel"/>.

source: <guimenu>Schedule</guimenu> <guimenuitem>Request Update</guimenuitem>
tr: <guimenu>Programla</guimenu> <guimenuitem>Güncelleme İste</guimenuitem>

source: Request the latest version of the selected event or to-do from the organizer.
tr: Seçili etkinlik ya da yapılacak için düzenleyicinden son sürümü iste.

source: For more information about this action, please refer to <xref linkend="refresh"/>.
tr: Bu eylem hakkında daha fazla bilgi için bkz. <xref linkend="refresh"/>.

source: <guimenu>Schedule</guimenu> <guimenuitem>Request Change</guimenuitem>
tr: <guimenu>Programla</guimenu> <guimenuitem>Değişim İste</guimenuitem>

source: Send an alternative proposal to the organizer of the selected event or to-do.
tr: Seçilen etkinliğin veya yapılacağın düzenleyicisine alternatif bir teklif gönder.

source: For more information about this action, please refer to <xref linkend="counter"/>.
tr: Bu eylem hakkında daha fazla bilgi için bkz. <xref linkend="counter"/>.

source: <guimenu>Schedule</guimenu> <guimenuitem>Mail Free Busy Information...</guimenuitem>
tr: <guimenu>Programla</guimenu> <guimenuitem>Uygun Dolu Bilgisini Eposta İle Yolla...</guimenuitem>

source: Email your Free Busy information to one or more email addresses.
tr: Uygun Dolu bilginizi bir ya da daha fazla eposta adresine yollayın.

source: For more information about this action, please refer to <xref linkend="free-busy"/>.
tr: Bu eylem hakkında daha fazla bilgi için bkz. <xref linkend="free-busy"/>.

source: <guimenu>Schedule</guimenu> <guimenuitem>Upload Free Busy Information</guimenuitem>
tr: <guimenu>Programla</guimenu> <guimenuitem>Uygun Dolu Bilgisini Yükle</guimenuitem>

source: Upload your Free Busy information to the groupware server. Other users will then be able to retrieve the information.
tr: Uygun Dolu bilginizi grup sunucusuna yükleyin. Diğer kullanıcılar buradan bu bilgiyi alabilirler.

source: Settings and Help
tr: Ayarlar ve Yardım

source: <guimenu>Settings</guimenu> <guisubmenu>Sidebar</guisubmenu>
tr: <guimenu>Ayarlar</guimenu> <guisubmenu>Yan Çubuk</guisubmenu>

source: <action>Click the menu items of this submenu to show or hide &korganizer; sidebar components</action>. Note that the sidebar is visible only when <link linkend="config-main-views">the current view does not use the full window.</link>
tr: <action>&korganizer; yan çubuk bileşenlerini göstermek ya da gizlemek için bu alt menüdeki menü ögelerine tıklayın</action>. Şunu unutmayın, yan çubuk sadece <link linkend="config-main-views">mevcut görünüm tüm pencereyi kullanmadığında</link> görünürdür.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Date &amp; Time...</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Tarih &amp; Saati Yapılandır...</guimenuitem>

source: <action>Click this menu item to set the desktop date and time formats</action>. Note that this setting is shared between other desktop applications.
tr: <action>Masaüstü tarih ve saat biçimlerini ayarlamak için bu menü ögesine tıklayın</action>. Şunu unutmayın, bu ayar diğer masaüstü uygulamar arasında paylaşılıyor.

source: <guimenu>Settings</guimenu> <guisubmenu>Manage View Filters...</guisubmenu>
tr: <guimenu>Ayarlar</guimenu> <guisubmenu>Görünüm Filtrelerini Yönet...</guisubmenu>
