Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/korganizer.po
Languages: tr

source: To create and delete tags, choose the <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Manage Tags...</guimenuitem> </menuchoice> menu item to open the <guilabel>Manage Tags</guilabel> dialog. If you assign <link linkend="config-main-colors">different colors to tags</link>, you will be able to quickly identify the type of event by its color, either in the Agenda view or in the Month view (depending on the <link linkend="config-main-views">&korganizer; view configuration</link>).
tr: Künyeler oluşturmak veya silmek için <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Künyeleri Yönet…</guimenuitem></menuchoice> menüsünden <guilabel>Künyeleri Yönet</guilabel> iletişim kutusunu açın. <link linkend="config-main-colors">Künyelere farklı renkler atarsanız</link> (<link linkend="config-main-views">&korganizer; görünüm yapılandırmasına bağlı olarak</link>) etkinliğin türünü hem Ajanda hem de Ay görünümündeyken kolaylıkla tez ayırt edebilirsiniz.

source: Filters
tr: Süzgeçler

source: To help you view, find and export your data, you can create and use filters for your calendars. For instance, if you do not want to view completed to-dos, you can filter them out, instead of <link linkend="managing-purge-archive">purging them</link>. If you assign tags, you can use them to create filters.
tr: Verilerinizi görüntülemenize, bulmanıza ve dışa aktarmanıza yardımcı olmak için takvimleriniz için süzgeçler oluşturabilir ve kullanabilirsiniz. Örneğin, tamamlanmış yapılacak işleri görüntülemek istemiyorsanız bunları <link linkend="managing-purge-archive">temizlemek yerine</link> süzebilirsiniz. Künyeler atarsanız bunları süzgeçler oluşturmak için kullanabilirsiniz.

source: To create, delete and edit filters, choose the <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Manage View Filters...</guimenuitem> </menuchoice> menu item to open the <guilabel>Edit Calendar Filters</guilabel> dialog. Using this dialog, you can create, delete and edit filters that will affect which items will be displayed by &korganizer;.
tr: Süzgeçler oluşturmak, onları düzenlemek ve silmek için <guilabel>Takvim Süzgeçlerini Düzenle</guilabel> iletişim kutusunu açmak için <menuchoice><guimenu>Ayarlar</guimenu> <guimenuitem>Görünüm Süzgeçlerini Yönet…</guimenuitem></menuchoice> menü ögesini kullanın. Bu iletişim kutusunu kullanarak, &korganizer; ile görüntülenecek süzgeçler oluşturabilir, onları düzenleyebilir veya silebilirsiniz.

source: The <menuchoice><guimenu>View</guimenu> <guisubmenu>Filter</guisubmenu></menuchoice> submenu and the filter toolbar drop down offer access to all available filters created using the <link linkend="menu-settings-edit-filters"><guilabel>Edit Calendar Filters</guilabel></link> dialog. To toggle the display of the filters toolbar on and off, choose the <menuchoice><guimenu>Settings</guimenu> <guisubmenu>Toolbars Shown</guisubmenu><guimenuitem>Filters Toolbar</guimenuitem></menuchoice>. If you do not want to use any filter, choose <guilabel>No filter</guilabel>.
tr: <menuchoice><guimenu>Görünüm</guimenu> <guisubmenu>Süzgeç</guisubmenu></menuchoice> alt menüsü ve süzgeç araç çubuğu açılır menüsü, <link linkend="menu-settings-edit-filters"><guilabel>Takvim Süzgeçlerini Düzenle</guilabel></link> iletişim kutusu tarafından oluşturulmuş tüm kullanılabilir süzgeçlere erişim sağlar. Süzgeçlerin görüntülenmesini açıp kapatmak için <menuchoice><guimenu>Ayarlar</guimenu> <guisubmenu>Gösterilen Araç Çubukları</guisubmenu> <guimenuitem>Süzgeçler Araç Çubuğu</guimenuitem></menuchoice> ögesini kullanın. Bir süzgeç kullanmak istemiyorsanız <guilabel>Süzgeç Yok</guilabel> ögesini seçin.

source: Filters are useful when <link linkend="managing-export">exporting your calendar</link>. If you use a filter, only the filtered (visible) items will be exported. Also, filters are more effective when the items are already classified and organized in <link linkend="categories-view">tags</link>, as you can easily create filters based on tags.
tr: Süzgeçler, <link linkend="managing-export">takviminizi dışa aktarırken</link> yararlıdır. Bir süzgeç kullanıyorsanız yalnızca süzülmüş (görünür) ögeler dışa aktarılır. Ayrıca süzgeçler, ögeleriniz <link linkend="categories-view">künyeler</link> ile sınıflandırıldığında daha kullanışlıdır; çünkü künyeler tabanlı süzgeçleri kolaylıkla oluşturabilirsiniz.

source: Searching
tr: Arama

source: Choose the <menuchoice><guimenu>Edit</guimenu> <guimenuitem>Find</guimenuitem></menuchoice> menu item or press the <keycombo action="simul">&Ctrl;<keycap>F</keycap> </keycombo> shortcut to find events, to-dos, or journal entries by their to summaries, descriptions, and/or tags. The find action will only search the specified fields.
tr: Etkinlikleri, yapılacakları veya günce girdilerini özetlerine, açıklamalarına ve/veya künyelerine göre bulmak için <menuchoice><guimenu>Düzen</guimenu> <guimenuitem>Bul</guimenuitem></menuchoice> menü ögesini veya <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> kısayolunu kullanın.

source: You can use wildcards if you do not remember the exact summary. If you do not know a single character of the summary, put <userinput>?</userinput> instead of the missing character. If you do not know more characters, use <userinput>*</userinput>. For instance if you know that the event or to-do has <emphasis>meeting</emphasis> in the beginning and <emphasis>product</emphasis> after, you would write <userinput>meeting*product</userinput> in the Find dialog. &korganizer; will locate entries like <quote>To-do: arrange meeting about the new product</quote>, <quote>Meeting to discuss the old product line</quote> and similar. Letter case is ignored.
tr: Tam kesin özeti anımsayamıyorsanız joker karakterler kullanabilirsiniz. Özetin tek bir karakterini bilmiyorsanız eksik karakterin yerine <userinput>?</userinput> koyun. Birden çok karakteri bilmiyorsanız <userinput>*</userinput> kullanın. Örneğin, etkinliğin veya yapılacağın başında <emphasis>toplantı</emphasis> ve sonrasında <emphasis>ürün</emphasis> olduğunu biliyorsanız Bul iletişim kutusunda <userinput>toplantı*ürün</userinput> yazın. &korganizer;, <quote>Yapılacak: Toplantı sonrasında ürün lansmanı</quote>, <quote>Toplantıda ürün prototiplerini göster</quote> ve benzer yapılacakları bulacaktır. BÜYÜK/küçük harf duyarlı değildir.

source: The result of the Find operation is a list of events, journal entries and/or to-dos with the specified keyword. The search list characteristics are the same as the <link linkend="list-view">List View</link>.
tr: Bul işleminin sonuçları; belirli anahtar sözcükleri içeren etkinlikler, günce girdileri ve yapılacaklardan oluşan bir listedir. Arama listesinin karakteristikleri, <link linkend="list-view">Liste Görünümü</link>’ndekilerle aynıdır.

source: This resulting list is active. You can double-click a line to display or edit the event or to-do details. Get more information about these details in <xref linkend="entering-data-events"/> and <xref linkend="entering-data-to-do"/>.
tr: Sonuç listesi odağa sahiptir. Etkinliği veya yapılacak ayrıntılarını görüntülemek için çift tıklayın. Bu ayrıntılar hakkında daha fazla bilgi için <xref linkend="entering-data-events"/> ve <xref linkend="entering-data-to-do"/> bölümlerine bakın.

source: Entering Data
tr: Veri Girmek

source: Events
tr: Etkinlikler

source: Events are future or past appointments, like business meetings, personal anniversaries and cinema visits. An event can also take several days, like holidays.
tr: Etkinlikler; iş toplantıları, kişisel yıldönümleri ve sinema ziyaretleri gibi gelecekteki veya geçmişteki randevulardır. Bir etkinlik, tatiller gibi birkaç gün de sürebilir.

source: Entering a new event is very easy. Just choose the <menuchoice><guimenu>Actions</guimenu><guimenuitem>New Event...</guimenuitem></menuchoice> menu item. A window with six tabs at the bottom will appear.
tr: Yeni bir etkinlik girmek pek kolaydır. <menuchoice><guimenu>Eylemler</guimenu> <guimenuitem>Yeni Etkinlik…</guimenuitem></menuchoice> menü ögesini kullanın. Altı adet sekmeye sahip bir pencere açılır.

source: If you wish you can use a different way to create a new event:
tr: Dilerseniz yeni bir etkinlik oluşturmak için farklı bir yol kullanabilirsiniz:

source: Use the Date Navigator to go to the event date.
tr: Etkinlik tarihine gitmek için Tarih Gezgini’ni kullanın.

source: Switch to <guilabel>Agenda</guilabel> view and click the desired view's icon on the <guimenu>View Toolbar</guimenu> or select the desired view from the <guimenu>Go</guimenu> menu. Since your event starts at a particular time, you should choose a <link linkend="reference-menus-view">view</link> that displays hours of the day. You may choose <guimenuitem>Day</guimenuitem>, <guimenuitem>Work Week</guimenuitem> view or <guimenuitem>Week</guimenuitem> view. The <guimenuitem>Month</guimenuitem> view is more suitable for to-dos, described below.
tr: <guilabel>Ajanda</guilabel> görünümüne geçin ve istenen görünümün simgesine <guimenu>Araç Çubuğunu Görüntüle</guimenu> ile tıklayın veya istediğiniz görünümü <guimenu>Git</guimenu> menüsünden seçin. Etkinliğiniz belirli bir saatte başladığından, günün saatlerini görüntüleyen bir <link linkend="reference-menus-view">görünüm</link> seçmelisiniz. <guimenuitem>Gün</guimenuitem>, <guimenuitem>Çalışma Haftası</guimenuitem> veya <guimenuitem>Hafta</guimenuitem> görünümünü seçebilirsiniz. <guimenuitem>Ay</guimenuitem> görünümü, yapılacaklar için daha elverişlidir; aşağıda açıklanmıştır.

source: In the main panel, double click the time and date when your event starts.
tr: Ana panelde, etkinliğinizin başlayacağı saat ve tarihe çift tıklayın.

source: A dialog with six tabs at the bottom of the window appears. Enter your data as described below.
tr: Pencerenin alt kısmında altı sekmeli bir iletişim kutusu görünür. Verilerinizi aşağıda açıklandığı gibi girin.

source: <screeninfo>A screenshot of &korganizer;'s Edit Event dialog</screeninfo>
tr: <screeninfo>&korganizer;’ün Etkinliği Düzenle iletişim kutusunun ekran görüntüsü</screeninfo>

source: <phrase>A screenshot of &korganizer;'s Edit Event dialog</phrase>
tr: <phrase>&korganizer;’ün Etkinliği Düzenle iletişim kutusunun ekran görüntüsü</phrase>

source: <para>A screenshot of &korganizer;'s Edit Event dialog</para>
tr: <para>&korganizer;’ün Etkinliği Düzenle iletişim kutusunun ekran görüntüsü</para>

source: This is a thorough description of the individual event window fields and widgets. Not all fields have to be filled in; some can be left empty. Read the <link linkend="entering-data-required-fields">Required fields</link> section for detailed information. And if you prefer to learn by example, there's one in the <link linkend="examples-entering-event">Entering event</link> section.
tr: Bu, bireysel olay penceresi alanlarının ve araç takımlarının kapsamlı bir açıklamasıdır. Tüm alanların doldurulması gerekmez; bazıları boş bırakılabilir. Ayrıntılı bilgi için <link linkend="entering-data-required-fields">Gerekli Alanlar</link> bölümünü okuyun. Örneklerle öğrenmek isterseniz <link linkend="examples-entering-event">Etkinlik Girmek</link> bölümünde bir tane vardır.

source: Summary:
tr: Özet:

source: Enter a short description of the event into the <guilabel>Summary</guilabel> field. This description is the text shown on the &korganizer; main panel.
tr: <guilabel>Özet</guilabel> alanına etkinliğin kısa bir açıklamasını girin. Bu açıklama, &korganizer; ana panelinde gösterilen metindir.

source: Location:
tr: Konum:

source: Enter short description of the <guilabel>location</guilabel> where the event will take place.
tr: Etkinliğin gerçekleşeceği <guilabel>konumun</guilabel> kısa bir açıklamasını girin.

source: <guilabel>Start</guilabel> and <guilabel>End</guilabel>
tr: <guilabel>Başlangıç</guilabel> ve <guilabel>Bitiş</guilabel>

source: The &korganizer; suggested Start and End dates of your event. Events are expected to start and end on the same date. Change these dates as desired. Enter the dates directly or use the <link linkend="glossary" endterm="gloss-calendar-widget"> Calendar Widget</link>. Select the time from quarter hour intervals, or enter the desired time directly into the time fields. These fields are only available when the <guilabel>All Day</guilabel> box is not checked.
tr: Etkinliğinizin &korganizer; tarafından önerilen başlangıç ve bitiş tarihleri. Etkinliklerin aynı günde başlaması ve bitmesi önerilir. Bu tarihleri istediğiniz gibi değiştirin. Tarihleri doğrudan girin veya <link linkend="glossary" endterm="gloss-calendar-widget">Takvim Araç Takımı</link>’nı kullanın. Zamanı, çeyrek saatlik aralıklar olarak seçin veya istediğiniz zamanı doğrudan zaman alanlarına girin. Bu alanlar yalnızca <guilabel>Tüm gün</guilabel> kutusu işaretlenmemişse kullanılabilirdir.

source: General Tab
tr: Genel Sekmesi

source: Details:
tr: Ayrıntılar:

source: Enter a long description of the event in the large, untitled rectangle. You can write as many details as you wish here. For example, If the event is, say, planned general repair of your car, you can list all items that need repairing. Later on you can print this list and hand it over to the serviceman. If the event is shopping, you should list the goods that you need to buy. Print the event and take it to the shop with you.
tr: Büyük, başlıksız dikdörtgene etkinliğin uzun bir açıklamasını girin. Buraya dilediğiniz kadar ayrıntı yazabilirsiniz. Örneğin, olay arabanızın planlı genel onarımı ise, onarılması gereken tüm ögeleri listeleyebilirsiniz. Daha sonra bu listeyi yazdırabilir ve servis görevlisine verebilirsiniz. Etkinlik alışveriş ise satın almanız gereken malları listelemelisiniz. Etkinliğin çıktısını alın ve alışverişe giderken yanınızda götürün.

source: <guilabel>Tags</guilabel>
tr: <guilabel>Künyeler</guilabel>

source: You can assign several <link linkend="categories-view">tags</link> to a calendar item. Click the <guibutton>...</guibutton> button to display all available tags. Check the tag boxes to assign suitable tags to the event.
tr: Bir takvim ögesine birden çok <link linkend="categories-view">künye</link> atayabilirsiniz. Kullanılabilir tüm künyeleri görüntülemek için <guibutton>…</guibutton> düğmesine tıklayın. Etkinlik için uygun olan künyeleri seçmek üzere künye kutularını işaretleyin.

source: You can also add a new tag, modify a tag, or delete a tag in the <guilabel>Manage Tags</guilabel> dialog. Open this dialog with <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Manage Tags</guimenuitem></menuchoice>.
tr: <guilabel>Künyeleri Yönet</guilabel> iletişim kutusunda bir künye ekleyebilir, künyede değişiklik yapabilir veya bir künyeyi silebilirsiniz. <menuchoice><guimenu>Ayarlar</guimenu> <guimenuitem>Künyeleri Yönet</guimenuitem></menuchoice> menü ögesinden bu iletişim kutusunu açın.

source: Your language lesson at work may belong to both Business and Education tags, while the anniversary of your marriage belongs to either Personal or Special Occasion - it is your choice.
tr: İş yerindeki dil dersiniz hem İş hem de Eğitim künyelerine ait olabilirken, evliliğinizin yıldönümü Kişisel veya Özel Günler künyelerine aittir — bu sizin seçiminizdir.

source: Access:
tr: Erişim:

source: Choose <guilabel>Public</guilabel>, <guilabel>Private</guilabel> or <guilabel>Confidential</guilabel> to keep the event private or confidential. Currently, this choice correctly sets the <quote>CLASS</quote> attribute of the events to <quote>PUBLIC</quote>, <quote>PRIVATE</quote> or <quote>CONFIDENTIAL</quote>. However, whether these settings are really used to restrict the access of the information depends on the client and/or groupware server implementation.
tr: <guilabel>Genel</guilabel>, etkinliği özel veya gizli tutmak içinse <guilabel>Özel</guilabel> veya <guilabel>Çok Gizli</guilabel> künyelerini seçin. Şu anda bu seçenek, etkinliklerin <quote>SINIF</quote> özniteliğini <quote>GENEL</quote>, <quote>ÖZEL</quote> veya <quote>ÇOK GİZLİ</quote> olarak ayarlar. Ancak bu ayarların gerçekte kullanılıp kullanılmadığı, istemcinin veya grup yazılımı sunucusunun gerçekleme yöntemine bağlıdır.

source: Currently, &korganizer; <emphasis>will</emphasis> display items owned by other people and marked as confidential. Other clients may treat them differently, but be careful when publishing private or confidential events: iCalendar is a text file format, and can be read with any text editor (if someone has read access to them). So if you want to keep items really confidential, make sure you use a resource that only you can access.
tr: Şu anda &korganizer;, diğer kişilere ait olan ve çok gizli olarak imlenmiş ögeleri <emphasis>görüntüleyecektir</emphasis>. Diğer istemciler bunlara farklı davranabilir; ancak özel veya çok gizli etkinlikleri yayınlarken dikkatli olun: iCalendar bir metin dosyası biçimidir ve herhangi bir metin düzenleyicisi ile okunabilir (birinin bunlara okuma erişimi varsa). Dolayısıyla, ögeleri gerçekten gizli tutmak istiyorsanız yalnızca sizin erişebileceğiniz bir özkaynak kullandığınızdan emin olun.

source: Attendees Tab
tr: Katılımcılar Sekmesi

source: Choose in this tab the people you want to invite to your event.
tr: Etkinliğinize davet etmek istediğiniz kişileri bu sekmede seçin.

source: <screeninfo>A screenshot of &korganizer;'s Edit Event dialog - Attendees tab</screeninfo>
tr: <screeninfo>&korganizer;’ün Etkinliği Düzenle iletişim kutusu — Katılımcılar sekmesi</screeninfo>

source: <phrase>A screenshot of &korganizer;'s Edit Event dialog - Attendees tab</phrase>
tr: <phrase>&korganizer;’ün Etkinliği Düzenle iletişim kutusu — Katılımcılar sekmesi</phrase>

source: <para>A screenshot of &korganizer;'s Edit Event dialog - Attendees tab</para>
tr: <para>&korganizer;’ün Etkinliği Düzenle iletişim kutusu — Katılımcılar sekmesi</para>

source: Meeting Organizer:
tr: Toplantı Düzenleyicisi:

source: Sets the identity corresponding to the organizer of this to-do or event. If &korganizer; is configured to send invitation emails, the identity selected on this combo box will be used when sending these emails. The default identity can be set in the <guilabel>Personal</guilabel> section of the &korganizer; configuration. In addition, identities are gathered from your &kmail; settings and from your address book.
tr: Bu yapılacak işin veya etkinliğin organizatörüne karşılık gelen kimliği ayarlar. Eğer &korganizer; davet e-postaları gönderecek şekilde yapılandırılmışsa bu e-postalar gönderilirken bu açılan kutuda seçilen kimlik kullanılacaktır. Öntanımlı kimlik, &korganizer; yapılandırmasının <guilabel>Kişisel</guilabel> bölümünde ayarlanabilir. Ayrıca, kimlikler &kmail; ayarlarınızdan ve adres defterinizden toplanır.

source: Attendee list
tr: Katılımcı Listesi

source: The list in the center of the tab displays the attendees selected for this event, and lets you add attendees by entering the name and mail address, edit or remove them.
tr: Sekmenin ortasındaki liste, bu etkinlik için seçilen katılımcıları görüntüler ve ad ve posta adresi girerek katılımcı eklemenize, düzenlemenize veya kaldırmanıza olanak tanır.

source: If the attendee(s) are in your Address Book, you do not have to remember or type his email address to add it to the attendee list. Just click the <guibutton>Select Addressee...</guibutton> button and choose the attendee(s) from the list. Please note that this is the standard &kde; address book, which is also used by &kmail; and can also be called as a separate application (&kaddressbook;).
tr: Katılımcılar adres defterinizdeyse onları listeye eklemek için anımsamanıza veya e-posta adreslerinizi girmenize gerek yoktur. Yalnızca <guibutton>Alıcı Seç…</guibutton> düğmesine basın ve katılımcıları listeden seçin. Bunun &kmail; tarafından da kullanılan standart &kde; adres defteri olduğunu aklınızda bulundurun; bir diğer adı da &kaddressbook; olarak geçer.

source: Participants
tr: Katılımcılar

source: Choose the role of the attendee (Participant, Optional Participant, Observer, Chair) from the drop down menu at the left side of an entry. The role is a simple reminder of what part the attendee plays in this event.
tr: Bir girdinin sol tarafındaki açılır menüden katılımcının rolünü (Katılımcı, İsteğe Bağlı Katılımcı, Gözlemci, Başkan) seçin. Rol, katılımcının bu etkinlikte hangi rolü oynadığını basit bir şekilde anımsatır.

source: Status
tr: Durum

source: Choose the status of the attendee (Needs Action, Accepted, Declined, Tentative, Delegated) from the drop down menu at the right side of an entry. If you use groupware schedule and request responses from your attendees, as you receive the responses the status of the attendee will be updated. If you do not request responses, you will have to update the status manually.
tr: Bir girişin sağ tarafındaki açılır menüden katılımcının durumunu (Eylem Gerekiyor, Kabul Edildi, Reddedildi, Geçici, Devredildi) seçin. Grup yazılımı planlaması kullanıyorsanız ve katılımcılarınızdan yanıt talep ediyorsanız yanıtları aldıkça katılımcının durumu güncellenecektir. Yanıt talep etmezseniz durumu elle güncellemeniz gerekecektir.

source: Request Response
tr: Yanıt İste

source: Select <guilabel>Request Response</guilabel> from the drop down box if this attendee should respond to your schedule plan. Consequently the attendee will be emailed with the event schedule information. A small envelope will appear in the details list to indicate this. This feature is specially useful when groupware scheduling is enabled, as the attendee's status is updated automatically.
tr: Bu katılımcının program planınıza yanıt vermesi gerekiyorsa açılır kutudan <guilabel>Yanıt iste</guilabel> seçeneğini seçin. Sonuç olarak katılımcıya etkinlik programı bilgileri e-posta ile gönderilecektir. Bunu belirtmek için ayrıntılar listesinde küçük bir zarf görünecektir. Bu özellik özellikle grup yazılımı planlaması etkinleştirildiğinde, katılımcının durumu kendiliğinden güncellendiği için kullanışlıdır.

source: Reminder Tab
tr: Anımsatıcı Sekmesi

source: Reminder
tr: Anımsatıcı

source: Select a default reminder in the drop down box and press <guibutton>Add</guibutton> if &korganizer; should remind you about an event.
tr: Açılır kutudan öntanımlı bir anımsatıcı seçin ve &korganizer; size bir etkinliği anımsatacaksa <guibutton>Ekle</guibutton> düğmesine basın.

source: Use the <guibutton>Configure</guibutton> button to open the <guilabel>Edit existing reminder</guilabel> dialog. Using this dialog, you can choose how many minutes, hours or days before or after the events start or end you want to be reminded, you can set repeating intervals for your reminders, and create special reminders that display text or play sounds.
tr: <guilabel>Var Olan Anımsatıcıyı Düzenle</guilabel> iletişim kutusunu açmak için <guibutton>Yapılandır</guibutton> düğmesini kullanın. Bu iletişim kutusunu kullanarak, etkinliklerin başlamasından veya bitmesinden kaç dakika, saat veya gün önce veya sonra anımsatılmasını istediğinizi seçebilir, anımsatıcılarınız için yinelenen aralıklar ayarlayabilir ve metin görüntüleyen veya ses çalan özel anımsatıcılar oluşturabilirsiniz.

source: Recurrence tab
tr: Yineleme Sekmesi

source: Some events take place regularly. You can specify their exact scheduling here.
tr: Bazı etkinlikler düzenli olarak gerçekleşir. Kesin zamanlamalarını burada belirtebilirsiniz.

source: <screeninfo>A screenshot of &korganizer;'s Edit Event dialog - Recurrence tab</screeninfo>
tr: <screeninfo>&korganizer;’ün Etkinliği Düzenle iletişim kutusu — Yineleme sekmesi</screeninfo>

source: <phrase>A screenshot of &korganizer;'s Edit Event dialog - Recurrence tab</phrase>
tr: <phrase>&korganizer;’ün Etkinliği Düzenle iletişim kutusu — Yineleme sekmesi</phrase>
