Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/korganizer.po
Languages: tr

source: <para>A screenshot of &korganizer;'s Edit Event dialog - Recurrence tab</para>
tr: <para>&korganizer;’ün Etkinliği Düzenle iletişim kutusu — Yineleme sekmesi</para>

source: To activate the settings, start by selecting a recurrence rule at the right of <guilabel>Repeats</guilabel> from the drop down box. If <guilabel>Never</guilabel> is selected, you are not able to make any changes on this tab.
tr: Ayarları etkinleştirmek için <guilabel>Yinelemeler</guilabel> yanındaki açılır menüden bir yineleme kuralı seçin. <guilabel>Asla</guilabel> seçiliyse bu sekmede bir değişiklik yapamazsınız.

source: Recurrence Rule
tr: Yineleme Kuralı

source: Choose if you want to repeat this event daily, weekly, monthly or yearly. More detailed options are as follows:
tr: Bu etkinliği günlük, haftalık, aylık veya yıllık olarak yinelemek isteyip istemediğinizi seçin. Daha ayrıntılı seçenekler aşağıdaki gibidir:

source: Daily
tr: Günlük

source: Specify whether the event occurs every day (1), every other day (2) and so on.
tr: Olayın her gün mü (1), gün aşırı mı (2) ve benzeri şekilde mi gerçekleşeceğini belirtin.

source: Weekly
tr: Haftalık

source: Specify whether the event occurs every week (1), every other week (2) and so on. Also specify the days (Sunday ... Monday) on which the event occurs.
tr: Olayın her hafta mı (1), iki haftada bir mi (2), vb. gerçekleşeceğini belirtin. Ayrıca olayın gerçekleşeceği günleri de (Pazar‥Pazartesi) belirtin.

source: Monthly
tr: Aylık

source: You can either have the event occur on the same day of the month, or in a specific week on a specific day of the week. You need to choose between these two possibilities. By default, &korganizer; assumes you want to repeat on the same calendar day of the month (for instance the 15th). You can also adjust the period, so you can repeat monthly, tri-monthly and so on.
tr: Etkinliğin ayın aynı gününde veya haftanın belirli bir gününde belirli bir haftada gerçekleşmesini sağlayabilirsiniz. Bu iki olasılık arasında seçim yapmanız gerekir. Öntanımlı olarak &korganizer;, ayın aynı takvim gününde (örneğin 15’inde) yinelemek istediğinizi varsayar. Periyodu da ayarlayabilirsiniz, böylece aylık, üç aylık ve benzeri şekilde yineleyebilirsiniz.

source: Yearly
tr: Yıllık

source: This is similar to Monthly. You need to choose whether or not you are indicating a calendar day of the year (&eg;, the 250th day of the year), in a specific week on a specific day of the week of a month (&eg;, the 2nd Tuesday of March), or the day of the month in a particular month of the year. By default, &korganizer; assumes you mean the day of the month. You can adjust the period to reflect events that occur bi-annually, every four years, and so on.
tr: Bu, Aylık ile benzerdir. Yılın bir takvim gününü mü (&eg;, yılın 250. günü), ayın haftanın belirli bir günündeki belirli bir haftayı mı (&eg;, Mart ayının 2. Salı günü), yoksa yılın belirli bir ayındaki ayın gününü mü belirttiğinizi seçmeniz gerekir. Öntanımlı olarak &korganizer;, ayın gününü kastettiğinizi varsayar. Periyodu iki yılda bir, dört yılda bir vb. gerçekleşen olayları yansıtacak şekilde ayarlayabilirsiniz.

source: Recurrence Range
tr: Yineleme Erimi

source: By default, events which repeat will do so forever; there is no <quote>end</quote> to the repetition. This may or may not be desirable, so you are able to terminate the repetition by selecting an end date or a number of occurrences.
tr: Öntanımlı olarak, yineleyen olaylar bunu sonsuza kadar yapacaktır; yineleme için bir <quote>son</quote> yoktur. Bu istenilen bir durum olabilir veya olmayabilir, bu nedenle bir bitiş tarihi veya yineleme sayısı seçerek yinelemeyi sonlandırabilirsiniz.

source: Exceptions
tr: İstisnalar

source: You may have a very nice recurrence rule set up, but realize that there are a few exceptions. If you set up your college class schedule for instance, you may want to make exceptions for holidays and the like. In this area, you can add, change, and delete dates from the list of exceptions (&ie; times when even if the recurrence rule matches, the event will <emphasis>not be scheduled</emphasis>). Pick a date with the date selector, and press <guibutton>Add</guibutton> to include it. For removing dates, highlight them in the box on the right side, and then click <guibutton>Delete</guibutton>.
tr: Çok güzel bir yineleme kuralı oluşturmuş olabilirsiniz; ancak birkaç istisna olduğunun farkına varın. Örneğin, üniversite ders programınızı ayarladıysanız tatiller ve benzerleri için istisnalar yapmak isteyebilirsiniz. Bu alanda, istisnalar listesine tarih ekleyebilir, tarihleri değiştirebilir ve silebilirsiniz (&ie; yineleme kuralı eşleşse bile etkinliğin <emphasis>planlanmayacağı</emphasis> zamanlar). Tarih seçicisi ile bir tarih seçin ve eklemek için <guibutton>Ekle</guibutton> düğmesine basın. Tarihleri kaldırmak için sağ taraftaki kutuda vurgulayın ve ardından <guibutton>Sil</guibutton> düğmesine tıklayın.

source: Attachments
tr: Ekler

source: Events and to-dos can contain attachments. Attachments can either be stored as links or inline. To add an attachment press the <guibutton>Add</guibutton> button.
tr: Etkinlikler ve yapılacaklar ekler içerebilir. Ekler bağlantı olarak ya da satır içi olarak saklanabilir. Bir ek eklemek için <guibutton>Ekle</guibutton> düğmesine basın.

source: <screeninfo>A screenshot of &korganizer;'s Edit Event dialog - Attachments tab</screeninfo>
tr: <screeninfo>&korganizer;’ün Etkinliği Düzenle iletişim kutusu — Ekler sekmesi</screeninfo>

source: <phrase>A screenshot of &korganizer;'s Edit Event dialog - Attachments tab</phrase>
tr: <phrase>&korganizer;’ün Etkinliği Düzenle iletişim kutusu — Ekler sekmesi</phrase>

source: <para>A screenshot of &korganizer;'s Edit Event dialog - Attachments tab</para>
tr: <para>&korganizer;’ün Etkinliği Düzenle iletişim kutusu — Ekler sekmesi</para>

source: Checking <guilabel>Store a copy of the attachment file inside the calendar</guilabel> will cause the attachment to be stored inside your calendar, which can take a lot of space depending on the size of the attachment. If this option is not checked, then only a link pointing to the attachment will be stored. Do not use a link for attachments that change often or may be moved (or removed) from their current location.
tr: <guilabel>Ek dosyasının bir kopyasını takvimde depola</guilabel> seçeneğinin işaretlenmesi, ekin takviminizin içinde depolanmasına neden olur ve bu da ekin boyutuna bağlı olarak çok fazla yer kaplayabilir. Bu seçenek işaretlenmezse yalnızca eke işaret eden bir bağlantı saklanır. Sık sık değişen veya geçerli konumlarından taşınabilen (veya kaldırılabilen) ekler için bir bağlantı kullanmayın.

source: The following actions in the context menu are provided to work with attachments:
tr: Eklerle çalışmak için bağlam menüsünde aşağıdaki eylemler sağlanmıştır:

source: Open
tr: Aç

source: Display the selected attachment with the associated application.
tr: Seçili eki ilişkili uygulama ile görüntüleyin.

source: Save As...
tr: Farklı Kaydet…

source: Allows to save an existing attachment with a different name.
tr: Var olan bir eki farklı bir adla kaydetmenize olanak tanır.

source: <guimenuitem>Copy</guimenuitem>, <guimenuitem>Cut</guimenuitem> and <guimenuitem>Paste</guimenuitem>
tr: <guimenuitem>Kopyala</guimenuitem>, <guimenuitem>Kes</guimenuitem> ve <guimenuitem>Yapıştır</guimenuitem>

source: Allows to copy, cut and paste to and from the clipboard.
tr: Panoya kopyalama, panoya kesme ve panodan yapıştırma işlemi yapmanıza olanak tanır.

source: Remove
tr: Kaldır

source: Deletes the selected attachment.
tr: Seçili eki siler.

source: Properties...
tr: Özellikler…

source: Allows to change an existing attachment.
tr: Var olan eki değiştirmeye olanak tanır.

source: Free/Busy
tr: Uygun/Meşgul

source: When adding attendees to your event, you need to know if they are busy or free in that particular time. If the attendees make their free / busy information available, you can view here their schedule before sending the invitations.
tr: Etkinliğinize katılımcı eklerken, o belirli zamanda meşgul veya uygun olup olmadıklarını bilmeniz gerekir. Katılımcılar uygun/meşgul bilgilerini kullanıma sunarsa davetiyeleri göndermeden önce programlarını burada görüntüleyebilirsiniz.

source: This shows the free/busy schedule chart on the right, where each line represents one of the attendees, listed on the left. The marked areas on the chart represent the time already taken by other events, unmarked areas represent time free from other events. You can move the event to a different point in time by dragging it with the mouse, or resize it by moving the edges of the highlighted area with the mouse.
tr: Bu, sağda uygun/meşgul programı çizelgesini gösterir, burada her satır solda listelenen katılımcılardan birini temsil eder. Çizelgedeki işaretli alanlar diğer etkinlikler tarafından halihazırda alınan zamanı temsil eder, işaretsiz alanlar diğer etkinliklerden boş zamanı temsil eder. Etkinliği fareyle sürükleyerek farklı bir zaman noktasına taşıyabilir veya vurgulanan alanın kenarlarını fareyle hareket ettirerek yeniden boyutlandırabilirsiniz.

source: The free/busy information is only available if the attendee publishes his free/busy schedule, and if &korganizer; is correctly configured to retrieve it. For more information about configuring &korganizer; to publish and retrieve free/busy information, please check the <xref linkend="config"/>. Double-clicking on an attendee entry in the list will allow you to enter the location of their free/busy information.
tr: Uygun/meşgul bilgisi yalnızca katılımcı uygun/meşgul programını yayınlarsa ve &korganizer; bunu almak üzere doğru bir biçimde yapılandırılmışsa kullanılabilir. &korganizer;’ü uygun/meşgul bilgisini almak/yayınlamak ile ilgili daha fazla bilgi için <xref linkend="config"/> bölümüne bakın. Listedeki katılımcı girişine çift tıklandığında, katılımcının uygun/meşgul bilgilerinin bulunduğu yer girilebilir.

source: Scale
tr: Ölçek

source: Sets the zoom level on the schedule chart. <guilabel>Hour</guilabel> shows a range of several hours, <guilabel>Day</guilabel> shows a range of a few days, <guilabel>Week</guilabel> shows a range of a few months, and <guilabel>Month</guilabel> shows a range of a few months, while <guilabel>Automatic</guilabel> selects the range most appropriate for the current event or to-do.
tr: Plan grafiğindeki yakınlaştırma düzeyini ayarlayın. <guilabel>Saat</guilabel>, birkaç saatlik bir erimi; <guilabel>Gün</guilabel>, birkaç günlük bir erimi; <guilabel>Hafta</guilabel>, birkaç haftalık bir erimi ve <guilabel>Ay</guilabel>, birkaç aylık bir erimi gösterirken <guilabel>Kendiliğinden</guilabel>, geçerli etkinlik veya yapılacak için olan en uygun erimi seçer.

source: Center on Start
tr: Başlangıca Ortala

source: Press this button to center the free/busy schedule chart on the start time and day of this event.
tr: Bu düğmeye basarak uygun/meşgul programı çizelgesini bu etkinliğin başlangıç ​​saatine ve gününe göre ortalayabilirsiniz.

source: Pick Date
tr: Tarih Seç

source: Press this button to automatically move the event to a date and time when all the attendees are free.
tr: Etkinliği tüm katılımcıların uygun olduğu bir gün veya saate kendiliğinden taşımak için bu düğmeye basın.

source: Reload
tr: Yeniden Yükle

source: Press this button to reload Free/Busy data for all attendees from the corresponding servers.
tr: İlgili sunuculardan tüm katılımcılar için uygun/meşgul verisini yeniden yüklemek için bu düğmeye basın.

source: When you want to confirm, call off or revert the entered data, choose among the Action Buttons <guibutton>OK</guibutton>, <guibutton>Apply</guibutton> and <guibutton>Cancel</guibutton>.
tr: Girilen veriyi onaylamak, geri çağırmak veya geri almak için <guibutton>Tamam</guibutton>, <guibutton>Uygula</guibutton> ve <guibutton>İptal</guibutton> eylem düğmelerinden birini seçin.

source: Manage Templates
tr: Şablonları Yönet

source: The <guibutton>Manage Templates</guibutton> button opens a dialog which enables you to save the current event as a template, so that you can reuse the data entered for future events. As an example you can save a template for a meeting that takes place at the same location and with the same people.
tr: <guibutton>Şablonları Yönet</guibutton> düğmesi, geçerli etkinliği şablon olarak kaydetmenizi sağlayan bir iletişim kutusu açar, böylece girilen verileri gelecekteki etkinlikler için yeniden kullanabilirsiniz. Örneğin, aynı yerde ve aynı kişilerle gerçekleşen bir toplantı için bir şablon kaydedebilirsiniz.

source: With the <guibutton>Apply</guibutton> button you can use an existing template for your event. Continuing the example in the preceding paragraph you can specify the agenda of the meeting.
tr: <guibutton>Uygula</guibutton> düğmesiyle etkinliğiniz için var olan bir şablonu kullanabilirsiniz. Önceki paragraftaki örneği sürdürerek toplantının gündemini belirtebilirsiniz.

source: To-dos
tr: Yapılacaklar

source: The To-do List is a place for you to write down notes to yourself about things that you need to do. To-dos are tasks, that may or may not be scheduled. There are short-term and long-term to-dos. For instance you should go to a hairdresser within a week, and you should sell your old car within a year. You likely do not want a reminder go off at a particular time, you just want to have a list of things that you must do, and dates when they must be finished at the latest (date due).
tr: Yapılacaklar Listesi, yapmanız gereken şeyler hakkında kendinize notlar yazabileceğiniz bir yerdir. Yapılacaklar, planlanmış veya planlanmamış görevlerdir. Kısa ve uzun vadeli yapılacaklar vardır. Örneğin, bir hafta içinde kuaföre gitmelisiniz ve eski arabanızı bir yıl içinde satmalısınız. Bunlar büyük olasılıkla anımsatıcı gerektirmeyen; ancak bir listede tutmak istediğiniz ve isteğe bağlı bir bitiş tarihi olan ögelerdir.

source: To enter a new to-do, choose <menuchoice><guimenu>Actions</guimenu><guimenuitem>New To-do...</guimenuitem></menuchoice>. A window with five tabs at the bottom will appear.
tr: Yeni bir yapılacak girmek için <menuchoice><guimenu>Eylemler</guimenu> <guimenuitem>Yeni Yapılacak…</guimenuitem></menuchoice> ögesini seçin. Alt kısmında beş adet sekme olan bir pencere açılır.

source: <screeninfo>A screenshot of &korganizer;'s Edit To-do dialog</screeninfo>
tr: <screeninfo>&korganizer;’ün yapılacakları düzenle iletişim kutusunun ekran görüntüsü</screeninfo>

source: <phrase>A screenshot of &korganizer;'s Edit To-do dialog</phrase>
tr: <phrase>&korganizer;’ün yapılacakları düzenle iletişim kutusunun ekran görüntüsü</phrase>

source: <para>A screenshot of &korganizer;'s Edit To-do dialog</para>
tr: <para>&korganizer;’ün yapılacakları düzenle iletişim kutusunun ekran görüntüsü</para>

source: This tab shares a lot of options with the <guilabel>Edit Events</guilabel> dialog, but has some additional items for to-dos:
tr: Bu sekme, <guilabel>Yapılacakları Düzenle</guilabel> iletişim kutusu ile birçok seçeneği paylaşır; ancak yapılacaklar için bazı ek ögelere sahiptir:

source: Completion
tr: Tamamlanma

source: This is a percent completed pull down menu initially set at 0% complete. Later on, you can indicate your progress by adjusting the percent completed in steps of 10%.
tr: Bu, başlangıçta %0 tamamlanma olarak ayarlanmış bir tamamlanan yüzde açılır menüsüdür. Daha sonra, tamamlanma yüzdesini %10’luk adımlarla ayarlayarak ilerlemenizi belirtebilirsiniz.

source: Priority
tr: Öncelik

source: Assign a priority to your to-do. This drop down menu offers priorities from one to nine, one being the highest. Initially to-dos are set to priority five (medium).
tr: Yapılacaklarınıza bir öncelik atayın. Bu açılır menü, bir ile dokuz arasında öncelikler sunar, bir en yüksek olanıdır. Başlangıçta yapılacaklar beş (orta) önceliğe ayarlanır.

source: Required Fields
tr: Zorunlu Alanlar

source: This is an overview of what fields are required and what fields can be empty when entering events and to-dos:
tr: Etkinlikleri ve yapılacak işleri girerken hangi alanların zorunlu, hangi alanların boş bırakılabileceğine dair genel bir bakış:

source: You must fill in the <guilabel>Summary</guilabel> field.
tr: <guilabel>Özet</guilabel> alanını doldurmanız gerekir.

source: The <guilabel>General</guilabel> Tab may be left completely empty.
tr: <guilabel>Genel</guilabel> sekmesi tümüyle boş bırakılabilir.

source: If you set a <guilabel>Reminder</guilabel>, you should also specify the time, and either the sound to be played or the program to be run.
tr: Bir <guilabel>Anımsatıcı</guilabel> ayarlarsanız zamanı ve çalınacak sesi veya çalıştırılacak programı da belirtmeniz gerekir.

source: The <guilabel>Attendees</guilabel> tab may be left completely empty.
tr: <guilabel>Katılımcılar</guilabel> sekmesi tümüyle boş bırakılabilir.

source: The <guilabel>Recurrence</guilabel> tab must only be filled if you select a daily, weekly, monthly or yearly repeat.
tr: <guilabel>Yineleme</guilabel> sekmesi yalnızca günlük, haftalık, aylık veya yıllık tekrarı seçerseniz doldurulmalıdır.

source: The <guilabel>Attachments</guilabel> dialog may be left completely empty.
tr: <guilabel>Ekler</guilabel> iletişim kutusu tümüyle boş bırakılabilir.

source: Group Scheduling
tr: Grup Programı

source: The group schedule functionality of &korganizer; allows you to organize appointments, meetings and shared to-do items, request responses from attendees and publish items. If you are being invited to an event or to-do, you can reply to it, stating if you will be able to attend, or send a counter proposal, with different arrangements, like a different time or location. You can also publish your free/busy schedule, to let people know when you are available, and request the same information from others.
tr: &korganizer;’ün grup programı işlevi, randevuları, toplantıları ve paylaşılan yapılacakları düzenlemenize, katılımcılardan yanıt istemenize ve ögeleri yayımlamanıza olanak tanır. Bir etkinliğe veya yapılacaklar listesine davet ediliyorsanız katılıp katılamayacağınızı belirterek yanıtlayabilir veya farklı bir zaman veya konum gibi farklı düzenlemelerle karşı teklif gönderebilirsiniz. Ayrıca, uygun olduğunuzda insanlara bildirmek için uygun/meşgul programınızı yayınlayabilir ve aynı bilgileri başkalarından isteyebilirsiniz.

source: Currently, &korganizer; schedules events and to-dos using email to transport the data, in a standards based scheme, the IMIP-protocol for group scheduling. Being a standard, IMIP is a used by many other clients too. For example &Microsoft;<application>Outlook</application>, Lotus <application>Notes</application> and Novell <application>Evolution</application>. This means that you can share events with other users using one of these clients. &korganizer; is integrated with &kmail; for receiving, processing, and sending events, event responses, updates, cancellations, &etc; For instance, when you get an invitation in &kmail;, and decide to accept it, by clicking the <guilabel>accept</guilabel> link in the mail body, the event is added to your calendar, and a response to the event's organizer is sent automatically.
tr: Şu anda &korganizer;, etkinlikleri ve yapılacakları ulaştırmak için standart bir veri şemasıyla e-posta kullanır (Grup Programı için IMIP protokolü). IMIP standardı başka istemciler tarafından da kullanılır. Örnek olarak; &Microsoft;<application>Outlook</application>, Lotus <application>Notes</application> ve Novell <application>Evolution</application> verilebilir. Bu, bu istemcileri kullanan kişilerle de etkinlikler paylaşabileceğiniz anlamına gelir. &korganizer;; etkinlikler, etkinlik yanıtları, güncellemeler, iptaller vb. işlemek üzere &kmail; ile tümleşiktir. Örneğin, &kmail;’da bir davetiye alırsanız onu <guilabel>kabul etmek</guilabel> için ileti gövdesindeki düğmeye tıklayın. Böylece etkinlik takviminize eklenir ve etkinliğin organizatörüne bir yanıt kendiliğinden gider.

source: If you check the <guilabel>Use Groupware Communication</guilabel> box in the <link linkend="config-main-groupscheduling">&korganizer; group scheduling configuration</link>, &korganizer; will handle the group scheduling communication for you. In other words, you will seldom need to use the <guimenu>Schedule</guimenu> menu directly to perform the scheduling actions. For instance, if you <link linkend="entering-data-events">create an event or to-do</link> with attendees, &korganizer; will ask you if you want to send the invitations to the attendees, so you will not need to use the <menuchoice> <guimenu>Schedule</guimenu><guimenuitem>Send Invitation to Attendees</guimenuitem> </menuchoice> menu item later. Also, if you change your status as an attendee for an event you were invited to, it will ask you if you want to send your updated status to the event's organizer, so you will not need to use the <menuchoice> <guimenu>Schedule</guimenu><guimenuitem>Send Status Update</guimenuitem> </menuchoice> menu item later.
tr: <link linkend="config-main-groupscheduling">&korganizer; grup programı yapılandırmasındaki</link> <guilabel>Grup yazılımı iletişimini kullan</guilabel> kutusunu işaretlerseniz &korganizer;, grup programı iletişimini sizin için halleder. Başka bir deyişle, planlama işleri için <guimenu>Program</guimenu> menüsünü doğrudan kullanmanıza gerek kalmaz. Örneğin, katılımcılı bir <link linkend="entering-data-events">etkinlik veya yapılacak</link> oluşturursanız &korganizer;, katılımcılara davet göndermek isteyip istemediğinizi soracaktır; böylece <menuchoice><guimenu>Program</guimenu> <guimenuitem>Katılımcılara Davet Gönder</guimenuitem></menuchoice> menü ögesini kullanmanıza gerek kalmaz. Ayrıca, davet edildiğiniz bir etkinlik için olan katılımcı durumunuzu değiştirirseniz etkinliğin organizatörüne güncellenmiş durumunuzu göndermek isteyip istemediğinizi de soracaktır; böylece yine <menuchoice><guimenu>Program</guimenu> <guimenuitem>Durum Güncellemesi Gönder</guimenuitem></menuchoice> ögesini kullanmanıza gerek kalmaz.

source: Publishing an Event, To-do or Journal Entry
tr: Bir etkinlik, yapılacak veya günce yayımlamak

source: If you simply want to send an event, to-do or journal entry, choose the <menuchoice><guimenu>Schedule</guimenu><guimenuitem>Publish Item Information...</guimenuitem></menuchoice> menu item, when the item is selected. Then a dialog appears, asking you the email addresses which will receive the event or to-do. The item will be sent by email, in the iCalendar format.
tr: Yalnızca bir etkinlik, yapılacak veya günce girdisi göndermek istiyorsanız öge seçiliyken <menuchoice><guimenu>Program</guimenu> <guimenuitem>Öge Bilgisini Yayımla…</guimenuitem></menuchoice> menü ögesini kullanmanız yeterlidir. Sonrasında bir iletişim kutusu açılır ve burada ögeyi alacak olan kişilerin e-posta adreslerini sorar. Akabinde öge, iCalendar biçiminde posta ile gönderilir.

source: Please note that you can use this action to email any item to anyone, not just to the item's attendees. In fact, you can publish an item with no attendees at all, as publishing does not request an answer from the attendees.
tr: Lütfen bu eylemi yalnızca ögenin katılımcılarına değil, herhangi bir ögeyi herkese e-posta ile göndermek için kullanabileceğinizi unutmayın. Aslında, hiç katılımcısı olmayan bir ögeyi yayımlayabilirsiniz; çünkü yayınlama işlemi katılımcılardan bir yanıt istemez.
