Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/korganizer.po
Languages: tr

source: This button opens the <guilabel>Select Color</guilabel> dialog, allowing you to select the Agenda or Month view background busy color. This color is only used when the option for drawing busy days with a different color is set in either of these views.
tr: Bu buton, Ajanda ya da Ay görünümü arkaplan dolu rengini seçmenize izin vere <guilabel>Renk Seç</guilabel> penceresini açar. Bu renk sadece, bu görünümlerden birindeyken dolu günleri farklı bir renkle boyamak için kullanılır.

source: Agenda view current-time line color
tr: Ajanda görünümü mevcut zaman çizgisi rengi

source: This button opens the <guilabel>Select Color</guilabel> dialog, allowing you to select a color for the current-time (Marcus Bains) line.
tr: Bu buton, mevcut zaman (Marcus Bains) çizgisini seçmenize izin veren <guilabel>Renk Seç</guilabel> penceresini açar.

source: Working hours color
tr: Çalışma saatleri rengi

source: This button opens the <guilabel>Select Color</guilabel> dialog, allowing you to select the color of the working hours background in the Agenda view.
tr: Bu buton, Ajanda görünümünde çalışma saatlerinin arkaplanının rengini seçmeye izin veren <guilabel>Renk Seç</guilabel> penceresini açar.

source: To-do due today color
tr: Bitiş tarihi bugun yapılacak rengi

source: This button opens the <guilabel>Select Color</guilabel> dialog, allowing you to select the to-do due today color.
tr: Bu buton, bitiş tarihi bugün olan yapılacak rengini seçmeye izin veren <guilabel>Renk Seç</guilabel> penceresini açar.

source: To-do overdue color
tr: Bitiş tarihi geçmiş yapılacak rengi

source: This button opens the <guilabel>Select Color</guilabel> dialog, allowing you to select the to-do overdue color.
tr: Bu buton, bitiş tarihi geçmiş yapılacak rengini seçmeye izin veren <guilabel>Renk Seç</guilabel> penceresini açar.

source: Resources
tr: Kaynaklar

source: This group allows you to assign a color to each resource. Select a resource in the drop down list, and press the button to open the <guilabel>Select Color</guilabel> dialog, allowing you to select the color for that resource. <link linkend="config-main-views">Depending on the view preferences</link>, this color will be used to mark events and to-dos which are stored using this resource in the Agenda and Month views.
tr: Bu grup, her kaynağa bir renk atamanıza izin verir. Kaynağı açılır listeden seçin, <guilabel>Renk Seç</guilabel> penceresini açmak için butona tıklayın, bu size kaynak için renk seçmenize izin verecektir. <link linkend="config-main-views">Görünüm tercihlerine bağlı olarak</link> bu renk, Ajanda ve Ay görünümünde, bu kaynaktaki etkinlik ve yapılacakların işaretlenmesinde kullanılacaktır.

source: Fonts tab
tr: Yazı tipi sekmesi

source: Time bar
tr: Zaman çubuğu

source: Press this button to pick the font, font style and size for the time bar.
tr: Zaman çubuğu için yazı tipi, yazı tipi biçemi ve boyut seçmek için bu butona basın.

source: Month view
tr: Ay görünümü

source: Press this button to pick the font, font style and size for the Month view.
tr: Ay görünümü için yazı tipi, yazı tipi biçemi ve boyut seçmek için bu butona basın.

source: Agenda view
tr: Ajanda görünümü

source: Press this button to pick the font, font style and size for the Agenda view (Day, Week and Work Week views).
tr: Ajanda görünümü (Gün, Hafta ve Çalışma Haftası görünümleri) için yazı tipi, yazı tipi biçemi ve boyut seçmek için bu butona basın.

source: Press this button to pick the font, font style and size for the Marcus Bains line (a colored line in the Agenda view indicating the current time).
tr: Marcus Bains çizgisi (mevcut zamanı Ajanda görünümünde gösteren renkli bir çizgi) için yazı tipi, yazı tipi biçemi ve boyut seçmek için bu butona basın.

source: Use Groupware Communication
tr: Grup Yazılımı İletişimi Kullan

source: Check this box to automatically send emails when creating, updating or deleting events or to-dos which involve others. This email can be an invitation to attendees of an event you created, a cancellation of an event you created, an answer or an update on your invitation status, an event change request, &etc; Check this option if you want to use the groupware functionality (&eg; Configuring &kontact; as a &kde; <guilabel>Kolab</guilabel> client).
tr: Diğerlerini dahil eden etkinlik ya da yapılacakları oluştururken, güncellerken ya da silerken otomatik eposta göndermek için bu kutuyu işareteyin. Bu eposta, oluşturduğunuz bir etkinliğe davetiye, oluşturduğunuz bir etkinliğin iptali, tavet durumunuza bir cevap ya da bir güncelleme, etkinlik değiştirme isteği &vb; olabilir. Grup işlevselliğini kullanmak için bu seçeneği işaretleyin (&örn; &kontact;'ı &kde; <guilabel>Kolab</guilabel> istemcisi olarak yapılandırmak).

source: Send copy to owner when mailing events
tr: Etkinlikleri eposta ile yollarken bir koypyasını sahibine gönder

source: When you check the <guilabel>Send copy to owner when mailing events</guilabel> box, you will get a copy of all email messages that &korganizer; sends at your request to the event attendees.
tr: <guilabel>Etkilniği epostalarken sahibine bir kopyasını gönder</guilabel> kutusunu işaretlediğinizde, &korganizer;'ın etkinlik katılımcılarına istek gönderdiğinde tüm epostaların bir kopyasını alacaksınız.

source: Mail transport
tr: Eposta aktarımı

source: Here you can choose which type of mail transport you would like to use. You can either use &kmail; or the &Sendmail; command (which must be installed on your system in order to work).
tr: Buradan hangi tür eposta aktarımı kullanmak istediğinizi seçebilirsiniz. &kmail; ya da &Sendmail; komutu kullanabilirsiniz (bunların çalışması için sisteminizde kurulu olması gerekmektedir).

source: Publish
tr: Yayınla

source: By publishing your free/busy information, you allow others to take your busy time schedule into account when inviting you to an event.
tr: Uygun/dolu bilgisini yayımlayarak, diğerlerinin sizi bir etkinliğe davet ederken dolu zaman programınızı görmesine izin verirsiniz.

source: Publish free/busy information automatically
tr: Uygun/dolu bilgisini kendiliğinden yayımla

source: Enable this option if you wish your Free/Busy information to be uploaded automatically. Note that you may skip this option and choose to mail or upload your Free/Busy information via the <guilabel>Schedule</guilabel> menu of &korganizer;.
tr: Uygun/Dolu bilgisinin kendiliğinden yüklenmesini istiyorsanız bu seçeneği işaretleyin. Şunu unutmayın, bu seçeneği geçip, &korganizer;'ın <guilabel>Programla</guilabel> menüsü aracılığıyla Uygun/Dolu bilginizi eposta yolu ile ya da yüklerek de güncelleyebilirsiniz.

source: If your application is setup to work as a <guilabel>&kde; Kolab client</guilabel>, this is not required. The <guilabel>Kolab2</guilabel> server can take care of publishing your Free/Busy information and manage the access to it from other users.
tr: Eğer uygulama <guilabel>&kde; Kolab istemcisi</guilabel> olarak çalışacak şekilde kuruldaysa, bu gerekli değildir. <guilabel>Kolab2</guilabel> sunucusu sizin Uygun/Dolu bilginizi yayımlamayı ve diğer kullanıcılar tarafından erişilebilir olmasını yönetmeyi yapar.

source: Minimum time between uploads (in minutes)
tr: Yüklemeler arasında geçecek en az süre (dakika olarak)

source: If you choose to publish your information automatically, you can configure the interval of time in minutes between each upload.
tr: Bilginizi kendiliğinden yayımlamayı seçerseniz, her yükleme arasındaki süreyi dakika olarak yapılandırabilirsiniz.

source: Publish (default 60) days of free/busy information
tr: Uygun/dolu bilgisini yayımlama (öntanımlı 60) günü

source: Configure the number of calendar days you wish to be published and available to others
tr: Yayımlamak ve diğerlerine uygun olması için takvim günü sayısını yapılandırın

source: Server &URL;
tr: Sunucu &URL;'si

source: Enter the &URL; for the server on which your Free/Busy information will be published. Ask the server administrator for this information.
tr: Uygun/Dolu bilginizin yayımlanacağı sunucunun &URL;'si. Bu bilgiyi sunucu yöneticinize sorun.

source: Kolab2 server example: <userinput>webdavs://kolab2.com/freebusy/joe@kolab2.com.ifb</userinput>
tr: Kolab2 sunucu örneği: <userinput>webdavs://kolab2.com/freebusy/joe@kolab2.com.ifb</userinput>

source: Username
tr: Kullanıcı adı

source: Enter the login information relative to your account on the server
tr: Sunucuda ilgili hesap için giriş bilgilerinizi girin

source: Kolab2 server specificity: your registered UID (Unique IDentifier), by default, would be similar to your email address on the Kolab2 server but it may be different. In this case enter your UID. Ask the server administrator about your UID if you do not know it.
tr: Kolab2 sunucu belirliliği: kayıtlı UID (Benzersiz Kimlik), öntanımlı olarak, eposta adresinize benzer olabilir fakat farklı da olabilir. Bu durumda UID girin. Eğer bilmiyorsanız sunucu yöneticinize UID’nizi sorun.

source: Password
tr: Parola

source: Enter your password (server login password) here.
tr: Parolanızı (sunucu giriş parolası) buraya girin.

source: Remember password
tr: Parolayı hatırla

source: Check this option if you want &korganizer; to remember your password and skip asking you each time it uploads your Free/Busy information.
tr: Eğer &korganizer;'ın uygun/dolu dosyalarını sunucuya yüklerken her seferinde parolanızı hatırlamasını ve sormamasını istiyorsanız bu seçeneği işaretleyin.

source: It is not recommended to store your password in the configuration file for security reasons.
tr: Güvenlik sebebiyle parolalarınızı yapılandırma dosyalarında saklamanız önerilmez.

source: Retrieve
tr: Getir

source: By retrieving other people's free/busy information, you can take their busy time schedule into account when inviting them to an event.
tr: Diğer bilgilerin uygun/dolu bilgisini getirerek, onları bir etkinliğe davet ederken meşgul zamanına bakabilirsiniz.

source: Retrieve other people's free/busy information automatically
tr: Diğer insanların uygun/dolu bilgisini kendiliğinden getir

source: Automate the process for retrieving other users free/busy time. Fill in the server information section below to enable this option.
tr: Diğer kullanıcıların uygun/dolu zamanlarını getirme işlemini otomatikleştirme. Bu seçeneği etkinleştirmek için aşağıdaki sunucu bilgisi bölümünü doldurun.

source: Use full email address for retrieval
tr: Getirmek için tam eposta adresini kullan

source: This setting lets you change the name of the file which will be fetched from the server. If you check this option, it will download a free/busy file called <userinput>user@domain.ifb</userinput>, else it will fetch <userinput>user.ifb</userinput>. Ask the server administrator if you are not sure about how to configure this option.
tr: Bu ayar, sunucudan getirilecek dosyanın adını değiştirmenizi sağlar. Eğer bu seçeneği işaretlerseniz, <userinput>kullanici@alanadi.ifb</userinput> adında bir uygun/dolu dosyası indirecektir, aksi takdirde, <userinput>kullaici.ifb</userinput> Bunu nasıl yapılandıracağınızdan emin değilseniz, sunucu yöneticinize sorun.

source: <guilabel>Kolab2 server specificity:</guilabel> If you are configuring &korganizer; as a component to a <guilabel>&kde; Kolab client (&kontact;/Kolab)</guilabel> you have to check this option.
tr: <guilabel>Kolab2 sunucu belirliliği:</guilabel> Eğer &korganizer;'ı <guilabel>&kde; Kolab istemcisine (&kontact;/Kolab)</guilabel> bir bileşen olarak yapılandırıyorsanız bu seçeneği işaretlemelisiniz.

source: Enter the &URL; for the server from which your Free/Busy information will be fetched. Ask the server administrator for this information.
tr: Uygun/Dolu bilginizin çekilecek sunucu &URL;'si. Bu bilgiyi sunucu yöneticinize sorun.

source: <guilabel>Kolab2 server example: </guilabel><userinput>webdavs://kolab2.com/freebusy/</userinput>
tr: <guilabel>Kolab2 sunucu örneği: </guilabel><userinput>webdavs://kolab2.com/freebusy/</userinput>

source: Enter the login information relative to your account on the server.
tr: Sunucudaki hesabınızla ilişkili giriş bilgilerinizi girin.

source: Check this option if you want &korganizer; to remember your password and skip asking you each time it fetches the free/busy files.
tr: Eğer &korganizer;'ın uygun/dolu dosyalarını çekerken her seferinde parolanızı hatırlamasını ve sormamasını istiyorsanız bu seçeneği işaretleyin.

source: Plugins
tr: Eklentiler

source: For more information about configuring plugins, please refer to <xref linkend="plugins-chapter"/>
tr: Eklentileri yapılandırma hakkında daha fazla bilgi için bkz. <xref linkend="plugins-chapter"/>

source: Custom Pages
tr: Özel Sayfalar

source: This page allows you to add your own &GUI; Elements to store your own values into &korganizer;.
tr: Bu sayfa, &korganizer; içine kendi verilerinizi saklayabileceğiniz &GUI; Ögeleri eklemenize izin verir.

source: Create your elements as described in <guilabel>How does this work?</guilabel>
tr: <guilabel>Bu nasıl çalışır?</guilabel> içinde tanımlandığı gibi ögelerinizi oluşturun

source: &korganizer; provides you with the possibility of extending the application with plugins.
tr: &korganizer; size, eklentilerle uygulamanızı genişletme olanağı tanır.

source: The plugins can be configured under the &korganizer; main configuration dialog. Choose <menuchoice><guimenu>Settings</guimenu><guimenuitem> Configure &korganizer;</guimenuitem></menuchoice> and click the <guilabel>Plugins</guilabel> icon on the icon list sidebar of the dialog.
tr: Eklentiler, &korganizer; ana yapılandırma penceresinden yapılandırılabilir. <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem> &korganizer;'ı Yapılandır</guimenuitem></menuchoice>'ı seçin ve pencerenin yan çubuğundaki simge listesinden <guilabel>Eklentiler</guilabel> simgesini seçin.

source: Available Plugins
tr: Kullanılabilir Eklentiler

source: Date Numbers Plugin for Calendars
tr: Takvimler için Tarih Rakamları Eklentisi

source: This plugin adds the number of the day in the year to the Agenda view. For instance, February 1 is day number 32.
tr: Bu eklenti, Ajanda görünümüne günün yılın kaçıncı günü olduğu bilgisini ekler. Örneğin, Şubat 1, 32. gündür.

source: Wikipedia 'This Day in History' Plugin
tr: Wikipedia 'Tarihte Bugün' Eklentisi

source: This plugin provides links to Wikipedia's <quote>This Day in History</quote> pages.
tr: Bu eklenti, Vikipedi’deki <quote>Tarihte Bugün</quote> sayfalarına bağlantı sağlar.

source: Wikipedia Picture of the Day Plugin for Calendars
tr: Takvimler için Vikipedi Günün Resmi Eklentisi

source: This plugin provides the Wikipedia <quote>Picture of the Day</quote>.
tr: Bu eklenti, Vikipedi’deki <quote>Günün Resmini</quote> sağlar.

source: Jewish Calendar Plugin
tr: İbrani Takvimi Eklentisi

source: Reference
tr: Referans

source: Menus
tr: Menüler

source: When &korganizer; starts, the main &korganizer; window appears. The window has several components: a menubar, a toolbar, a month calendar, a main panel with the current <quote>view</quote> of events, and a to-do list.
tr: &korganizer; başladığında, ana &korganizer; penceresı belirir. Pencerenin birkaç bileşenir vardır: bir menü çubuğu, bir araç çubuğu, bir aylık takvim, etkinliklerin mevcut <quote>görünümü</quote> ile bir ana panel, ve bir yapılacaklar listesi.

source: The menus provide access to all the common operations that can be performed with the calendar, including saving, loading, adding and deleting events, to-dos and journal entries, printing and more.
tr: Menüler, takvimlerle gerçekleştirilebilen, etkinliklerin kaydedilmesi, yüklenmesi, eklenmesi ve silinmesi, yapılacaklar ve günlük girişleri, baskılar ve daha pek çok şeyi içeren tüm ortak işlemleri sağlar.

source: Please note that when using &korganizer; as the calendar component of &kontact;, the menus differ from the stand alone application.
tr: &korganizer;'i, &kontact;'ın takvim bileşeni olarak kullanırken, menüler tek başına uygulama olarak çalıştığından farklıdır.

source: File
tr: Dosya

source: The <guimenu>File</guimenu> menu provides access to functions involving the entire calendar.
tr: <guimenu>Dosya</guimenu> menüsü tüm takvimi ilgilendiren işlevlere erişim sağlar.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu> File</guimenu> <guimenuitem>Open</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu> Dosya</guimenu> <guimenuitem>Aç</guimenuitem>

source: <action>Opens a file dialog allowing you to select a new vCalendar or iCalendar file to load.</action> If you have made changes to the current calendar, you will be given the option of saving them before loading a new one.
tr: <action>Yeni yüklenecek bir vCalendar ya da iCalendar dosyası seçmenizi sağlayan bir dosya penceresi açar.</action> Eğer mevcut takvimde bir değişiklik yaptıysanız, yenisi yüklenmeden önce onu kaydetmek için bir seçenek sunulur.

source: For more information about this, please refer to <xref linkend="managing-import-export"/>.
tr: Bunun hakkında daha fazla bilgi için bkz. <xref linkend="managing-import-export"/>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu> File</guimenu> <guimenuitem>Print</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu> Dosya</guimenu> <guimenuitem>Yazdır</guimenuitem>

source: Choose <guimenuitem>Print</guimenuitem> or click the <guilabel>Print</guilabel> icon to <action>print the current calendar</action>. You can specify the range of dates to be printed (either manually or with the Calendar Widget) and the Print Style (Day, Week, Month or To-dos and Journal).
tr: <action>Mevcut takvimi yazdırmak</action> için <guimenuitem>Yazdır</guimenuitem>'ı seçin ya da <guilabel>Yazdır</guilabel> simgesine tıklayın. Yazdırılacak tarih aralığını (elle ya da Takvim Parçacığı ile) ve Yazdırma Biçemini (Gün, Hafta, Ay, ya da Yapılacak ve Günlük) belirtebilirsiniz.

source: <guimenu> File</guimenu><guimenuitem>Print Preview</guimenuitem>
tr: <guimenu> Dosya</guimenu><guimenuitem>Yazdırma Önizleme</guimenuitem>

source: If you choose <guimenuitem>Print Preview</guimenuitem> or click the <guiicon>Print Preview</guiicon> icon, <action>the current calendar will be printed on your screen, instead of on your printer</action>. Use this feature to check if the printout will be correct before you start printing.
tr: Eğer <guimenuitem>Yazdırma Önizleme</guimenuitem> seçerseniz ya da <guiicon>Yazdırma Önizleme</guiicon> simgesine tıklarsanız, <action>Mevcut takvim, yazıcıdan önce ekranda gösterilir</action>. Bu özelliği, yazdırmadan önce çıktıyı doğrulamak için kullanın.

source: You can specify the range of dates to be printed (either manually or with the Calendar Widget) and the View Type (Day, Week, Month or To-do).
tr: Yazdırılacak tarih aralığını (elle ya da Takvim Parçacığı ile) ve Görünüm Türünü (Gün, Hafta, Ay ve Yapılacak) belirtebilirsiniz.

source: <guimenu>File</guimenu> <guisubmenu>Import</guisubmenu> <guimenuitem>Import Calendar</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guisubmenu>İçe Aktarma</guisubmenu> <guimenuitem>Takvim İçe Aktar</guimenuitem>

source: If you have a different iCalendar or vCalendar file somewhere, and you would like to <action>merge its contents into your own calendar, add as a new resource or open it as a new window</action>, choose this menu item. A good time to do this would be if you received a vCalendar with a few entries via email, for instance.
tr: Eğer bir yerde farklı iCalendar ya da vCalendar dosyanız varsa ve <action>içeriğini takviminizle, yeni bir kaynak olarak ekleyerek ya da yeni pencerede açarak, birleştirmek istiyorsanız</action>, bu menü ögesini seçin. Örneğin, eğer eposta yolu ile birkaç vCalendar aldıysanız bunu yapmak için iyi bir zaman.

source: For more information about this action, please refer to <xref linkend="managing-import"/>.
tr: Bu eylem hakkında daha fazla bilgi için bkz. <xref linkend="managing-import"/>.

source: <guimenu>File</guimenu> <guisubmenu>Export</guisubmenu> <guimenuitem>Export as iCalendar</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guisubmenu>Dışa Aktar</guisubmenu> <guimenuitem>iCalendar olarak Dışa Aktar</guimenuitem>

source: This action will export all your active events, to-dos and journal entries (independent of to which resource they belong) as a new iCalendar file.
tr: Bu eylem, aktif etkinliklerinizi, yapılacaklarınızı ve günlük girişlerinizi (ait oldukları kaynaktan bağımsız olarak) yeni bir iCalendar dosyası olarak dışa aktaracaktır.

source: For more information about this action, please refer to <xref linkend="managing-export"/>.
tr: Bu eylem hakkında daha fazla bilgi için bkz. <xref linkend="managing-export"/>.

source: From time to time you should delete your old events.
tr: Zamandan zamana eski etkilniklerinizi silmelisiniz.

source: For more information about this action, please refer to <xref linkend="managing-purge-archive"/>.
tr: Bu eylem hakkında daha fazla bilgi için bkz. <xref linkend="managing-purge-archive"/>.

source: <guimenu>File</guimenu> <guimenuitem>Purge Completed To-dos</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Tamamlanmış Yapılacakları Sil</guimenuitem>

source: This action will remove all the completed to-dos from your active calendar.
tr: Bu eylem, tüm tamamlanmış yapılacaklarınızı etkin takviminizden siler.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Çık</guimenuitem>

source: When you choose <guimenuitem>Quit</guimenuitem> or click the <guiicon>Quit</guiicon> icon, <action>the current calendar window will quit, prompting you to save if the current calendar has been modified but not yet saved.</action>
tr: <guimenuitem>Çık</guimenuitem>'ı seçtiğinizde ya da <guiicon>Çık</guiicon> simgesine tıkladığınızda, <action>mevcut takvim penceresi, eğer mevcut takvim değiştirilmiş ve henüz kaydedilmemişse size kaydetmeyi sorup çıkacaktır.</action>

source: This has no effect on other calendar windows which may be opened. You have to quit each calendar window individually.
tr: Bu, açılabilen diğer takvim pencereleri üzerinde bir etkisi yoktur. Her takvim penceresinden ayrı olarak çıkmanız gerekiyor.

source: Edit
tr: Düzenle

source: With the <guilabel>Edit</guilabel> menu you can edit and search events and to-dos.
tr: <guilabel>Düzenle</guilabel> menüsü ile, etkinlikleri ve yapılacakları arayabilir ve düzenleyebilirsiniz.

source: <guimenuitem>Cut</guimenuitem>, <guimenuitem>Copy</guimenuitem>, and <guimenuitem>Paste</guimenuitem> menu items behave in the same fashion as in other &kde; applications. With the <guimenuitem>Find</guimenuitem> menu item you can find events and to-dos across the current calendar.
tr: <guimenuitem>Kes</guimenuitem>, <guimenuitem>Kopyala</guimenuitem> ve <guimenuitem>Yapıştır</guimenuitem> menü ögeleri, diğer &kde; uygulamaları ile aynı şekilde çalışır. <guimenuitem>Bul</guimenuitem> menü ögesi ile etkinlik ve yapılacaklarınızı mevcut takvim arasında bulabilirsiniz.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu> Edit</guimenu> <guimenuitem>Undo</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu> Düzenle</guimenu> <guimenuitem>Geri Al</guimenuitem>

source: <action>Undo the latest action</action>, or in other words, return the calendar to the state it was immediately before the latest action.
tr: <action>Son eylemi geri alır</action>, ya da diğer bir deyişle, takvimi son eylemden hemen önceki duruma getirir.
