Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/korganizer.po
Languages: tr

source: The &korganizer; Handbook
tr: &korganizer; El Kitabı

source: Developer
tr: Geliştirici

source: Reviewer
tr: Eleştirmen

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: 5.4.40 (Applications 16.12)
tr: 5.4.40 (Uygulamalar 16.12)

source: &korganizer; is an easy to use personal information manager (<acronym>PIM</acronym>). You can write journal entries, schedule appointments, events, and to-dos. &korganizer; will remind you about pending tasks, and help you keep your schedule.
tr: &korganizer;, kullanımı kolay bir kişisel bilgi yöneticisidir (<acronym>PIM</acronym>). Günce girdileri yazabilir, randevular, etkinlikler ve yapılacaklar planlayabilirsiniz. &korganizer; size bekleyen görevlerinizi anımsatır ve planınıza sadık kalmanızı sağlar.

source: KOrganizer
tr: K Organizatör

source: manager
tr: yönetici

source: time
tr: zaman

source: schedule
tr: plan

source: reminder
tr: anımsatıcı

source: appointment
tr: randevu

source: event
tr: etkinlik

source: journal
tr: günce

source: to-do
tr: yapılacak

source: Introduction
tr: Giriş

source: &korganizer; is an intuitive and easy to use personal information manager (<abbrev>PIM</abbrev>). You can schedule appointments, events, create to-dos and write journal entries. &korganizer; will remind you about pending tasks, record your occurrences, experiences, and reflections and help you keep your schedule.
tr: &korganizer;, sezgisel ve kullanımı kolay bir kişisel bilgi yöneticisidir (<acronym>PIM</acronym>). Günce girdileri yazabilir, randevular, etkinlikler ve yapılacaklar planlayabilirsiniz. &korganizer; size bekleyen görevlerinizi anımsatır, olaylarınızı ve deneyimlerinizi kaydeder ve planınıza sadık kalmanızı sağlar.

source: But &korganizer; is not only about your personal calendar, it can help you to interact with your colleagues and friends too. With &korganizer;, you can invite anyone with an email address to an event and process responses, and share a calendar (using a groupware server or simply a file over the network). &korganizer; is based on open standards, and works with many different group scheduling servers, giving you the control over your information and the freedom to choose the best solutions.
tr: Ancak &korganizer; sadece kişisel takviminizle ilgili değildir, iş arkadaşlarınız ve dostlarınızla da etkileşim kurmanıza yardımcı olabilir. &korganizer; ile e-posta adresi olan herkesi bir etkinliğe davet edebilir ve yanıtları işleyebilir, bir takvim (bir grup yazılımı sunucusu veya ağ üzerinden bir dosya kullanarak) paylaşabilirsiniz. &korganizer; açık standartlara dayanır ve birçok farklı grup planlama sunucusuyla çalışarak size bilgileriniz üzerinde denetim ve en iyi çözümleri seçme özgürlüğü verir.

source: &korganizer; is also the calendar, journal and to-do component of &kontact;, offering you an integrated solution for your communication and information management needs: email, notes, contacts management, news reader and news feeds reader. Even if you do not use it inside &kontact;, &korganizer; is integrated with the other &kde; <acronym>PIM</acronym> applications. For instance, you can configure it to show birthdays from &kaddressbook; in your agenda, use &kmail; to send and receive invitations, &etc;
tr: &korganizer; ayrıca &kontact;’ın takvim, günce ve yapılacaklar bileşenidir; böylelikle size tüm iletişim ve bilgi yönetimi gereksinimleriniz için tümleşik bir çözüm sunar: E-posta, notlar, kişi yönetimi, haber ve haber beslemesi okuyucusu. Onu &kontact;’ın içinde kullanmasanız bile &korganizer;, diğer &kde; <acronym>PIM</acronym> uygulamalarıyla tümleşiktir. Örneğin onu, ajandanızda &kaddressbook; uygulamasından alacağı doğum günlerini göstermesi için yapılandırabilir, &kmail; kullanarak davetiyeleri alabilir ve gönderebilirsiniz.

source: Main features of &korganizer;:
tr: &korganizer;’ün ana özellikleri:

source: Create To-dos, schedule events, and write journal entries.
tr: Yapılacaklar listesi oluşturmak, etkinlikler planlamak ve günce girdileri yazmak.

source: Organize your events and to-dos by grouping the related items with tags.
tr: İlgili ögeleri künyelerle gruplandırarak etkinliklerinizi ve yapılacaklarınızı düzenleyin.

source: Highlight tags with colors.
tr: Künyeleri renklerle vurgulayın.

source: Open multiple calendars, and seamlessly view and edit them.
tr: Birden çok takvim açıp onları sorunsuzca görüntüleyip düzenleyin.

source: Reschedule your events by drag-and-drop.
tr: Etkinliklerinizi sürükle–bırak yöntemiyle yeniden planlayın.

source: Generate recurring events easily.
tr: Kolaylıkla yinelenen etkinlikler üretin.

source: Organize or attend events using the group scheduling features.
tr: Grup programı özelliklerini kullanarak etkinlikler düzenleyin veya etkinliklere katılın.

source: Choose among the multiple supported groupware servers.
tr: Desteklenen birden fazla grup yazılımı sunucusu arasından seçim yapın.

source: vCalendar and iCalendar (open standards) native support.
tr: vCalendar ve iCalendar (açık standartlar) için yerel destek sunar.

source: Calendar merging and import.
tr: Takvim birleştirmek ve içe aktarmak.

source: Drag-and-drop between open calendars.
tr: Açık takvimler arasında sürükle–bırak yapabilme özelliği.

source: Embedding collaboration with &konqueror;.
tr: &konqueror; ile işbirliği yapabilme özelliği.

source: Customizable icon sets.
tr: Özelleştirilebilir simge kümeleri.

source: Drag-and-drop tool panels.
tr: Sürükle–bırak özelliğini destekleyen araç panelleri.

source: Much more...
tr: Çok daha fazlası…

source: Now take a <link linkend="five-minute-course">Five-minute fly-over course</link> of &korganizer;, or delve into <link linkend="managing-data">the documentation</link>!
tr: Şimdi &korganizer;’ün <link linkend="five-minute-course">Beş Dakikalık Hızlı Kurs</link>’una bakın veya <link linkend="managing-data">belgelendirmesini</link> okuyun!

source: Five-minute Fly-over Course of &korganizer;
tr: &korganizer; Beş Dakikalık Hızlı Kursu

source: (for the experienced and for the impatient)
tr: (deneyimliler ve sabırsızlar için)

source: Pressed for time? Let's get you kick-started with a fast, hands-on overview of &korganizer;!
tr: Zaman sıkıntısı mı çekiyorsunuz? Gelin, &korganizer;’e hızlı ve uygulamalı bir genel bakış ile işe koyulalım!

source: If you ever worked with a personal information program before, you'll be right at home with &korganizer;. You can enter new events, reschedule existing events, assign tags to your events, devise new tags, enter and modify lists of attendees and their roles, email event invitations automatically and exchange data with other &korganizer; calendars, create to-dos and write journal entries.
tr: Daha önce bir kişisel bilgi programı ile çalıştıysanız &korganizer; ile evinizde gibi hissedeceksiniz. Yeni etkinlikler girebilir, var olan etkinlikleri yeniden planlayabilir, etkinliklerinize künyeler atayabilir, yeni künyeler tasarlayabilir, katılımcı listelerini ve rollerini girebilir ve değiştirebilir, etkinlik davetiyelerini kendiliğinden e-postayla gönderebilir ve diğer &korganizer; takvimleriyle veri alışverişi yapabilir, yapılacaklar oluşturabilir ve günce girdileri yazabilirsiniz.

source: This course assumes that you know how to work with the &kde;, and that you prefer to explore on your own. Only the basic functions of &korganizer; are covered here.
tr: Bu kurs, &kde; ile nasıl çalışacağınızı bildiğinizi ve kendi başınıza keşfetmeyi tercih ettiğinizi varsayar. Burada yalnızca &korganizer;’ün temel işlevleri ele alınmaktadır.

source: Entering Events
tr: Etkinlikler Girmek

source: Click the <inlinemediaobject><imageobject> <imagedata fileref="view-calendar-agenda.png" format="PNG"/></imageobject> </inlinemediaobject><guibutton>Agenda</guibutton> toolbar button or choose the <menuchoice><guimenu>View</guimenu> <guimenuitem>Agenda</guimenuitem></menuchoice> menu item. This will bring up the <link linkend="agenda-view"><guilabel>Agenda View</guilabel> </link>.
tr: <inlinemediaobject><imageobject> <imagedata fileref="view-calendar-agenda.png" format="PNG"/></imageobject> </inlinemediaobject><guibutton>Ajanda</guibutton> araç çubuğu düğmesine tıklayın veya <menuchoice><guimenu>Görünüm</guimenu> <guimenuitem>Ajanda</guimenuitem></menuchoice> menü ögesini seçin. Bu, <link linkend="agenda-view"><guilabel>Ajanda Görünümü</guilabel></link>’nü getirir.

source: Click on the desired date in the <link linkend="glossary" endterm="gloss-date-navigator">Date Navigator</link>.
tr: <link linkend="glossary" endterm="gloss-date-navigator">Tarih Gezgini</link>’nde istediğiniz tarihe tıklayın.

source: Select the text area beside the desired hour in the main panel that reflects the time of the event. Double click this area, or just start typing a summary of the event to open the <guilabel>New Event</guilabel> dialog.
tr: Ana panelde istediğiniz saatin yanında bulunan ve etkinliğin zamanını yansıtan metin alanını seçin. Bu alana çift tıklayın veya <guilabel>Yeni Etkinlik</guilabel> iletişim kutusunu açmak için etkinliğin özetini yazmaya başlayın.

source: <link linkend="entering-data-events">Enter event details</link>. Use the six tabs at the bottom of the window to move around the dialog and access all the event's characteristics.
tr: <link linkend="entering-data-events">Etkinlik ayrıntılarını girin</link>. İletişim kutusunda dolaşmak ve etkinliğin tüm özelliklerine erişmek için pencerenin altındaki altı sekmeyi kullanın.

source: Press <guibutton>OK</guibutton> to save the event.
tr: Etkinliği kaydetmek için <guibutton>Tamam</guibutton> düğmesine tıklayın.

source: Entering To-dos
tr: Yapılacaklar Girmek

source: Select the <xref linkend="menu-actions-new-todo"/> menu item to open the <guilabel>New To-do</guilabel> dialog.
tr: <guilabel>Yeni Yapılacak</guilabel> iletişim kutusunu açmak için <xref linkend="menu-actions-new-todo"/> menü ögesini seçin.

source: <link linkend="entering-data-to-do">Enter the to-do details</link>. Use the five tabs at the bottom of the window to move around the dialog and access all the event's characteristics.
tr: <link linkend="entering-data-to-do">Yapılacak ayrıntılarını girin</link>. İletişim kutusunda dolaşmak ve etkinliğin tüm özelliklerine erişmek için pencerenin altındaki beş sekmeyi kullanın.

source: Press <guibutton>OK</guibutton> to save the to-do.
tr: Yapılacağı kaydetmek için <guibutton>Tamam</guibutton> düğmesine tıklayın.

source: Adding Journal Entries
tr: Günce Girdileri Eklemek

source: Select the <inlinemediaobject><imageobject> <imagedata fileref="journal-new.png" format="PNG"/></imageobject> </inlinemediaobject><menuchoice><guimenu>View</guimenu> <guimenuitem>Journal</guimenuitem></menuchoice> menu item to open the <link linkend="journal-view"><guilabel>Journal</guilabel> main view</link>.
tr: <link linkend="journal-view"><guilabel>Günce</guilabel> ana görünümünü açmak için <inlinemediaobject><imageobject> <imagedata fileref="journal-new.png" format="PNG"/></imageobject> </inlinemediaobject><menuchoice><guimenu>Görünüm</guimenu> <guimenuitem>Günce</guimenuitem></menuchoice> menü ögesini</link> kullanın.

source: Select the <menuchoice><guimenu>Actions</guimenu> <guimenuitem>New Journal</guimenuitem></menuchoice> menu item.
tr: <menuchoice><guimenu>Eylemler</guimenu> <guimenuitem>Yeni Günce</guimenuitem></menuchoice> menü ögesini seçin.

source: Enter journal entry summary and text.
tr: Günce girdisi özetini ve metnini girin.

source: Rescheduling Events
tr: Etkinlikleri Yeniden Planlamak

source: Rescheduling events is a simple drag-and-drop operation:
tr: Etkinlikleri yeniden programlamak basit bir sürükle–bırak işlemidir:

source: Using the <link linkend="glossary" endterm="gloss-date-navigator">Date Navigator</link> go to the date of the event that you want to reschedule.
tr: <link linkend="glossary" endterm="gloss-date-navigator">Tarih Gezgini</link>’ni kullanarak, yeniden planlamak istediğiniz etkinliğin olduğu tarihe gidin.

source: You should choose an appropriate <link linkend="reference-menus-view">view</link> before beginning this operation. Only the <link linkend="agenda-view"><guilabel>Agenda</guilabel> view </link> (Day, Work Week and Week views) shows individual hours and are suitable for rescheduling exactly-timed events (appointments), while the Month view only shows days. Therefore the Month view is most suitable for long-term events like holidays.
tr: Bu işleme başlamadan önce uygun bir <link linkend="reference-menus-view">görünüm</link> seçmelisiniz. Yalnızca <link linkend="agenda-view"><guilabel>Ajanda</guilabel> görünümü</link> (Gün, İş Haftası ve Hafta görünümleri) ayrıntılı saatleri gösterir ve kesin zamanlı etkinlikleri (randevular gibi) yeniden planlamak için uygundur. Ay görünümü ise yalnızca günleri gösterir. Bundan dolayı, tatil gibi uzun dönemli etkinlikleri değiştirmek istiyorsanız Ay görünümünü kullanın.

source: To display the Week view select the Agenda view, press the <inlinemediaobject><imageobject> <imagedata fileref="view-calendar-week.png" format="PNG"/></imageobject> </inlinemediaobject><guibutton>Week</guibutton> view toolbar button, or choose the <menuchoice><guimenu>Go</guimenu> <guimenuitem>Week</guimenuitem></menuchoice> menu item.
tr: Hafta görünümünü görüntülemek için Ajanda görünümünü seçin, <inlinemediaobject><imageobject> <imagedata fileref="view-calendar-week.png" format="PNG"/></imageobject> </inlinemediaobject><guibutton>Hafta</guibutton> görünümü araç çubuğu düğmesine tıklayın veya <menuchoice><guimenu>Git</guimenu> <guimenuitem>Hafta</guimenuitem></menuchoice> menü ögesini kullanın.

source: Drag and drop the event to the new date and time location.
tr: Etkinliği yeni tarih ve zaman konumuna sürükleyip bırakın.

source: If you wish to reschedule more precisely, double-click the event and change the start and end time using the drop down menus that divide the day into quarter hours. If that is not precision enough, you can enter the desired time directly.
tr: Daha hassas bir şekilde yeniden planlamak isterseniz etkinliğe çift tıklayın ve günü çeyrek saatlere bölen açılır menüleri kullanarak başlangıç ve bitiş saatini değiştirin. Bu yeterince hassas değilse istediğiniz saati doğrudan girebilirsiniz.

source: Rescheduling or Editing To-dos
tr: Yapılacakları Yeniden Planlamak veya Düzenlemek

source: You should choose an appropriate <link linkend="reference-menus-view">view</link> before beginning this operation. Only the <link linkend="todo-view"><inlinemediaobject><imageobject> <imagedata fileref="view-calendar-tasks.png" format="PNG"/></imageobject> </inlinemediaobject><guilabel>To-do List</guilabel> view </link> and <link linkend="description-view">the To-do View sidebar component </link> show to-dos which do not have a due date.
tr: Bu işleme başlamadan önce uygun bir <link linkend="reference-menus-view">görünüm</link> seçmelisiniz. Yalnızca <link linkend="todo-view"><inlinemediaobject><imageobject> <imagedata fileref="view-calendar-tasks.png" format="PNG"/></imageobject> </inlinemediaobject><guilabel>Yapılacaklar Listesi</guilabel> görünümü</link> ve <link linkend="description-view">Yapılacaklar kenar çubuğu bileşeni</link> bir bitiş tarihi olmayan yapılacakları gösterir.

source: To display the To-do List view, press the <inlinemediaobject><imageobject> <imagedata fileref="view-calendar-tasks.png" format="PNG"/></imageobject> </inlinemediaobject><guibutton>To-do List</guibutton> view toolbar button, or choose the <menuchoice><guimenu>View</guimenu> <guimenuitem>To-do List</guimenuitem></menuchoice> menu item.
tr: Yapılacaklar Listesi görünümünü görüntülemek için <inlinemediaobject><imageobject> <imagedata fileref="view-calendar-tasks.png" format="PNG"/></imageobject> </inlinemediaobject><guibutton>Yapılacaklar Listesi</guibutton> görünümü araç çubuğu düğmesine tıklayın veya <menuchoice><guimenu>Görünüm</guimenu> <guimenuitem>Yapılacaklar Listesi</guimenuitem></menuchoice> menü ögesini kullanın.

source: To reschedule a to-do, right click it. This will bring up a context menu. Choose the <guimenuitem>Copy to</guimenuitem> or <guimenuitem>Move to</guimenuitem> menu items and select the new date from the calendar now appearing. The to-do is now copied or moved to the selected date. Alternatively, if the main panel holds a <guilabel>To-do List</guilabel> view, just right click the column <guilabel>Due Date/Time</guilabel>. A calendar will appear instantly, allowing you to set the new due date.
tr: Bir yapılacak ögesini yeniden planlamak için üzerinde sağ tıklayın. Bu, bir bağlam menüsü getirir. <guimenuitem>Şuraya Kopyala</guimenuitem> veya <guimenuitem>Şuraya Taşı</guimenuitem> menü ögelerini kullanın ve şimdi görünen takvimden yeni tarihi seçin. Yapılacak ögesi artık seçilen tarihe kopyalandı veya taşındı. Alternatif olarak, eğer ana panelde bir <guilabel>Yapılacaklar Listesi</guilabel> görünümü tutuyorsa yalnızca <guilabel>Bitiş Tarihi/Zamanı</guilabel> sütununa sağ tıklayın. Bir takvim anında açılır ve buradan yeni tarihi ayarlayabilirsiniz.

source: To <link linkend="entering-data-to-do">edit a to-do</link>, right click it and choose the <guimenuitem>Edit...</guimenuitem> menu item.
tr: Bir yapılacak ögesini <link linkend="entering-data-to-do">düzenlemek</link> için ona sağ tıklayın ve <guimenuitem>Düzenle…</guimenuitem> menü ögesini kullanın.

source: Conclusion
tr: Sonuç

source: This five-minute course covered only the basic operation of &korganizer;. Now you should go on and read the rest of this manual to unleash the full power of &korganizer;'s capabilities. But if you do not feel like it, you should at least skip through the <link linkend="faq">&FAQ;</link>.
tr: Bu beş dakikalık kurs, &korganizer;’ün yalnızca temel işlemlerini kapsar. &korganizer;’ün tüm yeteneklerini ortaya çıkarmak için şimdi bu kılavuzun tümünü okuyun. Pek okuyasınız yoksa en azından <link linkend="faq">&FAQ;</link> bölümüne bir göz atın.

source: Importing, Exporting, and Managing Calendars
tr: Takvimler İçe Aktarmak, Takvimleri Dışa Aktarmak ve Yönetmek

source: &korganizer; can store (and retrieve) events, journal entries and to-dos using various methods, and to different locations. Each of these locations is called a <firstterm>calendar resource</firstterm>.
tr: &korganizer;, etkinlikleri, günce girdilerini ve yapılacakları çeşitli yöntemler ve konumlar kullanarak depolayabilir ve onları getirebilir. Bu konumlardan her birine <firstterm>takvim özkaynağı</firstterm> adı verilir.

source: &korganizer; supports calendar files based on standards such as iCalendar and vCalendar natively (adding them as new resources), but you can import the data (merge) into an existing resource and open the file in a new window too. Importing files in the format used by the old <application>ical</application> application is also supported.
tr: &korganizer; iCalendar ve vCalendar standartlarına dayalı takvim dosyalarını yerel olarak destekler (onları yeni bir özkaynak olarak ekleyerek); ancak veriyi var olan bir özkaynağa içe aktarabilirsiniz (birleştirebilirsiniz) ve yeni bir pencerede açabilirsiniz. Eski <application>ical</application> uygulaması tarafından kullanılan biçim de desteklenir.

source: You can export your data as an iCalendar or vCalendar file. These files are supported by most scheduling applications.
tr: Verinizi iCalendar veya vCalendar dosyası olarak dışa aktarabilirsiniz. Bu dosyalar, çoğu planlama uygulaması tarafından desteklenir.

source: In this chapter we will explain how to manage your calendar resources as well as using the import and export actions.
tr: Bu fasılda takvim özkaynaklarınızı nasıl yöneteceğinizi ve içe/dışa aktarma eylemlerini nasıl kullanacağınızı açıklayacağız.

source: Calendar Resources
tr: Takvim Özkaynakları

source: &korganizer; uses a local file as its default resource. But this is not your only option: there are several other resources you can add: groupware servers, journal entries as blogs, network files, &etc; If you use more than one resource, &korganizer; <link linkend="config-main-general-personal">can be configured to use the default resource or ask which resource to use</link> when saving new events, to-dos or journal entries. &korganizer; will seamlessly merge the items from two or more resources in the <link linkend="description-view">views</link>.
tr: &korganizer;, öntanımlı özkaynak olarak bir yerel dosya kullanır. Bu, sizin tek seçeneğiniz değildir; ekleyebileceğiniz birden çok özkaynak türü bulunur: Grup yazılımı sunucuları, blog olarak günce girdileri, ağ dosyaları gibi. Birden çok özkaynak kullanıyorsanız &korganizer; <link linkend="config-main-general-personal">öntanımlı özkaynak olarak neyi kullanacağı konusunda veya yeni etkinlikleri, yapılacakları veya günce girdilerini kaydederken hangi özkaynağı kullanması gerektiği konusunda</link> yapılandırılabilir. &korganizer;, <link linkend="description-view">görünümlerindeki</link> iki veya daha çok özkaynağı sorunsuzca birleştirebilir.

source: The default resource is a good choice for many use cases, but you may want to use another resource, especially if you use a supported groupware server. Please ask the server administrator for the information required to configure the groupware resource, including free/busy information publishing and retrieving. Access to free/busy information allows an event organizer to take the attendee's calendar into consideration when adding him to the event's attendee list.
tr: Öntanımlı özkaynak birçok kullanım durumu için iyi bir seçimdir; ancak özellikle desteklenen bir grup yazılımı sunucusu kullanıyorsanız başka bir özkaynak kullanmak isteyebilirsiniz. Lütfen sunucu yöneticisinden uygun/meşgul bilgisini yayınlama ve alma içerilmek üzere grup yazılımı özkaynağını yapılandırmak için gereken bilgileri isteyin. Uygun/Meşgul bilgilerine erişim, bir etkinlik düzenleyicisinin katılımcıyı etkinliğin katılımcı listesine eklerken onun takvimini dikkate almasını sağlar.

source: Besides calendar storage, groupware servers typically offer contacts, mail and <link linkend="glossary" endterm="gloss-freebusy">free/busy information</link> storage. Therefore, some of the resources discussed here may be related to other resources from &kmail; and &kaddressbook; (the mail and contacts components of &kontact;), or to the <link linkend="config-main-free-busy">free/busy settings in the main configuration</link>.
tr: Takvim depolamasının yanı sıra, grup yazılımı sunucuları genellikle kişiler, posta ve <link linkend="glossary" endterm="gloss-freebusy">uygun/meşgul</link> bilgisi depolaması sunarlar. Bundan dolayı, burada belirtilen özkaynakların bazıları &kmail; ve &kaddressbook; (&kontact;’ın posta ve kişi yönetimi bileşeni) veya <link linkend="config-main-free-busy">ana yapılandırmadaki uygun/meşgul bilgisine</link> ait olabilir.

source: Please note that &korganizer; <link linkend="group-scheduling">group scheduling</link> communication is based on a peer to peer email standard. This means that you do not need a groupware server to use it!
tr: &korganizer;’ün <link linkend="group-scheduling">grup planlaması</link> iletişimi, eş tabanlı bir e-posta standardına dayanır. Bu, onu kullanmak için bir grup yazılımı sunucusuna gereksiniminizin olmadığı anlamına gelir!

source: <screeninfo>A screenshot of &korganizer;'s Add Calendars dialog</screeninfo>
tr: <screeninfo>&korganizer;’ün Takvimler Ekle iletişim kutusu</screeninfo>

source: <phrase>A screenshot of &korganizer;'s Add Calendars dialog</phrase>
tr: <phrase>&korganizer;’ün Takvimler Ekle iletişim kutusu</phrase>

source: <para>A screenshot of &korganizer;'s Add Calendars dialog</para>
tr: <para>&korganizer;’ün Takvimler Ekle iletişim kutusu</para>
