Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/korganizer.po
Languages: tr

source: The Agenda view presents your events or due to-dos for one or more days, sorted chronologically. You can also see the length of each event in the day timetable. To enable the Agenda view choose the <menuchoice><guimenu>View</guimenu> <guimenuitem>Agenda</guimenuitem></menuchoice> menu item or press the <inlinemediaobject><imageobject><imagedata fileref="view-calendar-agenda.png" format="PNG"/></imageobject></inlinemediaobject>toolbar button.
tr: Ajanda Görünümü, bir veya daha çok gün için etkinliklerinizi veya yapılması gerekenleri kronolojik olarak sıralanmış şekilde sunar. Gün çizelgesinde her etkinliğin uzunluğunu da görebilirsiniz. Ajanda Görünümünü’nü etkinleştirmek için <menuchoice><guimenu>Görünüm</guimenu> <guimenuitem>Ajanda</guimenuitem></menuchoice> menü ögesini kullanın veya <inlinemediaobject><imageobject><imagedata fileref="view-calendar-agenda.png" format="PNG"/></imageobject></inlinemediaobject>araç çubuğu düğmesine basın.

source: The <guilabel>Day</guilabel>, <guilabel>Work Week</guilabel> and <guilabel>Week</guilabel> views are variations of the Agenda view. In fact, you can set the days shown in the Agenda view at any time by selecting them in the Date Navigator.
tr: <guilabel>Gün</guilabel>, <guilabel>Çalışma Haftası</guilabel> ve <guilabel>Hafta</guilabel> görünümü, Ajanda Görünümü’nün varyasyonlarıdır. Özünde, Ajanda Görünümü’nde gösterilen günleri Tarih Gezgini’nde seçerek istediğiniz zaman ayarlayabilirsiniz.

source: Time is indicated by a time bar on the left side of the view. A scrollbar on the right is provided when the whole day cannot be displayed on a single screen (which is the usual case). Each rectangle in the view represents an individual event or to-do due for that time, and displays the start and end time and summary. A <guiicon>bell</guiicon> icon is displayed if a reminder is set, and a <guiicon>chasing-arrows</guiicon> icon is displayed if it repeats multiple times. Hovering the mouse over an calendar item will bring up a tooltip with the item detailed information. To make &korganizer; show a red line marking the current-time on the current day (the Marcus Bains line), check the <guilabel>Show current-time (Marcus Bains) line</guilabel> box in the <link linkend="config-main-views">&korganizer; view configuration</link>.
tr: Zaman, görünümün sol tarafındaki bir zaman çubuğu ile gösterilir. Tüm gün tek bir ekranda görüntülenemediğinde (ki bu olağan bir durumdur) sağ tarafta bir sarma çubuğu bulunur. Görünümdeki her dikdörtgen, o zaman için yapılması gereken tek bir etkinliği veya yapılacak işi temsil eder ve başlangıç ve bitiş zamanı ile özeti görüntüler. Bir anımsatıcı ayarlanmışsa bir <guiicon>zil</guiicon> simgesi ve birden çok kez yinelenirse bir <guiicon>takip eden oklar</guiicon> simgesi görüntülenir. Fareyi bir takvim öğesinin üzerine getirdiğinizde, öğe hakkında ayrıntılı bilgi içeren bir araç ipucu görüntülenir. &korganizer;’ün geçerli gün üzerinde (Marcus Bains çizgisi) geçerli zamanı imleyen kırmızı bir çizgi göstermesini sağlamak için <link linkend="config-main-views">&korganizer; görünüm yapılandırmasında</link> <guilabel>Geçerli zaman akışını (Marcus Bains) göster</guilabel> kutusunu işaretleyin.

source: Any event can be re-sized with your mouse. Simply move the mouse pointer near the top or bottom edge of the event, and drag the edge up or down. This way you can visually modify the starting and ending time of your event. This also works in the Week and Work Week views. In other words, it is possible to change start and end times with the mouse by just moving the upper or lower border of the event to the new time.
tr: Herhangi bir etkinlik farenizle yeniden boyutlandırılabilir. Fare işaretçisini etkinliğin üst veya alt kenarına yaklaştırın ve kenarı yukarı veya aşağı sürükleyin. Bu şekilde etkinliğinizin başlangıç ve bitiş zamanını görsel olarak değiştirebilirsiniz. Bu aynı zamanda Hafta ve Çalışma Haftası görünümlerinde de çalışır. Başka bir deyişle, olayın üst veya alt kenarlığını yeni zamana taşıyarak başlangıç ve bitiş zamanlarını fareyle değiştirmek olanaklıdır.

source: Any event can be rescheduled with your mouse. Move the mouse pointer over the event, and drag it to a new time location. This also works in the Week and Work Week views. Events can be moved to other, presently non-visible dates. Move the mouse pointer over the event, and drag it to the Date Navigator.
tr: Herhangi bir etkinlik farenizle yeniden planlanabilir. Fare imlecini etkinliğin üzerine getirin ve yeni bir zaman konumuna sürükleyin. Bu aynı zamanda Hafta ve Çalışma Haftası görünümlerinde de çalışır. Olaylar başka, şu anda görünmeyen tarihlere taşınabilir. Fare imlecini etkinliğin üzerine getirin ve Tarih Gezgini’ne sürükleyin.

source: Since the Agenda view cannot contain the whole day on most screens, you will have to scroll up and down to see the whole day. There is a useful hint that tells you if there are any currently invisible events above or below your current view; it is a small down-pointing arrow at the bottom of each day view or up-pointing arrow at the top.
tr: Ajanda görünümü çoğu ekranda tüm günü kapsayamayacağından, tüm günü görmek için yukarı ve aşağı kaydırmanız gerekecektir. Geçerli görünümünüzün üstünde veya altında o anda görünmeyen etkinlikler olup olmadığını gösteren yararlı bir ipucu vardır; her gün görünümünün altında küçük bir aşağı işaretli ok veya üstte yukarı işaretli oktur.

source: There are two useful shortcuts for adding events:
tr: Etkinlikler eklemek için iki kullanışlı kısayol vardır:

source: Double-click any open region of time, and &korganizer; will automatically create an event with default duration (which is customizable in the preferences dialog). You can immediately add the summary. The events <quote>snap</quote> to half-hour increments, rounding off to the closest half hour from where you clicked.
tr: Herhangi bir açık zaman bölgesine çift tıkladığınızda &korganizer; kendiliğinden öntanımlı süreye sahip (tercihler iletişim kutusunda özelleştirilebilir) bir etkinlik oluşturacaktır. Özeti hemen ekleyebilirsiniz. Etkinlikler, tıkladığınız yerden itibaren en yakın yarım saate <quote>yuvarlanarak</quote> yarım saatlik artışlarla gerçekleşir.

source: Select any open region of time, and double click it or start writing the summary of the event. &korganizer; will automatically set the duration and start time as defined by the selection area in the Agenda view.
tr: Herhangi bir açık zaman bölgesini seçin ve çift tıklayın veya etkinliğin özetini yazmaya başlayın. &korganizer;, Ajanda görünümündeki seçim alanı tarafından tanımlanan süreyi ve başlangıç zamanını kendiliğinden ayarlayacaktır.

source: To help you organize your agenda, the color of the events reflect their tags, and depending on the <link linkend="config-main-views">&korganizer; view configuration</link>, it may also reflect its <link linkend="managing-resources">resource</link>. Therefore, if you assign <link linkend="categories-view">tags to events</link> and <link linkend="config-main-colors">different colors to tags</link> , you will be able to quickly identify the type of event by its color.
tr: Ajandanızı organize etmenize yardımcı olmak için etkinliklerin renkleri künyelerini yansıtır ve <link linkend="config-main-views">&korganizer; görünüm yapılandırmasına</link> bağlı olarak, ayrıca kendi <link linkend="managing-resources">özkaynaklarını</link> da yansıtabilir. Bundan dolayı, <link linkend="categories-view">etkinliklere künyeler</link> ve <link linkend="config-main-colors">künyelere farklı renkler</link> atarsanız etkinliğin türünü kolaylıkla tez ayırt edebilirsiniz.

source: The Agenda view can display events from all your calendars merged into one view or show a view per calendar. Having both views available via tabs is also possible and can be <link linkend="config-main-views">customized in the preferences dialog</link>.
tr: Ajanda görünümü, tüm takvimlerinizdeki etkinlikleri tek bir görünümde birleştirerek görüntüleyebilir veya takvim başına bir görünüm gösterebilir. Her iki görünümün sekmeler aracılığıyla kullanılabilir olması da olanaklıdır ve <link linkend="config-main-views">tercihler iletişim kutusundan özelleştirilebilir</link>.

source: Day View
tr: Gün Görünümü

source: This view presents the <link linkend="agenda-view">Agenda view</link> for a single day.
tr: Bu görünüm, tek bir gün için <link linkend="agenda-view">Ajanda Görünümü</link>’nü gösterir.

source: Switch the display to the Day view by choosing the <menuchoice><guimenu>Go</guimenu> <guimenuitem>Day</guimenuitem></menuchoice> menu item or pressing the <inlinemediaobject><imageobject><imagedata fileref="go-jump-today.png" format="PNG"/></imageobject></inlinemediaobject><guilabel>Day</guilabel> button in the toolbar.
tr: <menuchoice><guimenu>Git</guimenu> <guimenuitem>Gün</guimenuitem></menuchoice> menü ögesini veya araç çubuğundaki <inlinemediaobject><imageobject><imagedata fileref="go-jump-today.png" format="PNG"/></imageobject></inlinemediaobject><guilabel>Gün</guilabel> ögesini kullanarak Gün Görünümü’ne geçebilirsiniz.

source: Next X Days View
tr: Sonraki X Gün Görünümü

source: This view presents the <link linkend="agenda-view">Agenda view</link> for the next days, starting from today. You can change the number of days to be displayed in the <link linkend="config-main-views">&korganizer; view configuration</link>. The default value is 3.
tr: Bu görünüm, bugünden başlayarak sonraki günler için <link linkend="agenda-view">Ajanda Görünümü</link>’nü sunar. <link linkend="config-main-views">&korganizer; görünüm yapılandırmasından</link> görüntülenecek günlerin sayısını seçebilirsiniz. Öntanımlı değer 3’tür.

source: Switch the display to the next days view by choosing the <menuchoice><guimenu>Go</guimenu> <guimenuitem>Next X Days</guimenuitem></menuchoice> menu item, (X represents the number of days, usually 3).
tr: Sonraki günler görünümüne <menuchoice><guimenu>Git</guimenu> <guimenuitem>Sonraki X Gün</guimenuitem></menuchoice> menü ögesini kullanarak gidebilirsiniz (X, gün sayısını belirtir; genellikle 3’tür).

source: Week View
tr: Hafta Görünümü

source: The Week view provides a view similar to the Day view. Events for seven days are shown next to each other.
tr: Hafta görünümü, Gün görünümüne benzer bir görünüm sağlar. Yedi güne ait olaylar yan yana gösterilir.

source: Switch the display to the Week view by choosing the <menuchoice><guimenu>Go</guimenu> <guimenuitem>Week</guimenuitem></menuchoice> menu item or pressing the <inlinemediaobject><imageobject><imagedata fileref="view-calendar-week.png" format="PNG"/></imageobject></inlinemediaobject><guilabel>Week</guilabel> button in the toolbar.
tr: <menuchoice><guimenu>Git</guimenu> <guimenuitem>Hafta</guimenuitem></menuchoice> menü ögesini veya araç çubuğundaki <inlinemediaobject><imageobject><imagedata fileref="view-calendar-week.png" format="PNG"/></imageobject></inlinemediaobject><guilabel>Hafta</guilabel> ögesini kullanarak Hafta Görünümü’ne geçebilirsiniz.

source: Work Week View
tr: Çalışma Haftası Görünümü

source: This is the same as the Week view, except that it shows only the working days of the week.
tr: Bu, yalnızca haftanın çalışma günlerini göstermesi dışında Hafta Görünümü ile aynıdır.

source: Switch the display to the Work Week view by choosing the <menuchoice><guimenu>Go</guimenu> <guimenuitem>Work Week</guimenuitem></menuchoice> menu item.
tr: <menuchoice><guimenu>Git</guimenu> <guimenuitem>Çalışma Haftası</guimenuitem></menuchoice> menü ögesini kullanarak Çalışma Haftası Görünümü’ne geçebilirsiniz.

source: Month View
tr: Ay Görünümü

source: The Month view shows all the events and due to-dos for the current month in a familiar month calendar layout. Each cell in the view represents a day, and each day contains all of the events that can fit in the area provided (maximizing the window will enable you to see more appointments). Information on repeating and reminder status is indicated through <guiicon>bell</guiicon> and <guiicon>chasing arrows</guiicon> icons, just as in other views.
tr: Ay görünümü, içinde bulunduğunuz ayın tüm etkinliklerini ve yapılması gerekenleri tanıdık bir ay takvimi düzeninde gösterir. Görünümdeki her hücre bir günü temsil eder ve her gün, sağlanan alana sığabilecek tüm etkinlikleri içerir (pencereyi büyütmek daha fazla randevu görmenizi sağlar). Yineleme ve anımsatma durumuna ilişkin bilgiler, diğer görünümlerde olduğu gibi <guiicon>zil</guiicon> ve <guiicon>takip eden oklar</guiicon> simgeleri aracılığıyla gösterilir.

source: Navigate the Month view using the Date Navigator arrows, or the items and toolbar buttons from the <guilabel>Go</guilabel> menu. Since the visible area of a day cell may not contain all events and to-dos, you can use the keyboard to browse the items, or you can use the scrollbars to see all the events and to-dos from that day.
tr: Ay görünümünde Tarih Gezgini oklarını kullanarak gezinebilirsiniz veya <guilabel>Git</guilabel> menüsündeki ögeleri ve araç çubuğu düğmelerini kullanabilirsiniz. Bir günlük hücrenin görünür alanı, tüm etkinlikleri ve yapılacakları kapsamayabileceğinden, ögeleri taramak için klavyeyi kullanın veya sarma çubuklarını kullanarak o andan itibaren tüm olayları ve yapılacakları görebilirsiniz.

source: Hover your mouse over any calendar item to display a tooltip with the item details. Double click an empty area to create an event, double click any calendar item to edit it.
tr: Öge ayrıntılarını içeren bir araç ipucu görüntülemek için farenizi herhangi bir takvim ögesinin üzerine getirin. Bir etkinlik oluşturmak için boş bir alana çift tıklayın, düzenlemek için herhangi bir takvim ögesine çift tıklayın.

source: To help you organize your data, the color of the events may reflect their tags, and their <link linkend="managing-resources">resource</link>, depending on the <link linkend="config-main-views">&korganizer; view configuration</link>. Therefore, if you assign <link linkend="categories-view">tags to events</link> and <link linkend="config-main-colors">different colors to tags</link>, you can identify the type of event (or resource) by its color.
tr: Verinizi organize etmenize yardımcı olmak için etkinliklerin renkleri künyelerini yansıtır ve <link linkend="config-main-views">&korganizer; görünüm yapılandırmasına</link> bağlı olarak, ayrıca kendi <link linkend="managing-resources">özkaynaklarını</link> da yansıtabilir. Bundan dolayı, <link linkend="categories-view">etkinliklere künyeler</link> ve <link linkend="config-main-colors">künyelere farklı renkler</link> atarsanız etkinliğin (veya özkaynağın) türünü kolaylıkla tez ayırt edebilirsiniz.

source: Switch the display to the Month view by choosing the <menuchoice><guimenu>View</guimenu> <guimenuitem>Month View</guimenuitem></menuchoice> menu item or pressing the <inlinemediaobject><imageobject><imagedata fileref="view-calendar-month.png" format="PNG"/></imageobject></inlinemediaobject><guilabel>Month</guilabel> button in the toolbar.
tr: <menuchoice><guimenu>Git</guimenu> <guimenuitem>Ay</guimenuitem></menuchoice> menü ögesini veya araç çubuğundaki <inlinemediaobject><imageobject><imagedata fileref="view-calendar-month.png" format="PNG"/></imageobject></inlinemediaobject><guilabel>Ay</guilabel> ögesini kullanarak Ay Görünümü’ne geçebilirsiniz.

source: Timeline View
tr: Zaman Akışı Görünümü

source: The Timeline view shows all events for the selected timespan in a gantt view. Every calendar is displayed in a separate line.
tr: Zaman Akışı görünümü, seçili zaman aralığı için tüm olayları bir Gantt görünümünde gösterir. Her takvim ayrı bir satırda görüntülenir.

source: To-do List
tr: Yapılacaklar Listesi

source: The To-do List provides a place for you to jot down quick (or long-term) notes about things that need to be done. The To-do View sidebar component appears right below the Date Navigator. You can also display it in the main panel if you click the <inlinemediaobject><imageobject> <imagedata fileref="view-calendar-tasks.png" format="PNG"/></imageobject> </inlinemediaobject><guilabel>To-do List</guilabel> view toolbar button or if you choose the <menuchoice><guimenu>View</guimenu><guimenuitem>To-do List</guimenuitem></menuchoice> menu item.
tr: Yapılacaklar Listesi, yapılması gerekenler hakkında tez (veya uzun vadeli) notlar almanız için bir yer sağlar. Yapılacaklar Görünümü kenar çubuğu bileşeni, Tarih Gezgini’nin hemen altında görünür. Ana panelde görüntülemek için <inlinemediaobject><imageobject><imagedata fileref="view-calendar-tasks.png" format="PNG"/></imageobject></inlinemediaobject><guilabel>Yapılacaklar Listesi</guilabel> görünüm araç çubuğu düğmesini veya <menuchoice><guimenu>Görünüm</guimenu> <guimenuitem>Yapılacaklar Listesi</guimenuitem></menuchoice> menü ögesini kullanın.

source: You can give your to-do a <quote>date due</quote>, in other words a date when the to-do should be finished.
tr: Yapılacak işinize bir <quote>bitiş tarihi</quote>, başka bir deyişle yapılacak işin bitirilmesi gereken bir tarih verebilirsiniz.

source: You can also assign priorities to to-dos, and they will appear sorted in order of priority. The lower the number, the higher the priority, except that zero (0) is defined as <quote>no priority.</quote>
tr: Yapılacak işlere öncelikler de atayabilirsiniz ve bunlar öncelik sırasına göre sıralanmış olarak görünür. Sayı ne kadar düşükse öncelik o kadar yüksektir; ancak sıfır (0), <quote>öncelik yok</quote> olarak tanımlanır.

source: To make a new to-do entry, right click the To-do View sidebar component, or the To-do List view, and choose the <guimenuitem>New To-do</guimenuitem> menu item. If you right click an already existing to-do, you will get more choices: you can <guimenuitem>Show</guimenuitem> the summary, <guimenuitem>Edit...</guimenuitem> the to-do details, <guimenuitem>Delete</guimenuitem> the to-do altogether, or you can create a <guimenuitem>New Sub-To-do...</guimenuitem> You could for example make a large to-do like building a house, and make sub-to-dos like choosing the right building site, hiring an architect, hiring workers and finally arranging a party for your friends.
tr: Yeni bir yapılacak girdisi oluşturmak için Yapılacaklar Görünümü kenar çubuğu bileşeninde veya Yapılacaklar Listesi Görünümü’nde sağ tıklayın ve <guimenuitem>Yeni Yapılacak</guimenuitem> menü ögesini seçin. Var olan bir yapılacak ögesine sağ tıklarsanız daha fazla seçenek alırsınız: Özeti <guimenuitem>Göster</guimenuitem> yapabilir, yapılacak ayrıntılarını <guimenuitem>Düzenle…</guimenuitem> yapabilir, yapılacak ögesini hepten <guimenuitem>Sil</guimenuitem> yapabilir ve <guimenuitem>Yeni Alt Yapılacak…</guimenuitem> oluşturabilirsiniz. Örneğin, bir ev yapmak gibi büyük bir iş yapabilir ve doğru inşaat alanını seçmek, bir mimarı işe almak, işçileri işe almak ve son olarak arkadaşlarınız için bir parti düzenlemek gibi alt işler yapabilirsiniz.

source: When you choose <guimenuitem>New To-do...</guimenuitem>, a dialog will pop up, allowing you to enter all necessary <link linkend="entering-data-to-do">information</link>.
tr: <guimenuitem>Yeni Yapılacak…</guimenuitem> ögesini seçtiğinizde bir iletişim kutusu açılır ve burada tüm gerekli <link linkend="entering-data-to-do">bilgileri</link> girebilirsiniz.

source: Click any to-do in the list to highlight it. If you click the thick-line box on the left of the to-do description, you will change the <quote>completed</quote> status of the to-do. If you double-click the to-do description, you will be able to edit all its details.
tr: Listedeki herhangi bir yapılacak işi vurgulamak için tıklayın. Yapılacak iş açıklamasının solundaki kalın çizgi kutusuna tıklarsanız yapılacak işin <quote>tamamlandı</quote> durumunu değiştirirsiniz. Yapılacak iş açıklamasına çift tıklarsanız tüm ayrıntılarını düzenleyebilirsiniz.

source: You may also pick <link linkend="managing-purge-archive">Purge Completed</link> from the <mousebutton>right</mousebutton> mouse button menu to delete all to-do entries that you have marked completed.
tr: Tamamlandı olarak işaretlediğiniz tüm girdileri toptan kaldırmak için <mousebutton>sağ</mousebutton> fare menüsünden <link linkend="managing-purge-archive">Tamamlanmışları Temizle</link> seçeneğini kullanın.

source: To-dos can also be dragged around with the mouse to rearrange the hierarchy or to exchange to-dos with other calendar windows. You can also read an <link linkend="other-features-drag-and-drop">overview</link> of all available drag-and-drop operations.
tr: Yapılacaklar ayrıca hiyerarşiyi yeniden düzenlemek veya yapılacakları diğer takvim pencereleriyle değiştirmek için fare ile sürüklenebilir. Ayrıca tüm kullanılabilir sürükle–bırak işlemlerinin bir <link linkend="other-features-drag-and-drop">genel görünümüne buradan</link> bakabilirsiniz.

source: Journal View
tr: Günce Görünümü

source: The Journal view provides a place for you to record your reflections, occurrences or experiences. You can display the Journal view in the main panel if you press the <inlinemediaobject><imageobject> <imagedata fileref="journal-new.png" format="PNG"/></imageobject> </inlinemediaobject><guilabel>Journal View</guilabel> toolbar button or if you choose the <menuchoice><guimenu>View</guimenu><guimenuitem>Journal</guimenuitem> </menuchoice> menu item.
tr: Günlük Görünümü; düşüncelerinizi, olaylarınızı veya deneyimlerinizi kaydetmeniz için bir yer sağlar. Günce Görünümü’nü ana panelde <inlinemediaobject><imageobject><imagedata fileref="journal-new.png" format="PNG"/></imageobject></inlinemediaobject><guilabel>Günce Görünümü</guilabel> araç çubuğu düğmesine basarak veya <menuchoice><guimenu>Görünüm</guimenu> <guimenuitem>Günce</guimenuitem></menuchoice> menü ögesini kullanarak görüntüleyebilirsiniz.

source: When you click the <guilabel>New journal ...</guilabel> link (or the <guibutton>New Journal ...</guibutton> button), a new journal entry will be created. If you want to edit a journal entry, just click the text box and edit it! To remove a journal entry, press the <inlinemediaobject> <imageobject><imagedata fileref="edit-delete.png" format="PNG"/> </imageobject></inlinemediaobject>delete button in the Journal view.
tr: <guilabel>Yeni Günce…</guilabel> bağlantısına (veya <guibutton>Yeni Günce…</guibutton> düğmesine) tıkladığınızda, yeni bir günce girdisi oluşturulur. Bir günce girdisini düzenlemek istiyorsanız yalnızca metin kutusuna tıklayın ve onu düzenleyin! Bir günce girdisini kaldırmak için Günce Görünümü’ndeyken <inlinemediaobject><imageobject><imagedata fileref="edit-delete.png" format="PNG"/></imageobject></inlinemediaobject> silme düğmesine basın.

source: <title>Tags</title>
tr: <title>Künyeler</title>

source: To help you organize your entries in related groups, you can assign tags to events, to-dos and journal entries. If you assign tags, you can use them later when searching, filtering, and displaying events and to-dos.
tr: Girdilerinizi ilgili gruplar halinde düzenlemenize yardımcı olması için etkinliklere, yapılacak işlere ve günce girdilerine künyeler atayabilirsiniz. Künyeleri sayesinde, bunları daha sonra etkinlikleri ve yapılacak işleri ararken, süzerken ve görüntülerken kullanabilirsiniz.

source: To assign tags when editing or creating new <link linkend="entering-data-events-general">events</link> or <link linkend="entering-data-to-do-general">to-dos</link>, click the <guibutton>...</guibutton> button in the <guilabel>General</guilabel> tab. You can assign more than one tag to each item.
tr: Yeni <link linkend="entering-data-events-general">etkinlikler</link> veya <link linkend="entering-data-to-do-general">yapılacaklar</link> oluştururken veya düzenlerken künyeler atamak için <guilabel>Genel</guilabel> sekmesindeki <guibutton>…</guibutton> düğmesine tıklayın. Her bir ögeye birden çok künye atayabilirsiniz.
