Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kpackagetool_man-kpackagetool6.1.po
Languages: tr

source: KPackage Manager
tr: KPackage Yöneticisi

source: Install, list, remove &plasma; packages
tr: &plasma; paketlerini kur, listele, kaldır

source: <command>kpackagetool6</command> <group choice="opt"><option>-v, --version</option></group> <group choice="opt"><option>-h, --help</option></group> <group choice="opt"><option>--hash</option> <replaceable> path</replaceable></group> <group choice="opt"><option>-g, --global</option></group> <group choice="opt"><option>-t, --type</option> <replaceable> type</replaceable></group> <group choice="opt"><option>-i, --install</option> <replaceable> path</replaceable></group> <group choice="opt"><option>-s, --show</option> <replaceable> name</replaceable></group> <group choice="opt"><option>-u, --upgrade</option> <replaceable> path</replaceable></group> <group choice="opt"><option>-l, --list</option></group> <group choice="opt"><option>--list-types</option></group> <group choice="opt"><option>-r, --remove</option> <replaceable> name</replaceable></group> <group choice="opt"><option>-p, --packageroot</option> <replaceable> path</replaceable></group> <group choice="opt"><option>--generate-index</option></group>
tr: <command>kpackagetool6</command> <group choice="opt"><option>-v, --version</option></group> <group choice="opt"><option>-h, --help</option></group> <group choice="opt"><option>--hash</option> <replaceable> yol</replaceable></group> <group choice="opt"><option>-g, --global</option></group> <group choice="opt"><option>-t, --type</option> <replaceable> type</replaceable></group> <group choice="opt"><option>-i, --install</option> <replaceable> yol</replaceable></group> <group choice="opt"><option>-s, --show</option> <replaceable> ad</replaceable></group> <group choice="opt"><option>-u, --upgrade</option> <replaceable> yol</replaceable></group> <group choice="opt"><option>-l, --list</option></group> <group choice="opt"><option>--list-types</option></group> <group choice="opt"><option>-r, --remove</option> <replaceable> ad</replaceable></group> <group choice="opt"><option>-p, --packageroot</option> <replaceable> yol</replaceable></group> <group choice="opt"><option>--generate-index</option></group>

source: Description
tr: Açıklama

source: <command>kpackagetool6</command> is a command line tool to install, list, remove &plasma; packages.
tr: <command>kpackagetool6</command>, &plasma; paketlerini kurmak, listelemek ve kaldırmak için bir komut satırı aracıdır.

source: Options
tr: Seçenekler

source: Displays version information.
tr: Sürüm bilgisini görüntüler.

source: Displays this help.
tr: Bu yardımı görüntüler.

source: <option>--hash</option> <replaceable> path</replaceable>
tr: <option>--hash</option> <replaceable> yol</replaceable>

source: Generate a SHA1 hash for the package at <quote>path</quote>.
tr: <quote>yol</quote>’daki paket için bir SHA1 sağlaması oluşturun.

source: For install or remove, operates on packages installed for all users.
tr: Paket kurma ve kaldırmayı tüm kullanıcılar için kurulu paketlerde yapar.

source: <option>-t, --type</option> <replaceable> type</replaceable>
tr: <option>-t, --type</option> <replaceable> tür</replaceable>

source: The type of package, corresponding to the service type of the package plugin, &eg; KPackage/Generic, Plasma/Theme, Plasma/Wallpaper, Plasma/Applet, &etc;
tr: Paket eklentisinin hizmet türüyle eşleşen paket türü; &eg;, KPackage/Genel, Plasma/Tema, Plasma/Duvar Kağıdı, Plasma/Uygulamacık, &etc;

source: <option>-i, --install</option> <replaceable> path</replaceable>
tr: <option>-i, --install</option> <replaceable> yol</replaceable>

source: Install the package at <quote>path</quote>.
tr: <quote>path</quote>’daki paketi kurun.

source: <option>-s, --show</option> <replaceable> name</replaceable>
tr: <option>-s, --show</option> <replaceable> ad</replaceable>

source: Show information of package <quote>name</quote>.
tr: Paket <quote>ad</quote>’ı hakkında bilgi gösterin.

source: <option>-u, --upgrade</option> <replaceable> path</replaceable>
tr: <option>-u, --upgrade</option> <replaceable> yol</replaceable>

source: Upgrade the package at <quote>path</quote>.
tr: <quote>yol</quote>’daki paketi yükseltin.

source: List installed packages.
tr: Kurulu paketleri listeleyin.

source: Lists all known Package types that can be installed.
tr: Kurulması olanaklı olan bilinen tüm Paket türlerini listeler.

source: <option>-r, --remove</option> <replaceable> name</replaceable>
tr: <option>-r, --remove</option> <replaceable> ad</replaceable>

source: Remove the package named <quote>name</quote>.
tr: Paket <quote>ad</quote>’ını kaldırın.

source: <option>-p, --packageroot</option> <replaceable> path</replaceable>
tr: <option>-p, --packageroot</option> <replaceable> yol</replaceable>

source: Absolute path to the package root. If not supplied, then the standard data directories for this &plasma; session will be searched instead.
tr: Paket köküne olan mutlak yol. Sağlanmazsa bu &plasma; oturumu için olan standart veri dizinleri aranır.

source: <option>--generate-index</option> <replaceable> path</replaceable>
tr: <option>--generate-index</option> <replaceable> yol</replaceable>

source: Recreate the plugin index. To be used in conjunction with either the option <option>-t</option> or <option>-g</option>. Recreates the index for the given type or package root. Operates in the user directory, unless <option>-g</option> is used.
tr: Eklenti indeksini yeniden oluşturun. <option>-t</option> veya <option>-g</option> seçenekleriyle kullanılır. Verilen tür veya paket kökü için indeksi yeniden oluşturur. <option>-g</option> seçeneği sağlanmadığı sürece kullanıcı dizininde işlem yapar.

source: See Also
tr: Ayrıca Bakınız

source: More detailed user documentation is available from <ulink url="help:/plasma-desktop">help:/plasma-desktop</ulink> (either enter this &URL; into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>help:/plasma-desktop</parameter></userinput>).
tr: Daha ayrıntılı kullanıcı belgelendirmesine <ulink url="help:/plasma-desktop">help:/plasma-desktop</ulink> (ya bu &URL;’yi &konqueror;’a girin ya da <userinput><command>khelpcenter</command> <parameter>help:/plasma-desktop</parameter></userinput> komutunu çalıştırın) adresinden ulaşabilirsiniz.

source: Authors
tr: Yazarlar

source: <command>kpackagetool6</command> was written by <personname><firstname>Aaron</firstname><surname>Seigo</surname></personname> <email>aseigo@kde.org</email>.
tr: <command>kpackagetool6</command>, <personname><firstname>Aaron</firstname><surname>Seigo</surname></personname> <email>aseigo@kde.org</email> tarafından yazılmıştır.
