Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kruler.po
Languages: tr

source: The &kruler; Handbook
tr: &kruler; El kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: 5.0 (Applications 17.08)
tr: 5.0 (Uygulamalar 17.08)

source: &kruler; can be used to measure objects on the screen.
tr: &kruler; ekrandaki nesneleri ölçmek için kullanılabilir.

source: KRuler
tr: K Cetvel

source: Introduction
tr: Giriş

source: &kruler; is a very simple application, with only one aim in life. To measure pixel distances on your screen. It is useful for working on layout of dialogs, web pages &etc;
tr: &kruler; tek amacı olan basit bir uygulamadır. Ekranınızdaki piksel mesafelerini ölçmek içindir. Şunlar üzerinde çalışırken yararlıdır: iletişim kutuları, web sayfaları &etc;

source: To start &kruler;, choose <menuchoice><guimenu>Applications</guimenu><guisubmenu>Utilities</guisubmenu> <guisubmenu>More Applications</guisubmenu> <guimenuitem>Screen Ruler</guimenuitem></menuchoice> from your application menu.
tr: &kruler;’i başlatmak için sistem menünüzden <menuchoice><guimenu>Uygulamalar</guimenu><guisubmenu>İzlenceler</guisubmenu> <guisubmenu>Daha Fazla Uygulama</guisubmenu> <guimenuitem>Ekran Cetveli</guimenuitem></menuchoice> yolunu izleyin.

source: Clicking with the &LMB; on the &kruler; will turn the cursor to a cross with four arrows and enables you to drag &kruler; around the screen.
tr: &kruler; üzerinde &LMB; ile tıklandığında, imleci dört oklu bir şekle döndürür ve &kruler;’i ekranda hareket ettirebilmenize olanak sağlar.

source: When you move the mouse over &kruler;, your cursor will turn into a red arrow. As you move the cursor, &kruler; will display how far from the origin the cursor currently is.
tr: Farenizi &kruler; üzerine getirdiğinizde, imleciniz kırmızı oka dönüşür. İmleci hareket ettirdikçe, &kruler; imlecin asıl noktasından ne kadar uzakta olduğunu gösterir.

source: You can resize the ruler by moving the mouse over the handle on the left or right edges of &kruler; (the top or bottom edges when it is oriented vertically), holding down the &LMB; and dragging the handle.
tr: Cetveli &kruler;’in sol ve sağ tarafında bulunan tutaçları kullanıp &LMB; ile basılı tutarak ve sürükleyerek yeniden boyutlandırabilirsiniz (dikey olduğunda üst ve alt uçlardan).

source: You can change the orientation in two different ways:
tr: Yönlendirmeyi iki farklı yolla değiştirebilirsiniz:

source: Clicking the &MMB; switches the ruler from vertical to horizontal orientation
tr: &MMB; ile tıklamak, cetveli yatay yönden dikey yöne doğru değiştirir

source: Using the context menu, described in the next chapter
tr: Bağlam menüsü ayrıntıları; bir sonraki bölüme bakın

source: Menu Reference
tr: Menü Başvurusu

source: Clicking with the &RMB; on the ruler will pop up a context menu, with the following entries:
tr: &RMB; ile tıklamak; takip eden girişler ile birlikte cetveldeki bağlam menüsünü açar:

source: Rotate
tr: Döndür

source: Switches &kruler; from vertical to horizontal orientation.
tr: &kruler;’i dikeyden yatay yöne çevirir.

source: Scale
tr: Ölçek

source: This option lets you set the ruler scale to <guilabel>Right to Left</guilabel> (<keycap>D</keycap>), <guilabel>Center Origin</guilabel> (<keycap>C</keycap>), <guilabel>Offset</guilabel> (<keycap>O</keycap>) and <guilabel>Percentage</guilabel>.
tr: Bu seçenek, cetvel ölçeğini <guilabel>Sağdan Sola</guilabel> (<keycap>D</keycap>), <guilabel>Orjine Ortala</guilabel> (<keycap>C</keycap>), <guilabel>Ofset</guilabel> (<keycap>O</keycap>) ve <guilabel>Yüzde</guilabel> olarak ayarlamanıza olanak tanır.

source: Changing the offset via the mousewheel is also possible when holding the &LMB;.
tr: Fare tekerleği ile ofseti değiştirmek, &LMB; ile basılı tutarken olanaklıdır.

source: Opacity
tr: Matlık

source: This menu item displays a slider to change the opacity of &kruler;.
tr: Bu menü, &kruler;’in matlığını değiştirmek için bir sürgü görüntüler.

source: Configure Shortcuts...
tr: Kısayolları Yapılandır…

source: The <guilabel>Configure Shortcut</guilabel> dialog allows you to assign shortcuts to &kruler; actions, and configure the shortcuts already assigned.
tr: <guilabel>Kısayolları Yapılandır</guilabel> iletişim kutusu, &kruler; eylemlerine kısayollar atamaya ve halihazırda atanmış kısayolları yapılandırmanıza izin verir.

source: For more information, read the section about the <ulink url="help:/fundamentals/config.html#shortcuts">Shortcuts</ulink> of the &kde; Fundamentals.
tr: Daha fazla bilgi için &kde; Temelleri’ndeki <ulink url="help:/fundamentals/config.html#shortcuts">Kısayollar</ulink> bölümüne bakın.

source: Configure &kruler;...
tr: &kruler; Uygulamasını Yapılandır…

source: <screeninfo>&kruler;'s settings dialog</screeninfo>
tr: <screeninfo>&kruler;’in ayarlar iletişim kutusu</screeninfo>

source: <phrase>&kruler;'s settings dialog</phrase>
tr: <phrase>&kruler;’ın ayarlar iletişim kutusu</phrase>

source: In this dialog you can change the background color and font and enable the tray icon.
tr: Bu iletişim kutusunda arka plan rengini ve yazıtipini değiştirebilir ve tepsi simgesini etkinleştirebilirsiniz.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenuitem>Close</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenuitem>Kapat</guimenuitem>

source: <action>Hides</action> &kruler;. It can be shown again using the icon in the system tray. The context menu displays this item only when <guilabel>Show tray icon</guilabel> is checked in the <link linkend="settings-dialog">settings dialog</link>.
tr: &kruler;’ı <action>gizler</action>. Sistem tepsisi simgesi kullanılarak yeniden gösterilebilir. Bu bağlam menüsü ögesi, yalnızca <link linkend="settings-dialog">ayarlar iletişim kutusundaki</link><guilabel>Sistem tepsisi simgesini göster</guilabel> etkinse gösterilir.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenuitem>Quit</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenuitem>Çık</guimenuitem>

source: <action>Quits</action> &kruler;
tr: &kruler;’den <action>çıkar</action>

source: &kruler; has the common &kde; <guimenu>Help</guimenu> menu item, for more information read the section about the <ulink url="help:/fundamentals/menus.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
tr: &kruler;’de temel &kde; <guimenu>Yardım</guimenu> menü ögesi vardır; daha fazla bilgi için &kde; Temelleri’nin <ulink url="help:/fundamentals/menus.html#menus-help">Yardım Menüsü</ulink> bölümüne bakın.

source: Keyboard Handling
tr: Klavye Kullanımı

source: You can move the ruler using the arrow key buttons.
tr: Cetveli ok düğmelerini kullanarak hareket ettirebilirsiniz.

source: You can move the mouse cursor, and thus the indicator, by holding down &Alt; and using the arrow buttons.
tr: Fare imlecini ve dolayısıyla cetvel göstergesini &Alt; düğmesini basılı tutup ok düğmelerini kullanarak hareket ettirebilirsiniz.

source: Hold down &Shift; while doing one of those to move faster.
tr: Daha hızlı hareket etmek için bunlardan birini yaparken &Shift; düğmesini basılı tutun.

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Copyright 2000, 2001 Till Krech <email>till@snafu.de</email>
tr: Telif hakkı 2000, 2001 Till Krech <email>till@snafu.de</email>

source: Copyright 2009 Mathias Soeken <email>msoeken@tzi.de</email>
tr: Telif Hakkı 2009 Mathias Söken <email>msoeken@tzi.de</email>

source: Thanks to Gunnstein Lye <email>gl@ez.no</email> for the initial port to &kde; 2
tr: &kde; 2 aktarımı için Gunnstein Lye’e (<email>gl@ez.no</email>) teşekkürler

source: Documentation Copyright &Lauri.Watts; &Lauri.Watts.mail;
tr: Belgelendirme telif hakkı &Lauri.Watts; &Lauri.Watts.mail;

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
