Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/krusader_user-interface.po
Languages: tr

source: <title>User Interface</title>
tr: <title>Kullanıcı Arayüzü</title>

source: <primary>User Interface</primary>
tr: <primary>Kullanıcı Arayüzü</primary>

source: OFM User Interface
tr: ORM Kullanıcı Arayüzü

source: The OFM file manager concept contains <link linkend="features">many features</link> that make them powerful enough to belong among the best file managers today. The interface is simple: left panel, right panel and a command line below. Because of interaction between these three items the file managing will become more efficient.
tr: OFM dosya yöneticisi kavramı, günümüzün en iyi dosya yöneticileri arasında olabilecek kadar güçlü olmasını sağlayan <link linkend="features">birçok özellik</link> barındırır. Arayüz basit: sol panel, sağ panel ve aşağıda bir komut satırı. Bu üç öge arasındaki etkileşim sayesinde dosya yönetimi çok verimlidir.

source: If you would like to know <ulink url="http://www.softpedia.com/reviews/linux/Krusader-Review-18193.shtml"> how &krusader; works</ulink> you can try it yourself, just install it on your computer. To accept an <ulink url="http://www.softpanorama.org/OFM/index.shtml">Orthodox File Manager (OFM)</ulink> like &krusader;, the user needs to get used to <emphasis>new ideas</emphasis> that are actually already 20 years old. If you prefer to waste time and lose a lot of productivity, you can always continue to use one panel file managers that are based on &Windows; Explorer.
tr: <ulink url="http://www.softpedia.com/reviews/linux/Krusader-Review-18193.shtml">&krusader; nasıl çalışır</ulink> öğrenmek istiyorsanız kendiniz deneyebilirsiniz, sadece bilgisayarınıza kurun. <ulink url="http://www.softpanorama.org/OFM/index.shtml">Ortodoks Dosya Yöneticisi (OFM)</ulink> benzeri olan &krusader;'ı kabul etmek için kullanıcının aslında 20 yıllık olan <emphasis>yeni fikirlere</emphasis> alışık olması gerekiyor. Eğer zaman ve üretkenlik kaybetmek istiyorsanız, her zaman &Windows; Explorer temelli tek panelli dosya yöneticilerini kullanabilirsiniz.

source: <title>&krusader; Main Window</title>
tr: <title>&krusader; Ana Pencere</title>

source: <phrase>&krusader; Main Window</phrase>
tr: <phrase>&krusader; Ana Pencere</phrase>

source: The User Interface is based on <ulink url="http://www.softpanorama.org/OFM/index.shtml">Orthodox File Manager (OFM)</ulink> paradigm, a 20- year old principle that has proven its bones. It is known as simple, easy and powerful. In the following sections we will cover the basic functions of each part with the exception of:
tr: Kullanıcı Arayüzü, kendini kanıtlamış 20 yıllık prensiplere dayalı <ulink url="http://www.softpanorama.org/OFM/index.shtml">Ortodoks Dosya Yöneticisi (OFM)</ulink> paradigması temellidir. Basit, kolay ve güçlü olarak bilinir. Aşağıdaki bölümlerde, şu istisnalar hariç her bölümün temel özelliklerini anlatacağız:

source: The <link linkend="menu-commands">Menu Bar</link> which has a chapter of its own.
tr: <link linkend="menu-commands">Menü Çubuğu</link>, kendisinin bölümü var.

source: The <link linkend="bookman">Bookmarks</link> which has a chapter of its own.
tr: <link linkend="bookman">Yer İmleri</link>, kendisinin bölümü var.

source: The <emphasis role="bold">Status Bar</emphasis> shows the properties of the current file (that is being) in focus.
tr: <emphasis role="bold">Durum Çubuğu</emphasis>, mevcut odaklanmış dosyanın özelliklerini gösterir.

source: Toolbars
tr: Araç Çubukları

source: &krusader; comes with several Toolbars.
tr: &krusader; birçok Araç Çubuğu ile gelir.

source: <title>Main Toolbar</title>
tr: <title>Ana Araç Çubuğu</title>

source: Toolbar
tr: Araç Çubuğu

source: <secondary>Main Toolbar</secondary>
tr: <secondary>Ana Araç Çubuğu</secondary>

source: <phrase>Main Toolbar</phrase>
tr: <phrase>Ana Araç Çubuğu</phrase>

source: <title>Job Toolbar</title>
tr: <title>İş Araç Çubuğu</title>

source: <secondary>Job Toolbar</secondary>
tr: <secondary>İş Araç Çubuğu</secondary>

source: By default, the &krusader; Job Toolbar (<link linkend="queue">Queue Manager</link> or simply the JobMan) is located at the right part of the Main Toolbar. This toolbar allows you to view the job progress, to pause and resume the job list execution and to undo the last executed job.
tr: Varsayılan olarak &krusader; İş Araç Çubuğu (<link linkend="queue">Kuyruk Yöneticisi</link> ya da sadece JobMan) Ana Araç Çubuğunun sağ tarafında bulunur. Bu araç çubuğu, iş ilerlemesini görüntülemenizi, iş listesi yürütme işlemini duraklatıp devam ettirmenizi ve son yürütülen işi geri almanızı sağlar.

source: <title>Actions Toolbar</title>
tr: <title>Eylemler Araç Çubuğu</title>

source: <secondary>Actions Toolbar</secondary>
tr: <secondary>Eylemler Araç Çubuğu</secondary>

source: <title>Location Toolbar</title>
tr: <title>Konum Araç Çubuğu</title>

source: <secondary>Location Toolbar</secondary>
tr: <secondary>Konum Araç Çubuğu</secondary>

source: <userinput> <command>settings:/</command> </userinput>will browse and open entries of the &systemsettings;.
tr: <userinput> <command>ayarlar:/</command> </userinput>&systemsettings; girdilerine göz atacak ve bu girdileri açacak.

source: <userinput> <command>trash:/</command> </userinput>opens trash folder.
tr: <userinput> <command>çöp:/</command> </userinput> çöp klasörünü açar.

source: <userinput> <command>mtp:/</command> </userinput>uses the kio_mtp to access, upload and organize the multimedia stored on <trademark>Android</trademark>-based devices.
tr: <userinput> <command>mtp:/</command> </userinput> <trademark>Android</trademark> temelli servislerde depolanan çokluortama erişmek, yüklemek ve organize etmek için kio_mtp kullanır.

source: And last but not least <link linkend="remote-connections">Remote Connections</link> .
tr: Son olarak fakat en az değil <link linkend="remote-connections">Uzak Bağlantılar</link> .

source: You can copy-paste a &URL; in the <guibutton>Location Toolbar</guibutton> or use a middle click. With the Right-Click menu you can configure the auto-complete function. An optional <guilabel>Clear Location Toolbar</guilabel> button is also available.
tr: <guibutton>Konum Araç Çubuğu</guibutton> içerisindeki &URL;yi kopyala-yapıştır yapabilir ya da orta tıklamayı kullanabilirsiniz. Sağ-Tık menüsü ile birlikte otomatik-tamamlama işlevini yapılandırabilirsiniz. İsteğe bağlı bir <guilabel>Konum Araç Çubuğunu Temizle</guilabel> tuşu da ayrıca kullanılabilirdir.

source: <title>Panel Toolbar</title>
tr: <title>Panel Araç Çubuğu</title>

source: <secondary>Panel Toolbar</secondary>
tr: <secondary>Panel Araç Çubuğu</secondary>

source: Each panel has a <link linkend="konfig-panel-buttons">configurable Panel Toolbar</link>. The complete Panel Toolbar or specific buttons can be made visible or be hidden.
tr: Her bir panel <link linkend="konfig-panel-buttons">yapılandırılabilir Panel Araç Çubuğu</link> sahibidir. Panel Araç çubuğunun tamamı veya belirli düğmeler görülebilir veya gizli hale getirilebilir.

source: Panels
tr: Paneller

source: The &krusader; panels are where most of the action takes place. Currently, there are two types of panels:
tr: &krusader; panelleri eylemlerin çoğunun gerçekleştiği yerlerdir. Şu anda, iki tip panel vardır:

source: <title>List Panel</title>
tr: <title>Liste Paneli</title>

source: <phrase>List Panel</phrase>
tr: <phrase>Liste Paneli</phrase>

source: <secondary>List Panel</secondary>
tr: <secondary>Liste Paneli</secondary>

source: The following items are available:
tr: Aşağıdaki ögeler kullanılabilirdir:

source: <emphasis> <guilabel>Information Label</guilabel> </emphasis>: shows how much free space is physically available on the file system, the file system capacity and where the filesystem is mounted. If the information is not available (most often in the case of remote file system) a message will be displayed with the reason for unavailability instead of the information.
tr: <emphasis> <guilabel>Bilgi Etiketi</guilabel> </emphasis>: dosya sistemi, dosya sistemi sığası ve dosya sisteminin takılı olduğu yer içerisinde fiziki olarak ne kadar boş alan kaldığını gösterir. Eğer bilgi yok ise (çoğunlukla uzak dosya sistemi olması durumunda) bilgi yerine neden bilgi olmadığına dair sebep ile birlikte bir ileti görüntülenecektir.

source: The <guibutton>Media button</guibutton> on the left of the <guilabel>Information Label</guilabel> displays a list of all available media, where you can select the desired media (HDD partition, &DVD;, &USB; stick, &etc;). Pressing <keycombo>&Ctrl;<keycap>Return</keycap></keycombo> when the <guibutton>Media menu</guibutton> is opened mounts the highlighted media when it is unmounted, and unmounts it when it is mounted. The context menu of a medium gives several options like <guilabel>Mount</guilabel>, <guilabel>Open in a new tab</guilabel>, &etc; The <guibutton>Media menu</guibutton> is <link linkend="konfig-panel-mediamenu"> configurable</link>.
tr: <guilabel>Bilgi</guilabel> etiketinin sol tarafındaki <guibutton>Ortam</guibutton> düğmesi, kullanılabilir tüm ortamların bir listesini görüntüler. Buradan istenen ortamı (HDD bölüntüsü, &DVD;, &USB; bellek, &etc;) seçebilirsiniz. <guibutton>Ortam</guibutton> menüsü açıkken <keycombo>&Ctrl;<keycap>Dönüş</keycap></keycombo> kısayolunu kullanmak, vurgulanmış olan ortamı bağlı değilken bağlar ve bağlıyken bağlantısını keser. Bir ortamın bağlam menüsü, <guilabel>Bağla</guilabel>, <guilabel>Yeni Bir Sekmede Aç</guilabel>, &etc; gibi eylemler sunar. <guibutton>Ortam</guibutton> menüsü <link linkend="konfig-panel-mediamenu"> yapılandırılabilirdir</link>.

source: Some useful <guilabel>List panel</guilabel> <link linkend="key_bindings">Key-Bindings</link>:
tr: Bazı kullanışlı <guilabel>Liste paneli</guilabel> <link linkend="key_bindings">Tuş-kombinasyonları</link>:

source: <keycombo action="simul">&Ctrl; <keycap>R</keycap></keycombo> will refresh the panel.
tr: <keycombo action="simul">&Ctrl; <keycap>R</keycap></keycombo> paneli yenileyecektir.

source: On a file: the right panel gets the same path as the left panel.
tr: Dosyada: sağ panel sol panel ile aynı yolu edinir.

source: <title>Sidebar</title>
tr: <title>Kenar Çubuğu</title>

source: <primary>Sidebar</primary>
tr: <primary>Yan Çubuk</primary>

source: Sidebar (3rd Panel)
tr: Yan Çubuk (3. Panel)

source: <emphasis> <guilabel>Preview Panel</guilabel> </emphasis>: gives a preview of the file that has the focus (currently selected file).
tr: <emphasis> <guilabel>Önizleme Paneli</guilabel> </emphasis>: odağı olan dosyanın önizlemesini verir (mevcut seçili dosya).

source: <emphasis> <guilabel>Viewer Panel</guilabel> </emphasis>: views a text file, views an image, &etc; A thumbnail view is generated whenever you open the <guilabel>Viewer Panel</guilabel>.
tr: <emphasis> <guilabel>Görüntüleme Paneli</guilabel> </emphasis>: metin dosyasını görüntüler, resmi görüntüler, &etc; Bir küçük resim <guilabel>Görüntüleme Panelini</guilabel> her ne zaman açarsanız oluşturulur.

source: If needed you can resize the window &eg; to better display a picture or view a file contents. Click on the arrow down button to close the <guilabel>3rd Hand Panel</guilabel>.
tr: Eğer ihtiyaç duyarsanız pencereyi &eg; daha iyi resim görüntülemesi veya dosya içeriği görüntülemesi için yeniden boyutlandırabilirsiniz. <guilabel>3üncü El Panelini</guilabel> kapatmak için aşağı ok tuşuna tıklayın.

source: Folder History
tr: Dizin Geçmişi

source: Both panels remember recently visited folders. Click on the <guibutton>Folder history</guibutton> button ("watch" symbol) to open the folder history list. Here you can quickly change to previously visited folders. The currently focused folder is checked. On every new start of &krusader;, the history list is populated by the items from previous run (history is saved).
tr: Her iki panel de son gezilen dizinleri hatırlar. Dizin geçmişi listesini açmak için <guibutton>Dizin geçmişi</guibutton> tuşuna ("izle sembolü") tıklayın. Buradan önceki gezilen dizinlere hızlıca geçiş yapabilirsiniz. Mevcutta odaklanılan dizin işaretlidir. &krusader;ın her yeniden başlatılmasında, geçmiş listesi önceki çalıştırmadaki ögeler ile doldurulur ( geçmiş kaydedilir).

source: Command Line / Terminal Emulator
tr: Komut Satırı / Uçbirim Öykünücüsü

source: Command Line
tr: Komut Satırı

source: Command line
tr: Komut satırı

source: The traditional command line mode offers a single line of input to enter commands, it also features three buttons:
tr: Geleneksel komut satırı kipi, komutları girmek için bir satırlık girdi sunar, ayrıca üç butonu vardır:

source: <guibutton>command history</guibutton> (down arrow) to quick open previous used commands
tr: <guibutton>komut geçmişi</guibutton> (aşağı ok), geçmişte kullanılmış komutları açmak içindir

source: <guibutton>Useraction expander</guibutton> (green plus button) to add easy <link linkend="useractions">Useraction placeholders</link>
tr: <guibutton>Kullanıcı eylemi genişletici</guibutton> (yeşil artı tuşu) <link linkend="useractions">Kullanıcı eylemi tutucuları</link>'nı kolayca eklemek içindir

source: <guibutton>run in terminal mode</guibutton> (console icon) button with the next options:
tr: <guibutton>terminal kipinde çalıştır</guibutton> (konsol simgesi) butonu şu seçenekler ile:

source: Start and Forget
tr: Başla ve Unut

source: Display Separated Standard and Error Output
tr: Standart ve Hata Çıktılarını Ayrı Ayrı Göster

source: Display Mixed Standard and Error Output
tr: Standart ve Hata Çıktılarını Karışık Göster

source: Start in New Terminal
tr: Yeni Sekmede Başlat

source: Send to Embedded Terminal Emulator
tr: Gömülü Uçbirim Öykünücüsüne Yolla

source: Terminal Emulator
tr: Uçbirim Öykünücüsü

source: Terminal emulator
tr: Uçbirim öykünücüsü

source: Click <link linkend="termemu_keybindings">here</link> to view the Terminal emulator keybindings.
tr: Uçbirim öykünücüsü tuş kombinasyonlarını görüntülemek için <link linkend="termemu_keybindings">buraya</link> tıklayın.

source: <title>Function (FN) Keys Bar</title>
tr: <title>Fonksiyon (FN) Tuş Çubuğu</title>

source: <phrase>Function (FN) Keys Bar</phrase>
tr: <phrase>Fonksiyon (FN) Tuş Çubuğu</phrase>

source: <title>Folder Tabs</title>
tr: <title>Dizin Sekmeleri</title>

source: <phrase>Folder Tabs</phrase>
tr: <phrase>Dizin Sekmeleri</phrase>

source: With <guibutton>Folder Tabs</guibutton> you can quickly change to multiple folders; each panel has its own <guibutton>Folder Tabs</guibutton>. The <guibutton>Folder Tabs</guibutton> positions are saved when closing &krusader;. To switch between <guibutton>Folder Tabs</guibutton>, click them with the mouse. Squeezed <guibutton>Folder Tabs</guibutton> have tooltips to display the full path. The following <guibutton>Folder Tabs</guibutton> operations are available:
tr: <guibutton>Dizin Sekmeleri</guibutton> ile tez çoklu dizinleri değiştirebilirsiniz; her panonun kendine özgü <guibutton>Dizin Sekmeleri</guibutton> vardır. <guibutton>Dizin Sekmeleri</guibutton> konumları, &krusader; kapatılırken kaydedilir. <guibutton>Dizin Sekmeleri</guibutton> arasında geçiş yapmak için fare ile tıklamanız yeterlidir. Sıkıştırılmış <guibutton>Dizin Sekmeleri</guibutton>'nin tüm yolu gösteren ipuçları vardır. Bu <guibutton>Dizin Sekmeleri</guibutton> işlemleri kullanılabilirdir:

source: To <action>lock a tab</action>, <keycap>Right-click</keycap> and select <guimenuitem>Lock Tab</guimenuitem>.
tr: <action>Bir sekmeyi kilitlemek</action> için <keycap>sağ</keycap> tıklayın ve <guimenuitem>Sekmeyi Kilitle</guimenuitem>'yi seçin.

source: To <action>pin a tab</action>, <keycap>Right-click</keycap> and select <guimenuitem>Pin Tab</guimenuitem>. The pinned tab is a locked tab but with temporarily changeable address. It resets to pinned address on tab reactivation. To unpin the pinned tab right-click on it and choose the <guimenuitem>Unpin Tab</guimenuitem> item.
tr: <action>Bir sekmeyi sabitlemek</action> için <keycap>Sağ tuş</keycap>'a basın ve <guimenuitem>Sekmeyi Sabitle</guimenuitem>'yi seçin. Sabitlenmiş sekme, kilitli bir sekmedir fakat geçici değişebilir adresi vardır. Sekme yeniden etkin olduğunda sabitlenmiş adresine sıfırlar. Sekmenin sabitlemesini kaldırmak için sağ tıklayın ve <guimenuitem>Sekme Sabitlemesini Kaldır</guimenuitem> ögesini seçin.

source: To <action>close a tab</action> (except for the last tab): <keycap>Right-click</keycap> on the tab and select <guimenuitem>Close Current Tab</guimenuitem>, or use the &MMB;, or use the Folder tab <guibutton>red cross</guibutton> button, or use <keycombo action="simul">&Ctrl; <keycap>W</keycap></keycombo>.
tr: <action>Bir sekmeyi kapatmak</action> için (son sekme hariç): Sekmede <keycap>sağ tuş</keycap>'a basın ve <guimenuitem>Mevcut Sekmeyi Kapat</guimenuitem>'ı seçin, ya da &MMB; kullanın ya da Dizin sekmesi <guibutton>kırmızı çarpı</guibutton> butonunu kullanın ya da <keycombo action="simul">&Ctrl; <keycap>W</keycap></keycombo> kısayolunu kullanın.

source: To <action>change tabs</action>: <keycombo action="simul">&Ctrl; <keycap>,</keycap></keycombo> or <keycombo action="simul">&Ctrl; <keycap>.</keycap></keycombo>.
tr: <action>sekmeleri değiştirmek</action>için: <keycombo action="simul">&Ctrl; <keycap>,</keycap></keycombo> ya da <keycombo action="simul">&Ctrl; <keycap>.</keycap></keycombo>.

source: To <action>open the current folder in a new tab</action>: use <keycombo action="simul"> &Ctrl;&Alt;&Enter;</keycombo>.
tr: <action>geçerli dizini yeni sekmede açmak</action> için: <keycombo action="simul">&Ctrl;&Alt;&Enter;</keycombo> kullanın.

source: To <action>close all other tabs</action>, <keycap>Right-click</keycap> and select <guimenuitem>Close Inactive Tabs</guimenuitem>.
tr: <action>diğer tüm sekmeleri kapatmak</action> için <keycap>Sağ tuş</keycap>'a basın ve <guimenuitem>Aktif Olmayan Sekmeleri Kapat</guimenuitem> seçin.

source: To <action>close duplicated tabs</action>, <keycap>Right-click</keycap> and select <guimenuitem>Close Duplicated Tabs</guimenuitem>.
tr: <action>çoğaltılmış sekmeleri kapatmak</action> için <keycap>Sağ tuş</keycap>'a basın ve <guimenuitem>Çoğaltılmış Sekmeleri Kapat</guimenuitem> seçin.

source: To move tab on the other panel, drag it to the area of the other panel with the &LMB; (the mouse cursor will become an arrow pointing left or right) and drop it. You can also press <keycombo action="simul">&Ctrl;&Shift; <keycap>O</keycap></keycombo>.
tr: Diğer panoya sekme taşımak için &LMB; ile diğer panonun olduğu alana taşıyın (fare imleci sağ ya da solu gösteren bir ok olacaktır) ve bırakın. Ayrıca <keycombo action="simul">&Ctrl;&Shift; <keycap>O</keycap></keycombo> kısayolunu kullanabilirsiniz.

source: Buttons
tr: Düğmeler

source: Several buttons for fast operations are available: <link linkend="main_toolbar">Main Toolbar</link>, <link linkend="actions_toolbar">Actions Toolbar</link>, <link linkend="panel_toolbar">Panel Toolbar</link>, <link linkend="location_toolbar">Location Toolbar</link>, <link linkend="list_panel">Media</link>, <link linkend="folderhistory">Folder history</link>, <link linkend="bookman">Bookmarks</link>, <link linkend="folder-tabs">Tab</link>, <link linkend="cmdline">Commandline</link>, <link linkend="fnkeys">Function keys</link>.
tr: Hızlı işlemler için birkaç buton vardır: <link linkend="main_toolbar">Ana Araç Çubuğu</link>, <link linkend="actions_toolbar">Eylem Araç Çubuğu</link>, <link linkend="panel_toolbar">Pano Araç Çubuğu</link>, <link linkend="location_toolbar">Konum Araç Çubuğu</link>, <link linkend="list_panel">Ortam</link>, <link linkend="folderhistory">Dizin geçmişi</link>, <link linkend="bookman">Yer İmleri</link>, <link linkend="folder-tabs">Sekme</link>, <link linkend="cmdline">Komut satırı</link>, <link linkend="fnkeys">Fonksiyon tuşları</link>.
