Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/krusader_viewer-editor.po
Languages: tr

source: KrViewer: &krusader;'s internal viewer-editor
tr: KrViewer: &krusader;'in dahili görüntüleyici-düzenleyicisi

source: <primary>Viewer</primary>
tr: <primary>Görüntüleyici</primary>

source: <seealso>Editor</seealso>
tr: <seealso>Düzenleyici</seealso>

source: Pressing &Enter; on a selected file <emphasis>opens the file with the associated application</emphasis>. The editor-viewer is tabbed, configure it on the <link linkend="konfig-general">Konfigurator General page</link>
tr: Seçili dosyada &Enter; tuşuna basmak <emphasis>dosyayı ilişkili uygulama ile açar</emphasis>. Düzenleyici-görüntüleyici sekmelidir, <link linkend="konfig-general">Konfigurator Genel sayfası</link> üzerinden yapılandırabilirsiniz.

source: <title>Viewer</title>
tr: <title>Görüntüleyici</title>

source: <keycombo action="simul">&Shift; <keycap>F3</keycap></keycombo> views a &URL; on demand, &eg;:
tr: <keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo> bir &URL; 'yi istek üzerine görüntüler, &eg;:

source: <userinput> <command>man:/</command> </userinput>views the manpages.
tr: <userinput> <command>man:/</command> </userinput>kılavuz sayfalarını görüntüler.

source: <userinput> <command>man:/</command><replaceable>krusader</replaceable> </userinput>views manpage of &krusader;.
tr: <userinput> <command>man:/</command><replaceable>krusader</replaceable> </userinput>&krusader; 'ın kılavuz sayfasını görüntüler.

source: <userinput> <command>info:/</command> </userinput>views the infopages.
tr: <userinput> <command>info:/</command> </userinput>bilgi sayfalarını görüntüler.

source: <userinput> <command>ftp://</command><replaceable>ftp.kde.org/pub/kde/</replaceable> </userinput>views a &FTP; server.
tr: <userinput> <command>ftp://</command><replaceable>ftp.kde.org/pub/kde/</replaceable> </userinput>&FTP; sunucusunu görüntüler.

source: <userinput> <command>sftp://</command><replaceable>sftp.foo/</replaceable> </userinput>views a secure &FTP; server.
tr: <userinput> <command>sftp://</command><replaceable>sftp.foo/</replaceable> </userinput>güvenilir bir &FTP; sayfasını görüntüler.

source: <userinput> <command>tar:/</command><replaceable>home/frank/archive.tar.gz/</replaceable> </userinput>opens content browser window for the <literal role="extension">tar.gz</literal> archive.
tr: <userinput> <command>tar:/</command><replaceable>home/frank/archive.tar.gz/</replaceable> </userinput> <literal role="extension">tar.gz</literal> arşivi için içerik tarayıcısı penceresini açar.

source: KrViewer can have the following menus: <link linkend="katepart-menu-file">File</link>, <link linkend="katepart-menu-edit">Edit</link>, <link linkend="katepart-menu-view">View</link>, <link linkend="katepart-menu-settings">Settings</link> and <link linkend="kredit_krviewer_menu">Krviewer</link>, depending on which file type is viewed. They will be discussed in the <link linkend="kredit">Editor section</link>. The internal viewer can follow links on &HTML; pages. With <keycombo action="simul">&Ctrl;&Shift; <keycap>E</keycap></keycombo> the viewer can start &krusader;'s internal editor (which is basically the same application).
tr: KrViewer görüntülenen dosya türüne bağlı olarak takip eden menülere sahip olabilir: <link linkend="katepart-menu-file">Dosya</link>, <link linkend="katepart-menu-edit">Düzenle</link>, <link linkend="katepart-menu-view">Görüntüle</link>, <link linkend="katepart-menu-settings">Settings</link> ve <link linkend="kredit_krviewer_menu">Krviewer</link>. Bunlar <link linkend="kredit">Düzenleyici bölümü</link> içerisinde tartışılacaktır. Dahili görüntüleyici &HTML; sayfaları üzerindeki bağlantıları takip edebilir. <keycombo action="simul">&Ctrl;&Shift; <keycap>E</keycap></keycombo> ile görüntüleyici &krusader;'in dahili düzenleyicisini başlatabilir (ki bu temel olarak aynı uygulamadır).

source: <title>Editor</title>
tr: <title>Düzenleyici</title>

source: <primary>Editor</primary>
tr: <primary>Düzenleyici</primary>

source: &krusader;'s internal editor has almost everything that you can expect of an editor. Editing is similar to viewing but with the <keycap>F4</keycap> key. The default editor is &krusader;'s internal editor. You can change the default editor in the <link linkend="konfig-general">Konfigurator General page</link>, if you prefer to use an external editor.
tr: &krusader;'ın dahili düzenleyicisi bir düzenleyiciden bekleyebileceğiniz neredeyse her şeye sahiptir. Düzenleme görüntülemeye çok benzer ve <keycap>F4</keycap> ile yapılır. Varsayılan düzenleyici &krusader;'ın dahili düzenleyicisidir. Eğer harici bir düzenleyici kullanmak isterseniz, arsayılan düzenleyiciyi <link linkend="konfig-general">Konfigurator Genel sayfası</link> içerisinden değiştirebilirsiniz.

source: When you use &krusader;'s internal editor for the first time, it is recommended to look at each section of the <link linkend="katepart-menu-settings">Settings</link> menu, and configure it the way you want it.
tr: &krusader;'ın dahili düzenleyicisiniilk defa kullandığınız zaman, <link linkend="katepart-menu-settings">Ayarlar</link> menüsünün her bir bölümüne göz atmanız, istediğiniz şekilde yapılandırmanız önerilir.

source: Menu overview
tr: Menü genel bakışı

source: There are different menus and menu items in simple and advanced mode. The advanced mode is enabled by checking the option <link linkend="katepart-appearance"> Enable power user mode (&kde; 3 mode)</link> on the <guilabel>Appearance</guilabel> page in &kappname;s settings.
tr: Basit ve gelişmiş kipte farklı menüler ve menü ögeleri vardır. Gelişmiş mod &kappname;s ayarları içerisindeki <guilabel>Görünüm</guilabel> sayfası üzerinden <link linkend="katepart-appearance"> Güç kullanıcısı kipini etkinleştir (&kde; 3 kip)</link> seçeneği işaretlenerek aktifleştirilir.

source: The File Menu
tr: Dosya Menüsü

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Kaydet</guimenuitem>

source: This saves the current document. If there has already been a save of the document then this will overwrite the previously saved file without asking for the user's consent. If it is the first save of a new document the save as dialog (described below) will be invoked.
tr: Bu mevcut belgeyi kaydeder. Belge zaten kaydedilmişse, bu kullanıcının rızasını sormadan önceden kaydedilmiş dosyanın üzerine yazacaktır. Yeni bir belgenin ilk kaydıysa, aşağıdaki gibi kaydet diyalog kutusu (aşağıda açıklandığı şekilde) çağrılacaktır.

source: <guimenu>File</guimenu> <guimenuitem>Save As...</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Farklı Kaydet...</guimenuitem>

source: This allows a document to be saved with a new file name.
tr: Bu bir belgenin yeni bir dosya ismi ile kaydedilebilmesini sağlar.

source: <shortcut> <keycombo action="simul"><keycap>F5</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Reload</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>F5</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Yeniden Yükle</guimenuitem>

source: Reloads the active file from disk. This command is useful if another program or process has changed the file while you have it open in &kappname;.
tr: Aktif dosyayı diskten yeniden yükler. Bu komut &kappname; içerisinde açılmış olan bir dosyayı başka bir program ya da süreç değiştirmiş ise kullanışlıdır.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Print...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Yazdır...</guimenuitem>

source: Opens a simple print dialog allowing the user to specify what, where, and how to print.
tr: Kullanıcının neyi, nerede ve nasıl yazdıracağını belirtmesini sağlayan basit bir yazdırma iletişim penceresi açar.

source: Export your file in &HTML; format so your document can be viewed as a web page. This item is only displayed when the plugin <guilabel>Exporter</guilabel> is loaded.
tr: Dosyanızı &HTML; biçiminde dışarı aktarın böylece belgeniz bir web sayfası olarak görüntülenebilir. Bu öge sadece <guilabel>Dışa Aktarıcı</guilabel> eklentisi yüklü olduğu zaman gösterilir.

source: The Edit Menu
tr: Düzenleme Menüsü

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Düzenle</guimenu> <guimenuitem>Geri Al</guimenuitem>

source: This is used to eliminate or reverse the most recent user action or operation.
tr: Bu en son kullanıcı eylemini veya çalışmasını elemek veya tersine çevirmek için kullanılır.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Redo</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Düzenle</guimenu><guimenuitem>Yinele</guimenuitem>

source: This will reverse the most recent change (if any) made using Undo
tr: Bu, Geri Al kullanılarak yapılan en son değişikliği (varsa) tersine çevirir.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Cut</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo></shortcut> <guimenu>Düzenle</guimenu><guimenuitem>Kes</guimenuitem>

source: This command deletes the current selection and places it on the clipboard. The clipboard is a feature that works invisibly to provide a way to transfer data between applications.
tr: Bu komut mevcut seçimi siler ve panoya yerleştirir. Pano, uygulamalar arasında veri aktarımı sağlamak için görünmez bir şekilde çalışan bir özelliktir.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Copy</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Düzenle</guimenu><guimenuitem>Kopyala</guimenuitem>

source: This copies the currently selected text to the clipboard so that it may be pasted elsewhere. The clipboard is a feature that works invisibly to provide a way to transfer data between applications.
tr: Bu, mevcut seçili metni panoya kopyalar böylece bu metin başka bir yere yapıştırılabilir. Pano, uygulamalar arasında veri aktarımı sağlamak için görünmez bir şekilde çalışan bir özelliktir.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Paste</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo></shortcut> <guimenu>Düzenle</guimenu><guimenuitem>Yapıştır</guimenuitem>

source: This copies the currently selected text to the clipboard as &HTML;. This item is only displayed when the plugin <guilabel>Exporter</guilabel> is loaded.
tr: Bu, seçili metni panoya &HTML; olarak kopyalar. Bu öğe sadece <guilabel>Dışa Aktarıcı</guilabel> eklentisi yüklendiğinde görüntülenir.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Select All</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut> <guimenu>Düzenle</guimenu><guimenuitem>Tümünü Seç</guimenuitem>

source: This will select the entire document. This could be very useful for copying the entire file to another application.
tr: Bu, tüm belgeyi seçecektir. Bu, tüm dosyanın başka bir uygulamaya kopyalanması için çok yararlı olabilir.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu><guimenuitem>Deselect</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Düzenle</guimenu><guimenuitem>Seçimi İptal Et</guimenuitem>

source: Deselects the selected text in the editor if any.
tr: Varsa, seçilen metnin editördeki seçimini kaldırır.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu><guimenuitem>Block Selection Mode</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Düzenle</guimenu><guimenuitem>Blok Seçim Kipi</guimenuitem>

source: Toggles Selection Mode. When the Selection Mode is <guilabel>BLOCK</guilabel>, you can make vertical selections, &eg; select column 5 to 10 in lines 9 to 15. The status bar shows the current state of the Selection Mode, either <guilabel>BLOCK</guilabel> or <guilabel>LINE</guilabel>.
tr: Seçim kipine değiştirir. Seçim Kipi <guilabel>BLOK</guilabel> olduğu zaman, dikey seçimler yapabilirsiniz, &eg; 9 ile 15 satırları arasındaki 5 ile 10 sütunları arasını seç. Durum çubuğu Seçim Kipinin <guilabel>BLOK</guilabel> ya da <guilabel>ÇİZGİ</guilabel> olup olmamasına göre mevcut durumunu gösterir.

source: Switch to a vi-like, modal editing mode. This mode supports the most used commands and motions from vim's normal and visual mode and has an optional vi mode statusbar. This status bar shows commands while they are being entered, output from commands and the current mode.The behavior of this mode can be configured in the <link linkend="katepart-pref-edit-vi-input-mode">Vi Input Mode</link> section of the <guilabel>Editing</guilabel> page in &kappname;'s settings dialog.
tr: Vi-gibi, kip düzenleme kipine geçer. Bu kip, en çok kullanılan komutları destekler ve vim’in normal ve görsel kipinden hareketler içerir ve ek olarak vi kipi durum çubuğu vardır. Bu durum çubuğu girilirken komutları, komut çıktılarını ve mevcut kipi gösterir. Bu kipin davranışı, &kappname;’nin ayarlar penceresinde <guilabel>Düzenleme</guilabel> sayfasının <link linkend="katepart-pref-edit-vi-input-mode">Vi Girdi Kipi</link> bölümünden yapılandırılabilir.

source: Toggles the Insert/Overwrite modes. When the mode is <guilabel>INS</guilabel>, you insert characters where the cursor is. When the mode is <guilabel>OVR</guilabel>, writing characters will replace the current characters if your cursor is positioned before any character. The status bar shows the current state of the Overwrite Mode, either <guilabel>INS</guilabel> or <guilabel>OVR</guilabel>.
tr: Ekle/Üzerine Yaz kiplerine değiştirir. Kip <guilabel>INS</guilabel> olduğu zaman, karakterleri imlecin olduğu yere eklersiniz. Kip <guilabel>OVR</guilabel> olduğu zaman, imleciniz herhangi bir karakterden önce konumlanmış ise karakterleri yazmak mevcut karakterleri değiştirecektir. Durum çubuğu Üzerine Yazma Kipinin, <guilabel>INS</guilabel> ya da <guilabel>OVR</guilabel> olup olmamasına göre mevcut durumunu gösterir.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Find...</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Düzenle</guimenu><guimenuitem>Bul...</guimenuitem>

source: This opens the incremental search bar at the bottom of the editor window. On the left side of the bar is a button with an icon to close the bar, followed by a small text box for entering the search pattern.
tr: Bu, düzenleme penceresinin altında artımlı arama çubuğunu açar. Çubuğun sol tarafında çubuğu kapatmaya yarayan, arama kalıbı için küçük bir metin kutusu bulunduran bir düğme vardır.

source: When you start entering characters of your search pattern, the search starts immediately. If there is a match in the text this is highlighted and the background color of the entry field changes to light green. If the search pattern does not match any string in the text, this is indicated by a light red background color of the entry field and <guilabel>Not found</guilabel> is displayed at the right side of the bar.
tr: Arama modelinizin karakterlerini girmeye başladığınızda, arama hemen başlar. Metinde bir eşleşme varsa bu vurgulanır ve giriş alanının arka plan rengi açık yeşil renge dönüşür. Arama modeli metindeki herhangi bir dizeyle eşleşmiyorsa, bu giriş alanının açık kırmızı arkaplan rengi ile gösterilir ve çubuğun sağ tarafında <guilabel>Bulunamadı</guilabel> görüntülenir.

source: Use the <guilabel>Next</guilabel> or <guilabel>Previous</guilabel> button to jump to the next or previous match in the document.
tr: Belge içerisinde önceki ya da sonraki eşleşmeye atlamak için <guilabel>Sonraki</guilabel> ya da <guilabel>Önceki</guilabel> kullanın.

source: You can choose whether the search should be case sensitive. Selecting <guilabel>Match Case</guilabel> will limit finds to entries that match the case (upper or lower) of each of the characters in the search pattern.
tr: Aramanın büyük/küçük harfe duyarlı olup olmayacağını seçebilirsiniz. <guilabel>Eşleşme Örneği</guilabel> seçeneğinin seçilmesi, bulguları arama modelindeki her bir karakterin (üst veya alt) durumuyla eşleşen girişlerle sınırlar.

source: Click on the button with a green arrow icon at the right side of the incremental search bar to switch to the power search and replace bar.
tr: Güç aramaya geçmek ve çubuğu değiştirmek için artımlı arama çubuğunun sağ tarafındaki yeşil ok simgesi olan düğmeye tıklayın.

source: <shortcut><keycombo action="simul"><keycap>F3</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Find Next</guimenuitem>
tr: <shortcut><keycombo action="simul"><keycap>F3</keycap></keycombo></shortcut> <guimenu>Düzenle</guimenu><guimenuitem>Sonrakini Bul</guimenuitem>

source: This repeats the last find operation, if any, without calling the incremental search bar.
tr: Bu, artan arama çubuğunu çağırmadan, son bulma işlemini tekrarlar.

source: <shortcut> <keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find Previous</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo> </shortcut> <guimenu>Düzenle</guimenu> <guimenuitem>Öncekini Bul</guimenuitem>

source: This repeats the last find operation, if any, without calling the incremental search bar, and searching backwards instead of forwards through the document.
tr: Bu, son arama işlemini, artımlı arama çubuğunu çağırmadan ve belge boca ileriye doğru aramak yerine geriye doğru arayarak tekrar eder.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Replace...</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Düzenle</guimenu><guimenuitem>Değiştir...</guimenuitem>

source: This command opens the power search and replace bar. On the upper left side of the bar is a button with an icon to close the bar, followed by a small text box for entering the search pattern.
tr: Bu komut güç arama ve değiştirme çubuğunu açar. Çubuğun sol üst tarafında, çubuğu kapatmak için bir simge bulunan bir düğme ve ardından arama modelini girmek için küçük bir metin kutusu vardır.

source: You can control the search mode by selecting <guilabel>Plain text</guilabel>, <guilabel>Whole words</guilabel>, <guilabel>Escape sequences</guilabel> or <guilabel>Regular expression</guilabel> from the drop down box.
tr: Arama kipini açılır menüden <guilabel>Düz metin</guilabel>, <guilabel>Tüm kelimeler</guilabel>, <guilabel>Kaçış dizileri</guilabel> ya da <guilabel>Düzenli ifade</guilabel> seçerek kontrol edebilirsiniz.

source: If <guilabel>Escape sequences</guilabel> or <guilabel>Regular expression</guilabel> are selected, the <guibutton>Add...</guibutton> menuitem at the bottom of the context menu of the text boxes will be enabled and allows you to add escape sequences or regular expression items to the search or replace pattern from predefined lists.
tr: Eğer <guilabel>Kaçış dizileri</guilabel> ya da<guilabel>Düzenli ifade</guilabel> seçili ise, metin kutularının içerik menüsünün altındaki <guibutton>Ekle...</guibutton> menü alanı etkinleştirilir ve ön tanımlı listelerden arama veya değiştirme düzenine kaçış dizileri veya düzenli ifade öğeleri eklemenizi sağlar.

source: Enter the text to replace with in the text box labeled <guilabel>Replace</guilabel> and click the <guibutton>Replace</guibutton> button to replace only the highlighted text or the <guibutton>Replace All</guibutton> button to replace the search text in the whole document.
tr: Değiştirilecek metni <guilabel>Değiştir</guilabel> etiketli metin kutusuna girin ve yalnızca vurgulanan metni değiştirmek için <guibutton>Değiştir</guibutton> düğmesini veya arama belgesindeki tüm metni değiştirmek için <guibutton>Tümünü Değiştir</guibutton> düğmesini tıklayın.

source: You can modify the search and replace behavior by selecting different options at the bottom of the bar. Selecting <guilabel>Match Case</guilabel> will limit finds to entries that match the case (upper or lower) of each of the characters in the search pattern. <guilabel>Selection Only</guilabel> will search and replace within the current selection only. The <guilabel>Find All</guilabel> button highlights all matches in the document and shows the number of found matches in a small popup.
tr: Ara ve değiştir davranışını, çubuğun sonundan farklı seçenekleri seçerek değiştirebilirsiniz. <guilabel>Eşleşme Durumu</guilabel> seçilmesi, bulguları arama kalıbındaki her bir karakter için harf (büyük ya da küçük) eşleşmesi girdisine sınırlayacaktır. <guilabel>Sadece Seçim</guilabel> sadece mevcut seçim içerisinde bulup değiştirecektir. <guilabel>Tümünü BUll</guilabel> tuşu belgedeki tüm eşleşmeleri vurgular ve küçük bir açılan pencerede bulunan eşleşme sayısını gösterir.

source: Click on the button with a green arrow icon at the right side of the power search and replace bar to switch to the incremental search bar.
tr: Güç aramanın sağ tarafında yeşil bir ok simgesi olan düğmeye tıklayın ve artımlı arama çubuğuna geçmek için çubuğu değiştirin.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Find Selected</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo></shortcut> <guimenu>Düzenle</guimenu><guimenuitem>Seçimi Bul</guimenuitem>

source: Finds next occurrence of selected text.
tr: Seçili metnin bir sonraki eşleşmesini bulur.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>H</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Find Selected Backwards</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>H</keycap></keycombo></shortcut> <guimenu>Düzenle</guimenu><guimenuitem>Geriye Doğru Seçimi Bul</guimenuitem>

source: Finds previous occurrence of selected text.
tr: Aranan metnin bir önceki eşleşmesini bul.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Go to Line...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo> </shortcut> <guimenu>Düzenle</guimenu> <guimenuitem>Satıra Git...</guimenuitem>
