Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/krusader_viewer-editor.po
Languages: tr

source: Check this if you want backups of local files when saving.
tr: Eğer yerel dosyaları kaydederken yedeklemek istiyorsanız bunu seçin.

source: Remote files
tr: Uzak dosyalar

source: Check this if you want backups of remote files when saving.
tr: Eğer uzak dosyaları kaydederken yedeklemek istiyorsanız bunu seçin.

source: Prefix
tr: Önek

source: Enter the prefix to prepend to the backup file names.
tr: Yedeklenen dosya isimlerinin başına getirmek üzere bir önek girin.

source: Suffix
tr: Sonek

source: Enter the suffix to add to the backup file names.
tr: Yedekleme dosya isimlerine eklemek üzere sonek girin.

source: Disable swap file syncing
tr: Takas dosyası senkronizasyonunu kapat

source: &kappname; is able to recover (most of) what was written after last save in case of a crash or power failure. A swap file (.swp.&lt;filename&gt;) is created after the first editing action on a document. If the user doesn’t save the changes and &kappname; crashes, the swap file remains on the disk. When opening a file, &kappname; checks if there is a swap file for the document and if it is, it asks the user whether he wants to recover the lost data or not. The user has the possibility to view the differences between the original file and the recovered one, too. The swap file is deleted after every save and on normal exit.
tr: &kappname;, bir çökme anında ya da güç sorununda kayıt sonrasında yazılanları (çoğunu) kurtarabilir. Bir belgedeki ilk düzenleme eyleminden sonra bir takas dosyası (.swp.&lt;dosyaadi&gt;) oluşturulur. Eğer kullanıcı değişiklikleri kaydetmezse ve &kappname; çökerse, takas dosyası diskte kalır. Bir dosya açılırken, &kappname; o belge için bir takas dosyası var mı diye kontrol eder ve eğer varsa, kullanıcıya kayıp veriyi kurtarmak isteyip istemediğini sorar. Kullanıcı, özgün dosya ile kurtarılan dosya arasındaki farkları da görüntüleyebilir. Takas dosya her kayıtta ya da normal kapatma sonrasında silinir.

source: &kappname; syncs the swap files on the disk every 15 seconds, but only if they have changed since the last sync. The user can disable the swap files syncing if he wants, by checking the <guilabel>Disable swap file syncing</guilabel> box, but this can lead to more data loss.
tr: &kappname; takas dosyalarını, eğer son senkronizasyondan sonra değişiklik olmuşsa diske her 15 saniyede bir senkronize eder. Kullanıcı, takas dosyalarını senkronize etmeyi, <guilabel>Takas dosyası senkronizasyonunu kapat</guilabel> kutusunu işaretleyerek kapatabilir fakat bu daha fazla veri kaybına yol açabilir.

source: Modes &amp; Filetypes
tr: Kipler &amp; Dosya Tipleri

source: Filetype:
tr: Dosya tipi:

source: The filetype with the highest priority is the one displayed in the first drop down box. If more filetypes were found, they are also listed.
tr: En yüksek önceliğe sahip dosya tipi, aşağı açılır ilk kutuda görüntülenendir. Daha fazla dosya tipi bulunursa, bunlar da listelenir.

source: <guilabel>New</guilabel>
tr: <guilabel>Yeni</guilabel>

source: This is used to create a new filetype. After you click on this button, the fields below get empty and you can fill the properties you want for the new filetype.
tr: Bu yeni bir dosya tipi oluşturmak için kullanılır. BU tuşa bastıktan sonra, aşağıdaki alanlar boşalır ve yeni dosya tipi için istediğiniz özellikler ile doldurabilirsiiz.

source: Delete
tr: Sil

source: To remove an existing filetype, select it from the drop down box and press the Delete button.
tr: Mevcut bir dosya türünü kaldırmak için açılır listeden seçin ve Sil düğmesine basın.

source: Properties of <replaceable>current filetype</replaceable>
tr: <replaceable>mevcut dosya türü</replaceable> seçenekleri

source: Name:
tr: İsim:

source: The name of the filetype will be the text of the corresponding menu item. This name is displayed in the <menuchoice><guimenu>Tools</guimenu><guimenuitem>Filetypes</guimenuitem> </menuchoice>
tr: Dosya tipinin ismi uyuşan menü ögesinin metni olacaktır. Bu isim <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Dosya Tipleri</guimenuitem> </menuchoice> içerisinde görüntülenebilir.

source: Section:
tr: Bölüm:

source: The section name is used to organize the file types in menus. This is also used in the <menuchoice><guimenu>Tools</guimenu><guimenuitem>Filetypes</guimenuitem> </menuchoice> menu.
tr: Bölüm ismi menülerdeki dosya tiplerini düzenlemek için kullanılır. Bu ayrıca <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Dosya Tipleri</guimenuitem></menuchoice> menüsü içerisinde de kullanılır.

source: Variables:
tr: Değişkenler:

source: Press <guibutton>Edit</guibutton> to see a list of all available variables and their descriptions. Select the checkbox on the left to enable a particular variable and then set the value of the variable on the right. Some variables provide a drop-down box to select possible values from while others require you to enter a valid value manually.
tr: Tüm kullanılabilir değişkenlerin listesini ve onların açıklamasını görmek için <guibutton>Düzenle</guibutton> butonuna basın. Belirli bir değişkeni etkinleştirmek için solundaki kutucuğu işaetleyin ve sağındaki değişkenin değerini ayarlayın. Bazı değişkenler olası değerler arasından seçmenizi sağlayan açılır kutu açarken bazıları elle veri girmenizi gerektirebilir.

source: For complete information on these variables, see <ulink url="help:/katepart/config-variables.html">Configuring with Document Variables</ulink>.
tr: Bu değişkenlerdeki tam bir bilgi için bakınız <ulink url="help:/katepart/config-variables.html">Belge Değişkenleri ile Yapılandırma</ulink>.

source: Highlighting:
tr: Vurgulama:

source: If you create a new file type, this drop down box allows you to select a filetype for highlighting.
tr: Yeni bir dosya türü oluşturursanız, bu açılır kutu vurgulamak için bir dosya türü seçmenize izin verir.

source: Indentation Mode:
tr: Girintileme Kipi:

source: The drop down box specifies the indentation mode for new documents.
tr: Açılır kutu yeni belgeler için girintileme kipini belirler.

source: File extensions:
tr: Dosya uzantıları:

source: The wildcards mask allows you to select files by filename. A typical mask uses an asterisk and the file extension, for example <filename>*.txt; *.text</filename>. The string is a semicolon-separated list of masks.
tr: Joker karakter maskesi dosyaları isimlerine göre seçmenize olanak tanır. Tipik bir maske yıldızı ve dosya uzantısını kullanır, örneğin <filename>*.txt; *.text</filename>. Karakter dizisi maskelerin yarı-sütunlar ise ayrılmış listesidir.

source: Priority:
tr: Öncelik:

source: Sets a priority for this file type. If more than one file type selects the same file, the one with the highest priority will be used.
tr: Bu dosya tipi için önceliği ayarlar. Eğer birden fazla dosya tipi aynı dosyayı seçerse, en yüksek öncelikli olan kullanılacaktır.

source: Download Highlighting Files...
tr: Vurgulama Dosyalarını İndir...

source: Click this button to download new or updated syntax highlight descriptions from the &kappname; website.
tr: &kappname; web sitesinden yeni veya güncellenmiş söz dizimi vurgulaması açıklamaları için bu tuşa tıklayın.

source: Extensions
tr: Uzantılar

source: The <guilabel>Plugins</guilabel> tab lists all available plugins and you can check those you want to use. Click on the <guibutton>Information</guibutton> button to open the <guilabel>About</guilabel> dialog of this plugin.
tr: <guilabel>Eklentiler</guilabel> sekmesi tüm kullanılabilir eklentileri listeler ve kullanmak istediğinizi buradan işaretleyebilirsiniz. Eklentinin <guilabel>Hakkında</guilabel> penceresini açmak için <guibutton>Bilgi</guibutton> butonuna basın.

source: Once a configurable plugin is checked, the <guibutton>Configure</guibutton> button is enabled and you can click it in order to configure the highlighted plugin.
tr: Yapılandırılabilir eklendi işaretlendi ise <guibutton>Yapılandır</guibutton> butonu etkin hale gelir ve işaretli eklentiyi yapılandırmak için buna basabilirsiniz.

source: Editor Component Plugins
tr: Düzenleyici Bileşeni Eklentileri

source: The autobrace plugin supersedes the &kappname; internal <quote>Auto Brackets</quote> feature. It automatically inserts a closing brace <keycap>}</keycap> at the beginning of the next line after ending a line with an opening one <keycap>{</keycap> and pressing the &Enter; key.
tr: Otomatik ayraç eklentisi &kappname; dahili <quote>Otomatik Ayraçlar</quote> özelliğinin üstüne yazar. Otomatik olarak, <keycap>{</keycap> ile açılarak biten bir satırdan sonraki satırın başına kapatma ayracı <keycap>}</keycap> ekler ve &Enter; tuşuna basar.

source: Data Tools
tr: Veri Araçları

source: Exporter
tr: Dışa Aktarıcı

source: Insert File
tr: Dosya Ekle

source: This plugin allows you to insert any readable file at the cursor position. If enabled, the <guimenu>Tools</guimenu> menu has an additional menu item <guimenuitem>Insert File</guimenuitem>.
tr: Bu eklenti imleç konumuna herhangi bir okunabilir dosyayı eklemenize imkan tanır. Etkinleştirildiği zaman, <guimenu>Araçlar</guimenu> menüsü <guimenuitem>Dosya Ekle</guimenuitem> şeklinde ek bir menü ögesine sahip olur.
