Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/krusader_viewer-editor.po
Languages: tr

source: This opens the goto line bar at the bottom of the window which is used to have the cursor jump to a particular line (specified by number) in the document. The line number may be entered directly into the text box or graphically by clicking on the up or down arrow spin controls at the side of the text box. The little up arrow will increase the line number and the down arrow decrease it. Close the bar with a click on the button with an icon on the left side of the bar.
tr: Bu, pencerenin en altında imleci belge içerisinde (sayı ile belirtilmiş olan) belirli bir satıra atlatmak için kullanılan satıra git çubuğu açar. Satır numarası direkt olarak metin kutusuna ya da metin kutusunun yan kısmında grafik olarak yukarı aşağı ok çevirmeli kontrollerine tıklayarak girilmiş olabilir. Küçük yukarı oku satır numarasını azaltacaktır ve aşağı ok artıracaktır. Çubuğu, çubuğun sol kısmındaki simgeli tuşa tıklayarak kapatın.

source: The View Menu
tr: Görünüm Menüsü

source: The <guimenu>View</guimenu> menu allows you to manage settings specific to the active editor, and to manage frames.
tr: <guimenu>Görünüm</guimenu> menüsü ayarları etkin düzenleyiciye göre özelleşmiş bir şekilde yönetmenize ve çerçeveleri yönetmenize olanak tanır.

source: <guimenu>View</guimenu> <guimenuitem>New Window</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Yeni Pencere</guimenuitem>

source: Create another window containing the current document. All changes to the document in one window are reflected in the other window and vice versa.
tr: Mevcut belgeyi içeren başka bir pencere oluştur. Bir penceredeki belgedeki değişiklikler diğer pencereye de yansır ve bunun tersi de geçerlidir.

source: <shortcut><keycombo action="simul"><keycap>F7</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Switch to Command Line</guimenuitem>
tr: <shortcut><keycombo action="simul"><keycap>F7</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Komut Satırına Değiştir</guimenuitem>

source: Displays the Katepart command line at the bottom of the window. In the command line, type <userinput>help</userinput> to get help and <userinput>help list</userinput> to get a list of commands.
tr: Pencere sonunda Katepart komut satırını görüntüler. Komut satırına, yardım almak için<userinput>yardım</userinput>ve komut listesini almak için ise <userinput>yardım listesi</userinput> yazın.

source: <guimenu>View</guimenu><guimenuitem>Show the Javascript Console</guimenuitem>
tr: <guimenu>Görünüm</guimenu><guimenuitem>Javascript Uç Birimini Göster</guimenuitem>

source: This opens a tool view that allows you to run Javascript code interactively. For more information, see <ulink url="help:/katepart/advanced-editing-tools-scripting.html">Extending &kate; with Scripts</ulink>
tr: Bu, Javascript kodunu etkileşimli olarak çalıştırmanıza izin veren bir araç görünümü açar. Daha fazla bilgi için bkz. <ulink url="help:/katepart/advanced-editing-tools-scripting.html">&kate; 'i Betikler ile Büyütmek</ulink>

source: <guimenu>View</guimenu> <guisubmenu>Schema</guisubmenu>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Şema</guisubmenu>

source: Select a font schema.
tr: Yazı tipi şeması seç.

source: <shortcut><keycombo action="simul"><keycap>F10</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Dynamic Word Wrap</guimenuitem>
tr: <shortcut><keycombo action="simul"><keycap>F10</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Dinamik Kelime Sarması</guimenuitem>

source: The text lines will be wrapped at the view border on the screen.
tr: Metin çizgileri ekranın görünüm sınırında sarılacaktır.

source: <guimenu>View</guimenu> <guisubmenu>Dynamic Word Wrap Indicators</guisubmenu>
tr: <guimenu>Grünüm</guimenu> <guisubmenu>Dinamik Kelime Kaydırma Belirteçleri</guisubmenu>

source: Choose when and how the dynamic word wrap indicators should be displayed. This is only available if the <guilabel>Dynamic Word Wrap</guilabel> option is checked.
tr: Dinamik kelime kaydırıcı belirteçlerinin ne zaman ve nasıl görüntüleneceğini seç. Bu sadece <guilabel>Dinamik Kelime Kaydırması</guilabel> seçeneği işaretli ise kullanılabilirdir.

source: <guimenu>View</guimenu> <guimenuitem>Show Static Word Wrap Marker</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Durağan Kelime Kaydırma İşaretçilerini Göster</guimenuitem>

source: If this option is checked, a vertical line will be drawn at the word wrap column as defined in the <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure Editor...</guimenuitem></menuchoice> in the Editing tab. Please note that the word wrap marker is only drawn if you use a fixed pitch font.
tr: Eğer bu seçenek seçili ise, <menuchoice> <guimenu>Ayarlar</guimenu> <guimenuitem>Düzenleyiciyi Yapılandır...</guimenuitem></menuchoice> içerisinde Düzenleme Sekmesinde tanımlandığı gibi kelime kaydırma sütununda dikey bir çizgi çizilecektir. Lütfen unutmayın ki kelime kaydırıcı sadece sabit bir yükseklikteki yazı tipi kullanırsanız çizilir.

source: <shortcut><keycombo action="simul"><keycap>F6</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Show Icon Border</guimenuitem>
tr: <shortcut><keycombo action="simul"><keycap>F6</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Simge Kenarlığını Göster</guimenuitem>

source: This is a toggle item. Setting it on checked will make the Icon Border visible in the left side of the active editor, and vice versa. The Icon Border indicates the positions of the marked lines in the editor.
tr: Bu bir değiştirme ögesidir. İşaretli olarak ayarlandığında, Simge Kenarlığını etkin düzenleyicinin sol tarafında görünür hale getirecek ve bunun tersi de geçerli olacaktır. Simge Kenarlığı, düzenleyicide işaretli çizgilerin konumunu gösterir.

source: <shortcut><keycombo action="simul"><keycap>F11</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Show Line Numbers</guimenuitem>
tr: <shortcut><keycombo action="simul"><keycap>F11</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Satır Numaralarını Göster</guimenuitem>

source: This is a toggle Item. Setting it on checked will make a pane displaying the line numbers of the document visible in the left border of the active editor, and vice versa.
tr: Bu bir değiştirme ögesidir. İşaretli olarak ayarlandığında, etkin editörün sol kenarlığında görünür olan, belgenin satır numaralarını gösteren bir panel açacak ve bunun tersi de geçerli olacaktır.

source: <guimenu>View</guimenu> <guisubmenu>Show Scrollbar Marks</guisubmenu>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Kaydırma Çubuğu İşaretlerini Göster</guisubmenu>

source: If this option is checked, the view will show marks on the vertical scrollbar. The marks are equivalent to the marks on the <link linkend="katepart-menu-view-show-icon-border">Icon Border</link>.
tr: Eğer bu seçenek işaretli ise, görünüm işaretleri dikey kaydırma çubuğunda gösterecektir. Bu işaretler <link linkend="katepart-menu-view-show-icon-border">Simge Kenarlığı</link> üzerindeki işaretlere eşdeğerdir.

source: <shortcut><keycombo action="simul"><keycap>F9</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Show Folding Markers</guimenuitem>
tr: <shortcut><keycombo action="simul"><keycap>F9</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Katlama İşaretlerini Göster</guimenuitem>

source: If this option is checked, the marks for code folding will be shown.
tr: Bu seçenek işaretliyse, kod sarmalama işaretleri gösterilecektir.

source: <guimenu>View</guimenu> <guisubmenu>Code Folding</guisubmenu>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Kod Sarmalama</guisubmenu>

source: These options pertain to <ulink url="help:/katepart/advanced-editing-tools-code-folding.html">code folding</ulink>:
tr: Bu seçenekler <ulink url="help:/katepart/advanced-editing-tools-code-folding.html">kod sarmalama</ulink> ile ilgilidir:

source: <shortcut> <keycombo action="simul"><keycap>F9</keycap></keycombo> </shortcut> <guimenuitem>Show Folding Markers</guimenuitem>
tr: <shortcut> <keycombo action="simul"><keycap>F9</keycap></keycombo> </shortcut> <guimenuitem>Sarmalama İşaretçilerini Göster</guimenuitem>

source: Toggles the display of the folding marker pane in the left side of the view.
tr: Katlama işaretçisi panelinin görünümün sol kısmında görüntülenmesini değiştirir.

source: Fold Current Node
tr: Geçerli Düğümü Topla

source: Collapse the region that contains the cursor.
tr: İmleci içeren bölgeyi daralt.

source: Unfold Current Node
tr: Geçerli Düğümü Aç

source: Expand the region that contains the cursor.
tr: İmleci içeren bölgeyi genişlet.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>-</keycap></keycombo> </shortcut> <guimenuitem>Fold Toplevel Nodes</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>-</keycap></keycombo> </shortcut> <guimenuitem>En Üst Seviye Düğümlerini Katla</guimenuitem>

source: Collapse all toplevel regions in the document. Click on the right pointing triangle to expand all toplevel regions.
tr: Belgedeki tüm üst seviye bölgelerini daralt. Tüm üst seviye bölgelerini genişletmek için sağı gösteren üçgene tıkla.

source: Enlarge Font
tr: Yazıtipini Büyüt

source: This increases the display font size.
tr: Görüntü yazıtipi puntosunu artırır.

source: Shrink Font
tr: Yazıtipini Küçült

source: This decreases the display font size.
tr: Görüntü yazıtipi puntosunun azaltır.

source: The Bookmarks Menu
tr: Yer İmleri Menüsü

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Bookmarks</guimenu> <guimenuitem>Set Bookmark</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Yer İmleri</guimenu> <guimenuitem>Yer İmi Ayarla</guimenuitem>

source: Sets or removes a bookmark in the current line of the active document. (If it is there, it is removed, otherwise one is set).
tr: Etkin belgenin geçerli satırındaki yer imini ayarlar ya da kaldırır. (Eğer varsa, kaldırılır, aksi halde biri ayarlanır).

source: <guimenu>Bookmarks</guimenu> <guimenuitem>Clear All Bookmarks</guimenuitem>
tr: <guimenu>Yer İmleri</guimenu> <guimenuitem>Tüm Yer İmlerini Temizle</guimenuitem>

source: This command will remove all the markers from the document as well as the list of markers which is appended at the bottom of this menu item.
tr: Bu komut, belgeden tüm işaretleyicileri ve bu menü ögesinin sonuna eklenen işaretçilerin listesini kaldıracaktır.

source: This will move the cursor to beginning of the first above line with a bookmark. The menuitem text will include the line number and the first piece of text on the line. This item is only available when there is a bookmark in a line above the cursor.
tr: Bu, imleci yer imi içeren üstteki ilk satırın başlangıcına taşıyacaktır. Menuitem metni satır numarasını ve satırdaki ilk metin parçasını içerecektir. Bu öge sadece imlecin üzerinde bir satırda bir yer imi olduğunda kullanılabilir.

source: <shortcut><keycombo action="simul">&Alt; <keycap>PgDown</keycap></keycombo></shortcut> <guimenu>Bookmarks</guimenu><guimenuitem>Next</guimenuitem>
tr: <shortcut><keycombo action="simul">&Alt; <keycap>PgDown</keycap></keycombo></shortcut> <guimenu>Yer İmleri</guimenu><guimenuitem>Sonraki</guimenuitem>

source: This will move the cursor to beginning of the next line with a bookmark. The menuitem text will include the line number and the first piece of text on the line. This item is only available when there is a bookmark in a line below the cursor.
tr: Bu, imleci yer imi içeren sonraki ilk satırın başlangıcına taşıyacaktır. Menuitem metni satır numarası ve satırdaki ilk metin parçasını içerecektir. Bu öğe yalnızca imlecin altındaki bir satırda bir yer imi olduğunda kullanılabilir.

source: At the bottom of this menu, a list of bookmarks appears if any bookmarks are available for this window.
tr: Bu menünün alt kısmında, bu pencere için herhangi bir yer işareti varsa yer imlerinin bir listesi görüntülenir.

source: The Tools Menu
tr: Araçlar Menüsü

source: <guimenu>Tools</guimenu> <guimenuitem>Read Only Mode</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Salt Okunur Kipi</guimenuitem>

source: Set the current document to Read Only mode. This prevents any text addition and any changes in the document formatting.
tr: Geçerli belgeyi Salt Okunur kipine ayarla. Bu belge biçimlendirmesinde herhangi bir değiştirmeyi ve metin eklemesini engeller.

source: <guimenu>Tools</guimenu> <guisubmenu>Mode</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Kip</guisubmenu>

source: Choose the filetype scheme you prefer for the active document. This overwrites the global filetype mode set in <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure Editor...</guimenuitem></menuchoice> in the Filetypes tab for your current document only.
tr: Etkin belge için tercih ettiğiniz dosya tipi şemasını seçin. Bu Dosya Tipleri sekmesi içerisindeki <menuchoice> <guimenu>Ayarlar</guimenu><guimenuitem>Düzenleyiciyi Yapılandır...</guimenuitem></menuchoice> içinden sadece mevcut belgeniz için genel dosya tipi kipini değiştirir.

source: <guimenu>Tools</guimenu> <guisubmenu>Highlighting</guisubmenu>
tr: <guimenu>Araçlar</guimenu><guisubmenu>Vurgulama</guisubmenu>

source: Choose the Highlighting scheme you prefer for the active document. This overwrites the global highlighting mode set in <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure Editor...</guimenuitem></menuchoice> for your current document only.
tr: Etkin belge için tercih ettiğiniz vurgulama şemasını seçin. Bu Dosya Tipleri sekmesi içerisindeki <menuchoice> <guimenu>Ayarlar</guimenu><guimenuitem>Düzenleyiciyi Yapılandır...</guimenuitem></menuchoice> içinden sadece mevcut belgeniz için genel vurgulama kipini değiştirir.

source: <guimenu>Tools</guimenu> <guisubmenu>Indentation</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Girintileme</guisubmenu>

source: Choose the style of indentation you want for your active document. This overwrites the global indentation mode set in <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure Editor...</guimenuitem></menuchoice> for your current document only.
tr: Arşiv belgeniz için istediğiniz girintinin biçemini seçin. Bu sadece geçerli belgeniz için <menuchoice> <guimenu>Ayarlar</guimenu> <guimenuitem>Düzenleyiciyi Yapılandır...</guimenuitem></menuchoice> içerisinde ayarlanmış olan genel girinti kipinin üzerine yazar.

source: <guimenu>Tools</guimenu> <guisubmenu>Encoding</guisubmenu>
tr: <guimenu>Ayarlar</guimenu> <guisubmenu>Kodlama</guisubmenu>

source: You can overwrite the default encoding set in <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure Editor...</guimenuitem></menuchoice> in the <guilabel>Open/Save</guilabel> page to set a different encoding for your current document. The encoding you set here will be only valid for your current document.
tr: Geçerli belgeniz için farklı bir kodlama ayarlamak için varsayılan kodlama setinin üzerine <guilabel>Aç/Kaydet</guilabel> sayfası içerisindeki <menuchoice> <guimenu>Ayarlar</guimenu> <guimenuitem>Düzenleyiciyi Yapılandır...</guimenuitem></menuchoice> içerisinden yazabilirsiniz. Buraya ayarladığınız kodlama sadece mevcut belgeniz için geçerli olacaktır.

source: <guimenu>Tools</guimenu> <guisubmenu>End of Line</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Satır Sonu</guisubmenu>

source: Choose your preferred end of line mode for your active document. This overwrites the global end of line mode set in <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure Editor...</guimenuitem></menuchoice> for your current document only.
tr: Etkin belgeniz için tercih ettiğiniz satır sonu kipini seçin. Bu sadece geçerli belgleniz için genel satır sonu kip ayarlarını<menuchoice> <guimenu>Ayarlar</guimenu> <guimenuitem>Düzenleyiciyi Yapılandır...</guimenuitem></menuchoice> içerisinden üzerine yazacaktır.

source: <guimenu>Tools</guimenu> <guisubmenu>Add Byte Mark Order (BOM)</guisubmenu>
tr: <guimenu>Araçlar</guimenu> <guisubmenu>Bayt İşareti Sırası Ekle (BSİ)</guisubmenu>

source: Manually invoke command completion, usually by using a shortcut bound to this action.
tr: Komut tamamlamayı el ile tetikle, genellikle bu eylem için bir kısayol kullanılır.

source: <guimenu>Tools</guimenu> <guimenuitem>Word Completion</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Kelime Tamamlama</guimenuitem>

source: <guimenuitem>Reuse Word Below</guimenuitem> (<keycombo action="simul">&Ctrl; <keycap>9</keycap></keycombo>) and <guimenuitem>Reuse Word Above</guimenuitem> (<keycombo action="simul">&Ctrl; <keycap>8</keycap></keycombo>) complete the currently typed text by searching for similar words backward or forward from the current cursor position. <guimenuitem>Shell Completion</guimenuitem> pops up a completion box with matching entries.
tr: <guimenuitem>Aşağıdaki Kelimeyi Yeniden Kullan</guimenuitem> (<keycombo action="simul">&Ctrl; <keycap>9</keycap></keycombo>) ve <guimenuitem>Yukarıdaki Kelimeyi Yeniden Kullan</guimenuitem> (<keycombo action="simul">&Ctrl; <keycap>8</keycap></keycombo>) mevcutta yazılan metni mevcut imleç konumundan ileriye veya geriye doğru benzer kelimeleri arayarak tamamlar. <guimenuitem>Kabuk Tamamlama</guimenuitem> eşleşen girdiler içeren tamamlama kutusu açar.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Automatic Spell Checking</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Kendiliğinden Yazım Denetimi</guimenuitem>

source: When <guimenuitem>Automatic Spell Checking</guimenuitem> is enabled, wrong text is underlined in the document on-the-fly.
tr: <guimenuitem>Kendiliğinden Yazım Denetimi</guimenuitem> etkinleştirildiği zaman, yanlış metin belge içerisinde anında altı çizili hale gelir.

source: <guimenu>Tools</guimenu><guimenuitem>Spelling...</guimenuitem>
tr: <guimenu>Araçlar</guimenu><guimenuitem>Yazım...</guimenuitem>

source: <action>This initiates the spellchecking program - a program designed to help the user catch and correct any spelling errors.</action> Clicking on this entry will start the checker and bring up the speller dialog box through which the user can control the process. There are four settings lined up vertically in the center of the dialog with their corresponding labels just to the left. Starting at the top they are:
tr: <action>Bu, yazım denetimi programını başlatır - kullanıcının yazım hatalarını yakalamasına ve düzeltmesine yardımcı olmak için tasarlanmış bir program.</action> Bu girdiye tıklamak, denetleyiciyi başlatacak ve kullanıcının işlemi denetleyebileceği yazım iletişim kutusunu açacaktır. İletişim kutusunun ortasına ilgili etiketlerine göre dikey olarak dizilmiş dört ayar vardır; En baştan başlayarak bunlar:

source: Unknown word:
tr: Bilinmeyen kelime:

source: Here, the spellchecker indicates the word currently under consideration. This happens when the checker encounters a word not in its dictionary - a file containing a list of correctly spelled words against which it compares each word in the editor.
tr: Burada, yazım denetçisi şu anda dikkate alınan kelimeyi gösterir. Bu, denetçi sözlüğünde olmayan bir sözcükle karşılaştığında gerçekleşir - editörde her sözcüğü karşılaştıran doğru sözcüklerin listesini içeren bir dosyadır.

source: Replace with:
tr: Şununla değiştir:

source: If the checker has any similar words in its dictionary the first one will be listed here. The user can accept the suggestion, type in his or her own correction, or choose a different suggestion from the next box.
tr: Denetçinin sözlüğünde benzer kelimeler varsa, bunlardan ilki burada listelenecektir. Kullanıcı öneriyi kabul edebilir, kendi düzeltmesi şeklinde yazabilir veya bir sonraki kutudan farklı bir öneri seçebilir.

source: Language:
tr: Dil:

source: If you have installed multiple dictionaries, here you can select which dictionary/language should be used.
tr: Eğer birden fazla sözlük kurduysanız, buradan hangi sözlük/dilin kullanılacağını seçebilirsiniz.

source: On the right side of the dialog box are 6 buttons that allow the user to control the spellcheck process. They are:
tr: İletişim kutusunun sağ tarafında kullanıcının yazım denetimi sürecini kontrol etmesini sağlayan 6 adet tuş bulunmaktadır. Bunlar:

source: Add to Dictionary
tr: Sözlüğe Ekle

source: Pressing this button adds the <guilabel>Unknown word </guilabel> to the checker's dictionary. This means that in the future the checker will always consider this word to be correctly spelled.
tr: Bu tuşa basmak denetleyicinin sözlüğüne <guilabel>Bilinmeyen kelime</guilabel> ekler. Bu, denetçinin ileride bu kelimeyi her zaman düzgün yazılmış olarak göz önüne alacağı anlamına gelir.

source: Suggest
tr: Öner

source: The checker may list here a number of possible replacements for the word under consideration. Clicking on any one of the suggestions will cause that word to be entered in the <guilabel>Replace with</guilabel> box, above.
tr: Denetçi, göz önünde bulundurulan kelime için bir dizi olası değiştirmeyi burada listeleyebilir. Önerilerden herhangi birine tıkladığınızda, bu kelimenin yukarıdaki <guilabel>Şununla değiştir</guilabel> kutusuna girilmesine neden olur.

source: Replace
tr: Değiştir

source: This button has the checker replace the word under consideration in the document with the word in the <guilabel>Replace with</guilabel> box.
tr: Bu tuş belgedeki <guilabel>Şununla değiştir</guilabel> kutusu içerisinde göz önüne alınan kelimeyi değiştirecek kontrol ediciye sahiptir.

source: Replace All
tr: Tümünü Değiştir

source: This button causes the checker to replace not only the current <guilabel>Unknown word:</guilabel> but to automatically make the same substitution for any other occurrences of this <guilabel>Unknown word</guilabel> in the document.
tr: Bu tuş denetleyicinin sadece mevcut <guilabel>Bilinmeyen kelime:</guilabel> değiştirmesine değil, aynı yerine koyma işlemini belgede herhangi bir <guilabel>Bilinmeyen kelime</guilabel> oluşu için yapmasına sebep olur.

source: Ignore
tr: Yoksay

source: Activating this button will have the checker move on without making any changes.
tr: Bu düğmeyi etkinleştirmek, denetçinin herhangi bir değişiklik yapmadan devam etmesini sağlayacaktır.

source: Ignore All
tr: Tümünü Yoksay

source: This button tells the checker to do nothing with the current <guilabel>Unknown word:</guilabel> and to pass over any other instances of the same word.
tr: Bu tuş, denetleyiciye geçerli <guilabel>Bilinmeyen sözcük:</guilabel> ile hiçbir şey yapmamasını ve aynı kelimenin diğer örneklerini iletmesini söyler.

source: This only applies to the current spellcheck run. If the checker is run again later it will stop on this same word.
tr: Bu sadece geçerli yazım denetimi için geçerlidir. Denetleyici daha sonra tekrar çalıştırılırsa, aynı sözcük üzerinde duracaktır.

source: Three more buttons are located horizontally along the bottom of the spellcheck dialog. They are:
tr: Yazım denetimi iletişim kutusunun alt kısmında yatay olarak üç tuş daha bulunur. Bunlar:

source: Help
tr: Yardım

source: This invokes the &kde; help system with the help page for this dialog.
tr: Bu, bu iletişim kutusu için yardım sayfası ile birlikte &kde; yardım sistemini çağırır.

source: Finished
tr: Tamamlandı

source: This button ends the spellcheck process, and returns to the document.
tr: Bu tuş yazım denetimi sürecini sona erdirir, ve belgeye döner.

source: Cancel
tr: İptal Et
