Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/krusader_viewer-editor.po
Languages: tr

source: This button cancels the spellcheck process, all modifications are reverted, and you will return to your document.
tr: Bu tuş yazım denetimi işlemini iptal eder, tüm düzenlemeler geri döndürülür, ve belgenize geri dönersiniz.

source: <guimenu>Tools</guimenu> <guimenuitem>Spelling (from cursor)...</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Yazım Denetimi (imleçten itibaren)...</guimenuitem>

source: This initiates the spellchecking program but it starts where your cursor is instead of at the beginning of the document.
tr: Bu yazım denetimi programını başlatır fakat, belgenin başlagıcı yerine imleciniz nerede ise orada başlar.

source: <guimenu>Tools</guimenu> <guimenuitem>Spellcheck Selection...</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Yazım Denetimi Seçimi...</guimenuitem>

source: Spellchecks the current selection.
tr: Mevcut seçimin yazımını denetler.

source: <guimenu>Tools</guimenu> <guimenuitem>Change Dictionary</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Sözlüğü Değiştir</guimenuitem>

source: Displays a drop down box with all available dictionaries for spellchecking at the bottom of the editor window. This allows easy switching of the spellcheck dictionary &eg; for automatic spellcheck of text in different languages.
tr: Editör penceresinin altında, yazım denetimi için tüm kullanılabilir sözlükleri içeren bir açılır kutu görüntüler. Bu, yazım denetimi sözlüğünün kolayca değiştirilmesine izin verir &eg; metnin farklı dillerdeki otomatik yazım denetimi için.

source: <guimenu>Tools</guimenu><guimenuitem>Clean Indentation</guimenuitem>
tr: <guimenu>Aralar</guimenu><guimenuitem>Temiz Girintileme</guimenuitem>

source: This cleans the indentation for the current selection or for the line the cursor is currently in. Cleaning the indentation ensures that all your selected text follows the indentation mode you choose.
tr: Bu, geçerli seçimin veya imlecin şu anda içinde bulunduğu satırın girintisini temizler. Girintiyi temizlemek, seçtiğiniz tüm metinlerin seçtiğiniz girinti kipini takip etmesini sağlar.

source: <guimenu>Tools</guimenu> <guimenuitem>Align</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Hizala</guimenuitem>

source: Causes a realign of the current line or selected lines using the indentation mode and indentation settings in the document.
tr: Belgedeki girinti kipini ve girinti ayarlarını kullanarak geçerli satırın veya seçilen satırların yeniden hizalanmasına neden olur.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Comment</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo> </shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Yorum</guimenuitem>

source: This adds one space to the beginning of the line where the text cursor is located or to the beginning of any selected lines.
tr: Bu, metin imlecinin bulunduğu satırın başına veya seçilen herhangi bir satırın başına bir boşluk ekler.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>D</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Uncomment</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>D</keycap></keycombo> </shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Yorumu Kaldır</guimenuitem>

source: This removes one space (if any exist) from the beginning of the line where the text cursor is located or from the beginning of any selected lines.
tr: Bu, metin imlecinin bulunduğu satırın başından ya da seçili satırların başından bir boşluğu (varsa) kaldırır.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Uppercase</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Büyük Harf</guimenuitem>

source: Put the selected text or the letter after the cursor in uppercase.
tr: Seçili metni veya imleçten sonraki harfi büyük harfe koy.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Lowercase</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Araçlar </guimenu> <guimenuitem>Küçük Harf</guimenuitem>

source: Put the selected text or the letter after the cursor in lowercase.
tr: İmleçten sonraki harfi veya seçili metni küçük harfe koy.

source: <shortcut> <keycombo action="simul">&Ctrl;&Alt;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Capitalize</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Alt;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Baş Harfleri Büyüt</guimenuitem>

source: Capitalize the selected text or the current word.
tr: Mevcut kelimeyi veya seçili metni tamamen büyük harf yap.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>J</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Join Lines</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>J</keycap></keycombo> </shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Satırları Birleştir</guimenuitem>

source: Joins the selected lines, or the current line and the line below with one white space character as a separator. Leading/trailing white space on joined lines is removed in the affected ends.
tr: Seçili satırları, ya da mevcut satırı ve aşağıdaki satırı bir beyaz karakteri ayırıcı olarak birleştirir. Birleştirilen satırlardaki baştaki/sondaki beyaz boşluklar etkilenen sonlarda kaldırılır.

source: <guimenu>Tools</guimenu> <guimenuitem>Apply Word Wrap</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Kelime Kaydırmasını Uygula</guimenuitem>

source: Apply static word wrapping on all the document. That means that a new line of text will automatically start when the current line exceeds the length specified by the <guilabel>Wrap words at</guilabel> option in the Editing tab in <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Configure Editor...</guimenuitem></menuchoice>
tr: Durağan kelime kaydırmasını tüm belgeye uygula. Bu, mevcut satırın<menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Düzenleyiciyi Yapılandır...</guimenuitem></menuchoice> içerisindeki Düzenleme sekmesi içinde<guilabel>Kelimeleri şurada kaydır</guilabel> seçeneği ile belirtilen uzunluğu aştığı zaman yeni bir satırın otomatik olarak başlayacağı anlamına gelir.

source: If the <link linkend="katepart-pref-plugins">plugin</link> Insert File is enabled, you will find here an additional menu item <guimenuitem>Insert File...</guimenuitem>.
tr: Eğer <link linkend="katepart-pref-plugins">eklenti</link> Dosya Ekle etkinleştirilmiş ise, burada ek bir menü ögesi olan <guimenuitem>Dosya Ekle...</guimenuitem> bulacaksınız.

source: The Settings Menu
tr: Ayarlar Menüsü

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Editor...</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Düzenleyiciyi Yapılandır...</guimenuitem>

source: This menu item opens a dialog whereby several different <link linkend="kredit_config">settings</link> may be adjusted.
tr: Bu menü ögesi birkaç farklı <link linkend="kredit_config">ayarın</link> ayarlanabildiği bir iletişim kutusu açar.

source: The KrViewer Menu
tr: KrViewer Menüsü

source: <shortcut> <keycombo action="simul"> &Ctrl;&Shift; <keycap>G</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Generic viewer</guimenuitem>
tr: <shortcut> <keycombo action="simul"> &Ctrl;&Shift; <keycap>G</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Genel görüntüleyici</guimenuitem>

source: &krusader;'s internal viewer is actually part of &konqueror;, which can basically view every file type viewable by &konqueror; (&eg; display pictures, play music, show the content of an archive).
tr: &krusader;'ın iç görüntüleyicisi aslında &konqueror;'ın bir parçasıdır, temel olarak &konqueror; tarafından görüntülenebilir her dosya türünü görüntüleyebilir (&eg; resimleri göstermek, müzik çalmak, bir arşivin içeriğini göstermek).

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift; <keycap>T</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Text viewer</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift; <keycap>T</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Metin görüntüleyicisi</guimenuitem>

source: View the file in text mode.
tr: Dosyayı metin kipinde görüntüle.

source: <shortcut> <keycombo action="simul"> &Ctrl;&Shift; <keycap>H</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Hex viewer</guimenuitem>
tr: <shortcut> <keycombo action="simul"> &Ctrl;&Shift; <keycap>H</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Onaltılık görüntüleyici</guimenuitem>

source: View the file in hex mode.
tr: Dosyayı onaltılık kipinde görüntüle.

source: <shortcut> <keycombo action="simul"> &Ctrl;&Shift; <keycap>L</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Lister</guimenuitem>
tr: <shortcut> <keycombo action="simul"> &Ctrl;&Shift; <keycap>L</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Listeleyici</guimenuitem>

source: Fast text/hex viewer for huge filesizes, done by <link linkend="konfig-general">Krusader lister</link>.
tr: <link linkend="konfig-general">Krusader listeleyicisi</link> tarafından yapılan, büyük dosya boyutları için hızlı metin/onaltılık görüntüleyicisi.

source: <shortcut> <keycombo action="simul"> &Ctrl;&Shift; <keycap>E</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Text editor</guimenuitem>
tr: <shortcut> <keycombo action="simul"> &Ctrl;&Shift; <keycap>E</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Metin düzenleyici</guimenuitem>

source: Edit the file in text mode.
tr: Dosyayı metin kipinde düzenle

source: <shortcut> <keycombo action="simul"> &Ctrl;&Shift; <keycap>D</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Detach Tab</guimenuitem>
tr: <shortcut> <keycombo action="simul"> &Ctrl;&Shift; <keycap>D</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Ayırma Sekmesi</guimenuitem>

source: Detach browsing Tab and open in a new window.
tr: Gözatma sekmesini ayır ve yeni bir pencerede aç.

source: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>Q</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Quit</guimenuitem>
tr: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>Q</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Kapat</guimenuitem>

source: Closes &krusader;'s viewer/editor window.
tr: &krusader;'ın görüntüleyici/düzenleyici penceresini kapatır.

source: The Editor Component Configuration
tr: Düzenleyici Bileşeni Yapılandırması

source: This group contains all pages related to the editor component of &kappname;. Most of the settings here are defaults, they can be overridden by <link linkend="katepart-pref-open-save-modes-filetypes">defining a filetype</link>, by <ulink url="help:/katepart/config-variables.html">Document Variables</ulink> or by changing them per document during an editing session.
tr: Bu grup &kappname; editör bileşeni ile ilgili tüm sayfaları içerir. Buradaki ayarların çoğu varsayılan değerlerdir, <link linkend="katepart-pref-open-save-modes-filetypes">dosya tipi belirlenerek</link>, <ulink url="help:/katepart/config-variables.html">Belge Çeşitliliği</ulink> veya düzenleme süreci sırasında her belge için değiştirerek üzerlerine yazılabilir.

source: Appearance
tr: Görünüm

source: <title>General</title>
tr: <title>Genel</title>

source: Dynamic Word Wrap
tr: Dinamik Sözcük Kaydırma

source: If this option is checked, the text lines will be wrapped at the view border on the screen.
tr: Eğer bu seçenek işaretlenmişse, metin satırları, ekrandaki izleme kenarlıklarında kaydırılacak.

source: Dynamic word wrap indicators (if applicable)
tr: Devingen sözcük kaydırma belirteçleri (uygulanabilir ise)

source: Choose when the Dynamic word wrap indicators should be displayed, either <guilabel>Off</guilabel>, <guilabel>Follow Line Numbers</guilabel> or <guilabel>Always on</guilabel>.
tr: Dinamik sözcük kaydırma girintilerinin ne zaman görüntüleneceğini seçin, <guilabel>Kapalı</guilabel>, <guilabel>Satır Numaralarını Takip Et</guilabel> ya da <guilabel>Daima açık</guilabel>.

source: Align dynamically wrapped lines to indentation depth:
tr: Devingen olarak kaydırılmış satırları girinti derinliğine hizala:

source: Enables the start of dynamically wrapped lines to be aligned vertically to the indentation level of the first line. This can help to make code and markup more readable.
tr: Dinamik olarak kaydırılmış satırların ilk satırın girinti seviyesine dikey olarak hizalanmasını sağlar. Bu kod ve işaretlemeyi daha okunabilir hale getirmeye yardımcı olabilir.

source: Additionally, this allows you to set a maximum width of the screen, as a percentage, after which dynamically wrapped lines will no longer be vertically aligned. For example, at 50%, lines whose indentation levels are deeper than 50% of the width of the screen will not have vertical alignment applied to subsequent wrapped lines.
tr: Buna ek olarak, bu, ekranın maksimum genişliğini yüzde olarak ayarlamanıza olanak verir, bundan sonra dinamik olarak kaydırılmış çizgiler artık dikey olarak hizalanmayacaktır. Örneğin, %50’lik kısım, bunlar girinti seviyeleri ekranın genişliğinin %50’sinden daha derin olan çizgiler, sonraki kaydırılmış çizgilere uygulanan dikey hizalamaya sahip olmayacaktır.

source: Whitespace Highlighting
tr: Beyazalan Vurgulaması

source: Highlight tabulators
tr: Tablolayıcıları Vurgula

source: The editor will display a &raquo; symbol to indicate the presence of a tab in the text.
tr: Düzenleyci metindeki sekmenin varlığını girintilemek için &raquo; sembolünü görüntüleyecektir.

source: Highlight trailing spaces
tr: Sondaki boşlukları vurgula

source: The editor will display dots to indicate the presence of extra whitespace at the end of lines.
tr: Editör, satırların sonunda ekstra beyaz boşluk varlığını göstermek için noktalar gösterecektir.

source: <guilabel>Advanced</guilabel>
tr: <guilabel>Gelişmiş</guilabel>

source: Show indentation lines
tr: Girinti satırlarını göster

source: If this is checked, the editor will display vertical lines to help identifying indent lines.
tr: Bu işaretlenirse, düzenleyici girinti satırlarının tanımlanmasına yardımcı olmak için dikey çizgiler görüntüler.

source: Highlight range between selected brackets
tr: Seçilen parantezler arasındaki aralığı vurgula

source: If this is enabled, the range between the selected matching brackets will be highlighted.
tr: Bu etkin ise, seçilmiş eşleşen parantezler arasındaki aralık vurgulanacaktır.

source: <title>Borders</title>
tr: <title>Kenarlıklar</title>

source: <guilabel>Borders</guilabel>
tr: <guilabel>Kenarlıklar</guilabel>

source: Show folding markers (if available)
tr: Katlama işaretlerini göster (eğer kullanılabilir ise)

source: If this option is checked, the current view will display marks for code folding, if code folding is available.
tr: Bu seçenek işaretliyse, geçerli görünüm kod katlama mevcut ise kod katlama için işaretleri gösterecektir.

source: Show icon border
tr: Simge kenarlığını göster

source: If this is checked, you will see an icon border on the left hand side. The icon border shows bookmark signs for instance.
tr: Eğer bu seçili ise, sol tarafta simge kenarlığını göreceksiniz. Simge kenarlığı girintileme için yer imi işaretlerini gösterir.

source: Show line numbers
tr: Satır numaralarını göster

source: If this is checked, you will see line numbers on the left hand side.
tr: Eğer bu seçili ise, sol tarafta satır numaralarını göreceksiniz.

source: Show scrollbar marks
tr: Kaydırma çubuğu işaretlerini göster

source: If this option is checked the current view will show marks on the vertical scrollbar. These marks will for instance show bookmarks.
tr: Eğer bu seçenek seçili ise mevcut görünüm dikey kaydırma çubuğunda işaretleri gösterecektir. Bu işaretler örneğin yer imlerini gösterecektir.

source: Sort Bookmarks Menu
tr: Yer İmleri Menüsünü Sırala

source: By creation
tr: Oluşturmaya göre

source: Each new bookmark will be added to the bottom, independently from where it is placed in the document.
tr: Her yeni yer imi, belge içinde nereye yerleştirildiğinden bağımsız olarak, listenin en sonuna eklenecektir.

source: By position
tr: Konuma göre

source: The bookmarks will be ordered by the line numbers they are placed at.
tr: Yer imleri, yerleştirildikleri satırların numaraları ile sıralandırılacak.

source: Fonts &amp; Colors
tr: Yazı Tipleri &amp; Renkler

source: This section of the dialog lets you configure all fonts and colors in any color scheme you have, as well creating new schemes or deleting existing ones. Each scheme has settings for colors, fonts and normal and highlight text styles.
tr: İletişim kutusunun bu bölümü, sahip olduğunuz renk şemasındaki tüm yazı tiplerini ve renkleri yapılandırmanıza, ayrıca yeni şemalar oluşturmanıza veya varolanları silmenize olanak tanır. Her şemada renkler, yazı tipleri ve normal ve vurgulanmış metin stilleri için ayarlar bulunur.

source: &kappname; will preselect the currently active scheme for you, if you want to work on a different scheme start by selecting that from the <guilabel>Schema</guilabel> combobox. With the <guibutton>New</guibutton> and <guibutton>Delete</guibutton> button you can create a new scheme or delete existing ones.
tr: &kappname; mevcut aktif şemayı sizin için seçecektir, eğer farklı bir şemada çalışmak isterseniz bunu <guilabel>Şema</guilabel> çoklu seçim kutusundan seçerek başlayın. <guibutton>Yeni</guibutton> ve <guibutton>Sil</guibutton> tuşları ile yeni bir şema oluşturabilir ya da mevcut olanları silebilirsiniz.

source: At the bottom of the page you can select the <guilabel>Default schema for &kappname;</guilabel>.
tr: Sayfanın sonundan <guilabel>&kappname; için varsayılan şema</guilabel> seçebilirsiniz.

source: Colors
tr: Renkler

source: Text Area Background
tr: Metin Bölgesi Arkaplanı

source: Normal text
tr: Normal metin

source: This is the default background for the editor area, it will be the dominant color on the editor area.
tr: Bu editör alanının varsayılan arka planıdır, editör alanında baskın renk olacaktır.

source: Selected text
tr: Seçili metin

source: This is the background for selected text. The default is the global selection color, as set in your &plasma; color preferences.
tr: Bu seçilen metin için arkaplandır. Varsayılan &plasma; renk tercihleri içerisinden de ayarlandığı gibi genel seçim rengidir.

source: Current line
tr: Mevcut satır

source: Set the color for the current line. Setting this a bit different from the Normal text background helps to keep focus on the current line.
tr: Mevcut satırın rengini ayarla. Bunu ayarlamak Normal metin arkaplan ayarlamaktan biraz farklıdır mevcut satıra odaklı kalınmasına yardımcı olur.

source: Bookmark
tr: Yer İmi

source: This combobox lets you set overlay colors for various mark types. The color is mixed into the background color of a marked line, so that a line with more marks or a marked line that is current has a background that is a mix of more colors. The mark colors are also used if you enable display of scrollbar marks.
tr: Bu çoklu seçim kutusu çeşitli marke türleri için kaplama rengini ayarlamanıza olanak tanır. Renk, işaretli çizginin arkaplanı içerisinde karıştırılır, bu demektir ki daha fazla maskeli bir çizgi veya mevcut bir işaretli çizgi daha fazla renk karışımı olan bir arkaplana sahiptir. Renkler ayrıca kaydırma çubuğu maskelerini aktifleştirirseniz de kullanılır.

source: Additional Elements
tr: Ek Ögeler

source: Left border background
tr: Sol kenarlık arkaplanı

source: This color is used for the marks, line numbers and folding marker borders in the left side of the editor view when they are displayed.
tr: Bu renk, görüntülendiğinde editör görünümünün sol tarafındaki işaretler, çizgi numaraları ve katlama işaretleri kenarlıkları için kullanılır.

source: Line numbers
tr: Satır numaraları

source: This color is used to draw the line numbers on the left side of the view when displayed.
tr: Bu renk, görüntülendiği zaman görünümün sol tarafındaki çizgi numaralarını çizmek için kullanılır.

source: Bracket highlight
tr: Köşeli parantez vurgusu

source: This color is used to draw the background of matching brackets.
tr: Bu renk, eşleşen parantezlerin arka planını çizmek için kullanılır.

source: Word wrap markers
tr: Sözcük kaydırma işaretleri

source: This color is used to draw a pattern to the left of dynamically wrapped lines when those are aligned vertically, as well as for the static word wrap marker.
tr: Bu renk, dikey olarak hizalandıkları zaman dinamik olarak kaydırılmış çizgilerin solunda ve aynı zamanda statik sözcük kaydırma işaretçisi için bir desen çizmek için kullanılır.

source: Tab and space markers
tr: Sekme ve boşluk işaretleri

source: This color is used to draw white space indicators when enabled.
tr: Bu renk, etkinleştirildiği zaman beyaz boşluk göstergelerini çizmek için kullanılır.

source: Spelling mistake line
tr: Yazım yanlışı satırı

source: sets the color of the line that is used to indicate spelling mistakes.
tr: yazım yanlışlarını göstermek için kullanılan satırın rengini ayarlar.

source: Fonts
tr: Yazı Tipleri

source: Here you can choose the font for the schema. You can choose from any font available on your system, and set a default size. A sample text displays at the bottom of the dialog, so you can see the effect of your choices.
tr: Burada şema için yazı tipini seçebilirsiniz. Sisteminizde bulunan herhangi bir yazı tipini seçebilir ve varsayılan bir boyut ayarlayabilirsiniz. İletişim kutusunun altında örnek bir metin görüntülenir, böylece seçimlerinizin etkisini görebilirsiniz.

source: Normal Text Styles
tr: Normal Metin Biçemleri

source: The normal text styles are inherited by the highlight text styles, allowing the editor to present text in a very consistent way, for example comment text is using the same style in almost all of the text formats that &kappname; can highlight.
tr: Normal metin biçemleri, vurgu metni biçemleri tarafından devralınır, editörün metni çok tutarlı bir şekilde sunmasına izin verir, örneğin yorum metni hemen hemen tüm metin biçimlerinde &kappname; vurgulayabileceği aynı biçemi kullanır.

source: The name in the list of styles is using the style configured for the item, providing you with an immediate preview when configuring a style.
tr: Biçem listesindeki ad öge için yapılandırılan biçemi kullanır ve biçem yapılandırırken anında önizleme sağlar.

source: Each style lets you select common attributes as well as foreground and background colors. To unset a background color, rightclick to use the context menu.
tr: Her biçem, ortak nitelikleri yanı sıra ön plan ve arka plan renkleri seçmenizi sağlar. Arka plan rengini kaldırmak için içerik menüsünü kullanmak için sağ tıklayın.

source: Highlighting Text Styles
tr: Metin Biçemleri Vurgusu
