Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/krusader_faq.po
Languages: tr

source: Frequently Asked Questions (&FAQ;)
tr: Sıkça Sorulan Sorular (&SSS;)

source: <primary>FAQ</primary>
tr: <primary>SSS</primary>

source: The &FAQ; is divided into three sections: <itemizedlist> <listitem> <para> <link linkend="faq_installation">Installation &FAQ;</link> (this page)</para> </listitem> <listitem> <para> <link linkend="faq_usage">Usage &FAQ;</link> (issues with running/using &krusader;)</para> </listitem> <listitem> <para> <link linkend="faq_general">General &FAQ;</link> (bug reports, forum, mailing list, ...)</para> </listitem> </itemizedlist>If you feel that a &FAQ; is missing or if something is not clear to you, please <link linkend="editors_note">let us know</link>.
tr: &SSS; üç kısma ayrılmıştır: <itemizedlist> <listitem> <para> <link linkend="faq_installation">Kurulum &SSS;</link> (this page)</para> </listitem> <listitem> <para> <link linkend="faq_usage">Kullanım &SSS;</link> (&krusader; çalıştırma/kullanmayla ilgili sorunlar)</para> </listitem> <listitem> <para> <link linkend="faq_general">Genel &SSS;</link> (hata raporları, forum, posta listesi, ...)</para> </listitem> </itemizedlist>Bir &SSS; eksikliği hissederseniz veya bir şey yeterince açık gelmezse, lütfen <link linkend="editors_note">bize haber verin</link>.

source: Installation &FAQ;
tr: Kurulum &SSS;

source: Does &krusader; need &plasma; to run?
tr: &Krusader; çalışmak için &plasma;'ya ihtiyaç duyar mı?

source: To summarize, if you want a working &krusader; - install &kf5-full;. If you want a functional &krusader; then you need &kf5-full; and some additional &plasma; packages. For maximum functionality, &krusader; needs some &kde; Applications (&ark;, &kdiff3;, <application>KRename</application>), but the &plasma; window manager is optional.
tr: Özetlemek gerekirse, çalışan bir &krusader; istiyorsanız - &kf5-full; kurun. İşlevsel bir &krusader; istiyorsanız &kf5-full; ve bazı ek &plasma; paketlerine ihtiyacınız vardır. Azami işlevsellik için &krusader; bazı &kde; Uygulamalarına ihtiyaç duyar (&ark;, &kdiff3;, <application>KRename</application>), ama &plasma; pencere yöneticisi isteğe bağlıdır.

source: Check if your distribution provides &krusader;, if it does not then contact your distribution creator and ask them to include &krusader;!
tr: Dağıtımınızın &krusader; sağlayıp sağlamadığını kontrol edin, sağlamıyorsa dağıtım oluşturucunuzla iletişim kurarak &krusader;'i dahil etmelerini isteyebilirsiniz!

source: I am having trouble compiling and installing &krusader;, how do I send a help request?
tr: &krusader; derleme ve kurmada sorun yaşıyorum, yardım isteği nasıl göndereceğim?

source: Use the search function on the <ulink url="https://forum.kde.org/viewforum.php?f=225">&kde; Forum</ulink>, your problem might be solved or discussed already.
tr: <ulink url="https://forum.kde.org/viewforum.php?f=225">&kde; Forumunda</ulink> arama işlevini kullanın, probleminiz çözülmüş ya da daha önce tartışılmış olabilir.

source: If you cannot find a solution, please make a note of the following issues: <itemizedlist> <listitem> <para>the &krusader; version used</para> </listitem> <listitem> <para>the &Linux; distribution + version used</para> </listitem> <listitem> <para>a good description of the problem</para> </listitem> </itemizedlist>Without this information, it is very difficult for us to help you.
tr: Bir çözüm bulamazsanız, lütfen şu konuları açıkça yazın: <itemizedlist> <listitem> <para>kullanılan &krusader; sürümü</para> </listitem> <listitem> <para>&Linux; dağıtımı ve sürümü</para> </listitem> <listitem> <para>problemin iyi bir açıklaması</para> </listitem> </itemizedlist>Bu bilgiler olmadan, size yardım etmemiz çok zordur.

source: If you give us the error messages (&eg; <command>make</command> error messages) please start with the FIRST error message, all the error messages which follow the first error message are consequences and not the cause of your problem.
tr: Eğer hata iletilerini de gönderirseniz (&örn; <command>make</command> hata iletileri) lütfen İLK hata iletisinden başlayarak, tüm hata iletilerini gönderin çünkü sonraki hatalar sorunun sebebi değil ilk hatanın sonuçları olabilir.

source: Send out your help request.
tr: Yardım isteğinizi gönderin.

source: Thank you for your co-operation!
tr: İşbirliğiniz için teşekkürler!

source: Why does &krusader;-git show an old version number in the about box?
tr: &Krusader-git; hakkında kutusunda neden eski bir sürüm numarası gösteriyor?

source: Because we only change the version number just before we do a new release. &krusader;-git will show an older version number, so ignore the version number and check the download date. We simply have not yet decided what the next version number will be.
tr: Çünkü sürüm numarasını yeni bir sürüm yapmadan önce değiştiriyoruz. &krusader;-git eski bir sürüm numarası gösterecektir, sürüm numarasını göz ardı edin ve indirme tarihini kontrol edin. Sonraki sürüm numarasının ne olacağına henüz karar vermedik.

source: Usage &FAQ;
tr: Kullanım &SSS;

source: Why does &krusader; freeze or hang on a dead mountpoint?
tr: &krusader; ölü bir bağlantı noktasında neden donuyor ya da takılıyor?

source: When I try to resize &krusader; to make it smaller, I discover that I cannot resize it below a certain size. Why?
tr: &krusader;'i yeniden boyutlandırmaya çalıştığımda, belli bir boyun altına düşüremediğimi fark ettim. Neden?

source: See the <guibutton>F1, F2</guibutton> (&etc;) buttons? They are not allowing &krusader; to downsize as they have a minimum size. Just disable them <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Show FN Keys Bar</guimenuitem> </menuchoice> and you will be able to resize &krusader; to your liking. Since version 1.51 we have improved this greatly: when downsizing the buttons will look like 'F5 ..py'. When the button faces are too small to read a tooltip will give the complete text. The minimum width is 45 pixels for each button.
tr: <guibutton>F1, F2</guibutton> (&vs;) düğmelerini görüyor musunuz? Bir asgari boyutları olduğundan &krusader;'in boyut küçültmesine izin vermiyorlar. <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>FN Anahtarları Çubuğunu Göster</guimenuitem></menuchoice> ile kapatırsanız &krusader;'i istediğiniz gibi yeniden boyutlandırabilirsiniz. 1.5.1 sürümünden bu yana bunu epey geliştirdik: küçültürken düğmeler 'F5..py' gibi görünecek. Düğme yüzleri okumak için çok küçük olursa bir araç ipucu tüm metni verecek. Asgari genişlik her düğme için 45 pikseldir.

source: What to do if an external tool does not seem to work?
tr: Harici bir araç çalışmıyor gibi görünüyorsa ne yapmalı?

source: &krusader; uses several programs as <link linkend="konfig-dependencies">external tools</link>, and sometimes they appear not to work. Open a terminal and check if tool foo is installed. <screen><prompt>$</prompt> <userinput><command>foo</command></userinput></screen> Check if tool foo is properly configured in the <link linkend="konfig-dependencies">Konfigurator Dependencies page</link>. For Archiving tools: autodetect the archives again with the <guibutton>Auto Configure</guibutton> button in the <link linkend="konfig-archives">Konfigurator archive page</link>. Check the <link linkend="konfig-protocols">Konfigurator Protocol page</link> If it does not work, backup your <filename><envar>XDG_CONFIG_HOME</envar>/krusaderrc</filename> (default is <filename>$<envar>HOME</envar>/.config/krusaderc</filename>) configuration file and remove it from this location. Restart &krusader;, &krusader; will now start the first start configuration wizard, follow these guidelines.
tr: &krusader; birçok programı <link linkend="konfig-dependencies">harici araçlar</link> olarak kullanır ve bazen bunlar çalışmaz. Bir uçbirim açın ve aracın kurulu olup olmadığını kontrol edin. <screen><prompt>$</prompt> <userinput><command>arac</command></userinput></screen> Arac aracının düzgün yapılandırılıp yapılandırılmadığını <link linkend="konfig-dependencies">Konfigurator Bağımlılıkları sayfasında</link> kontrol edin. Arşivleme araçları için: arşivleri <link linkend="konfig-archives">Konfigurator arşiv sayfasındaki</link> <guibutton>Otomatik Yapılandırma</guibutton> ile tekrar algılatın. Çalışmazsa <link linkend="konfig-protocols">Konfigurator İletişim kuralı sayfasını</link> kontrol edin, <filename><envar>XDG_CONFIG_HOME</envar>/krusaderrc</filename> dosyanızı yedekleyin (öntanımlı olarak <filename>$<envar>HOME</envar>/.config/krusaderc</filename>) ve bu konumdan kaldırın. &krusader;'i yeniden başlatın, &krusader; artık ilk yapılandırma sihirbazını çalıştıracaktır, bu kılavuzu takip edin.

source: How to executing jar files (and not enter the jar archive)?
tr: Jar dosyalarını çalıştırmak (jar arşivine girmeden)?

source: Go to the <link linkend="konfig-protocols">Konfigurator Protocol page</link> and remove <guilabel>application/x-jar</guilabel> from the krarc node, &krusader; should no longer enter the archive. Global file associations are handled by &plasma; and not by &krusader;. To associate the jar extension:
tr: <link linkend="konfig-protocols">Konfigurator İletişim Kuralı sayfasına</link> gidin ve krarc düğümünden <guilabel>application/x-jar</guilabel>'ı kaldırın, artık arşive girmiyor olmalı. Genel dosya ilişkileri &plasma; tarafından ele alınır, &krusader; değil. jar eklentisini ilişkilendirmek için:

source: Open &plasma; &systemsettings;: <application>systemsettings</application>
tr: &Plasma; &systemsettings;'i açın: <application>systemsettings</application>

source: <guimenu>Applications</guimenu> <guimenuitem>File Associations</guimenuitem>
tr: <guimenu>Uygulamalar</guimenu> <guimenuitem>Dosya İlişkileri</guimenuitem>

source: Enter <filename>jar</filename> as filename pattern
tr: Dosya adı kalıbı olarak <filename>jar</filename> girin

source: Add <filename>java</filename> as application
tr: Uygulama olarak <filename>java</filename> ekleyin

source: Why do I have trouble with my &FTP; connection?
tr: Neden &FTP; bağlantımla ilgili sorunum var?

source: The reason for this error is that '&FTP; via &HTTP; proxy' feature is not yet supported by &krusader;. This error may be caused by a misconfiguration of the proxy settings in &systemsettings;. Modify the proxy settings to not use &HTTP; proxy and &FTP; will work.
tr: Bu hatanın sebebi '&HTTP; aracılığıyla &FTP;' özelliğinin henüz &krusader; tarafından desteklenmemesidir. Bu hata &systemsettings; içindeki vekil ayarlarında bir yapılandırma eksikliği yüzünden olabilir. Vekil ayarlarını &HTTP; vekil kullanmayacak şekilde yapılandırırsanız &FTP; çalışacaktır.

source: How do not add <literal role="extension">.part</literal> suffix when copying files via &FTP;?
tr: Dosyaları &FTP; ile kopyalarken<literal role="extension">.part</literal> sonekini eklememenin yolu?

source: When uploading files a <literal role="extension">.part</literal> suffix is added to the filename, once the upload is complete the filename is renamed automagically to remove the <literal role="extension">.part</literal> suffix. This works great but sometimes some &FTP; servers do not allow a rename operation. You can solve this by unchecking the checkbox <guilabel>Mark partially uploaded files</guilabel> in &plasma; &systemsettings;. The check box is located at <menuchoice> <guimenu>Network</guimenu> <guimenuitem>Settings</guimenuitem> <guimenuitem>Connection Preferences</guimenuitem> </menuchoice>.
tr: Dosyaları yüklerken dosya ismine bir <literal role="extension">.part</literal> soneki eklenir, yükleme tamamlandığında dosya ismi otomatik olarak <literal role="extension">.part</literal> soneki kaldırılmış şekilde yeniden adlandırılır. Bu gayet iyi çalışır ama bazen &FTP; sunucuları yeniden isimlendirme işlemine izin vermezler. Bunu &plasma; &systemsettings; içinde <guilabel>Bir kısmı yüklenen dosyaları işaretle</guilabel> kontrol kutusundan işareti kaldırarak çözebilirsiniz. Kontrol kutusu <menuchoice><guimenu>Ağ</guimenu> <guimenuitem>Ayarlar</guimenuitem> <guimenuitem>Bağlantı Seçenekleri</guimenuitem> </menuchoice> altındadır.

source: How can I close a remote connection (&eg; a &FTP; connection)?
tr: Bir uzak bağlantıyı nasıl kapatırım (&örn; &FTP; bağlantısını)?

source: It is explained in the <link linkend="remote-connections">remote connections chapter</link>.
tr: <link linkend="remote-connections">Uzak bağlantılar bölümünde</link> açıklanmıştır.

source: I am experiencing problems with the media:/ protocol, why?
tr: media:/ iletişim kuralıyla sorunlar yaşıyorum, neden?

source: The media:/ protocol was removed since &kde; 4. Please use mtp:/ protocol instead.
tr: media:/ iletişim kuralı &kde; 4 sürümünden beri kaldırıldı. Lütfen bunun yerine mtp:/ iletişim kuralını kullanın.

source: How can I disable the default sounds, &eg; when I do a delete action?
tr: Bir silme yaptığımda vs. çalan öntanımlı sesi nasıl kapatabilirim?

source: Where the remote connection manager?
tr: Uzak bağlantı yöneticisi nerde?

source: Use our Bookmark Manager. Use a <link linkend="remote-connections">remote &URL;</link> and bookmark it.
tr: Yerimi Yöneticimizi kullanın. Bir <link linkend="remote-connections">uzak &URL;</link> kullanın ve yerimine ekleyin.

source: Where is Konfigurator, do i need to install the &plasma; to use it?
tr: Konfigurator nerde, kullanmak için &plasma; kurmalı mıyım?

source: How can I set the look &amp; feel of 2 different users to be the same?
tr: İki ayrı kullanıcının görünüm &amp; davranışını nasıl aynı olacak şekilde ayarlarım?

source: Presuming that the current setup is the good configuration, you can copy the configuration to the other user. <screen><prompt>#</prompt> <userinput><command>cp ~/.config/krusaderrc /home/foo_user/.config</command></userinput></screen> And when the other user is Root use:
tr: Mevcut kurulumun iyi bir yapılandırma olduğunu varsayarak, yapılandırmayı başka bir kullancıya kopyalayabilirsiniz. <screen><prompt>#</prompt> <userinput><command>cp ~/.config/krusaderrc /home/foo_kullanicisi/.config</command></userinput></screen> Diğer kullanıcı Root olduğunda şunu kullanın:

source: General &FAQ;
tr: Genel &SSS;

source: How can I report a wish, a suggestion, or a comment?
tr: Bir istek, öneri veya yorum nasıl biliririm?

source: How can I send a patch?
tr: Nasıl yama yollarım?

source: It is not easy to write patch guidelines, but here are some.
tr: Yama kılavuzları yazmak kolay değil, ama biraz değinelim.

source: Patches, new code or new features are always welcome!
tr: Yamalar, yeni kod veya yeni özellikleri her zaman bekleriz!

source: Focus only on one problem at a time, so the developers can easily understand you, and commit your patch it works.
tr: Bir kerede bir soruna odaklanın, böylecek geliştiriciler sizi kolayca anlar, ve yamanız çalışıyorsa gönderir.

source: A final note: always keep in mind a patch might be rejected. Either it has side effects, which we could not fix or it contradicts with the idea behind the patched module. In this sense, a software project differs from, let's say a wiki: a software project has to have someone to make all the final decisions. Otherwise the software will not work. Furthermore: keep in mind that the examination of patches might take time, as we all have private lives.
tr: Son bir not: bir yamanın kabul edilmeyebileceğini her zaman aklınızda tutun. Düzeltemeyeceğimiz yan etkileri olabilir veya yamalanan modülün arkasındaki fikirle çatışıyordur. Bu açıdan bir yazılım projesi bir diğerinden farklılaşabilir, örneğin bir wiki: yazılım projesi tüm son kararları alacak birine sahip olmalıdır. Aksi halde yazılım çalışmayacaktır. Dahası: yamaların incelenmesinin belli bir süre alacağını unutmayın, hepimizin özel hayatları da var.

source: How can I report a bug?
tr: Nasıl bir hata raporlarım?

source: Bugs?!?!? Well, ok.... We have an online Bug Tracking System.
tr: Hatalar?!?!? Tabi bir çevrimiçi Hata Takip Sistemimiz var.

source: Using the online bug-tracker helps us have a clear and orderly way to know how many bugs are open, bug priority and follow-ups. It saves us from browsing through the entire &krusader; forum, searching for yesterdays bug. Please use this system.
tr: Çevrimiçi hata-takibini kullanmak kaç tane hatanın açık olduğunu, hata önceliklerini ve takibini açık ve düzenli bir şekilde görmemizi sağlamaya yardımcı olur. Dünden bir hata için tüm &krusader; forumunu tarama derdinden kurtarır. Lütfen bu sistemi kullanın.

source: Before reporting a bug, please read the following:
tr: Bir hata raporlamadan, lütfen aşağıdakini okuyun:

source: <emphasis role="bold">Check</emphasis> if the bug is already posted in the <ulink url="https://bugs.kde.org">online bug list</ulink> of the Bug Tracking System.
tr: Hatanın Hata Takip Sisteminin <ulink url="https://bugs.kde.org">çevrimiçi hata listesine</ulink> gönderilip gönderilmediğini <emphasis role="bold">kontrol edin</emphasis>.

source: If you cannot find this bug mentioned, please <emphasis role="bold">submit</emphasis> it into the bug tracker by clicking the <guibutton>Submit New</guibutton> button in the bug-tracker window. Please submit the following issues: the &krusader; version used, the &Linux; distribution + version used, processor type, and as good a description of the problem as you can manage.
tr: Bu hatadan bahsedildiğini bulamazsanız, lütfen hata takip penceresindeki <guibutton>Yeni Gönder</guibutton> düğmesine tıklayarak <emphasis role="bold">gönderin</emphasis>. Lütfen aşağıdaki şeyleri gönderin: kullanılan &krusader; sürümü, kullanılan &Linux; dağıtımı + sürümü, işlemci türü, ve sorunun olabildiğince iyi bir tanımı.

source: How can i send good debug or crash reports?
tr: Nasıl iyi hata yıklama ve çökme raporları gönderirim?

source: What to do if the KDEcrashhandler sends no useful backtrace information?
tr: KDEcrashhandler faydalı geri izleme bilgisi göndermezse ne yapmalı?

source: Does &krusader; have a mailing list?
tr: &krusader; bir posta listesine sahip mi?

source: Tip. our mailing lists can be browsed online or read with a newsreader, so that you do not even need to subscribe to follow the action on the mailing lists.
tr: İpucu. posta listelerimiz çevrimiçi olarak taranabilir ve bir haber okuyucuyla okunabilir, yani posta listelerindeki hareketleri takip etmek için üye olmanıza gerek yoktur.

source: Does &krusader; provide news feeds?
tr: &krusader; haber kaynağı sağlıyor mu?

source: How does the &krusader; forum work?
tr: &krusader; forumu nasıl çalışıyor?

source: In the spirit of freedom of speech, everything that is &krusader; related can be discussed in our forum. It does not matter if you are a newcomer or an advanced user, everyone is welcome. An open source project's greatest strength is derived from getting user feedback. That is why we love to hear what you have to say. With your feedback we can make &krusader; better and better; otherwise, we are not aware of issues and ideas you may have. But please remember the following, so that we can maintain some order in the chaos.
tr: Konuşma özgürlüğü ruhu adına, &krusader; ile ilgili her şey forumumuzda konuşulabilir. Yeni gelmiş olmanız veya ileri seviye kullanıcı olmanız fark etmez, herkese hoşgeldin deriz. Bir açık kaynak projenin en büyük gücü kullanıcı geri beslemesi almasından gelir. Bu yüzden söylediklerinizi duymak isteriz. Geri beslemenizle &krusader;'i daha da iyi hale getirebiliriz; aksi halde fikirleriniz veya sorunlar hakkında bilgimiz olmaz. Ama lütfen kaos içinde bir düzeni sağlayabilmemiz için şunları unutmayın.

source: Please use the search function of the <ulink url="https://forum.kde.org/viewforum.php?f=225">&kde; Forum</ulink>, your issue may have been previously discussed (this allows us to minimize the double/triple/... postings). If your issue has already been discussed in the past there is a great chance that you will have an instant solution to your problem. If the issue is currently being discussed, you can join in the discussion. Some questions are asked over and over again, that is why we have created this <link linkend="faq">FAQ</link>. This allows us to spend more time developing &krusader;.
tr: Lütfen <ulink url="https://forum.kde.org/viewforum.php?f=225">&kde; Forumunun</ulink> arama işlevini kullanın, sorununuz daha önce tartışılmış olabilir (bu bize birden çok gönderileri engelleme imkanı sağlar). Sorunuz zaten tartışılmışsa muhtemelen anında bir çözüm bulacaksınız. Sorun hali hazırda tartışılıyorsa siz de katılabilirsiniz. Bazı sorular tekrar tekrar sorulur bu yüzden bu <link linkend="faq">SSS</link>i oluşturduk. Bu bize &krusader;'i geliştirmek için daha çok vakit bırakır.

source: How can I translate &krusader; into my native language?
tr: &krusader;'i ana dilime nasıl çeviririm?

source: How can I support &krusader;?
tr: &krusader;'i nasıl desteklerim?

source: You can <link linkend="help_krusader"> support</link> &krusader; in many different ways. Please send us <link linkend="faqg_wish">feedback</link>, <link linkend="faqg_bug_report">bug reports</link>, patches, <link linkend="help_krusader">donations</link>, translations, ...
tr: &krusader;'i birçok farklı yolla <link linkend="help_krusader">desteleyebilirsiniz</link>. Lütfen bize <link linkend="faqg_wish">geri bildirim</link>, <link linkend="faqg_bug_report">hata raporları</link>, yamalar, <link linkend="help_krusader">bağışlar</link>, çeviriler vs. gönderin ...

source: The two panels and a commandline are available, all the other stuff like <link linkend="features">OFM features</link> and the <link linkend="gloss-ofm">OFM</link> interaction with the user is missing from this profile.
tr: İki panel ve bir komut satırı kullanılabilir, <link linkend="features">OFM özellikleri</link> ve <link linkend="gloss-ofm">OFM</link> gibi diğer şeyler bu profilde değiller.

source: Why should I use an <link linkend="gloss-ofm">OFM</link>?
tr: Neden bir <link linkend="gloss-ofm">OFM</link> kullanmalıyım?
