Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/krusader_viewer-editor.po
Languages: tr

source: Here you can edit the text styles used by a specific highlight definition. The editor preselects the highlight used by your current document. To work on a different highlight, select one in the <guilabel>Highlight</guilabel> combobox above the style list.
tr: Buradan metin türlerini belirli bir vurgulama tanımlaması kullanarak düzenleyebilirsiniz. Düzenleyici mevcut belgeniz tarafından kullanılan vurguyu önceden seçer. Başka bir vurguda çalışmak için biçem listesi içindeki <guilabel>Vurgu</guilabel> çoklu seçim kutusu içerisinden birini seçin.

source: Each style lets you select common attributes as well as foreground and background colors. To unset a background color, rightclick to use the context menu. In addition you can see if a style is equal to the default style used for the item, and set it to that if not.
tr: Her bir biçem önplan ve arkaplan renklerinin yanında genel öznitelikleri de seçmenize izin verir. Arkaplan rengini kaldırmak için bağlam menüsü kullanmak için sağ tıklayın. Ek olarak, biçemin öge için kullanılan varsayılan biçeme denk olup olmadığını görebilir, eğer değilse de ayarlayabilirsiniz.

source: You will notice that many highlights contain other highlights represented by groups in the style list. For example most highlights import the Alert highlight, and many source code formats imports the Doxygen highlight. Editing colors in those groups only affects the styles when used in the edited highlight format.
tr: Biçem listesinde başka vurgular içeren pek çok vurgunun gruplar içerisinde temsil edildiğini fark edeceksiniz. Örneğin çoğu vurgu Uyarı vurgusunu içeri aktarır, ve pek çok kaynak kodu biçimi Doxygen vurgusunu içe aktarır. Bu gruplardaki renkleri düzenlemek biçemleri sadece düzenlenen vurgu biçimi içerisinde kullanıldıkları zaman etkiler.

source: Editing
tr: Düzenleme

source: Static Word Wrap
tr: Durağan Sözcük Kaydırma

source: Word wrap is a feature that causes the editor to automatically start a new line of text and move (wrap) the cursor to the beginning of that new line. &kappname; will automatically start a new line of text when the current line reaches the length specified by the <link linkend="katepart-pref-wrap-words-at">Wrap Words At:</link> option.
tr: Kelime kaydırma özelliği, düzenleyicinin metinde otomatik olarak yeni satır başlatmasına ve imleci bu yeni satır başına hareket ettirmesine (aydırmasına) sebep olur. &kappname; mevcut satır <link linkend="katepart-pref-wrap-words-at">Kelimeleri Şurada Kaydır:</link> seçeneği içerisinde belirtilen aralığına ulaştığı zaman otomatik olarak yeni bir satır başlatır.

source: Enable static word wrap
tr: Durağan sözcük kaydırmayı etkinleştir

source: Turns static word wrap on or off.
tr: Durağan sözcük kaydırmayı açar veya kapatır.

source: Show static word wrap markers (if applicable)
tr: Durağan sözcük kaydırma işaretlerini göster (kullanılabilir ise)

source: Wrap words at:
tr: Sözcükleri şurada kaydır:

source: If the <link linkend="katepart-pref-word-wrap">Enable static word wrap</link> option is selected this entry determines the length (in characters) at which the editor will automatically start a new line.
tr: Eğer <link linkend="katepart-pref-word-wrap">Durağan kelime kaydırmasını etkinleştir</link> seçeneği seçili ise bu girdi hangi uzunluğun (karakter olarak) hangi düzenleyicide otomatik olarak yeni bir satır başlatacağına karar verir.

source: Misc
tr: Çeşitli

source: Remove trailing spaces while editing
tr: Düzenleme esnasında sondaki boşlukları kaldır

source: &kappname; will automatically eliminate extra spaces at the ends of lines of text.
tr: &kappname; metnin satırlarının sonundaki ek boşlukları otomatik olarak eleyecektir.

source: Auto brackets
tr: Otomatik parantezler

source: When the user types a left bracket ([, (, or {) &kappname; automatically enters the right bracket (}, ), or ]) to the right of the cursor.
tr: Kullanıcı bir sol parantez yazdığı zaman ([, (, veya {) &kappname; sağ parantezi (}, ), veya ]) otomatik olarak imlecin sağına ekler.

source: Copy/Cut the current line if no selection
tr: Eğer seçim yoksa mevcut satırı Kopyala/Kes

source: If this option is enabled and the text selection is empty, copy and cut action are performed for the line of text at the actual cursor position.
tr: Bu seçenek etkinleştirilirse ve metin seçimi boşsa, imlecin gerçek konumunda metin satırı için kopyalama ve kesme eylemi gerçekleştirilir.

source: Allow scrolling past the end of the document
tr: Belgenin sonunu geçtikten sonra kaydırmaya izin ver

source: This option lets you scroll past the end of the document. This can be used to vertically centre the bottom of the document, or put it on top of the current view.
tr: Bu seçenek belgenin sonun kaydırmanızı sağlar. Bu, belgenin sonunu dikey olarak ortalamak veya geçerli görünümün en üstüne koymak için kullanılabilir.

source: Cursor &amp; Selection
tr: İmleç &amp; Seçimi

source: Text Cursor Movement
tr: Metin İmleci Hareketi

source: Smart home and smart end
tr: Akıllı başlangıç ve akıllı son

source: When selected, pressing the home key will cause the cursor to skip white space and go to the start of a line's text.
tr: Seçili olduğu zaman, home tuşuna basılması imlecin beyaz boşlukları atlamasına ve satırın başındaki metne gitmesine sebep olur.

source: Wrap cursor
tr: İmleci kaydır

source: When off, the insertion cursor cannot be moved left of the line start, but it can be moved off the line end, which can be very handy for programmers. When this option is chosen, moving the cursor with the arrow keys off the end of a line (to the right) causes it to jump down to the beginning of the next line. Likewise when the cursor is moved past the beginning of a line (to the left) it jumps up to the end of the preceding line. When this option is not selected, moving the cursor right past the end of a line merely causes it to continue horizontally in the same line and trying to move it left past the beginning does nothing.
tr: Kapalıyken, ekleme imleci satır başlangıcından sola hareket ettirilemez, ancak programcılar için çok kullanışlı olabilen satır sonundan çıkarılabilir. Bu seçenek seçildiğinde, imleci bir satırın sonundaki ok tuşlarıyla (sağda) hareket ettirmek, bir sonraki satırın başına atlamasına neden olur. Benzer şekilde, imleç bir çizginin başlangıcından (sola) geçtiğinde, önceki satırın sonuna kadar atlar. Bu seçenek seçilmediğinde, imlecin bir çizginin sonundan hemen sonra hareket ettirilmesi, sadece aynı çizgide yatay olarak devam etmesine ve başlangıcını geride bırakmaya çalışmasına neden olur.

source: PageUp/PageDown moves cursor
tr: PageUp/PageDown imleci hareket ettirir

source: Autocenter cursor (lines):
tr: İmleci otomatik ortala (satırlar):

source: Sets the number of lines to maintain visible above and below the cursor when possible.
tr: Mümkün olduğu zaman imlecin üzerinde ve altında görünecek satır sayısını ayarlar.

source: Text Selection Mode
tr: Metin Seçim Kipi

source: Selections will be overwritten by typed text and will be lost on cursor movement.
tr: Seçimler yazılı metin tarafından üzerine yazıma uğrayacaktır ve imleç hareketi ile kaybolacaktır.

source: Persistent
tr: Kalıcı

source: Selections will stay even after cursor movement and typing.
tr: Seçimler imleç hareketi ve yazmadan sonra bile kalacaktır.

source: Indentation
tr: Girintileme

source: Default Indentation mode:
tr: Varsayılan girintileme kipi:

source: Select the automatic indentation mode you want to use as default. It is strongly recommended to use <userinput>None</userinput> or <userinput>Normal</userinput> here, and use filetype configurations to set other indentation modes for text formats like C/C++ code or &XML;.
tr: Varsayılan olarak kullanmak istediğiniz girintileme kipini seçin. Burada <userinput>Hiçbiri</userinput> veya <userinput>Normal</userinput> kullanmanız özellikle tavsiye edilir, C/C++ kodları veya &XML; gibi diğer metin biçimleri için diğer girintileme kiplerini ayarlamak için dosya tipi yapılandırmalarını kullanın.

source: Indent using
tr: Kullanılan girintileme

source: Tabulators
tr: Tablolayıcılar

source: When this is enabled the editor will insert tabulator characters when you press the &Tab; key or use <ulink url="help:/katepart/kate-part-autoindent.html">automatic indentation</ulink>.
tr: Bu etkinleştirildiğinde, &Tab; tuşuna bastığınızda ya da <ulink url="help:/katepart/kate-part-autoindent.html">otomatik girintileme</ulink> kullandığınızda düzenleyici sekme karakterleri ekleyecektir.

source: Spaces
tr: Boşluklar

source: When this is enabled the editor will insert a calculated number of spaces according to the position in the text and the <option>tab-width</option> setting when you press the &Tab; key or use <ulink url="help:/katepart/kate-part-autoindent.html">automatic indentation</ulink>.
tr: Bu etkileştirildiği zaman, düzenleyici metnin içindeki konuma göre ve &Tab; tuşuna bastığınız zaman <option>sekme-genişliği</option> ayarına göre veya <ulink url="help:/katepart/kate-part-autoindent.html">otomatik girintileme</ulink> kullandığınız zaman hesaplanan sayıda boşluk ekleyecektir.

source: Tabulators and Spaces
tr: Tablolayıcılar ve Boşluklar

source: When this is enabled, the editor will insert spaces as describe above when indenting or pressing &Tab; at the beginning of a line, but insert tabulators when the &Tab; key is pressed in the middle or end of a line.
tr: Bu etkinleştirildiğinde, yukarıda anlatıldığı gibi girintileme yapıldığında ya da satır başında &Tab; tuşuna basıldığında düzenleyici boşluk ekleyecektir fakat satırın ortasında ya da sonunda iken &Tab; tuşu sekme ekleyecektir.

source: Tab width:
tr: Sekme genişliği:

source: This configures the number of spaces that are displayed in place of a tabulator character.
tr: Bu, bir tablolayıcı karakterinin yerine görüntülenen boşluk sayısını yapılandırır.

source: Indentation width:
tr: Girintileme genişliği:

source: The indentation width is the number of spaces which is used to indent a line. If configured to indent using tabulators, a tabulator character is inserted if the indentation is divisible by the tab width.
tr: Girinti genişliği, bir çizgiyi girintilemek için kullanılan boşluk sayısıdır. Tablolayıcılar kullanılarak girintilemek üzere yapılandırılmışsa, girinti sekme genişliğine göre bölünebilirse bir tablolayıcı karakteri eklenir.

source: Indentation Properties
tr: Girintileme Özellikleri

source: Keep Extra Spaces
tr: Ek Boşlukları Koru

source: If this option is disabled, changing the indentation level aligns a line to a multiple of the width specified in <guilabel>Indentation width</guilabel>.
tr: Bu seçenek kapatılmış ise, girintileme seviyesini değiştirmek, satırı <guilabel>Girintileme genişliği</guilabel> içerisinde belirtilen genişliğin bir katına hizalar.

source: Adjust indentation of code pasted from the clipboard
tr: Panodan yapıştırılan kodun girintilemesini ayarla

source: If this option is selected, pasted code from the clipboard is indented. Triggering the <guimenuitem>Undo</guimenuitem> action removes the indentation.
tr: Eğer bu seçenek seçilmiş ise, panodan yapıştırılan kod girintilenir. <guimenuitem>Geri Al</guimenuitem> eyleminin tetiklenmesi girintilemeyi kaldırır.

source: Indentation Actions
tr: Girintileme Eylemleri

source: Backspace key in leading blank space unindents
tr: Baştaki boşlukta Backspace tuşu girintiyi azaltır

source: If this option is selected, the &Backspace; key decreases the indentation level if the cursor is located in the leading blank space of a line.
tr: Bu seçenek seçili ise, imleç satır başındaki önde gelen boş alanda konumlanmış ise &Backspace; tuşu girinti seviyesini azaldır.

source: Tab key action (if no selection exists)
tr: Tab tuşu eylemi (eğer seçim yok ise)

source: If you want &Tab; to align the current line in the current code block like in emacs, make &Tab; a shortcut to the action <guimenuitem>Align</guimenuitem>.
tr: Eğer emacs’teki gibi mevcut kod bloğunda mevcut satırı hizalamak için &Tab; kullanmak istiyorsanız, &Tab; tuşunu <guimenuitem>Hizala</guimenuitem> eylemi için bir kısayol olarak ayarlayın.

source: Always advance to the next tab position
tr: Her zaman sonraki sekme konumuna ilerle

source: If this option is selected, the &Tab; key always inserts white space so that the next tab position is reached. If the option <guilabel>Insert spaces instead of tabulators</guilabel> on the <guilabel>General</guilabel> tab in the <guilabel>Editing</guilabel> page is enabled, spaces are inserted; otherwise, a single tabulator is inserted.
tr: Eğer bu seçenek seçili ise, &Tab; tuşu daima beyaz alan ekler böylece bir sonraki tab konumuna ulaşılmış olur. Eğer <guilabel>Tablolar yerine boşlukları ekle</guilabel> seçeneği seçili ise <guilabel>Düzenleme</guilabel> içerisindeki <guilabel>Genel</guilabel> sekmesi üzerindeki sayfa etkinleştirilmiş ise, boşluklar eklenir; aksi halde tekil bir tablo eklenir.

source: Always increase indentation level
tr: Girinti seviyesini her zaman yükselt

source: If this option is selected, the &Tab; key always indents the current line by the number of character positions specified in <guilabel>Indentation width</guilabel>.
tr: Bu seçenek seçili ise, &Tab; tuşu mevcut satırı <guilabel>Girinti genişliği</guilabel> içerisinde belirtilmiş olan karakter konumları ile daima girintiler.

source: Increase indentation level if in leading blank space
tr: Önde gelen boşluktaysa girinti seviyesini artırın

source: If this option is selected, the &Tab; key either indents the current line or advances to the next tab position. If the insertion point is at or before the first non-space character in the line, or if there is a selection, the current line is indented by the number of character positions specified in <guilabel>Indentation width</guilabel>. If the insertion point is located after the first non-space character in the line and there is no selection, white space is inserted so that the next tab position is reached: if the option <guilabel>Insert spaces instead of tabulators</guilabel> on the <guilabel>General</guilabel> tab in the <guilabel>Editing</guilabel> page is enabled, spaces are inserted; otherwise, a single tabulator is inserted.
tr: Eğer bu seçenek seçiliyse, &Tab; tuşu ya mevcut satırı girintiler ya da sonraki seçme konumuna ilerler. Eğer ekleme noktası satırda boşluk olmayan ilk karakterde ya da önce ise, ya da bir seçim yoksa, mevcut satır <guilabel>Girintileme genişliği</guilabel> bölümünde belirtilen karaktar sayısı kadar girintilenir. Eğer ekleme noktası satırdaki ilk boşluk olmayan karakterden sonra ise ya da bir seçim yoksa, beyaz boşluk eklenir böylece sonraki sekme konumuna ulaşılır: eğer <guilabel>Düzenleme</guilabel> sayfasındaki <guilabel>Genel</guilabel> sekmesinde yer alan <guilabel>Sekme yerine boşluk ekle</guilabel> seçiliyse, boşluklar eklenir, değilse, tek sekme eklenir.

source: Auto Completion
tr: Otomatik Tamamlama

source: <guilabel>General</guilabel>
tr: <guilabel>Genel</guilabel>

source: Enable auto completion
tr: Otomatik tamamlamayı etkinleştir

source: If enabled, a word completion box automatically pops up during typing showing a list of text entries to complete the current text under the cursor.
tr: Eğer seçili ise, yazım sırasında imleç altındaki mevcut metni tamamlamak için metin listesi göstererek, kelime tamamlama kutusu otomatik olarak açılır.

source: Minimal word length to complete
tr: Tamamlanacak olan kelimenin asgari uzunluğu

source: While typing text, the word completion searches for words in the document starting with the already typed text. This option configures the minimal amount of characters that are needed to make the word completion active and pop up a completion box.
tr: Metin yazarken, kelime tamamlama hali hazırda yazılmış metinle başlayan belgede kelimeler arar. Bu seçenek, sözcük tamamlamayı etkin hale getirmek ve bir tamamlama kutusu açmak için gereken minimum karakter miktarını yapılandırır.

source: Vi Input Mode
tr: Vi Girdi Kipi

source: Use VI input mode
tr: VI girdi kipini kullan

source: When selected, the vi input mode will be enabled when opening a new view. You can still toggle the vi input mode on/off for a particular view in the <guimenu>Edit</guimenu> menu.
tr: Seçili olduğu zaman, yeni görünüm açılırken vi girdi kipi etkinleştirilir. Vi girdi kipini <guimenu>Düzenle</guimenu> menüsü içerisinden belirli bir görünüm için hala açık/kapalı olarak değiştirebilirsiniz.

source: Let Vi commands override Kate shortcuts
tr: Vi komutlarının Kate kısayollarının üzerie yazmasına izin ver

source: When selected, Vi commands will override &kappname;'s built-in commands. For example: <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> will redo, and override the standard action (showing the search and replace dialog).
tr: Seçili olduğu zaman, Vi komutları &kappname;'in yerleşik komutlarının üzerine yazacaktır. Örneğin: <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> geri alacak, ve standart eylemin üzerine yazacaktır (ara ve değiştir iletişim kutusunu göstererek).

source: Hide the Vi mode status bar
tr: Vi kipi durum çubuğunu gizle

source: By default, an extra status bar will be used when the Vi input mode is enabled. This status bar shows commands while they are being typed and messages/errors produced by Vi commands.
tr: Varsayılan olarak, Vi girdi kipi etkinleştirildiğinde ekstra bir durum çubuğu kullanılır. Bu durum çubuğu, yazımları esnasında komutları ve Vi komutları tarafından üretilen mesajları/hataları gösterir.

source: Checking this option will hide this extra status line.
tr: Bu seçeneği işaretlemek ek durum satırını gizleyecektir.

source: Key Mapping
tr: Tuş Haritalaması

source: Key mapping is used to change the meaning of typed keys. This allows you to move commands to other keys or make special keypresses for doing a series of commands.
tr: Anahtar eşleme, yazılan tuşların anlamını değiştirmek için kullanılır. Bu, komutları diğer tuşlara taşımanıza veya bir dizi komut yapmak için özel tuş basımlarına olanak tanır.

source: Example:
tr: Örnek:

source: This will prepend <keycap>I--</keycap> to a line when pressing <keycap>F2</keycap>.
tr: Bu <keycap>F2</keycap> basılıyken <keycap>I--</keycap> satır başına getirecektir.

source: Spellcheck
tr: Yazım Denetimi

source: These configuration options are described in the documentation for the &systemsettings; module <ulink url="help:/kcontrol/spellchecking">Spell Checker</ulink>.
tr: Bu yapılandırma seçenekleri &systemsettings; <ulink url="help:/kcontrol/spellchecking">Yazım Denetçisi</ulink> modülü için olan belgelendirme içerisinde açıklanmıştır.

source: Open/Save
tr: Aç/Kaydet

source: File Format
tr: Dosya Biçimi

source: Encoding:
tr: Kodlama:

source: This defines the standard encoding to use to open/save files, if not changed in the open/save dialog or by using a command line option.
tr: Bu, eğer değiştirilmemiş ise açma/kaydetme iletişim kutusu veya komut satırı seçeneğini kullanarak, dosyaları açmak/kaydetmek için gereken standart kodlamayı tanımlar.

source: Encoding Detection
tr: Kodlama Algılaması

source: Select an item from the drop down box, either to disable autodetection or use <guilabel>Universal</guilabel> to enable autodetection for all encodings. But as this may probably only detect utf-8/utf-16, selecting a region will use custom heuristics for better results. If neither the encoding chosen as standard above, nor the encoding specified in the open/save dialog, nor the encoding specified on command line match the content of the file, this detection will be run.
tr: Tüm kodlamalar için otomatik algılamayı devre dışı bırakmak için aşağı açılır kutudan bir öge seçin, ya da etkinleştirmek için <guilabel>Evrensel</guilabel> kullanın. Fakat bu muhtemelen sadece utf-8/utf-16 algılayacaktır, bölge seçmek daha iyi sonuçlar için özel buluşları kullanacaktır. Eğer ki kodlama yukarıdaki standarttaki gibi seçilmemiş ise, dosyanın içeriği ile ne aç/kaydet iletişim penceresinde belirtilmiş olan kodlama ne de komut satırında belirtilmiş olan kodlama uyuşmaktadır, bu algılama yürütülecektir.

source: Fallback Encoding
tr: Yedek Kodlama

source: This defines the fallback encoding to try for opening files if neither the encoding chosen as standard above, nor the encoding specified in the open/ save dialog, nor the encoding specified on command line match the content of the file. Before this is used, an attempt will be made to determine the encoding to use by looking for a byte order marker at start of file: if one is found, the right unicode encoding will be chosen; otherwise encoding detection will run, if both fail fallback encoding will be tried.
tr: Bu, ne yukarıdaki standart olarak seçilen kodlamanın ne aç / kaydet iletişim kutusunda belirtilen kodlamanın ne de komut satırında belirtilen kodlamanın dosyanın içeriğiyle eşleşmediği durumlarda dosyaları açmayı denemek için geri dönüş kodlamasını tanımlar. Bu kullanılmadan önce, dosyanın başlangıcında bir bayt sırası işaretçisi arayarak kullanılacak kodlamayı belirlemek için bir girişimde bulunulur: bir tane bulunursa, doğru unicode kodlaması seçilecektir; Aksi takdirde kodlama tespiti, eğer her ikisi de başarısız olan geri dönüş kodlaması denenecekse çalışır.

source: End of line:
tr: Satır sonu:

source: Choose your preferred end of line mode for your active document. You have the choice between &UNIX;, DOS/&Windows; or Macintosh.
tr: Geçerli belgeniz için tercih ettiğiniz satır sonun kipini seçin. &UNIX;, DOS/&Windows; veya Macintosh arasında seçime sahipsiniz.

source: Automatic end of line detection
tr: Otomatik satır sonu algılaması

source: Check this if you want the editor to autodetect the end of line type. The first found end of line type will be used for the whole file.
tr: Eğer düzenleyicinin satır sonu türünü otomatik olarak algılamasını istiyorsanız bunu işaretleyin. Bulunan ilk satır sonu türü tüm dosya için kullanılacakır.

source: Enable byte order marker
tr: Bayt sırası işaretleyiciyi etkinleştir

source: Automatic Cleanups on Load/Save
tr: Yüklemede/Kaydetmede Otomatik Temizleme

source: Remove trailing spaces
tr: Sondaki boşlukları kaldır

source: The editor will automatically eliminate extra spaces at the ends of lines of text while loading/saving the file.
tr: Düzenleyici, dosyayı yüklerken/kaydederken metin satırlarının sonlarındaki fazla boşlukları otomatik olarak eleyecektir.

source: <title>Advanced</title>
tr: <title>Gelişmiş</title>

source: Folder Config File
tr: Dizin Yapılandırma Dosyası

source: Search depth for config file:
tr: Yapılandırma dosyası için derinlik ara:

source: The editor will search the given number of folder levels upwards for &kappname; config file and load the settings line from it. Further information about these hidden folder config files you find in the <ulink url="help:/katepart/config-variables.html">document variables section</ulink>.
tr: Düzenleyici dizin seviyelerinin verilen sayılarını &kappname; yapılandırma dosyası için yukarıya doğru arayacak ve buradan ayarlar satırını yükleyecektir. Bu gizli dizin yapılandırma dosyaları hakkında daha fazla bilgiyi <ulink url="help:/katepart/config-variables.html">belge değişkenleri bölümü</ulink> içerisinden bulabilirsiniz.

source: Backup on Save
tr: Kaydederken yedekle

source: Backing up on save will cause &kappname; to copy the disk file to &lt;prefix&gt;&lt;filename&gt;&lt;suffix&gt; before saving changes. The suffix defaults to <emphasis role="bold">~</emphasis> and prefix is empty by default.
tr: Kaydetme sırasında yedekleme &kappname;'in disk dosyasını değişiklikleri kaydetmeden önce &lt;prefix&gt;&lt;filename&gt;&lt;suffix&gt; içerisine kaydedecektir. Sonek varsayılan olarak <emphasis role="bold">~</emphasis> ve önek ise varsayılan olarak boştur.

source: Local files
tr: Yerel dosyalar
