Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/ksystemlog.po
Languages: tr

source: The &ksystemlog; Handbook
tr: &ksystemlog; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: 0.4 (Applications 16.04)
tr: 0.4 (Uygulamalar 16.04)

source: &ksystemlog; is a system log viewer tool by &kde;. This program is developed for beginner users who don't know how to find information about their system or where the log files are located. It is also designed for advanced users who want to quickly see problems occuring on their server.
tr: &ksystemlog;, &kde;’nin sunduğu bir sistem günlüğü görüntüleme aracıdır. Bu program, sistemleri hakkında nasıl bilgi bulacağını veya günlük dosyalarının nerede bulunduğunu bilmeyen başlangıç düzeyindeki kullanıcılar için geliştirilmiştir. Ayrıca sunucularında oluşan sorunları tez görmek isteyen ileri düzey kullanıcılar için de tasarlanmıştır.

source: logs
tr: günlükler

source: security
tr: güvenlik

source: boot
tr: önyükleme

source: Using &ksystemlog;
tr: &ksystemlog; Kullanımı

source: Introduction
tr: Giriş

source: What is &ksystemlog; ?
tr: &ksystemlog; nedir?

source: &ksystemlog; is a system log viewer tool.
tr: &ksystemlog;, bir sistem günlüğü görüntüleme aracıdır.

source: &ksystemlog; helps users understand what their machine does in the background. &ksystemlog; aims to simplify the reading of system log files. This program is developed for beginner users who don't know how to find information about their system or where the log files are located in their computer.
tr: &ksystemlog;, kullanıcıların makinelerinin arka planda ne yaptığını anlamalarına yardımcı olur. &ksystemlog; sistem günlük dosyalarının okunmasını basitleştirmeyi amaçlamaktadır. Bu program, sistemi hakkında nasıl bilgi bulacağını veya günlük dosyalarının bilgisayarında nerede bulunduğunu bilmeyen, başlangıç düzeyindeki kullanıcılar için geliştirilmiştir.

source: But it is also designed for advanced users who want to quickly see problems occuring on their server. &ksystemlog; tries to provide some advanced features to allow sorting and reading logs from specifical programs.
tr: Ancak aynı zamanda sunucularında meydana gelen sorunları tez görmek isteyen ileri düzey kullanıcılar için de tasarlanmıştır. &ksystemlog;, belirli programlardan günlüklerin sıralanmasına ve okunmasına olanak tanıyan bazı gelişmiş özellikler sağlamaya çalışır.

source: <screeninfo>&ksystemlog; main screen</screeninfo>
tr: <screeninfo>&ksystemlog; ana ekranı</screeninfo>

source: <phrase>&ksystemlog; main screen</phrase>
tr: <phrase>&ksystemlog; ana ekranı</phrase>

source: Features
tr: Özellikler

source: In its current version, &ksystemlog; 0.4 has quite a number of helpful features, such as:
tr: Şu anki &ksystemlog; 0.4 sürümünde, pek çok yararlı özellik bulunmaktadır:

source: Support for many different log files type, with the support of Syslog server formating, Samba
tr: Syslog sunucu biçimlendirmesi ve Samba desteğiyle birçok farklı günlük dosyası türü desteği

source: Tabbed view to display several logs at the same time
tr: Aynı anda birden fazla günlüğü görüntülemek için sekmeli görünüm

source: Reading one log mode from multiple sources
tr: Birden fazla kaynaktan bir günlük kipini okuma

source: Auto-display of newly logged lines in bold
tr: Yeni kaydedilen satırların kendiliğinden kalın harflerle görüntülenmesi

source: Group by different criteria (log level, log file, process, hour, ...)
tr: Farklı kriterlere göre gruplandırma (günlük düzeyi, günlük dosyası, süreç, saat, …)

source: Detailed information for each log lines
tr: Her bir günlük satırı için ayrıntılı bilgi

source: Adding a log entry manually
tr: Elle günlük girdisi ekleme

source: Filtering by priority
tr: Önceliğe göre süzme

source: It supports the following log files from your system :
tr: Sisteminizdeki aşağıdaki günlük dosyası türlerini destekler:

source: Syslog logs (system messages)
tr: Syslog günlükleri (sistem iletileri)

source: X.org logs
tr: X.org günlükleri

source: Kernel logs
tr: Çekirdek günlükleri

source: Authentication logs
tr: Kimlik doğrulama günlükleri

source: ACPID logs
tr: ACPID günlükleri

source: Cups logs
tr: CUPS günlükleri

source: Postfix logs
tr: Postfix günlükleri

source: Apache logs
tr: Apache günlükleri

source: Samba logs
tr: Samba günlükleri

source: Daemons logs
tr: Ardalan süreci günlükleri

source: Cron logs
tr: Cron günlükleri

source: XSessions logs
tr: XSessions günlükleri

source: Systemd / Journald logs
tr: Systemd/Journald günlükleri

source: Many other features are included and will be discussed in the appropriate chapters of this manual.
tr: Diğer birçok özellik içerilir ve bu kılavuzun uygun bölümlerinde ele alınacaktır.

source: Reading logs with &ksystemlog;
tr: &ksystemlog; ile günlükleri okumak

source: As you will see in the following screenshots, &ksystemlog; provides features to easily sort and filter log lines. We are now going to describe them in the next parts of this documentation.
tr: Aşağıdaki ekran görüntülerinde göreceğiniz gibi &ksystemlog;, günlük satırlarını kolayca sıralamak ve süzmek için özellikler sunmaktadır. Şimdi bunları bu belgelendirmenin sonraki bölümlerinde açıklayacağız.

source: Getting started
tr: Başlarken

source: When you start &ksystemlog;, by default it tries to open the most useful log, the <guilabel>System Log</guilabel>. If it does not display it and pops up a message box, you probably forgot to launch &ksystemlog; as an administrator user (commonly named root). The log files are usually available in the /var/log folder, which is often protected against normal users. In the settings dialog you can select another log to open at startup.
tr: &ksystemlog; uygulamasını başlattığınızda, öntanımlı olarak en yararlı günlük olduğunu düşündüğü <guilabel>Sistem Günlüğü</guilabel>’nü açmaya çalışır. Görüntüleyemezse &ksystemlog; uygulamasını yönetici olarak başlatmayı unuttuğunuzu size anımsatan bir iletişim kutusu görüntüler. Günlük dosyaları genellikle normal kullanıcılara karşı korunan /var/log klasöründe bulunur. Ayarlar iletişim kutusunda, başlangıçta açılacak başka bir günlük seçebilirsiniz.

source: <screeninfo>&ksystemlog; first launch</screeninfo>
tr: <screeninfo>&ksystemlog; ilk başlangıç</screeninfo>

source: <phrase>&ksystemlog; first launch</phrase>
tr: <phrase>&ksystemlog; ilk başlangıç</phrase>

source: Reading log files easily
tr: Günlük dosyalarını kolaylıkla okumak

source: Sorting log lines
tr: Günlük satırlarını sıralamak

source: Every log lines are displayed in a list view, which can be sorted by clicking on the wanted column. Another click will sort it in the other order. If you want to sort the list as it was on the first loading, you can use the <menuchoice><guimenu>Edit</guimenu><guimenuitem>Reload</guimenuitem></menuchoice> menu item, or simply click on the first column of the list, generally named <guilabel>Date</guilabel>, to sort the list in the ascending order. Even if your log mode does not use time to describe each log lines, for example the <guilabel>X.org Log</guilabel>, the list will be correctly sorted, because &ksystemlog; keeps an internal order of the list.
tr: Her günlük satırı, aranan sütuna tıklanarak sıralanabilen bir liste görünümünde görüntülenir. Başka bir tıklama onu diğer sıraya göre sıralayacaktır. Listeyi ilk yüklemedeki gibi sıralamak isterseniz <menuchoice><guimenu>Düzen</guimenu><guimenuitem>Yeniden Yükle</guimenuitem></menuchoice> menü ögesini kullanın veya listeyi artan sırada sıralamak için listenin ilk sütununa tıklayın, genelde <guilabel>Tarih</guilabel> başlıklıdır. Günlük kipiniz her günlük satırını tanımlamak için zaman kullanmasa bile, örneğin <guilabel>X.org Günlüğü</guilabel>, liste doğru şekilde sıralanacaktır çünkü &ksystemlog; listenin iç sırasını tutar.

source: Filtering log lines
tr: Günlük satırlarını süzmek

source: <screeninfo>Filtering on a specific process</screeninfo>
tr: <screeninfo>Belirli bir süreçte süzmek</screeninfo>

source: <phrase>Filtering on a specific process</phrase>
tr: <phrase>Belirli bir süreçte süzmek</phrase>

source: You can also use the filter bar to filter according to the selected criteria and the typed string. Simply type something in the filter, and the list will automatically be modified to only display lines which match your filter string. By default, the combo box next to the filter selects <guilabel>All</guilabel>, which means that a line will be displayed only if one of its columns contains the filter string.
tr: Seçils kriterlere ve yazılan diziye göre süzmek için süzgeç çubuğunu da kullanabilirsiniz. Süzgece bir şey yazmanız yeterlidir; liste, yalnızca süzgeç dizinizle eşleşen satırları görüntüleyecek biçimde kendiliğinden değiştirilecektir. Öntanımlı olarak, süzgecin yanındaki birleşik giriş kutusu <guilabel>Tümü</guilabel> seçeneğini seçer; bu, bir satırın yalnızca sütunlarından biri süzgeç dizisini içeriyorsa görüntüleneceği anlamına gelir.

source: You can select another field to filter only this column of the list. For example, in the <guilabel>System Log</guilabel>, by selecting the <guilabel>Process</guilabel> column, and writing a process name in the filter bar, &ksystemlog; will display every log lines sent by this process.
tr: Listenin yalnızca bu sütununu süzmek için başka bir alan seçebilirsiniz. Örneğin, <guilabel>Sistem Günlüğü</guilabel> alanında, <guilabel>Süreç</guilabel> sütununu seçip süzgeç çubuğuna bir işlem adı yazdığınızda, &ksystemlog; bu süreç tarafından gönderilen her günlük satırını görüntüleyecektir.

source: Other features
tr: Diğer özellikler

source: Colorizing log lines
tr: Renkli günlük satırları

source: This option is activated by default and helps you see which lines have a higher level than the others. For example, <guilabel>Error</guilabel> level will be highlighted in a different color than the <guilabel>Notice</guilabel> one. This feature can be disabled in the configuration dialog.
tr: Bu seçenek öntanımlı olarak etkindir ve hangi satırların diğerlerinden daha yüksek düzeye sahip olduğunu görmenize yardımcı olur. Örneğin, <guilabel>Hata</guilabel> düzeyi, <guilabel>Bildirim</guilabel>’den farklı bir renkle vurgulanacaktır. Bu özellik yapılandırma iletişim kutusundan devre dışı bırakılabilir.

source: Hiding the process identifier
tr: Süreç tanımlayıcısını gizlemek

source: If you are only interested in a specific process (for example in the <guilabel>System Log</guilabel> or the <guilabel>Cron Log</guilabel>), you can hide its PID in the <guilabel>Process</guilabel> column. This can be useful if you are trying to analyze the output of a specific command, like a Samba server. In this case, please use the <link linkend="filtering">Filter Bar</link>.
tr: Yalnızca belirli bir süreçle ilgileniyorsanız (örneğin <guilabel>Sistem Günlüğü</guilabel> veya <guilabel>Cron Günlüğü</guilabel>), PID’sini <guilabel>Süreç</guilabel> sütunundan gizleyebilirsiniz. Samba sunucusu gibi belirli bir komutun çıktısını çözümlemeye çalışıyorsanız bu yararlı olabilir. Bu durumda lütfen <link linkend="filtering">Süzgeç Çubuğu</link>’nu kullanın.

source: Send logd via email
tr: E-posta ile logd gönder

source: The context menu has an action <guilabel>Email Selection</guilabel>. Select relevant lines in the log and use this action to open the composer window of your default email client prefilled with the selection.
tr: Bağlam menüsünde <guilabel>Seçimi E-posta ile Gönder</guilabel> eylemi bulunur. Günlükteki ilgili satırları seçin ve bu eylemi, öntanımlı e-posta istemcinizin seçimle önceden doldurulmuş oluşturucu penceresini açmak için kullanın.

source: Monitoring Management
tr: İzleme Yönetimi

source: &ksystemlog; provides an easy way to control the reading and the monitoring of log files. Indeed, sometimes you only need to analyze some existing log lines. In this case, you cannot tolerate the appearance of a new line. You can deactivate the monitoring of log files by clicking on the <guibutton>Stop</guibutton> button. This stops the opened log files from being updated while still letting them get filled by other processes. Of course, you can reactivate the monitoring by clicking on <guibutton>Resume</guibutton>, which will display the log lines added since the last pause.
tr: &ksystemlog;, günlük dosyalarının okunmasını ve izlenmesini denetlemenin kolay bir yolunu sağlar. Aslında bazen yalnızca var olan bazı günlük satırlarını çözümlemeniz gerekir. Bu durumda yeni bir satırın ortaya çıkmasına tahammül edemezsiniz. <guibutton>Durdur</guibutton> düğmesine tıklayarak günlük dosyalarının izlenmesini devre dışı bırakabilirsiniz. Bu, açılan günlük dosyalarının güncellenmesini durdururken diğer işlemler tarafından doldurulmasına izin verir. Elbette, son duraklatmadan bu yana eklenen günlük satırlarını görüntüleyecek olan <guibutton>Sürdür</guibutton>’e tıklayarak izlemeyi yeniden etkinleştirebilirsiniz.

source: Furthermore, to focus on the newly appeared log lines, you can toggle the <guimenuitem>Scroll to New Lines</guimenuitem> option.
tr: Ayrıca, yeni görünen günlük satırlarına odaklanmak için <guimenuitem>Yeni Satırlara Sar</guimenuitem> seçeneğini açabilirsiniz.

source: Management of several opened tabs
tr: Birden çok açık sekmenin yönetimi

source: &ksystemlog; allows you to open several log modes by opening multiple tabs. For this, simply use the <guimenu>Window</guimenu> menu to manage and open new tabs. Once you have selected the right tab, simply choose the desired log mode using the dedicated menu.
tr: &ksystemlog; birden çok sekme açarak birden çok günlük kipini açmanıza olanak tanır. Bunun için yeni sekmeleri yönetmek ve açmak için <guimenu>Pencere</guimenu> menüsünü kullanmanız yeterlidir. Doğru sekmeyi seçtikten sonra özel menüyü kullanarak istediğiniz günlük kipini seçebilirsiniz.

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: &ksystemlog;, Copyright 2008 by Nicolas Ternisien
tr: &ksystemlog;, Telif hakkı 2008 Nicolas Ternisien

source: Contributors:
tr: Katkıcılar:

source: Patrick Dreker : Ideas, Code Improvements.
tr: Patrick Dreker: Fikirler, kod iyileştirmeleri

source: Bojan : SSH Log mode, Printing.
tr: Bojan: SSH günlük kipi, yazdırma

source: Special thanks to all translators of &ksystemlog;.
tr: Tüm &ksystemlog; çevirmenlerine özel teşekkürlerimle.

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Emir SARI<email>emir_sari@icloud.com</email></para>
