Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kteatime.po
Languages: tr

source: The &kteatime; Handbook
tr: &kteatime; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: 1.3.0 (Applications 16.04)
tr: 1.3.0 (Uygulamalar 16.04)

source: This Handbook describes &kteatime;, the &kde; Tea Cooker.
tr: Bu el kitabı, &kteatime;, &kde; çay demleyicisini açıklar.

source: kteatime
tr: k çay saati

source: cooker
tr: demleme

source: timer
tr: sayaç

source: Introduction
tr: Giriş

source: What's &kteatime;?
tr: &kteatime; nedir?

source: &kteatime; is a handy timer for steeping tea. No longer will you have to guess at how long it takes for your tea to be ready. Simply select the type of tea you have, and it will alert you when the tea is ready to drink.
tr: &kteatime;, çay demlemek için kullanışlı bir sayaçtır. Artık çayınızın hazır olması için ne kadar zaman harcadığınızı tahmin etmek zorunda değilsiniz. Elinizdeki çayın türünü seçmeniz yeterlidir; çay içilmeye hazır olduğunda bu uygulama sizi uyaracaktır.

source: How to Use &kteatime;
tr: &kteatime; nasıl kullanılır?

source: When you start up &kteatime;, it will automatically dock itself in your panel. To access the menu, right click on the docked icon. This will present a list of options which are covered in more detail in the next chapter.
tr: &kteatime;’yı başlattığınızda, kendini kendiliğinden panele yerleştirir. Menüye girmek için simgenin üstüne sağ tıklayın. Bu, sonraki bölümde daha ayrıntılı anlatılacak olan seçeneklerin listesini gösterecektir.

source: Timing Your Tea
tr: Çayınızı Zamanlamak

source: Upon starting, the panel icon will be that of an tea mug. If you click with the &RMB; on the mug and select your tea, an animated clock visualizing the remaining time is displayed on the icon. After the specified time, the tea will be finished, and a suitable message box will be shown. At this point, you can close the message box by clicking on it. This resets also the timer and the clock on the mug disappears again.
tr: Başlattıktan sonra, panel simgesi bir çay kupası simgesi olarak gözükür. Kupanın üstüne &RMB; ile tıklayıp çayı seçerseniz kalan süreyi gösteren canlandırmalı bir saat simgesi göreceksiniz. Belirlenen sürenin sonunda çay demlenmiş olur ve uygun bir ileti gösterilir. Bu noktada ileti kutusuna tıklayarak kapatabilirsiniz. Bu da sayacı sıfırlayacak ve kupadaki saat yeniden kaybolacaktır.

source: The timer should only be reset by those who really enjoy tea.
tr: Sayacı yalnızca gerçek çay tiryakileri sıfırlamalıdır.

source: Menu Options
tr: Menü Seçenekleri

source: The following section describes the menu options that are available in &kteatime;.
tr: Aşağıdaki bölüm, &kteatime; içinde kullanılabilecek olan menü seçeneklerini açıklar.

source: Select Your Tea
tr: Çayını Seç

source: Clicking on the icon with the &RMB; will bring up a menu. At the top of the menu there are four menu items. Here, you can select what kind of tea you are preparing to drink. There are: <guimenuitem>Black Tea</guimenuitem>, <guimenuitem>Earl Grey</guimenuitem>, <guimenuitem>Fruit Tea</guimenuitem>, and <guimenuitem>Green Tea</guimenuitem>. These teas are preconfigured with a default time. Many people have complained that the times are not correct. Please be aware that the amount of time it takes to steep a cup of tea is based on personal preference. The times chosen are approximations. If you read on, you will learn how to change or delete these predefined times and to set your own time. A quick-and-easy way to set a custom time is to choose <guimenuitem>Custom...</guimenuitem> from the menu.
tr: Simgeye &RMB; ile tıkladığınızda bir menü açılacaktır. Menünün üstünde dört menü ögesi vardır. Burada, içmek için hazırlayacağınız çayın türünü seçebilirsiniz. Bunlar: <guimenuitem>Siyah Çay</guimenuitem>, <guimenuitem>Earl Grey Çayı</guimenuitem>, <guimenuitem>Meyve Çayı</guimenuitem>, ve <guimenuitem>Yeşil Çay</guimenuitem> olarak listelenir. Bu çaylar öntanımlı bir zamanlayıcıyla önceden yapılandırılmıştır. Çoğu kimse zamanın doğru olmadığından şikayet eder. Bir bardak çayın demini alması için gereken sürenin kişisel tercihinize bağlı olduğunu unutmayın. Seçilen süreler yaklaşık değerlerdir. Okumayı sürdürürseniz önceden tanımlanmış süreleri nasıl değiştireceğinizi veya sileceğinizi öğrenebilir ve kendi sürenizi ayarlayabilirsiniz. Özel bir süre ayarlamak için tez ve kolay bir yol, menüden <guimenuitem>Özel…</guimenuitem> ögesini seçmektir.

source: Clicking <guimenuitem>Configure Notifications...</guimenuitem> brings up the &kde; Notification Settings for &kteatime;.
tr: <guimenuitem>Bildirimleri Yapılandır…</guimenuitem> ögesine tıklamak, &kteatime; için olan &kde; bildirim ayarlarını getirir.

source: Start the Tea Timer
tr: Çay Sayacını Başlatmak

source: To start the tea timer select a tea from the context menu. As confirmation that you have indeed started the timer, a clock visualizing the remaining time is displayed in the panel icon.
tr: Çay sayacını başlatmak için içerik menüsünden bir çay seçin. Sayacı gerçekten başlattığınıza dair bir onay olarak panel simgesinde kalan süreyi gösteren bir saat görüntülenir.

source: Configure
tr: Yapılandır

source: This menu item opens up the configuration dialog box. A screenshot is shown below:
tr: Bu menü ögesi, yapılandırma iletişim kutusunu açar. Ekran görüntüsü aşağıda gösterilmektedir:

source: <screeninfo>The &kteatime; configuration dialog box.</screeninfo>
tr: <screeninfo>&kteatime; yapılandırma iletişim kutusu.</screeninfo>

source: <phrase>The &kteatime; configuration dialog box.</phrase>
tr: <phrase>&kteatime; yapılandırma iletişim kutusu.</phrase>

source: As shown in the picture, you may add new entries for other tea or change names, times and the order of existing entries. This is useful if you are brewing a cup of tea that is not on the list or if you do not agree with the predefined times. To edit one entry, mark it in the <guilabel>Tea List</guilabel> on the left and change the values in the <guilabel>Tea Properties</guilabel> on the right.
tr: Resimde görüldüğü gibi, diğer çaylara yeni kayıtlar ekleyebilir veya adlarını, zamanlarını ve var olan kayıtların sırasını değiştirebilirsiniz. Listede bulunmayan bir fincan çayı demlemek için veya önceden tanımlanmış süreleri değiştirmek için yararlıdır. Bir girdiyi düzenlemek için soldaki <guilabel>Çay Listesi</guilabel> içinden işaretleyin ve sağdaki <guilabel>Çay Özellikleri</guilabel> içinden değerleri değiştirin.

source: The box below is the <guilabel>Action</guilabel> field. Here you can define an action that will be executed when the time is up. If <guilabel>Popup</guilabel> is selected, a message box will appear alerting you to the fact that your tea is ready.
tr: Aşağıdaki kutu, <guilabel>Eylem</guilabel> alanıdır. Burada, zaman dolduğunda uygulanacak bir eylemi tanımlayabilirsiniz. <guilabel>İleti</guilabel> seçiliyse çayınızın hazır olduğunu belirten bir ileti kutusu belirecektir.

source: If you enable the check box labeled <guilabel>Visualize progress in icon tray</guilabel>, the progress will be shown as a little animated clock inside the icon.
tr: <guilabel>İlerlemeyi simge tepsisinde görselleştir</guilabel> etiketli onay kutusunu etkinleştirirseniz ilerleme küçük bir hareketli saat simgesi olarak gösterilir.

source: Credits
tr: Hazırlayanlar

source: &kteatime; Copyright &copy; 1998-1999 by &Matthias.Hoelzer-Kluepfel; &Matthias.Hoelzer-Kluepfel.mail;
tr: &kteatime; Telif Hakkı &copy; 1998–1999 — &Matthias.Hoelzer-Kluepfel; &Matthias.Hoelzer-Kluepfel.mail;

source: Documentation by &Michael.Korman; &Michael.Korman.mail;
tr: Belgelendirme — &Michael.Korman; &Michael.Korman.mail;

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviren Kaan Özdinçer <email>kaanozdincer@gmail.com</email></para>
