Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/ktimer.po
Languages: tr

source: The &ktimer; Handbook
tr: &ktimer; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Applications 18.04
tr: Uygulamalar 18.04

source: &ktimer; is an application that lets you start an application after a certain amount of time has passed.
tr: &ktimer;, belirli bir süre geçtikten sonra bir uygulamayı başlatmanıza izin veren bir uygulamadır.

source: ktimer
tr: k sayaç

source: countdown
tr: geri sayım

source: Introduction
tr: Giriş

source: &ktimer; allows you to enter several tasks and to set a timer for each of them. When the timer reaches zero, the task is executed. The timers for each task can be started, stopped, changed, or looped.
tr: &ktimer;, farklı görevler girmenize ve her biri için bir sayaç belirlemenize izin verir. Sayaç sıfıra ulaştığında, görev yürütülür. Her bir görev için sayaçlar başlatılabilir, durdurulabilir, değiştirilebilir veya döngüye alınabilir.

source: Using &ktimer;
tr: &ktimer; Kullanımı

source: Here's a screenshot of &ktimer; when you start it for the first time
tr: İlk defa başlattığınızda &ktimer;’ın bir ekran görüntüsü

source: &ktimer; main window
tr: &ktimer; ana penceresi

source: To start, first add a task by selecting <guibutton>New</guibutton>. Then type the command you wish to execute into the <guilabel>Command line:</guilabel> box. You can then adjust the settings, or start the timer countdown. When the time is up, the command will be run.
tr: Başlatmak için <guibutton>Yeni</guibutton> ögesini seçerek ilk görevinizi ekleyin. Ardından <guilabel>Komut satırı:</guilabel> bölümüne yürütülmesini istediğiniz komutu girin. Daha sonra ayarları değiştirebilir veya sayacın geri sayımını başlatabilirsiniz. Zaman dolduğunda, komut çalıştırılacaktır.

source: Here's a screenshot of &ktimer; after you have told it to run &konqueror;.
tr: &konqueror;’un çalıştırmasını söyledikten sonra, &ktimer;’ın bir ekran görüntüsü.

source: add a task
tr: bir görev ekle

source: Let's use &konqueror; as an example. By default, it will start in 100 seconds once the timer countdown is started.
tr: &konqueror;’u örnek olarak kullanalım. Öntanımlı olarak, sayaç geri sayıma başladığında 100 saniye içinde başlatılacaktır.

source: Here it is counting down: in 56 seconds &konqueror; will be run.
tr: Geri sayım: 56 saniye içinde &konqueror; çalıştırılacak.

source: 56 seconds to go
tr: 56 saniye kaldı

source: Now let's start the task. Here it has been running for a bit and is partway through the countdown. In 56 seconds, &konqueror; will be started.
tr: Şimdi göreve başlayalım. Burada geri sayım var ve ilerliyor. 56 saniye içinde &konqueror; başlatılacak.

source: See that sliding bar? You can use it to quickly increase or decrease the amount of time on a task.
tr: Şuradaki kayar çubuğu görüyor musunuz? Bir görevdeki süreyi tez artırmak veya azaltmak için kullanabilirsiniz.

source: Let's add a second task.
tr: İkinci bir görev ekleyelim.

source: start another &konqueror;, you can never have too many!
tr: başka bir &konqueror; başlatın, isteğiniz kadar açabilirsiniz!

source: Now two &konqueror;s are scheduled to be run. The top one will be run in 20 seconds, and the bottom one is currently stopped. You can add more commands. While you can never have too many &konqueror;s, you probably want to use other executables. Your own shell script, perhaps.
tr: Şimdi, iki &konqueror; çalışmak için programlandı. Üstteki 20 saniye içinde çalıştırılacak ve alttaki durdurulmuştur durumda. Daha fazla komut ekleyebilirsiniz. İstediğiniz &konqueror; çalıştırabilirsiniz; ancak başka yürütülebilir dosyaları da kullanmak isteyeceksinizdir. Belki kendi betiğinizi çalıştırmak istersiniz.

source: If you want to start a new task with a certain delay after the previous task in the list is finished check the option <guilabel>Consecutive task</guilabel> and adjust the time specified in the column <guilabel>Delay</guilabel>.
tr: Listedeki bir önceki görev tamamlandıktan sonra belirli bir gecikmeyle yeni bir görev başlatmak istiyorsanız <guilabel> Ardışık görev</guilabel> seçeneğini işaretleyin ve <guilabel>Gecikme</guilabel> sütununda belirtilen süreyi ayarlayın.

source: Settings
tr: Ayarlar

source: <guibutton>New</guibutton>
tr: <guibutton>Yeni</guibutton>

source: Adds a new task.
tr: Yeni bir görev ekler.

source: Remove
tr: Kaldır

source: Removes the current task.
tr: Geçerli görevi kaldırır.

source: Help
tr: Yardım

source: Opens the Handbook.
tr: El Kitabı’nı açar.

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Program Copyright 2001 &Stefan.Schimanski; &Stefan.Schimanski.email;
tr: Program telif hakkı 2001 &Stefan.Schimanski; &Stefan.Schimanski.email;

source: Documentation Copyright 2008 &A.L.Spehr; &A.L.Spehr.email;
tr: Belgelendirme telif hakkı 2008 &A.L.Spehr; &A.L.Spehr.email;

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviren: Kaan Özdinçer <email>kaanozdincer@gmail.com</email></para>
