Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/ktorrent.po
Languages: tr

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>İşbaran</firstname><surname>Akçayır</surname><affiliation><address><email>isbaran@gmail.com</email></address></affiliation><contrib>-</contrib></othercredit> <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>-</contrib></othercredit>

source: &ktorrent; is a bittorrent application by KDE which allows you to download files using the BitTorrent protocol. It enables you to run multiple torrents at the same time and comes with extended features to make it a full-featured client for BitTorrent.
tr: &ktorrent;, BitTorrent iletişim kuralını kullanarak dosyalar indirmenizi sağlayan bir KDE Bittorrent uygulamasıdır. Aynı anda birden çok torrent çalıştırmanızı sağlar ve tam kapsamlı bir BitTorrent istemcisi yapacak gelişmiş özelliklerle gelir.

source: Features
tr: Özellikler

source: Queuing of torrents
tr: Torrentlerin kuyruklanması

source: Global and per torrent speed limits
tr: Global ve torrent başı hız sınırları

source: Previewing of certain file types, build in (video and audio)
tr: Belirli dosya türlerinin önizlemesi (video ve ses)

source: Importing of partially or fully downloaded files
tr: Kısımsal veya tümüyle indirilmiş dosyaların içe aktarımı

source: File prioritization for multi-file torrents
tr: Çok dosyalı torrentlerde dosya öncelikleri

source: Selective downloading for multi-file torrents
tr: Çok dosyalı torrentlerde seçimle indirme

source: Kick/ban peers with an additional IP Filter dialog for list/edit purposes
tr: Listeleme/düzenleme amacıyla ek IP süzgecine sahip eşleri kovma/engelleme

source: UDP tracker support
tr: UDP izleyicisi desteği

source: Support for private trackers and torrents
tr: Özel izleyiciler ve torrentler için destek

source: Support for µTorrent's peer exchange
tr: µTorrent’in eş değişimi için destek

source: Support for protocol encryption (compatible with Azureus)
tr: İletişim kuralı şifreleme desteği (Azureus ile uyumlu)

source: Support for creating trackerless torrents
tr: İzleyicisiz torrentler oluşturmak için destek

source: Support for distributed hash tables (DHT, the Mainline version)
tr: Dağıtılmış özet tabloları için destek (DHT, Mainline sürümü)

source: Support for UPnP to automatically forward ports on a LAN with dynamic assigned hosts
tr: Devingen atamalı makinelere sahip bir LAN üzerinde bağlantı noktalarını kendiliğinden aktarmak için UPnP desteği

source: Support for webseeds
tr: webseed desteği

source: System tray integration
tr: Sistem tepsisi tümleştirmesi

source: Tracker authentication support
tr: İzleyici kimlik doğrulama desteği

source: Connection though a proxy
tr: Bir vekil aracılığıyla bağlantı

source: Interprocess control via DBus interface
tr: DBus arayüzü aracılığıyla süreç arası denetim

source: Online Help Resources
tr: Çevrimiçi Yardım Özkaynakları

source: KTorrent on UserBase
tr: Userbase’de K Torrent

source: KDE Community Forums
tr: KDE Topluluk Forumları
