Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kwalletmanager.po
Languages: tr

source: The &kwallet5; Handbook
tr: &kwallet5; El Kitabı

source: Developer
tr: Geliştirici

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Kaan</firstname><surname>Özdinçer</surname><affiliation><address><email>kaanozdincer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Applications 16.04
tr: Uygulamalar 16.04

source: The wallet subsystem provides a convenient and secure way to manage all your passwords.
tr: Cüzdan alt sistemi, tüm parolalarınızı yönetmek için kullanışlı ve güvenli bir yol sağlar.

source: Kwallet
tr: K Cüzdan

source: passwords
tr: parolalar

source: forms
tr: formlar

source: Introduction
tr: Giriş

source: Computer users have a very large amount of data to manage, some of which is sensitive. In particular, you will typically have many passwords to manage. Remembering them is difficult and writing them down on paper or in a text file is insecure.
tr: Bilgisayar kullanıcılarının yönetmesi gereken çok büyük miktarda verisi vardır ve bunların bir kısmı hassastır. Özellikle, genellikle yönetmeniz gereken birçok parolanız olacaktır. Bunları hatırlamak zordur ve bunları bir kağıda veya bir metin dosyasına yazmak güvensizdir.

source: &kwallet5; provides a secure way to store passwords and other secret information, allowing the user to remember only a single password instead of numerous different passwords and credentials.
tr: &kwallet5;, şifreleri ve diğer gizli bilgileri saklamak için güvenli bir yol sağlar ve kullanıcının çok sayıda farklı şifre ve kimlik bilgisi yerine yalnızca tek bir şifreyi hatırlamasına olanak tanır.

source: Create a Wallet
tr: Cüzdan Oluştur

source: Wallet is a password storage. It is usually sufficient to have just one wallet secured by one master password but you can organize your large collection of passwords by wallets using &kwalletmanager5;.
tr: Cüzdan bir şifre deposudur. Bir cüzdanın tek bir ana parola ile güvence altına alınması genellikle yeterlidir; ancak büyük parola koleksiyonunuzu &kwalletmanager5; kullanarak cüzdanlara göre düzenleyebilirsiniz.

source: By default a wallet named <guilabel>kdewallet</guilabel> will be used to store your passwords. This wallet is secured by your login password and will automatically be opened at login, if kwallet_pam is installed and properly configured. On certain distros (&eg; Archlinux) kwallet_pam is not installed by default
tr: Öntanımlı olarak, parolalarınızı depolamak için <guilabel>kdewallet</guilabel> adlı bir cüzdan kullanılacaktır. Bu cüzdan, oturum açma parolanız tarafından güvence altına alınmıştır ve kwallet_pam yüklenmiş ve doğru şekilde yapılandırılmışsa oturum açma sırasında kendiliğinden açılacaktır. Belirli dağıtımlarda (örn. Archlinux) kwallet_pam öntanımlı olarak kurulu değildir

source: Other wallets have to be opened manually.
tr: Diğer cüzdanlar elle açılmalıdır.

source: There are two ways to create a new wallet:
tr: Yeni bir cüzdan oluşturmanın iki yolu vardır:

source: Use the menu item <menuchoice><guimenu>File</guimenu><guimenuitem>New Wallet</guimenuitem></menuchoice> in the &kwalletmanager5;
tr: &kwalletmanager5; içindeki <menuchoice><guimenu>Dosya</guimenu><guimenuitem>Yeni Cüzdan</guimenuitem></menuchoice> ögesini kullanın.

source: Use the <guibutton>New</guibutton> button in the &systemsettings; module <guilabel>KDE Wallet</guilabel>
tr: &systemsettings; içindeki <guilabel>KDE Cüzdan</guilabel> modülünde <guibutton>Yeni</guibutton> düğmesini kullanın

source: If you have not created a wallet yet, see section <link linkend="kwallet-using">Using &kwallet5;</link>.
tr: Henüz bir cüzdan oluşturmadıysanız <link linkend="kwallet-using">&kwallet5; Kullanımı</link> bölümüne göz atın.

source: &kwallet5; offers two different ways to store your data:
tr: &kwallet5; ile verilerinizi depolamanın iki farklı yolu vardır:

source: <screeninfo>Select encryption</screeninfo>
tr: <screeninfo>Şifreleme seç</screeninfo>

source: <phrase>Select encryption</phrase>
tr: <phrase>Şifreleme seç</phrase>

source: Blowfish encryption
tr: Blowfish şifreleme

source: &kwallet5; saves this sensitive data for you in a strongly encrypted file, accessible by all applications, and protected with a master password that you define.
tr: &kwallet5; bu hassas verileri sizin için güçlü bir şekilde şifrelenmiş, tüm uygulamalar tarafından erişilebilen ve sizin belirleyeceğiniz bir ana parola ile korunan bir dosyaya kaydeder.

source: <screeninfo>Create a blowfish encrypted wallet</screeninfo>
tr: <screeninfo>Blowfish ile şifrelenmiş bir cüzdan oluştur</screeninfo>

source: <phrase>Create a blowfish encrypted wallet</phrase>
tr: <phrase>Blowfish ile şifrelenmiş bir cüzdan oluştur</phrase>

source: The data is encrypted with the <ulink url="http://www.schneier.com/blowfish.html">Blowfish symmetric block cipher algorithm</ulink>, the algorithm key is derived from the <ulink url="http://www.ietf.org/rfc/rfc3174.txt">SHA-1 hash</ulink> of the password, with a key length of 156 bits (20 bytes). The data into the wallet file is also hashed with SHA-1 and checked before the data is deciphered and accessible by the applications.
tr: Veri, <ulink url="http://www.schneier.com/blowfish.html">Blowfish simetrik blok şifreleme algoritması</ulink> ile şifrelenmiştir, algoritma anahtarı parolanın <ulink url="http://www.ietf.org/rfc/rfc3174.txt">SHA-1 özeti</ulink> üzerinden türetilmiştir, anahtar uzunluğu 156 bittir (20 bayt). Cüzdan dosyasındaki veriler ayrıca, SHA-1 ile sağlaması yapılarak veriler çözülmeden önce denetlenir ve uygulamalar tarafından erişilebilir duruma gelir.

source: GPG encryption
tr: GPG şifreleme

source: GnuPG offers some very strong encryption algorithms and uses passphrase protected long keys.
tr: GnuPG bazı çok güçlü şifreleme algoritmaları sunar ve parola korumalı uzun anahtarlar kullanır.

source: <screeninfo>No GPG key found</screeninfo>
tr: <screeninfo>GPG anahtarı bulunamadı</screeninfo>

source: <phrase>No GPG key found</phrase>
tr: <phrase>GPG anahtarı bulunamadı</phrase>

source: The screenshots above show the case where an encryption capable GPG key was not found on the system. Please use applications like &kgpg; or &kleopatra; to create a key and try again.
tr: Yukarıdaki ekran görüntüleri, sistemde şifreleme özellikli bir GPG anahtarının bulunmadığı durumu göstermektedir. Lütfen bir anahtar oluşturmak ve yeniden denemek için &kgpg; veya &kleopatra; gibi uygulamalar kullanın.

source: If a GPG key was found you will get the next dialog where you can select a key to use for your new wallet.
tr: Bir GPG anahtarı bulunursa yeni cüzdanınız için kullanmak üzere bir anahtar seçebileceğiniz bir sonraki iletişim kutusunu göreceksiniz.

source: <screeninfo>Select an encryption key</screeninfo>
tr: <screeninfo>Şifreleme anahtarı seçin</screeninfo>

source: <phrase>Select an encryption key</phrase>
tr: <phrase>Şifreleme anahtarı seçin</phrase>

source: &kwallet5; will now use GPG when storing wallets and when opening them. The passphrase dialog only shows once. Even if the wallet is closed after initial open, subsequent opening will occur silently during the same session.
tr: &kwallet5;, artık cüzdanları saklarken ve açarken GPG kullanacaktır. Parola iletişim kutusu yalnızca bir kez gösterilir. Cüzdan ilk açılıştan sonra kapatılsa bile, sonraki açılış aynı oturum sırasında sessizce gerçekleşecektir.

source: The same session can handle simultaneously both file formats. &kwallet5; will transparently detect the file format and load the correct backend to handle it.
tr: Aynı oturum, her iki dosya biçimini aynı anda işleyebilir. &kwallet5; dosya biçimini saydam bir şekilde algılayacak ve onu işlemek için doğru arka ucu yükleyecektir.

source: To use your sensitive data from your classic wallet with the new backend follow these steps:
tr: Klasik cüzdanınızdaki hassas verilerinizi yeni arka uçla kullanmak için şu adımları izleyin:

source: Create a new GPG based wallet
tr: GPG tabanlı yeni bir cüzdan oluşturun

source: Launch &kwalletmanager5; using &krunner; (<keycombo>&Alt; <keycap>F2</keycap></keycombo>) or other application launcher (menu) and select your old wallet. Then choose <menuchoice><guimenu>File</guimenu> <guimenuitem>Export as encrypted</guimenuitem></menuchoice> to create an archive file with your sensitive data.
tr: &krunner;’ı veya başka bir uygulama başlatıcıyı kullanarak &kwalletmanager5;’i başlatın (<keycombo>&Alt; <keycap>F2</keycap></keycombo>) ve eski cüzdanınızı seçin. Sonrasında, hassas verinizle bir arşiv dosyası oluşturmak için <menuchoice><guimenu>Dosya</guimenu> <guimenuitem>Şifreli Olarak Dışa Aktar</guimenuitem></menuchoice> seçeneğini kullanın.

source: Select the new GPG based wallet then choose <menuchoice><guimenu>File</guimenu> <guimenuitem>Import encrypted</guimenuitem></menuchoice> and select the file you just saved.
tr: Yeni GPG tabanlı cüzdanı seçin ve <menuchoice><guimenu>Dosya</guimenu> <guimenuitem>Şifreliyi İçe Aktar</guimenuitem></menuchoice>’a tıklayıp biraz önce kaydettiğiniz dosyayı seçin.

source: Go to &systemsettings; <menuchoice><guimenu>Account Details</guimenu> <guimenuitem>KDE Wallet</guimenuitem></menuchoice> and select the newly created GPG based wallet from the <guilabel>Select wallet to use as default</guilabel> combobox.
tr: &systemsettings; <menuchoice><guimenu>Hesap Ayrıntıları</guimenu> <guimenuitem>KDE Cüzdan</guimenuitem></menuchoice> yolunu izleyin ve <guilabel>Öntanımlı olarak kullanılacak cüzdanı seç</guilabel> çoklu kutusundan yeni oluşturulan GPG tabanlı cüzdanı seçin.

source: Alternatively use <guimenuitem>Import a wallet</guimenuitem> but in that case you have to select the <filename class="extension">.kwl</filename> file corresponding to your old wallet, located in the folder <filename class="directory">kwalletd</filename> in <userinput>qtpaths --paths GenericDataLocation</userinput>.
tr: Alternatif olarak, <guimenuitem>Cüzdan İçe Aktar</guimenuitem> seçeneğini kullanın; ancak bu durumda <userinput>qtpaths --paths GenericDataLocation</userinput> içindeki <filename class="directory">kwalletd</filename> klasöründe eski cüzdanınıza karşılık gelen <filename class="extension">.kwl</filename> dosyasını seçmeniz gerekir.

source: &kwallet5; supports multiple wallets, so for the most secure operation, you should use one wallet for local passwords, and another for network passwords and form data. You can configure this behavior in the &kwallet5; &systemsettings; module, however the default setting is to store everything in one wallet named <guilabel>kdewallet</guilabel>.
tr: &kwallet5; birden çok cüzdanı destekler, bu nedenle en güvenli işlem için yerel parolalar için bir cüzdan, ağ parolaları ve form verileri için başka bir cüzdan kullanmaktır. Bu davranışı &kwallet5; &systemsettings; modülünden yapılandırabilirsiniz; ancak öntanımlı ayar, her şeyi <guilabel>kdewallet</guilabel> adlı tek bir cüzdanda saklamaktır.

source: A wallet is by default closed, which means that you must supply a password to open it. Once the wallet is opened, the contents can be read by any user process, so this may be a security issue.
tr: Bir cüzdan öntanımlı olarak kapalıdır, bu da onu açmak için bir parola sağlamanız gerektiği anlamına gelir. Cüzdan açıldıktan sonra içerik herhangi bir kullanıcı işlemi tarafından okunabilir, dolayısıyla bu bir güvenlik sorunu olabilir.

source: Using &kwallet5;
tr: &kwallet5; Kullanımı

source: If you visit &eg; the &kde; bugtracker and enter the login data for the first time, a dialog pops up offering to store the password in an encrypted wallet:
tr: Örneğin, &kde; hata izleyicisini ziyaret edip giriş verinizi ilk kez girdiğinizde, parolayı şifreli bir cüzdan içine saklamanızı öneren bir iletişim penceresi açılır:

source: <screeninfo>Request to save login information</screeninfo>
tr: <screeninfo>Giriş bilgilerini kaydetme isteği</screeninfo>

source: <phrase>Request to save login information</phrase>
tr: <phrase>Giriş bilgilerini kaydetme isteği</phrase>

source: If you want to store this information, select <guibutton>Store</guibutton> to proceed. In case you did not create a wallet so far, the next dialog asks for the encryption backend and creates a wallet named kdewallet.
tr: Bu bilgiyi depolamak istiyorsanız <guibutton>Depola</guibutton> ögesini kullanın. Şimdiye kadar bir cüzdan oluşturmadıysanız bir sonraki iletişim penceresi şifreleme arka ucunu sorar ve kdewallet adlı bir cüzdan oluşturur.

source: Next time you visit the same website again, the application retrieves the login data from an open wallet and prefills the forms with these secrets.
tr: Aynı web sitesini yeniden ziyaret ettiğinizde, uygulama oturum açma verilerini açık bir cüzdandan alır ve formları bu gizlerle önceden doldurur.

source: <screeninfo>Prefilled login information</screeninfo>
tr: <screeninfo>Önceden doldurulmuş giriş bilgisi</screeninfo>

source: <phrase>Prefilled login information</phrase>
tr: <phrase>Önceden doldurulmuş giriş bilgisi</phrase>

source: If the wallet is closed the application requests to open the wallet. Enter the wallet password and click the <guibutton>Open</guibutton> button.
tr: Cüzdan kapalıysa uygulama cüzdanı açma isteği gönderir. Cüzdan parolasını girin ve <guibutton>Aç</guibutton> düğmesine tıklayın.

source: <screeninfo>Request to open a wallet</screeninfo>
tr: <screeninfo>Cüzdan açma isteği</screeninfo>

source: <phrase>Request to open a wallet</phrase>
tr: <phrase>Cüzdan açma isteği</phrase>

source: This connects the application to the wallet, enables it to read the login data from the wallet and to restore the login information for this website. Once an application is connected to the wallet, it can automatically restore any login information stored in the wallet.
tr: Bu, uygulamayı cüzdana bağlar, cüzdandan oturum açma verilerini okumasını ve bu web sitesi için oturum açma bilgilerini geri yüklemesini sağlar. Bir uygulama cüzdana bağlandığında, cüzdanda saklanan tüm giriş bilgilerini kendiliğinden geri yükleyebilir.

source: &kwalletmanager5; serves a number of functions. Firstly it allows you to see if any wallets are open, which wallets those are, and which applications are using each wallet. You can disconnect an application's access to a wallet from within the &kwalletmanager5;.
tr: &kwalletmanager5;, bir dizi işlev sağlar. Öncelikle, herhangi bir cüzdanın açık olup olmadığını, bu cüzdanı olup olmadığını ve hangi uygulamaların hangi cüzdanı kullandığını görmenizi sağlar. Bir uygulamanın &kwalletmanager5; içinden bir cüzdana erişimini kesebilirsiniz.

source: You may also manage the wallets installed on the system, creating and deleting wallets and manipulating their contents (changing keys, ...).
tr: Ayrıca sistemde kurulu olan cüzdanları yönetebilir, cüzdan oluşturabilir, silebilir ve içeriklerini düzenleyebilirsiniz (anahtar değiştirme, vb.).

source: The &kwalletmanager5; application is launched with <menuchoice> <guimenu>Applications</guimenu><guisubmenu>System</guisubmenu> <guimenuitem>Wallet Management Tool</guimenuitem></menuchoice> from the application launcher. Alternatively start &krunner; with shortcut <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> and enter <command>kwalletmanager5</command>.
tr: &kwalletmanager5;, uygulaması, başlatıcıdan <menuchoice> <guimenu>Uygulamalar</guimenu><guisubmenu>Sistem</guisubmenu> <guimenuitem>Cüzdan Yönetim Aracı</guimenuitem></menuchoice> üzerinden başlatılabilir. Alternatif olarak, <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> kısayolu ile &krunner; başlatabilir ve <command>kwalletmanager5</command> komutunu girebilirsiniz.

source: Click once on the system tray wallet icon to display the &kwalletmanager5; window.
tr: &kwalletmanager5; penceresini görüntülemek için sistem tepsisindeki cüzdan simgesine bir kere tıklamanız yeterlidir.

source: <screeninfo>Main window with one wallet</screeninfo>
tr: <screeninfo>Tek cüzdan içeren ana pencere</screeninfo>

source: <phrase>Main window with one wallet</phrase>
tr: <phrase>Tek cüzdan içeren ana pencere</phrase>

source: <para>Main window with one wallet</para>
tr: <para>Tek cüzdan içeren ana pencere</para>

source: The Wallet Window
tr: Cüzdan Penceresi

source: If you have more than one wallet all available wallets are shown on the left.
tr: Birden fazla cüzdanınız varsa tüm kullanılabilir cüzdanlar solda gösterilir.

source: Clicking on a wallet in the &kwalletmanager5; window will display that wallet's status and the contents of an opened wallet. A wallet may contain any number of folders, which allow storing of password information. By default a wallet will contain folders named Form Data and Passwords.
tr: &kwalletmanager5; içinde bir cüzdana tıklamak penceresi o cüzdanın durumunu ve açılmış bir cüzdanın içeriğini gösterecektir. Bir cüzdan, şifre bilgilerinin saklanmasına izin veren herhangi bir sayıda klasör içerebilir. Öntanımlı olarak bir cüzdan, Form Verileri ve Parolalar adlı klasörler içerecektir.

source: <screeninfo>Main window with two wallets</screeninfo>
tr: <screeninfo>İki cüzdanlı ana pencere</screeninfo>

source: <phrase>Main window with two wallets</phrase>
tr: <phrase>İki cüzdanlı ana pencere</phrase>

source: <para>Main window with two wallets</para>
tr: <para>İki cüzdanlı ana pencere</para>

source: Use <guibutton>Open</guibutton> to display the content of a closed wallet. You will be requested to enter the master password.
tr: Kapalı cüzdanın içeriğini göstermek için <guibutton>Aç</guibutton> düğmesini kullanın. Ana parolayı girmeniz istenecektir.

source: Contents tab
tr: İçerik sekmesi

source: The <guilabel>Contents</guilabel> tab has three sections:
tr: <guilabel>İçerik</guilabel> sekmesi üç bölümden oluşur:

source: A search line to filter the items of the current wallet
tr: Geçerli cüzdan ögelerini süzmek için bir arama satırı

source: The tree view of the folders contained in the wallet. Click the <guiicon>&gt;</guiicon> / <guiicon>v</guiicon> icons to expand or collapse the tree view.
tr: Cüzdanda bulunan klasörlerin ağaç görünümü. Ağaç görünümünü açıp kapatmak için <guiicon>&gt;</guiicon> / <guiicon>v</guiicon> simgelerine tıklayın.

source: The contents of the selected folder entry at the right side. By default the password and value are hidden. To display and edit them enable <guilabel>Show values</guilabel> or click the <guilabel>Show Contents</guilabel> button.
tr: Seçilen klasör girdisinin içeriği sağ taraftadır. Öntanımlı olarak parola ve değeri gizlidir. Bunları görüntülemek ve düzenlemek için <guilabel>Değerleri göster</guilabel> seçeneğini etkinleştirin veya <guilabel>İçeriği Göster</guilabel> düğmesine tıklayın.

source: Folders may be added or deleted via the context menu, and selecting a folder will update the folder entry list and the summary display. Selecting a folder entry will update the entry contents pane, and allow you to edit that entry.
tr: Bağlam menüsü aracılığıyla klasörler eklenebilir veya silinebilir ve bir klasör seçildiğinde, klasör giriş listesi ve özet ekranı güncellenir. Klasör girişinin seçilmesi, giriş içeriği bölmesini güncelleyecek ve bu girişi düzenlemenize izin verecektir.

source: Entries may also be created, renamed or deleted via the context menu for the folder contents.
tr: Klasör içeriği için içerik menüsü aracılığıyla girişler oluşturulabilir, yeniden adlandırılabilir veya silinebilir.

source: All folders and entries may be dragged and dropped into other wallets or folders respectively. This allows a user to easily package up a new wallet for transfer to another environment. For instance, a new wallet could be created and copied onto a removable flash memory device. Important passwords could be transferred there, so you have them available in other locations.
tr: Tüm klasörler ve girişler, sırasıyla diğer cüzdanlara veya klasörlere sürüklenebilir ve bırakılabilir. Bu, bir kullanıcının başka bir ortama aktarım için yeni bir cüzdanı kolayca paketlemesine olanak tanır. Örneğin, yeni bir cüzdan oluşturulabilir ve çıkarılabilir bir USB bellek aygıtına kopyalanabilir. Önemli parolalar buralara aktarılabilir, böylece onları başka konumlarda kullanabilirsiniz.

source: Import and Export
tr: İçe ve Dışa Aktarma

source: If you want to transfer your secrets to another device or computer use the actions in the <guimenu>File</guimenu> menu. With <guimenuitem>Export as encrypted</guimenuitem> wallets can be exported into an encrypted archive file. Importing this archive file with <guimenuitem>Import encrypted</guimenuitem> you have to provide the master password of the wallet.
tr: Gizli bilgileri başka bir aygıta veya bilgisayara aktarmak isterseniz <guimenu>Dosya</guimenu> menüsündeki işlemleri kullanabilirsiniz. <guimenuitem>Şifrelenmiş Olarak Dışa Aktar</guimenuitem>, cüzdanları, şifrelenmiş arşiv dosyası olarak dışa aktarır. Bu arşivi, <guimenuitem>Şifreliyi İçe Aktar</guimenuitem> seçeneğiyle içe aktarmak isterseniz cüzdanın ana parolasını belirtmeniz gerekir.

source: Alternatively a <filename class="extension">.xml</filename> file can be used for transferring a wallet. Keep in mind that all secrets are stored as plain text in this file.
tr: Alternatif olarak, bir cüzdanı aktarmak için bir <filename class="extension">.xml</filename> dosyası kullanılabilir. Tüm gizlerin bu dosyada düz metin olarak saklandığını unutmayın.

source: Adding Entries Manually
tr: Elle Girdiler Eklemek

source: Open the context menu with the &RMB; click on <guilabel>Maps</guilabel> or <guilabel>Passwords</guilabel> in the <guilabel>Folder</guilabel> tree view. Select <guimenuitem>New</guimenuitem> or <guimenuitem>New Folder</guimenuitem> and choose a name for the new entry.
tr: Bağlam menüsünü &RMB; ile açın. <guilabel>Klasör</guilabel> ağaç görünümünden, <guilabel>Haritalar</guilabel> veya <guilabel>Parolalar</guilabel> seçeneğine tıklayın. <guimenuitem>Yeni</guimenuitem> veya <guimenuitem>Yeni Klasör</guimenuitem> ögesini seçin ve yeni girdi için bir ad seçin.

source: In the folder contents pane select <guilabel>New Folder</guilabel> from the context menu of <quote>Form Data</quote> or <quote>Passwords</quote>. For passwords click the <guilabel>Show Contents</guilabel> button, enter the new password. For Maps you have to add a <guilabel>Key</guilabel> and a <guilabel>Value</guilabel>. Click the <guilabel>Save</guilabel> button to store the new entries in the encrypted wallet file.
tr: Klasör içerikleri bölmesinden, <quote>Form Verisi</quote> veya <quote>Parolalar</quote> ögelerinin bağlam menüsünden, <guilabel>Yeni Klasör</guilabel> seçin. Parolalar için <guilabel>İçeriği Göster</guilabel> düğmesine tıklayın ve yeni parola girin. Haritalar için <guilabel>Anahtar</guilabel> ve <guilabel>Değer</guilabel> eklemelisiniz. Yeni girdileri, şifrelenmiş cüzdan dosyasında saklamak için <guilabel>Kaydet</guilabel> düğmesine basın.

source: <title>Applications tab</title>
tr: <title>Uygulamalar sekmesi</title>

source: <screeninfo>Applications tab</screeninfo>
tr: <screeninfo>Uygulamalar sekmesi</screeninfo>

source: <phrase>Applications tab</phrase>
tr: <phrase>Uygulamalar sekmesi</phrase>

source: <para>Applications tab</para>
tr: <para>Uygulamalar sekmesi</para>

source: The first list shows all applications currently connected to the selected wallet. Use the button at the right side of each entry to disconnect the application.
tr: İlk liste, o anda seçilen cüzdana bağlı olan tüm uygulamaları gösterir. Uygulamanın bağlantısını kesmek için her girişin sağ tarafındaki düğmeyi kullanın.

source: In the second list all applications are displayed which are authorized to access the wallet. Use the button right of each entry in the list to revoke the access.
tr: İkinci listede, cüzdana erişme yetkisi olan tüm uygulamalar görüntülenir. Erişimi iptal etmek için listedeki her girişin sağındaki düğmeyi kullanın.
