Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kwalletmanager.po
Languages: tr

source: Configuring &kwallet5;
tr: &kwallet5; Yapılandırması

source: Wallet Preferences
tr: Cüzdan Tercihleri

source: &kwallet5; contains a small configuration panel with several options that allow you to tune &kwallet5; to your personal preferences. The default settings for &kwallet5; are sufficient for most users.
tr: &kwallet5; &kwallet5;’i kişisel tercihlerinize göre ayarlamanıza izin veren birkaç seçeneğe sahip küçük bir yapılandırma paneli içerir. &kwallet5; öntanımlı ayarları çoğu kullanıcı için yeterlidir.

source: Check the box to enable or disable the &kde; wallet subsystem entirely. If this box is unchecked, then &kwallet5; is entirely disabled and none of the other options here have any effect, nor will &kwallet5; record any information, or offer to fill in forms for you.
tr: &kde; cüzdan alt sistemini tamamen etkinleştirmek veya devre dışı bırakmak için kutuyu işaretleyin. Bu kutunun işareti kaldırılırs, &kwallet5; tümüyle devre dışı kalır ve burada diğer seçeneklerden hiçbirinin etkisi yoktur; bu durumda &kwallet5; herhangi bir bilgiyi kaydetmez veya sizin için formları doldurmayı teklif etmez.

source: Close Wallet
tr: Cüzdanı Kapat

source: Close when unused for:
tr: Şu kadar kullanılmazsa kapat:

source: Close the current wallet after a period of inactivity. If you check this option, set the period in the box, default is 10 minutes. When a wallet is closed, the password is needed to access it again.
tr: Bir süre işlem yapılmadığında geçerli cüzdanı kapat. Bu seçeneği işaretlerseniz kutuda süreyi ayarlayın, öntanımlı olarak 10 dakikadır. Bir cüzdan kapatıldığında, ona yeniden erişmek için parola gerekir.

source: Close when screensaver starts
tr: Ekran koruyucu başladığında kapat

source: Close the wallet as soon as the screen saver starts. When a wallet is closed, the password is needed to access it again.
tr: Ekran koruyucu başlar başlamaz cüzdanı kapat. Bir cüzdan kapatıldığında, ona yeniden erişmek için parola gerekir.

source: Close when last application stops using it
tr: Kullanan en son program kapatıldığında kapat

source: Close the wallet as soon as applications that use it have stopped. Note that your wallets will only be closed when all the applications that use it have stopped. When a wallet is closed, the password is needed to access it again.
tr: Onu kullanan uygulamalar durur durmaz cüzdanı kapat. Cüzdanlarınızın yalnızca onu kullanan tüm uygulamalar durduğunda kapatılacağını unutmayın. Bir cüzdan kapatıldığında, ona yeniden erişmek için parola gerekir.

source: Automatic Wallet Selection
tr: Otomatik Cüzdan Seçimi

source: Select wallet to use as default:
tr: Öntanımlı olarak kullanılacak cüzdanı seç:

source: Select which wallet you want to use as default wallet. Please keep in mind that only the wallet named <guilabel>kdewallet</guilabel> will be opened automatically at login, if this wallet and your login password are identical.
tr: Hangi cüzdanı öntanımlı cüzdan olarak kullanmak istediğinizi seçin. Yalnızca <guilabel>kdewallet</guilabel> adlı cüzdanın oturum açma sırasında bu cüzdan ve oturum açma şifreniz aynı ise.kendiliğinden açılacağını unutmayın.

source: Different wallet for local passwords:
tr: Yerel parolalar için farklı cüzdan:

source: If checked, choose a different wallet for local passwords.
tr: İşaretlenirse yerel parolalar için farklı bir cüzdan seçin.

source: Wallet Manager
tr: Cüzdan Yöneticisi

source: Show manager in system tray
tr: Sistem tepsisinde yöneticiyi göster

source: Enable the wallet manager to have its icon in the system tray.
tr: Cüzdan yöneticisinin simgesinin sistem tepsisinde olmasını sağlayın.

source: Hide System tray icon when last wallet closes
tr: En son cüzdan kapandığında sistem tepsisi simgesini gizle

source: When there is no wallet in use anymore, remove the wallet icon from the system tray.
tr: Kullanımda bir cüzdan kalmadığında, sistem tepsisindeki cüzdan simgesini kaldır.

source: Finally, there is a button labeled <guibutton>Launch Wallet Manager</guibutton>, which does precisely that.
tr: Son olarak, <guibutton>Cüzdan Yöneticisini Çalıştır</guibutton> etiketli bir düğme vardır, bu da tam olarak bunu yapmaktadır.

source: This button is only visible if &kwalletmanager5; is not running
tr: Bu düğme, yalnızca &kwalletmanager5; çalışmıyorken görünürdür

source: <title>Access Control</title>
tr: <title>Erişim Denetimi</title>

source: There is only one option on this page:
tr: Bu sayfada yalnızca tek bir seçenek vardır:

source: Prompt when an application accesses a wallet
tr: Bir program cüzdanlardan birine erişmeye çalıştığında uyar

source: Signal you when an application gains access to a wallet.
tr: Bir uygulama, herhangi bir cüzdana eriştiğinde sizi uyarır.

source: Next there is a tree style view of the access controls for your wallets.
tr: Ardından, cüzdanlarınız için erişim denetimlerinin ağaç biçemli görünümü vardır.

source: <screeninfo>Access Control</screeninfo>
tr: <screeninfo>Erişim Denetimi</screeninfo>

source: <phrase>Access Control</phrase>
tr: <phrase>Erişim Denetimi</phrase>

source: Click with the &LMB; on the <guiicon>&gt;</guiicon> symbol beside a wallet name to expand the tree. You will see the name of each application that has asked for access to the wallet, and the policy you set for it. You cannot edit policies here, or add them, but it is possible to delete an entry by &RMB; clicking on it and choosing <guimenuitem>Delete</guimenuitem> from the context menu that appears, or by simply selecting it and pressing the <keysym>Del</keysym> key.
tr: Ağacı genişletmek için cüzdanın yanındaki <guiicon>&gt;</guiicon> sembolüne &LMB; ile tıklayın. Cüzdana erişmek isteyen her uygulamanın adını ve bunun için belirlediğiniz politikayı göreceksiniz. Buradaki politikaları düzenleyemez veya ekleyemezsiniz; ancak bir girdiye &RMB; ile tıklayarak ve bağlam menüsünde gözüken <guimenuitem>Sil</guimenuitem> ögesini seçerek veya ögeyi seçip <keysym>Sil</keysym> düğmesine basarak silmek olanaklıdır.

source: An application that has been allowed access to a wallet is granted access to all passwords stored inside.
tr: Bir cüzdana erişimine izin verilen bir uygulamaya, içinde saklanan tüm şifrelere erişim izni verilir.

source: If you erroneously configured an application not to use the &kwallet5; delete the policy for this application here.
tr: Bir uygulamayı yanlışlıkla &kwallet5; kullanmayacak şekilde yapılandırdıysanız bu uygulama için politikayı buradan silin.

source: On the next start of this application you can define a new policy for access to the wallet.
tr: Bu uygulamanın bir sonraki başlangıcında, cüzdana erişim için yeni bir politika tanımlayabilirsiniz.

source: <screeninfo>Access request to open a wallet</screeninfo>
tr: <screeninfo>Açık bir cüzdana erişim isteği</screeninfo>

source: <phrase>Access request to open a wallet</phrase>
tr: <phrase>Açık bir cüzdana erişim isteği</phrase>

source: An application requesting access to a wallet
tr: Cüzdana erişim isteyen bir uygulama

source: Advanced Features
tr: Gelişmiş Özellikler

source: Wallets can be dragged from the &kwalletmanager5; window. This allows you to drag the wallet to a file browser window, where you can choose to copy, move, or link the wallet, as desired.
tr: Cüzdanlar &kwalletmanager5; penceresinden sürüklenebilir. Bu, cüzdanı istediğiniz gibi kopyalamanıza, taşımanıza veya bağlamayı seçebileceğiniz bir dosya tarayıcı penceresine sürükleyebilmenize izin verir.

source: You might use this to save a wallet to portable media, such as a USB keychain, so that you can take your passwords with you to work or on a vacation, and still have easy access to important sites.
tr: Bunu, bir cüzdanı USB anahtarlık gibi taşınabilir bir ortama kaydetmek için kullanabilirsiniz, böylece parolalarınızı işe veya tatile giderken yanınıza alabilir ve yine de önemli sitelere kolayca erişebilirsiniz.

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Documentation &copy; &Lauri.Watts; and &George.Staikos;
tr: Belgelendirme &copy; &Lauri.Watts; ve &George.Staikos;

source: CREDIT_FOR_TRANSLATORS
tr: <para>Kaan Özdinçer<email>kaanozdincer@gmail.com</email></para>
