Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/kwallet-query_man-kwallet-query.1.po
Languages: tr

source: <firstname>Valentin</firstname> <surname>Rusu</surname> <contrib>Original author</contrib> <address> <email>kde@rusu.info</email> </address>
tr: <firstname>Valentin</firstname> <surname>Rusu</surname> <contrib>Özgün yazar</contrib> <address> <email>kde@rusu.info</email> </address>

source: &kde; Wallet command-line manipulation tool
tr: &kde; Cüzdan komut satırı manipülasyon aracı

source: <emphasis role="strong">kwallet-query</emphasis> <emphasis>OPTIONS</emphasis> <emphasis>wallet</emphasis>
tr: <emphasis role="strong">kwallet-sorgusu</emphasis> <emphasis>SEÇENEKLER</emphasis> <emphasis>cüzdan</emphasis>

source: DESCRIPTION
tr: Açıklama

source: <command>kwallet-query</command> comes in handy when shell scripts need to read or update the &kde; Wallet. It works by manipulating the entries displayed in the <emphasis role="strong">&kde; Wallet Manager</emphasis> utility. It&#8217;s only parameter is the <emphasis>wallet</emphasis>name the tool should read or update. The operation mode is specified by the options.
tr: <command>kwallet-query</command>, kabuk betiklerinin &kde; Cüzdan’ı okuması veya güncellemesi gerektiğinde işe yarar. <emphasis role="strong">&kde; Cüzdan Yöneticisi</emphasis> izlencesindeki girdileri manipüle ederek çalışır. Tek parametresi, okuması veya güncellemesi gereken <emphasis>cüzdan</emphasis>adıdır. İşlem kipi, seçeneklerle belirtilir.

source: OPTIONS
tr: Seçenekler

source: Display a short help message.
tr: Kısa bir yardım iletisi görüntüleyin.

source: List password entries. These are the folder names displayed in the <emphasis role="strong">&kde; Wallet Manager</emphasis> utility. If the <emphasis role="strong">-f</emphasis> option is given, this will only display the subfolders of the specified folder.
tr: Parola girdilerini listeleyin. Bunlar, <emphasis role="strong">&kde; Cüzdan Yöneticisi</emphasis> İzlencesinde listelenen klasör adlarıdır. <emphasis role="strong">-f</emphasis> seçeneği verilmişse bu yalnızca belirtilen klasörün alt klasörlerini görüntüler.

source: <emphasis role="strong">-r,--read-password</emphasis> <emphasis>Entry</emphasis>
tr: <emphasis role="strong">-r,--read-password</emphasis> <emphasis>girdi</emphasis>

source: Read the contents of the given <emphasis>Entry</emphasis> from the <emphasis role="strong">Folder</emphasis>section of the <emphasis>wallet</emphasis> and output it on the standard output. Maps are exported as &JSON; object.
tr: <emphasis>cüzdan</emphasis>’ın <emphasis role="strong">klasör</emphasis>bölümünden verilen <emphasis>girdi</emphasis>’nin içeriğini okuyun ve standart çıktıya yönlendirin. Haritalar bir &JSON; nesnesi olarak dışa aktarılır.

source: <emphasis role="strong">-w,--write-password</emphasis> <emphasis>Entry</emphasis>
tr: <emphasis role="strong">-w,--write-password</emphasis> <emphasis>girdi</emphasis>

source: Write secrets to the given <emphasis>Entry</emphasis> under the <emphasis role="strong">Folder</emphasis> section of the given <emphasis>wallet</emphasis>. The secrets are read from the standard input. Maps take in input a well-formed &JSON; object. <emphasis role="strong">IMPORTANT</emphasis> previous wallet entry value will be overwritten by this option, so be careful when using it!
tr: <emphasis>cüzdan</emphasis>’ın <emphasis role="strong">klasör</emphasis>bölümünden verilen <emphasis>girdi</emphasis>’ye gizleri yazın. Gizler standart girdi’den okunur. Haritalar, düzgünce oluşturulmuş bir &JSON; nesnesinden girdi alır. <emphasis role="strong">ÖNEMLİ</emphasis>, bir önceki cüzdan girdisinin bu seçenekle üzerine yazılır; bu yüzden kullanırken dikkatli olun!

source: <emphasis role="strong">-f,--folder</emphasis> <emphasis>Folder</emphasis>
tr: <emphasis role="strong">-f,--folder</emphasis> <emphasis>klasör</emphasis>

source: Set the <emphasis>wallet</emphasis> folder to <emphasis>Folder</emphasis> value. By default <emphasis role="strong">Passwords</emphasis> is used.
tr: <emphasis>cüzdan</emphasis> klasörünü <emphasis>klasör</emphasis> değerine ayarlayın. Öntanımlı olarak <emphasis role="strong">parolalar</emphasis> kullanılır.

source: Output more information when performing the operation, to help debugging.
tr: Hata ayıklamaya yardımcı olmak için işlemi gerçekleştirirken daha fazla bilgi çıktılayın.

source: EXIT STATUS
tr: Çıkış Durumu

source: Success.
tr: Başarılı.

source: The wallet <emphasis>wallet</emphasis> was not found.
tr: <emphasis>cüzdan</emphasis> bulunamadı

source: The wallet <emphasis>wallet</emphasis> could not be opened. For example, that would be an indication of a bad password entry or some other problem with the &kde; Wallet system.
tr: <emphasis>cüzdan</emphasis> açılamadı. Örneğin, bu hatalı bir parola girişine veya &kde; Cüzdan sistemindeki başka bir hataya işaret edebilir.

source: The <emphasis role="strong">Folder</emphasis> section was not found inside the wallet <emphasis>wallet</emphasis>. Perhaps the wallet file is corrupt?
tr: <emphasis>cüzdan</emphasis> içindeki <emphasis role="strong">klasör</emphasis> bölümü bulunamadı. Dosya bozuk olabilir mi?

source: The read or write operation has failed for some reason.
tr: Okuma veya yazma işlemi bir nedenden dolayı başarısız oldu.

source: BUGS
tr: Hatalar

source: Please report all bugs on the &kde; bug reporting website: bugs.kde.org. Be sure to select <quote>kwallet-query</quote> when submitting your bug-report.
tr: Lütfen tüm hataları bugs.kde.org adresindeki &kde; hata izleme sistemine rapor edin. Raporunuzu iletirken <quote>kwallet-query</quote> bileşenini seçtiğinizden emin olun.

source: AUTHOR
tr: Yazar

source: <command>kwallet-query</command> was originally written by Valentin Rusu and is part of &kde;.
tr: <command>kwallet-query</command>, ilk olarak Valentin Rusu tarafından yazılmıştır ve &kde;’nin bir parçasıdır.

source: COPYING
tr: Telif Hakkı

source: Copyright (C) 2015 Valentin Rusu. Free use of this software is granted under the terms of the &GNU; General Public License (GPL).
tr: Telif hakkı (C) 2015 Valentin Rusu. Bu yazılımın özgürce kullanımına &GNU; Genel Kamu Lisansı (GPL) altında izin verilmiştir.
