Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/lokalize.po
Languages: tr

source: The &lokalize; Handbook
tr: &lokalize; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@îcloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Applications 25.10
tr: Uygulamalar 25.10

source: &lokalize; is a computer-aided translation system that focuses on productivity and quality assurance. It has components usually included in CAT tools like translation memory, glossary, and also a unique translation merging (synchronization) capability. It is targeted for software translation and also integrates external conversion tools for freelance office document translation.
tr: &lokalize; üretkenlik ve kalite önceliği amaçlı bir bilgisayar destekli çeviri sistemidir. Genelde CAT araçlarında da bulunan çeviri belleği, kavram dizini ve ayrıca benzersiz bir çeviri birleştirme (eşzamanlama) yeteneğine iyedir. Yazılım çevirisi için özel olarak tasarlanmıştır ve serbest ofis belgeleri çevirisi için de dış dönüştürme araçları ile tümleşir.

source: localization
tr: yerelleştirme

source: internationalization
tr: uluslararasılaştırma

source: translation
tr: çeviri

source: globalization
tr: globalleştirme

source: Introduction
tr: Giriş

source: Usually program messages and documentation are written in English. Using a framework made of a set of tools and libraries, it is possible to have your favorite applications speak your native non-English language. This process of adapting an application to a specific language is known as <emphasis>localization</emphasis>. The localization process includes translating the program's interfaces and documentation to the various languages users need and, in some countries or regions, making the inputs and outputs conform to particular conventions. &lokalize; is a tool which will assist you in the localization process to make an application's interface speaks many languages.
tr: Genellikle, program iletileri ve belgelendirmeler İngilizce yazılır. Gerekli araçlar ve kitaplıklardan oluşan ilgili çatıları kullanarak, favori uygulamalarınızı İngilizce olmayan kendi ana dilinize çevirmeniz olanaklıdır. Bir uygulamayı belirli bir dile adapte etme olarak bilinen bu kavrama <emphasis>yerelleştirme</emphasis> denir. Yerelleştirme süreci, programın arayüzünü ve belgeledirmesini, kullanıcıların gereksinim duyduğu çeşitli dillere çevirme ve bazı ülke ve bölgelere göre girdi ve çıktıları çeşitli göreneklere uyacak biçimde ayarlamaktır. &lokalize;, bir uygulamanın arayüzünü birden çok dili konuşacak biçimde ayarlamada yardımcı olacak bir araçtır.

source: Every internationalization-aware program makes available for translation one or more message-catalog files. The extension of these files is <filename class="extension">.pot</filename>. <acronym>POT</acronym> is an acronym for <quote>Portable Object Template</quote>. &lokalize; is an advanced and easy to use PO file (&GNU; gettext message catalogs) editor. It is a computer-aided translation system for translators, written from scratch using the &kde; Platform 4 framework. Aside from basic editing of PO files with nifty auxiliary details, it integrates support for glossary, translation memory, diff-modes for QA, project managing, &etc; It has many features like full navigation capabilities, extensive editing functionality, search functions, syntax checking and statistics functions.
tr: Uluslararasılaştırma destekli her program, bir veya birden çok ileti kataloğu dosyasını çeviri için kullanıma sunar. Bu dosyaların uzantısı <filename class="extension">.pot</filename>’tur. <acronym>POT</acronym>, <quote>Portable Object Template</quote> (Taşınabilir Nesne Şablonu) ifadesinin baş harflerinden oluşan bir kısaltmadır. &lokalize;, gelişmiş ve kullanımı kolay bir PO dosyası (&GNU; gettext ileti kataloğu) düzenleyicisidir. &kde; Platform 4 çatısı kullanılarak sıfırdan yazılmıştır ve çevirmenler için gelişmiş bir bilgisayar destekli çeviri ortamı sunar. PO dosyalarının temel düzenlemesi yanında; kavram dizini, çeviri belleği, kalite önceliği için diff düğümleri, proje yönetimi vb. için destek içerir. Tam dolaşım yeteneği, gelişmiş düzenleme işlevselliği, arama işlevleri, sözdizim denetimi ve istatistik işlevleri gibi birçok özelliği vardır.

source: Portable Object (.po) files: Each translator takes a copy of one of these POT templates and begins to fill in the blanks: each message is translated into the language desired. The file containing the translated text is referred to as a PO (Portable Object) file.
tr: Portable Object (.po) dosyaları: Her bir çevirmen, bu POT şablonlarından birini alır ve boşlukları doldurmaya başlar; her bir ileti, istenen dile çevrilir. Çeviri metnini içeren dosya, artık bir PO (Portable Object) dosyası olarak anılır.

source: Editor
tr: Düzenleyici

source: Main Window
tr: Ana Pencere

source: By default, the main window contains six parts. The upper-right box is read-only and contains the current msgid (source text) field from the opened PO-file. The edit box just below this contains the msgstr (target text) field related to the msgid shown and here you can input or edit the translated text.
tr: Öntanımlı olarak, ana pencere altı bölümden oluştur. Sağ üst kutu saltokunurdur ve yalnızca açılmış PO/POT dosyasından alınan msgid’yi (kaynak metin) içerir. Bu kutunun altında bulunan düzenleme kutusu ise msgstr’yi (hedef metin) belirtir. Buraya metin girebilir veya girilen metni değiştirebilirsiniz.

source: The main default &lokalize; window
tr: Öntanımlı ana &lokalize; penceresi

source: This shows the default window when a file is opened.
tr: Bu, bir dosya açıldığındaki öntanımlı pencereyi gösterir

source: The top-left part of the main window shows the Translation Units. Below this, there is Unit Metadata section and it contains comments relevant to the currently displayed source text. In the lower-left, there is a Translation Memory section which shows the suggested translations from the translation memory database for the current source text entry. On the lower-right corner of the window, the glossary section is shown.
tr: Ana pencerenin sol üst köşesi Çeviri Birimleri’ni gösterir. Bunun altında Birim Üst Verisi vardır ve şu anda görüntülenen kaynak metinle ilgili yorumları içerir. Sol altta, geçerli kaynak metin girdisi için çeviri veritabanındaki önerilen çevirileri gösteren bir Çeviri Belleği bölümü vardır. Pencerenin sağ alt köşesinde, Kavram Dizini bölümü görüntülenir.

source: Translation files are opened in separate tabs, with two big multi-line edits as well as a bunch of <emphasis>tool views</emphasis>. These views can be stacked (similar to tabs), shown separately, or hidden. Translation files consist of many English-target pairs called <emphasis>units</emphasis>. A <emphasis>unit</emphasis> typically correspond to a single string in the user interface, or one paragraph in the documentation. The purpose of the first multi-line edit is to display the original part of the pair. The purpose of the second multi-line edit is to display the translation. You can navigate through the <emphasis>units</emphasis> via the <guilabel>Translation Units</guilabel> view or by using <keycap>Page Down</keycap> and <keycap>Page Up</keycap>.
tr: Çeviri dosyaları, ayrı sekmelerde iki büyük çoklu satır düzenleme görünümüyle ve birkaç <emphasis>araç görünümleriyle</emphasis> açılır. Bu görünümler üst üste yığılabilir (sekmeler gibi), ayrı ayrı gösterilebilir veya gizlenebilir. Çeviri dosyaları, <emphasis>birimler</emphasis> adı verilen birden çok İngilizce girdi eşinden oluşur. Bir <emphasis>birim</emphasis>, genelde kullanıcı arayüzündeki bir diziye veya belgelendirmedeki bir paragrafa denk gelir. İlk çoklu satır düzenlemesinin amacı, eşin özgün kısmını görüntülemektir. İkinci çoklu satır düzenlemesinin amacı ise çeviriyi görüntülemektir. <emphasis>Birimler</emphasis> arasında <guilabel>Çeviri Birimleri</guilabel> görünümü ile veya <keycap>Page Down</keycap> ve <keycap>Page Up</keycap> düğmeleriyle dolaşabilirsiniz.

source: A unit may be <emphasis>translated</emphasis> or <emphasis>untranslated</emphasis>. A translation of a translated unit may be <emphasis>ready</emphasis> or <emphasis>not ready</emphasis> (also called <emphasis>fuzzy</emphasis> sometimes). If the unit is not ready, its translation is rendered in italics. &lokalize; allows you to easily navigate through the file according to the state of their translation. See <guilabel>Go</guilabel> menu for the shortcuts. The status bar at the bottom of the window shows the current string number, total number of strings, total untranslated strings, total not ready (fuzzy) strings and status of the current string respectively. When navigating, untranslated units are treated as not ready. Also, you may use the filtering feature of <guilabel>Translation Units</guilabel> toolview. Pressing <keycap>Page Down</keycap> actually takes you to the next unit in filtered/sorted list of that tool view.
tr: Bir birim,<emphasis>çevrilmiş</emphasis> veya <emphasis>çevrilmemiş</emphasis> olabilir. Çevrilmiş bir birimin çevirisi <emphasis>hazır olabilir</emphasis> veya <emphasis>hazır olmayabilir</emphasis> (buna bazen <emphasis>bulanık</emphasis> çeviri de denir). Birim hazır değilse çevirisi yatık metinle gösterilir. &lokalize;, dosyada çeviri durumlarına göre kolayca dolaşmanıza izin verir. Kısayollar için <guilabel>Git</guilabel> menüsüne bir göz atın. Pencerenin altındaki durum çubuğu, sırasıyla geçerli dizi numarasını, toplam çevrilmemiş dizi sayısını, toplam hazır olmayan dizi sayısını ve geçerli dizinin durumunu gösterir. Dolaşırken, çevrilmemiş diziler hazır değil olarak varsayılır. Ayrıca, <guilabel>Çeviri Birimleri</guilabel> araç görünümünün süzme özelliğini kullanabilirsiniz. <keycap>Page Down</keycap> düğmesine basmak, sizi bu araç görünümündeki bir sonraki süzülmüş/sıralanmış birime götürür.

source: To ease up translation of the console applications where spacers in messages are important you can check the <guilabel>Visualize separators such as spaces, tabs and new lines in the editor</guilabel> item on the page <guilabel>Editing</guilabel> of the configuration window which can be opened by choosing the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &lokalize;...</guimenuitem></menuchoice> main menu item.
tr: İletilerdeki boşlukların önemli olduğu konsol uygulamalarının çevirisini kolaylaştırmak için <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>&lokalize; Uygulamasını Yapılandır…</guimenuitem></menuchoice> ana menü ögesindeki <guilabel>Düzenleme</guilabel> sekmesinden, <guilabel>Düzenleyicide boşluklar, sekmeler ve yeni satırlar gibi ayırıcıları görselleştir</guilabel> seçeneğini etkinleştirin.

source: If you have no access to the original translation template file (it is a common practice on some commercial translation projects) then you can use a translation file from the related language. Just choose the <menuchoice><guimenu>File</guimenu><guimenuitem>Clear all translated entries</guimenuitem></menuchoice> menu item or use <keycombo>&Ctrl;&Alt;<keycap>D</keycap></keycombo> shortcut to clear all translation units.
tr: Özgün çeviri şablonuna artık erişiminiz yoksa (kimi ticari çeviri projelerinde çok sık rastlanan bir durumdur) ilgili dilden bir çeviri dosyası kullanabilirsiniz. Tüm çeviri birimlerini temizlemek için <menuchoice><guimenu>Dosya</guimenu><guimenuitem>Tüm Çevrilmiş Girdileri Temizle</guimenuitem></menuchoice> menü ögesini veya <keycombo>&Ctrl;&Alt;<keycap>D</keycap></keycombo> kısayolunu kullanın.

source: To the main window one can add many more sections like <guilabel>Alternate Translations</guilabel>, <guilabel>Primary Sync</guilabel>, <guilabel>Secondary Sync</guilabel>, <guilabel>Binary Units</guilabel> by using <menuchoice><guimenu>Settings</guimenu><guimenuitem>Toolviews</guimenuitem></menuchoice> from the main menu.
tr: Ana menüden <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Araç Görünümleri</guimenuitem></menuchoice> ögesini kullanarak <guilabel>Alternatif Çeviriler</guilabel>, <guilabel>Birincil Eşzamanlama</guilabel>, <guilabel>İkincil Eşzamanlama</guilabel>, <guilabel>İkili Birimler</guilabel> vb. gibi birçok ek bölümü ana pencereye ekleyebilirsiniz.

source: Toolbars
tr: Araç Çubukları

source: You can add or remove actions in the toolbars using <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Toolbars...</guimenuitem></menuchoice> from the main menu.
tr: Ana menüden <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Araç Çubuklarını Yapılandır…</guimenuitem></menuchoice> ögesini kullanarak araç çubuğuna yeni eylemler ekleyebilir veya var olanları kaldırabilirsiniz.

source: Configure Toolbars
tr: Araç Çubuklarını Yapılandır

source: Here you can configure the toolbars.
tr: Buradan, araç çubuklarını yapılandırabilirsiniz.

source: For more information read the section about <ulink url="help:/fundamentals/config.html#toolbars">Toolbars</ulink> of the &kde; Fundamentals.
tr: Daha fazla bilgi için &kde; Temel Bilgisi içindeki <ulink url="help:/fundamentals/config.html#toolbars">Araç Çubukları</ulink> bölümünü okuyun.

source: Shortcut keys
tr: Kısayol Düğmeleri

source: You can save time by using shortcut keys during translation. To configure shortcut keys, use <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Shortcuts...</guimenuitem></menuchoice> from the main menu.
tr: Çeviri sırasında kısayol düğmelerini kullanarak zaman kazanabilirsiniz. Kısayol düğmelerini yapılandırmak için ana menüden <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Klavye Kısayollarını Yapılandır…</guimenuitem></menuchoice> ögesini kullanın.

source: Configure Shortcuts
tr: Kısayolları Yapılandır

source: Here you can configure the shortcut keys.
tr: Buradan, kısayol düğmelerini yapılandırabilirsiniz.

source: For more information read the section about <ulink url="help:/fundamentals/config.html#shortcuts">Shortcuts</ulink> of the &kde; Fundamentals.
tr: Daha fazla bilgi için &kde; Temel Bilgisi içindeki <ulink url="help:/fundamentals/config.html#toolbars">Kısayollar</ulink> bölümünü okuyun.

source: General Tips
tr: Genel Öneriler

source: If you are doing translations for &kde;, then either you will already have &lokalize; project file in your language folder (usually named <filename>index.lokalize</filename>), or you can select <menuchoice><guimenu>Project</guimenu><guimenuitem>Create new project</guimenuitem></menuchoice> and the wizard will download translation files for your language and will create project for you.
tr: &kde; için çeviri yapıyorsanız &lokalize; proje dosyasına büyük olasılıkla sahipsinizdir (genelde <filename>index.lokalize</filename> olarak adlandırılmıştır) veya <menuchoice><guimenu>Proje</guimenu><guimenuitem>Yeni Proje Oluştur</guimenuitem></menuchoice> menü ögesini seçtiğinizde sihirbaz diliniz için çeviri dosyalarını indirip projeyi sizin yerinize oluşturacaktır.

source: It is recommended that you get used to the keyboard shortcuts instead of the menus and toolbars for increased productivity. For example, use the <keycombo>&Ctrl;<keycap>L</keycap></keycombo> to focus <guilabel>Quick search</guilabel> input line to filter the unit list in <guilabel>Translation Units</guilabel> view. Once you are done, press <keycap>Page Down</keycap> to start moving along the filtered list. Pressing <keycap>Esc</keycap> in the filter input will move the focus back to the target text field without selecting another unit.
tr: Artırılmış üretkenlik için menü ve araç çubuklarına bağımlı olmak yerine klavye kısayollarına alışmanız önerilir. Örneğin, <guilabel>Çeviri Birimleri</guilabel> görünümündeki <guilabel>Tez ara…</guilabel> giriş satırına tez odaklanmak için <keycombo>&Ctrl;<keycap>L</keycap></keycombo> kısayolunu kullanın. Odaklandıktan sonra <keycap>Sayfa Aşağı</keycap>’ya basıp süzülen listede gezinmeye başlayın. Süzgeç girdisinde <keycap>Vazgeç</keycap> düğmesine basmak, odağı başka bir birimi seçmeden hedef metin alanına geri taşır.

source: If you are working with translation files in XLIFF format (definitely the case when you translate OpenDocument), then extended states are available (<emphasis>new</emphasis>, <emphasis>needs review</emphasis>, <emphasis>approved</emphasis>, &etc;). You may select them in drop-down menu of <guilabel>Approved</guilabel> button in the toolbar. Classification of the state as <emphasis>ready</emphasis> or <emphasis>not ready</emphasis> depends on the current <emphasis>workflow phase</emphasis> (<emphasis>translation</emphasis>, <emphasis>review</emphasis>, <emphasis>approval</emphasis>). A default phase for you depends on your <emphasis>role</emphasis> in the project (set in project settings). Each unit usually contains information about phase it was changed last time, and for each phase its owner is logged to the file.
tr: Eğer XLIFF biçimindeki çeviri dosyalarıyla çalışıyorsanız (OpenDocument çevirisi yapıyorsanız bunu kesin kullanırsınız) genişletilmiş durumlar kullanıma açıktır (<emphasis>yeni</emphasis>, <emphasis>gözden geçirme gerekiyor</emphasis>, <emphasis>onaylanmış</emphasis>, vb.). Bunları, araç çubuğundaki <guilabel>Onaylanmış</guilabel> düğmesindeki açılır menüden kullanabilirsiniz. <emphasis>Hazır</emphasis> veya <emphasis>Hazır Değil</emphasis> biçimindeki bir sınıflandırmaya, geçerli <emphasis>iş akışı aşamalarına </emphasis> göre karar verilir (<emphasis>çeviri</emphasis>, <emphasis>gözden geçirme</emphasis>, <emphasis>onay</emphasis>). Sizin için kullanılacak öntanımlı faza, projedeki <emphasis>rolünüze</emphasis> göre karar verilir (proje ayarlarından belirlenir). Her birim, genelde son değiştirilen fazı hakkında bilgi içerir ve her bir faz için onun sahibi dosyaya günlüklenir.

source: Projects
tr: Projeler

source: General Notes
tr: Genel Notlar

source: The projects are one of the main concepts in &lokalize;. A project is represented by a file that contains paths, folders with translations, templates, and other files: glossary file, automation scripts, translation memories. Whenever &lokalize; opens a file without a project loaded, it will search for a project file in the parent folders (up to four levels). Alternatively, you can specify the project file via the <userinput>--project</userinput> flag when starting &lokalize; from the command line.
tr: Projeler, &lokalize;’deki ana kavramlardan biridir. Bir proje, yolları, çevirileri olan klasörleri, şablonları ve diğer dosyaları içeren bir dosyayla temsil edilir: Kavram dizini dosyası, otomasyon komut dosyaları, çeviri bellekleri. &lokalize;, yüklü bir proje olmadan bir dosyayı açarsa ana klasörlerde (dört düzeye kadar) bir proje dosyası arar. Alternatif olarak, &lokalize;’yi başlatırken proje dosyasını <userinput>--project</userinput> bayrağıyla komut satırından belirtebilirsiniz.

source: For each project you select your role in it (<emphasis>translator</emphasis>, <emphasis>reviewer</emphasis>, <emphasis>approver</emphasis>), which in turn affects the workflow phase &lokalize; automatically picks up for files you edit.
tr: Her proje için rolünüzü seçersiniz (<emphasis>çevirmen</emphasis>, <emphasis>gözden geçiren</emphasis>,<emphasis>onaylayan</emphasis>), bu da iş akışı aşamasını etkiler. &lokalize;, düzenlediğiniz dosyaları otomatik olarak alır.

source: It is possible to define a word wrapping position on a project level. Just use the <menuchoice><guimenu>Project</guimenu> <guimenuitem>Configure project...</guimenuitem></menuchoice> menu item then go to the <guilabel>Advanced</guilabel> page.
tr: Bir proje düzeyinde bir sözcük kaydırma konumu tanımlamak olanaklıdır. <menuchoice><guimenu>Proje</guimenu><guimenuitem>Projeyi Yapılandır…</guimenuitem></menuchoice> menü ögesini kullanmanız ve ardından <guilabel>Gelişmiş</guilabel> sayfasına gitmeniz yeterlidir.

source: Translation memories (unlike project files, glossary and scripts) are not shared between the translation team members, as they are created and stored under the user's home folder, meaning that the translation memories for all of the projects are stored in the same folder and thus can be used when other projects are opened.
tr: Çeviri bellekleri (proje dosyaları, sözlük ve betiklerin aksine), çeviri ekibi üyeleri arasında paylaşılmaz; çünkü bunlar kullanıcının ana klasörü altında oluşturulur ve saklanır, yani tüm projeler için çeviri bellekleri aynı klasörde saklanır ve böylece diğer projeler açıldığında kullanılabilir.

source: Project Overview tab
tr: Proje Genel Görünümü Sekmesi

source: When you start &lokalize; first time, you will see an empty <guilabel>Project Overview</guilabel> tab. Project Overview is a file manager view, which helps you keep an overview of your PO files. The &lokalize; suite will help you to translate quickly and also to keep translations consistent. &lokalize; workflow implies that you start with creating/opening a project.
tr: &lokalize;’yi ilk kez başlattığınızda, boş bir <guilabel>Proje Genel Görünümü</guilabel> sekmesini görürsünüz. Proje Genel Görünümü, PO dosyalarınızın çetelesini tutmanıza yardımcı olan bir dosya yöneticisi görünümüdür. &lokalize; süiti, sizi tez çevirmeye başlamanıza ve çevirilerinizi tutarlı yapmanıza yardımcı olacaktır. &lokalize; iş akışı, bir proje oluşturarak/açarak başlayacağınızı varsayar.

source: To create a new project, use <menuchoice><guimenu>Project</guimenu><guimenuitem>Create new project</guimenuitem></menuchoice>. This will guide through the steps to create a new project. In <guimenu>Project</guimenu> menu you can also find options like <guimenuitem>Project overview</guimenuitem>, <guimenuitem>Configure project</guimenuitem>, <guimenuitem>Open project</guimenuitem>, and <guimenuitem>Open recent project</guimenuitem>.
tr: Yeni bir proje oluşturmak için <menuchoice><guimenu>Proje</guimenu><guimenuitem>Yazılım Çeviri Projesi Oluştur</guimenuitem></menuchoice> ögesini kullanın. Bu, sizi yeni bir proje oluşturmak için gerekli adımlar ile yönlendirir. <guimenu>Proje</guimenu> menüsünde ayrıca <guimenuitem>Proje Genel Görünümü</guimenuitem>, <guimenuitem>Projeyi Yapılandır</guimenuitem>, <guimenuitem>Proje Aç</guimenuitem> ve <guimenuitem>Son Kullanılan Projeyi Aç</guimenuitem> gibi ögeler bulunur.

source: Project Overview Tab
tr: Proje Genel Görünümü Sekmesi

source: Here you can configure the project.
tr: Buradan projenizi yapılandırabilirsiniz.

source: The <guilabel>Project Overview</guilabel> tab displays a file tree with statistics for a current project, such as the percentage of translated units completed and the last translator. It allows you to open a selected file in a new tab of the current &lokalize; window.
tr: <guilabel>Proje Genel Görünümü</guilabel> sekmesi, geçerli bir proje için istatistikleri gösteren bir dosya ağacı görüntüler; örneğin, çevrilen birimlerin çeviri yüzdeleri ve son çevirmen gibi. Sizin geçerli &lokalize; penceresinde seçili bir dosyayı yeni bir sekmede açmanıza olanak tanır.

source: You can switch off the completely translated files from the <guilabel>Project Overview</guilabel> using the <guibutton>Hide completed items</guibutton> button on the main toolbar or <keycombo>&Ctrl;<keycap>T</keycap></keycombo> default shortcut.
tr: Tümüyle çevrilmiş dosyaları <guilabel>Proje Genel Görünümü</guilabel>’nden ana araç çubuğundaki <guibutton>Tamamlanan Ögeleri Gizle</guibutton> düğmesiyle veya <keycombo>&Ctrl;<keycap>T</keycap></keycombo> öntanımlı kısayoluyla gizleyebilirsiniz.
