Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/lokalize.po
Languages: tr

source: When you start &lokalize; the next time it will show the last opened file by default. You can switch off this behavior with the <guilabel>Restore the previously opened files when opening &lokalize;</guilabel> item on the page <guilabel>General</guilabel> of the configuration window which can be opened by choosing the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &lokalize;...</guimenuitem></menuchoice> main menu item. The same page can be used to configure &lokalize; behavior when you switch to the next/previous tab in it. It is possible to go through the tab list according to the tab positions or according to their activation order.
tr: &lokalize; uygulamasını bir sonraki başlatışınızda, öntanımlı olarak son açılan dosyayı gösterir. Bu davranışı, ayarlardan <guilabel>&lokalize;’yi başlatırken önceden açılan dosyaları geri yükle</guilabel> seçeneğiyle kapatabilirsiniz (<menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>&lokalize; Uygulamasını Yapılandır…</guimenuitem></menuchoice>, <guilabel>Genel</guilabel> sekmesi). Aynı sayfa, içindeki bir sonraki/önceki sekmeye geçtiğinizde &lokalize; davranışını yapılandırmak için kullanılabilir. Sekme listesinde sekme konumlarına göre veya etkinleştirme sıralarına göre ilerlemek olanaklıdır.

source: Glossary
tr: Kavram Dizini

source: Have you ever become tired of typing the same long text sequence several times just because it would take more time to find its translation for a copy and paste? Now you will only have to find the (frequent) word sequence in the <guilabel>Glossary</guilabel> view, and then insert it by pressing a shortcut.
tr: Sırf kopyala yapıştır için çevirisini bulmak daha fazla zaman alacağı için aynı uzun metin dizisini birkaç kez yazmaktan yoruldunuz mu hiç? Artık yalnızca <guilabel>Kavram Dizini</guilabel> görünümünde (sık kullanılan) sözcük dizisini bulmanız ve ardından bir kısayola basarak eklemeniz yeterlidir.

source: Of course the glossary should be populated with word sequences first. &lokalize; has a handy glossary editor that allows an explicit search over the entire glossary.
tr: Elbette kavram dizini, önce sözcük dizileriyle doldurulmalıdır. &lokalize;, tüm kavram dizini üzerinde açık bir arama yapılmasına olanak tanıyan kullanışlı bir düzenleyiciye sahiptir.

source: <screeninfo>Glossary view in the bottom right corner displays glossary entries appropriate for the current unit</screeninfo>
tr: <screeninfo>Sağ alt köşedeki kavram dizini görünümü, geçerli birim için uygun girdileri görüntülüyor</screeninfo>

source: <phrase>Glossary view in the bottom right corner displays glossary entries appropriate for the current unit</phrase>
tr: <phrase>Sağ alt köşedeki kavram dizini görünümü, geçerli birim için uygun girdileri görüntülüyor</phrase>

source: Translation Memory
tr: Çeviri Belleği

source: The <guilabel>Translation Memory</guilabel> view allows you to drag and drop a folder with translation files from say &dolphin; into the view, and then, within few minutes, translation suggestions will be shown automatically on the unit switch. To insert the translation suggestions into the file, use <keycombo>&Ctrl;<keycap>1</keycap></keycombo>, <keycombo>&Ctrl;<keycap>2</keycap></keycombo> and so on, depending on the number of suggestion.
tr: <guilabel>Çeviri Belleği</guilabel> görünümü, çeviri dosyaları içeren bir klasörü; örneğin, &dolphin; dosyalarını görünüme sürükleyip bırakmanıza olanak tanır. Birkaç dakika içinde, çeviri önerileri birime geçişte kendiliğinden görüntüleneceklerdir. Bir çeviri önerisini dosyaya geçirmek için <keycombo>&Ctrl;<keycap>1</keycap></keycombo>, <keycombo>&Ctrl;<keycap>2</keycap></keycombo> gibi ilerleyen klavye kısayollarını kullanın.

source: Use <menuchoice><guimenu>Tools</guimenu><guimenuitem>Manage translation memories</guimenuitem></menuchoice> to add/manage projects to your Translation Memory. Here you can also import or export data from <filename role="extension">tmx</filename> file format.
tr: Çeviri belleğinize projeler eklemek/yönetmek için <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Çeviri Belleğini Yönet</guimenuitem></menuchoice> seçeneğini kullanın. Buradan <filename role="extension">tmx</filename> biçimli dosyalardan veri içe aktarabilir veya veriyi dışa aktarabilirsiniz.

source: Pressing <keycombo><keycap>F7</keycap></keycombo> will open <guilabel>Translation Memory</guilabel> tab, which allows you to query the TM freely. Clicking a search result will open the corresponding file and unit. If you want to quickly open some file in the project (and it is added to TM), then instead of browsing <guilabel>Project Overview</guilabel> you can just type its name into the <guilabel>File mask</guilabel> field, accompanied by '*'.
tr: <keycombo><keycap>F7</keycap></keycombo> düğmesine basıldığında, çeviri belleğini serbestçe sorgulamanızı sağlayan <guilabel>Çeviri Belleği</guilabel> sekmesi açılacaktır. Bir arama sonucuna tıkladığınızda ilgili dosya ve birim açılır. Projedeki bir dosyayı tez açmak (ve çeviri belleğine eklemek) için <guilabel>Proje Genel Görünümü</guilabel> içinde bakınmak yerine onun adını <guilabel>Dosya maskesi</guilabel> alanına “*” ile yazabilirsiniz.

source: The TM engine indexes all entries, including non-ready and untranslated ones. This allows it to completely replace the Search-in-Files feature which required scanning every file in the project each time a search is done.
tr: TM işletkesi, hazır olmayan ve çevrilmemiş olanlar da içerilmek üzere tüm girdileri indeksler. Bu, her arama yapıldığında projedeki her dosyanın taranmasını gerektiren Dosyalar İçinde Ara özelliğinin tümüyle yerini almasını sağlar.

source: The outdated TM entries will be deleted from the &lokalize; translation memory on rescan or clicking a missing entry if you check the <guilabel>Delete missing files from translation memory on Rescan or when clicking a missing entry</guilabel> item on the page <guilabel>Translation Memory</guilabel> of the configuration window which can be opened by choosing the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &lokalize;...</guimenuitem></menuchoice> main menu item.
tr: Ayarlardaki <guilabel>Eksik dosyaları yeniden tararken veya kayıp girdiye sağ tıkladığında çeviri belledğinden sil</guilabel> seçeneği işaretliyse eski çeviri belleği girdileri &lokalize; çeviri belleğinden yeniden tarama veya eksik bir girdiye sağ tıklandığında kaldırılır (<menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>&lokalize; Uygulamasını Yapılandır…</guimenuitem></menuchoice>, <guilabel>Çeviri Belleği</guilabel> sayfası).

source: <screeninfo>&lokalize; with translation memory search results for the current unit</screeninfo>
tr: <screeninfo>Geçerli birim için çeviri belleği arama sonuçlarıyla &lokalize;</screeninfo>

source: <phrase>&lokalize; with translation memory search results for the current unit</phrase>
tr: <phrase>Geçerli birim için çeviri belleği arama sonuçlarıyla &lokalize;</phrase>

source: Batch Translation:
tr: Toplu Çeviri:

source: To insert the exactly matching suggestion automatically from the translation memory database, use <menuchoice><guimenu>Tools</guimenu><guimenuitem>Fill in all exact suggestions</guimenuitem></menuchoice> OR <guimenuitem>Fill in all exact suggestions and mark as fuzzy</guimenuitem>.
tr: Çeviri belleği veritabanından tam uyuşan önerileri kendiliğinden doldurmak için <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Tüm Tam Uyuşan Önerileri Doldur</guimenuitem></menuchoice> veya <guimenuitem>Tüm Tam Uyuşan Önerileri Doldur ve Belirsiz Olarak İmle</guimenuitem> seçeneklerini kullanın.

source: Translation Synchronization Capabilities
tr: Çeviri Eşzamanlama Yetenekleri

source: The <guilabel>Sync Mode</guilabel> (previously known as <guilabel>Merge Mode</guilabel>) saves a great deal of time for the editors, and for cases when two or more translators are working simultaneously on the same file, or when one has to maintain translations for several branches of software.
tr: <guilabel>Eşzamanlama Kipi</guilabel> (eski adı <guilabel>Birleştirme Kipi</guilabel>), editörlere pek çok zaman kazandırır ve iki veya daha çok çevirmen bir dosya üzerinde çalışıyorsa veya bir yazılımın birkaç dalı için çeviri bakımı gerekiyorsa çok yararlıdır.

source: &lokalize; allows quick navigation through units that differ, and displays word-by-word differences. Also, &lokalize; has two Sync views - <guilabel>Primary Sync</guilabel> and <guilabel>Secondary Sync</guilabel>. They are identical, but the former is usually used to merge translations and second to keep in sync translations for two software branches.
tr: &lokalize;, farklı birimlerde tez dolaşıma olanak tanır ve sözcük başına olan farkları görüntüler. Ayrıca &lokalize;’da iki eşzamanlama görünümü vardır — <guilabel>Birincil Eşzamanlama</guilabel> ve <guilabel>İkincil Eşzamanlama</guilabel>. Bunlar eşdeğerdir; ancak iki yazılım dalı bakımını yaparken birincisi çevirileri birleştirmede, ikincisi de çevirileri eşzamanlı tutmada kullanılır.

source: After you copied translation from auxiliary file (<emphasis>synchronized</emphasis> it), any subsequent changes made to this unit will be replicated back to auxiliary file.
tr: Çeviriyi yardımcı dosyadan kopyaladıktan sonra (<emphasis>eşzamanladığınızda</emphasis>), bu birimde yapılan sonraki tüm değişiklikler yardımcı dosyaya geri kopyalanacaktır.

source: Merging
tr: Birleştirme

source: One use of <guilabel>Sync Mode</guilabel> is reviewing changes made by (new) contributors, when you cannot be sure of the quality of the work done.
tr: <guilabel>Eşzamanlama Kipi</guilabel>’nin bir kullanımı da, yapılan işin kalitesinden emin olamadığınızda (yeni) katkıda bulunanlar tarafından yapılan değişiklikleri gözden geçirmektir.

source: Open a base file, then drop its changed version into the <guilabel>Primary Sync</guilabel> view, followed by <keycombo>&Alt;<keycap>Down</keycap></keycombo> or <keycombo>&Alt; <keycap>Up</keycap></keycombo> (remember that shortcuts may be modified in a usual way for all &kde; applications) to navigate through entries that are different.
tr: Taban dosyayı açın, değiştirilen sürümünü <guilabel>Birincil Eşzamanlama</guilabel> görünümüne sürükleyip bırakın, farklı olan girdilerde dolaşmak için <keycombo>&Alt;<keycap>Aşağı Ok Düğmesi</keycap></keycombo> veya <keycombo>&Alt; <keycap>Yukarı Ok Düğmesi</keycap></keycombo> kombinasyonlarını kullanın (&kde; uygulamalarında kısayolların tercihlerinize göre düzenlenebileceğini unutmayın).

source: <screeninfo>&lokalize; used for merging changes in translation</screeninfo>
tr: <screeninfo>Çevirideki değişiklikleri birleştirmek için kullanılırken &lokalize;</screeninfo>

source: <phrase>&lokalize; used for merging changes in translation</phrase>
tr: <phrase>Çevirideki değişiklikleri birleştirmek için kullanılırken &lokalize;</phrase>

source: Replication
tr: Yineleme

source: <guilabel>Sync Mode</guilabel> may also be used to make changes to translation for two branches simultaneously. Set <guilabel>Branch folder</guilabel> path in your project options to the path that corresponds to base folder of the branch, and <guilabel>Secondary Sync</guilabel> view will automatically open files from branch. Then, each time you make changes in files of your main branch, they will automatically be replicated to the branch (of course, if it contains the same English string).
tr: <guilabel>Eşzamanlama Kipi</guilabel>, aynı anda iki dalın çevirisinde değişiklik yapmak için de kullanılabilir. Proje seçeneklerinizdeki <guilabel>Dal klasörü</guilabel> yolunu dalın temel klasörüne karşılık gelen yol olarak ayarlayın ve <guilabel>İkincil Eşzamanlama</guilabel> görünümü kendiliğinden daldaki dosyaları açacaktır. Daha sonra, ana dalınızdaki dosyalarda her değişiklik yaptığınızda, bunlar kendiliğinden dala kopyalanacaktır (tabii ki aynı İngilizce diziyi içeriyorsa).

source: For example, if you work on &kde; translation, you can checkout trunk to <filename class="directory">/home/xx/hacking/kde/trunk/l10n-kf5/YOUR_LANG</filename> and branch to <filename class="directory">/home/xx/hacking/kde/branches/stable/l10n-kf5/YOUR_LANG</filename>. Create &lokalize; project: <filename>/home/xx/hacking/kde/trunk/l10n-kf5/YOUR_LANG/project.lokalize</filename> and set <filename class="directory">BranchDir=../../../branches/stable/l10n-kf5/YOUR_LANG</filename>, then work via this project, and commit changes in both trunk and branch folders.
tr: Örneğin, &kde; çevirileri üzerinde çalışıyorsanız trunk’ı <filename class="directory">/home/xx/hacking/kde/trunk/l10n-kf5/DİL_ADI</filename> yoluna ve stable’ı da <filename class="directory">/home/xx/hacking/kde/branches/stable/l10n-kf5/DİL_ADI</filename> yoluna çıkış yapın. &lokalize; projenizi: <filename>/home/xx/hacking/kde/trunk/l10n-kf5/DİL_ADI/proje.lokalize</filename> olarak oluşturun ve <filename class="directory">BranchDir=../../../branches/stable/l10n-kf5/DİL_ADI</filename> olarak ayarlayıp hem trunk ve stable klasörlerindeki değişiklikleri işleyin.

source: Alternate Translations
tr: Alternatif Çeviriler

source: Each unit may have several <emphasis>alternate translations</emphasis> associated with it. Such translations may appear during file update, when the source string is slightly changed. In this case the old translation with it's (old) source is moved to alternate translations list, so that they are not lost.
tr: Her birim, kendisiyle ilişkili birkaç <emphasis>alternatif çeviriye</emphasis> sahip olabilir. Bu tür çeviriler dosya güncellemesi sırasında, kaynak dizisi biraz değiştiğinde ortaya çıkabilir. Bu durumda, eski çeviri (eski) kaynağıyla birlikte alternatif çeviriler listesine taşınır, böylece kaybolmazlar.

source: When translating software, usually gettext tools are used to prepare translation files. When original text changes, gettext tools update translation files and mark entries with changed original text as <emphasis>fuzzy</emphasis> (or <emphasis>non-ready</emphasis> in other terminology). They store previous original text so that translators could see what changes exactly were made. &lokalize; simplifies the life of the translator and highlights parts of the original text that were changed in the <guilabel>Alternate Translations</guilabel> view.
tr: Yazılım çevirisi yaparken, çeviri dosyalarını hazırlamak için genellikle gettext araçları kullanılır. Özgün metin değiştiğinde, gettext araçları çeviri dosyalarını günceller ve değiştirilmiş özgün metne sahip girişleri <emphasis>bulanık</emphasis> (veya diğer terminolojide <emphasis>hazır olmayan</emphasis>) olarak imler. Çevirmenlerin tam olarak hangi değişikliklerin yapıldığını görebilmeleri için önceki özgün metni saklarlar. &lokalize; çevirmenin hayatını kolaylaştırır ve <guilabel>Alternatif Çeviriler</guilabel> görünümünde özgün metnin değiştirilen kısımlarını vurgular.

source: <screeninfo>&lokalize; highlighting parts of original text that were changed since translation was last reviewed</screeninfo>
tr: <screeninfo>&lokalize; çevirinin son gözden geçirilmesinden bu yana özgün metinde değiştirilen kısımların vurgularken</screeninfo>

source: <phrase>&lokalize; highlighting parts of original text that were changed since translation was last reviewed</phrase>
tr: <phrase>&lokalize; çevirinin son gözden geçirilmesinden bu yana özgün metinde değiştirilen kısımların vurgularken</phrase>

source: External Tools
tr: Dış Araçlar

source: The interaction with <application>Pology</application> can be configured using the page <guilabel>Pology</guilabel> of the configuration window which can be opened by choosing the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &lokalize;...</guimenuitem></menuchoice> main menu item.
tr: <guilabel>Pology</guilabel> yapılandırma sayfasını kullanarak, <application>Pology</application> uygulaması ile etkileşimi yapılandırabilirsiniz. Yapılandırma penceresini açmak için <menuchoice><guimenu>Ayarlar</guimenu> ana menü ögesinden <guimenuitem>&lokalize; Uygulamasını Yapılandır…</guimenuitem></menuchoice>’ı seçin.

source: For more information, please refer to <ulink url="http://pology.nedohodnik.net/">Pology homepage</ulink>.
tr: Daha fazla bilgi için lütfen <ulink url="http://pology.nedohodnik.net/">Pology ana sayfasına</ulink> başvurun.

source: <application>LanguageTool</application> offers spell and grammar checking of your translation units.
tr: <application>LanguageTool</application>, çeviri birimleriniz için yazım ve dilbilgisi denetimi sunar.

source: You can configure your custom <application>LanguageTool</application> server using the page <guilabel>LanguageTool</guilabel> of the configuration window which can be opened by choosing the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &lokalize;...</guimenuitem></menuchoice> main menu item.
tr: <guilabel>LanguageTool</guilabel> yapılandırma sayfasını kullanarak, kendi özel <application>LanguageTool</application> sunucunuzu yapılandırabilirsiniz. Yapılandırma penceresini açmak için <menuchoice><guimenu>Ayarlar</guimenu> ana menü ögesinden <guimenuitem>&lokalize; Uygulamasını Yapılandır…</guimenuitem></menuchoice>’ı seçin.

source: To utilize <application>LanguageTool</application> checking capabilities use the <menuchoice><guimenu>Edit</guimenu><guimenuitem>Check this unit using LanguageTool</guimenuitem></menuchoice> menu item or use <keycombo>&Ctrl;<keycap>J</keycap></keycombo> shortcut.
tr: <application>LanguageTool</application> denetleme yeteneklerinden yararlanmak için <menuchoice><guimenu>Düzen</guimenu><guimenuitem>Bu Birimi LanguageTool ile Denetle</guimenuitem></menuchoice> menü ögesini veya<keycombo>&Ctrl;<keycap>J</keycap></keycombo> kısayolunu kullanın.

source: For more information, please refer to <ulink url="https://languagetool.org/">LanguageTool homepage</ulink>.
tr: Daha fazla bilgi için lütfen <ulink url="https://languagetool.org/">LanguageTool ana sayfasına</ulink> başvurun.

source: Credits and License
tr: Katkıda Bulunanlar ve Teşekkürler

source: Program Copyright &copy; 2007-2015, Nick Shaforostoff <email>shaforostoff@kde.ru</email>
tr: Program telif hakkı &copy; 2007–2015, Nick Shaforostoff <email>shaforostoff@kde.ru</email>

source: Some code was taken from KBabel, the &lokalize; predecessor.
tr: Bazı kodlar, &lokalize; programının atası olan KBabel’den alınmıştır.

source: Documentation Copyright &copy; 2007-2009 Nick Shaforostoff <email>shaforostoff@kde.ru</email>
tr: Belgelendirme telif hakkı&copy; 2007–2009 Nick Shaforostoff <email>shaforostoff@kde.ru</email>

source: Author:
tr: Yazar:

source: See the <ulink url="http://userbase.kde.org/lokalize">&lokalize; homepage</ulink> for more details.
tr: Daha fazla ayrıntı için <ulink url="http://userbase.kde.org/lokalize">&lokalize; ana sayfasını</ulink> ziyaret edin.

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
