Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/meinproc6_man-meinproc6.1.po
Languages: tr

source: meinproc6 User's Manual
tr: meinproc6 Kullanıcı Kılavuzu

source: &kde; translator for &XML;
tr: &XML; için &kde; çevirmeni

source: Synopsis
tr: Özet

source: <command>meinproc6</command> <arg choice="opt">-h, --help</arg> <arg choice="opt">-v, --version</arg> <arg choice="opt">--cache<replaceable> file</replaceable></arg> <arg choice="opt">--check</arg> <arg choice="opt">--srcdir<replaceable> dir</replaceable></arg> <arg choice="opt">--param <replaceable>key</replaceable>=<replaceable>value</replaceable></arg> <group> <group> <arg>-o</arg> <arg>--output</arg> </group> <replaceable> file</replaceable> </group> <arg choice="opt">--stdout</arg> <arg choice="opt">--stylesheet<replaceable> xsl</replaceable></arg> <arg choice="plain">docbook_file</arg>
tr: <command>meinproc6</command> <arg choice="opt">-h, --help</arg> <arg choice="opt">-v, --version</arg> <arg choice="opt">--cache<replaceable> dosya</replaceable></arg> <arg choice="opt">--check</arg> <arg choice="opt">--srcdir<replaceable> dir</replaceable></arg> <arg choice="opt">--param <replaceable>anahtar</replaceable>=<replaceable>değer</replaceable></arg> <group> <group> <arg>-o</arg> <arg>--output</arg> </group> <replaceable> dosya</replaceable> </group> <arg choice="opt">--stdout</arg> <arg choice="opt">--stylesheet<replaceable> xsl</replaceable></arg> <arg choice="plain">docbook_file</arg>

source: Description
tr: Açıklama

source: <command>meinproc6</command> converts DocBook files to &HTML;.
tr: <command>meinproc6</command> komutu, DocBook dosyalarını &HTML; biçimine dönüştürür.

source: Generic Options
tr: Temel Seçenekler

source: Show help about options.
tr: Seçenekler üzerine yardım gösterin.

source: Show version information.
tr: Sürüm bilgisini gösterin.

source: Application Options
tr: Uygulama Seçenekleri

source: <option>--cache</option> <parameter>file</parameter>
tr: <option>--cache</option> <parameter>dosya</parameter>

source: Create a cache file for the document.
tr: Belge için bir önbellek dosyası oluşturun.

source: Check the document for validity.
tr: Belgeyi geçerlilik için denetleyin.

source: The output can be a bit daunting, since one small mistake can cause a cascade of errors. The trick is to look at the first error, fix that error, save the file, and run <command>meinproc6</command> again.
tr: Çıktı biraz göz korkutucu olabilir; çünkü küçük bir hata bir dizi hataya neden olabilir. İşin püf noktası, ilk hataya bakmak, bu hatayı düzeltmek, dosyayı kaydetmek ve <command>meinproc6</command>’yı yeniden çalıştırmaktır.

source: <option>-o</option>, <option>--output</option><parameter> file</parameter>
tr: <option>-o</option>, <option>--output</option><parameter> dosya</parameter>

source: Output whole document to <parameter>file</parameter>.
tr: Tüm dosyayı <parameter>dosya</parameter>’ya çıktılayın.

source: Output whole document to stdout.
tr: Tüm belgeyi stdout’a çıktılayın.

source: Stylesheet to use.
tr: Kullanılacak biçem sayfası.

source: <option>--srcdir</option> <parameter>dir</parameter>
tr: <option>--srcdir</option> <parameter>dizin</parameter>

source: Set the root directory to look for kdoctools.
tr: kdoctools’un aranacağı kök dizini ayarlayın.

source: Set parameters to pass to the stylesheet.
tr: Biçem sayfasına geçirilecek parametreleri ayarlayın.

source: Usage
tr: Kullanım

source: The most common way to run <command>meinproc6</command> is simply as <literallayout> <userinput><command>meinproc6</command> <replaceable>docbook-file</replaceable> </userinput> </literallayout> where <replaceable>docbook-file</replaceable> is usually index.docbook. This command creates &HTML; pages from the DocBook file. Note that these pages are only viewable in &kde;-based browsers (like &konqueror;).
tr: <command>meinproc6</command>’u kullanmanın en kolay yolu şöyledir: <literallayout> <userinput><command>meinproc6</command> <replaceable>docbook-dosyası</replaceable> </userinput> </literallayout>. Burada <replaceable>docbook-dosyası</replaceable> genelde index.docbook’tur. Bu komut, DocBook dosyalarından &HTML; sayfaları oluşturur. Bu sayfaların yalnızca &kde; tabanlı tarayıcılarda görüntülenebileceğini not edin (&konqueror; gibi).

source: If you need to view the &HTML; output in another browser (for example, if you're placing it on line), use <literallayout> <userinput><command>meinproc6</command> --stylesheet <replaceable>stylesheet-name</replaceable> <replaceable>docbook-file</replaceable> </userinput> </literallayout> where <replaceable>stylesheet-name</replaceable> is the full path to one of the &XSL; stylesheets in &lt;kdoctools_installation_prefix&gt;/share/kf5/kdoctools/customization/. To produce output suitable for the web, you can use <command>kde-web.xsl</command> or <command>kde-chunk-online.xsl</command>. See the <filename>README</filename> file in that directory for more details.
tr: &HTML; çıktısını başka bir tarayıcıde görüntülemeniz gerekiyorsa (örneğin internete koyacaksanız) <literallayout> <userinput><command>meinproc6</command> --stylesheet <replaceable>biçem sayfası adı</replaceable> <replaceable>docbook-dosyası</replaceable> </userinput> </literallayout> kullanın. Burada, <replaceable>biçem sayfası</replaceable>, &lt;kdoctools_installation_prefix&gt;/share/kf5/kdoctools/customization/ içindeki &XSL; biçem sayfalarıdır. Web için uygun çıktı üretmek için <command>kde-web.xsl</command> veya <command>kde-chunk-online.xsl</command> komutlarını kullanabilirsiniz. Daha fazla ayrıntı için aynı dizindeki <filename>README</filename> dosyasına bakın.

source: See Also
tr: Ayrıca Bakınız

source: Bugs
tr: Hatalar

source: Please use <ulink url="https://bugs.kde.org">&kde;'s bugtracker</ulink> to report bugs.
tr: Hataları bildirmek için lütfen <ulink url="https://bugs.kde.org">&kde;’nin hata izleyicisini</ulink> kullanın.
