Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/okular.po
Languages: tr

source: Click on the tool button, then click with the &LMB; to place the top-left corner of the rectangle, then drag to place the bottom-right one.
tr: Araç düğmesini tıklayın, ardından dikdörtgenin sol üst köşesini yerleştirmek için &LMB; ile tıklayın, ardından sağ alt köşeyi yerleştirmek için sürükleyin.

source: It is possible to define the <guilabel>Type</guilabel> (<guimenuitem>Rectangle</guimenuitem> or <guimenuitem>Ellipse</guimenuitem>), <guilabel>Color</guilabel>, <guilabel>Opacity</guilabel>, <guilabel>Shape fill</guilabel> (and its color), and <guilabel>Width</guilabel> for the border. Just right-click on the border created and select the <guimenuitem>Properties</guimenuitem> menu item.
tr: Kenarlığın <guilabel>Tür</guilabel>’ünü (<guimenuitem>Dörtgen</guimenuitem> veya <guimenuitem>Elips</guimenuitem>), <guilabel>Renk</guilabel>’ini, <guilabel>Matlık</guilabel>’ını, <guilabel>Renk dolgusu</guilabel>’nu (ve dolgunun rengini) ve <guilabel>Genişlik</guilabel>’ini tanımlamak olanaklıdır. Yalnızca oluşturulan kenarlığın üzerinde sağ tıklayın ve <guimenuitem>Özellikler</guimenuitem> menü ögesini seçin.

source: Ellipse (drop-down list)
tr: Elips (Açılır Liste)

source: Draws an ellipse or rectangle around a chosen area.
tr: Seçili bir alanın çevresine bir elips veya dikdörtgen çizer.

source: Click on the tool button, then click with the &LMB; and hold to place the top-left corner of the circumscribed rectangle for the ellipse, then drag to place the bottom-right one.
tr: Araç düğmesine tıklayın, ardından &LMB; ile tıklayın ve elips için çevrelenmiş dikdörtgenin sol üst köşesini yerleştirmek için basılı tutun, ardından sağ alt köşeyi yerleştirmek için sürükleyin.

source: Polygon (drop-down list)
tr: Çokgen (Açılır Liste)

source: Draws a closed shape from three or more line segments. The corresponding note can be viewed by double clicking inside the polygon.
tr: Üç veya daha fazla çizgi parçasından kapalı bir şekil çizer. İlgili not çokgenin içine çift tıklanarak görüntülenebilir.

source: Click on the tool button, then click with the &LMB; to place the first vertex of the polygon, then drag to place of the second vertex. Proceed until you have drawn the whole polygon and connected back up with the first vertex. Click twice to add a note to the polygon. Enter the text of the note then click on the <guibutton>OK</guibutton> to save the note, <guibutton>Clear</guibutton> to clear the note, or <guibutton>Cancel</guibutton> to cancel note entry.
tr: Araç düğmesine tıklayın, ardından çokgenin ilk köşesini yerleştirmek için &LMB; ile tıklayın, ardından ikinci köşenin yerine sürükleyin. Çokgenin tamamını çizip ilk köşeye bağlanana kadar sürdürün. Çokgene bir not eklemek için iki kez tıklayın. Notun metnini girin ve kaydetmek için <guibutton>Tamam</guibutton> düğmesine, notu temizlemek için <guibutton>Temizle</guibutton> düğmesine veya not girişini iptal etmek için <guibutton>İptal</guibutton> düğmesine tıklayın.

source: It is possible to define the <guilabel>Color</guilabel>, <guilabel>Opacity</guilabel>, <guilabel>Shape fill</guilabel> (and its color), and <guilabel>Width</guilabel> for the polygon. Just right-click on the polygon created and select the <guimenuitem>Properties</guimenuitem> menu item.
tr: Çokgenin <guilabel>Renk</guilabel>’ini, <guilabel>Matlık</guilabel>’ını, <guilabel>Şekil dolgusu</guilabel>’nu (ve dolgu rengini) ve <guilabel>Genişlik</guilabel>’ini tanımlamak olanaklıdır. Oluşturulan çokgenin üzerine sağ tıklayın ve <guimenuitem>Özellikler</guimenuitem> menü ögesini seçin.

source: Stamp
tr: Damga

source: Inserts a pre-defined shape into the document.
tr: Belgeye önceden tanımlanmış bir şekil ekler.

source: Click on the tool button to choose the stamp from the drop-down list then click with the &LMB; to place the stamp.
tr: Açılan listeden damgayı seçmek için araç düğmesine tıklayın ve ardından damgayı yerleştirmek için &LMB; ile tıklayın.

source: A single click just places a square stamp (useful for icons). To add a rectangular stamp you can click with the &LMB; and hold to place the top-left point, then drag to place the bottom-right one.
tr: Tek bir tıklama yalnızca kare bir damga yerleştirir (simgeler için kullanışlıdır). Dikdörtgen bir damga eklemek için &LMB; ile tıklayıp sol üst noktayı yerleştirmek için basılı tutabilir, ardından sağ alt noktayı yerleştirmek için sürükleyebilirsiniz.

source: It is possible to define the <guilabel>Opacity</guilabel> and <guilabel>Stamp symbol</guilabel> for the stamp. Just right-click on the stamp icon created and select the <guimenuitem>Properties</guimenuitem> menu item.
tr: Damganın <guilabel>Matlık</guilabel>’ını ve <guilabel>Damga simgesi</guilabel>’ni tanımlamak olanaklıdır. Oluşturulan damganın üzerine sağ tıklayın ve <guimenuitem>Özellikler</guimenuitem> menü ögesini seçin.

source: This feature is experimental. Custom stamps inserted in &PDF; documents are not visible in &PDF; readers other than &okular;.
tr: Bu özellik deneyseldir. &PDF; belgelerine eklenen özel damgalar, &okular; dışındaki &PDF; okuyucularında görünmez.

source: These are the default annotations provided by &okular;. Using the <link linkend="configannotations">Annotations page</link> of the configuration dialog you can add your own annotations like custom stamps, text markup or a geometrical shape with inner color to highlight regions &etc;
tr: Bunlar &okular; tarafından sağlanan öntanımlı bilgi notlarıdır. Yapılandırma iletişim kutusunun <link linkend="configannotations">Bilgi Notları</link> sayfasını kullanarak, bölgeleri vb. vurgulamak için özel damgalar, metin işaretlemesi veya iç renkli geometrik şekil gibi kendi açıklamalarınızı ekleyebilirsiniz.

source: It is possible to add &latex; code into the text of annotations. To do so, add <userinput>$$<replaceable>code</replaceable>$$</userinput> into the text of annotation, where <replaceable>code</replaceable> is any valid &latex; equation. Follow the instructions that will appear on the screen to render it using a &latex; distribution installed in your system.
tr: Bilgi notları metnine &latex; kodları eklemek olanaklıdır. Bunu yapmak için bilgi notu metnine <userinput>$$<replaceable>kod</replaceable>$$</userinput> ekleyin. <replaceable>kod</replaceable> yerine herhangi bir geçerli &latex; denklemini girebilirsiniz. Sisteminizde kurulu bir &latex; dağıtımını kullanarak oluşturmak için ekranda görünecek yönergeleri izleyin.

source: It is possible to configure the selected tool using the annotation toolbar itself:
tr: Bilgi Notları araç çubuğunun kendisini kullanarak seçilen aracı yapılandırmak olanaklıdır:

source: Option Name
tr: Seçenek Adı

source: Line width
tr: Çizgi genişliği

source: Click on this button to choose the width from the drop-down list.
tr: Açılır listeden genişliği seçmek için bu düğmeye tıklayın.

source: Annotation color
tr: Bilgi notu rengi

source: Click on this button to choose the color of the text or border of your annotation. You can chose one of the predefined colors or click on the <guimenuitem>Custom Color...</guimenuitem> item to open the color selection dialog.
tr: Bilgi notu metninin veya kenarlığının rengini seçmek için bu düğmeye tıklayın. Önceden tanımlanmış renklerden birini seçebilir veya renk seçimi iletişim kutusunu açmak için <guimenuitem>Özel Renk…</guimenuitem> ögesine tıklayabilirsiniz.

source: Annotation fill color
tr: Bilgi notu dolgu rengi

source: Click on this button to choose the fill color of your annotation. You can chose one of the predefined colors or click on the <guimenuitem>Custom Color...</guimenuitem> item to open the color selection dialog.
tr: Bilgi notu dolgu rengini seçmek için bu düğmeye tıklayın. Önceden tanımlanmış renklerden birini seçebilir veya renk seçimi iletişim kutusunu açmak için <guimenuitem>Özel Renk…</guimenuitem> ögesine tıklayabilirsiniz.

source: Annotation opacity
tr: Bilgi notu matlığı

source: Click on this button to choose the opacity of your annotation from the drop-down list (<guimenuitem>100%</guimenuitem> creates opaque annotations).
tr: Açılır listeden bilgi notu matlığını seçmek için bu düğmeye tıklayın (<guimenuitem>%​100</guimenuitem>, mat ek açıklamalar oluşturur).

source: Annotation font
tr: Bilgi notu yazıtipi

source: Click on this button to open the font selection dialog.
tr: Yazıtipi seçimi iletişim kutusunu açmak için bu düğmeye tıklayın.

source: Advanced settings for the current annotation tool
tr: Geçerli bilgi notu aracı için gelişmiş ayarlar

source: Click on this button to open the general configuration dialog for your annotation.
tr: Bilgi notu için genel yapılandırma iletişim kutusunu açmak için bu düğmeye tıklayın.

source: There are three additional utility buttons on the annotation toolbar:
tr: Bilgi notu araç çubuğunda üç adet ek izlence düğmesi vardır:

source: Add the current annotation to the <guilabel>Quick Annotations</guilabel> menu on the main toolbar.
tr: Geçerli bilgi notunu ana araç çubuğundaki <guilabel>Tez Bilgi Notları</guilabel> menüsüne ekleyin.

source: You can use the default shortcuts from <keycombo action="simul">&Alt;<keycap>9</keycap></keycombo> to <keycombo action="simul">&Alt;<keycap>0</keycap></keycombo> to select the quick annotation actions any time you like, even with the annotation toolbar hidden.
tr: Bilgi notu araç çubuğu gizli olsa bile <keycombo action="simul">&Alt;<keycap>9</keycap></keycombo> ile <keycombo action="simul">&Alt;<keycap>0</keycap></keycombo> arasındaki kısayollarla istediğiniz tez bilgi notu aracını seçebilirsiniz.

source: When checked, keep the current annotation tool active after use.
tr: İşaretlendiğinde, geçerli bilgi notu aracını kullanım sonrasında etkin tutarsınız.

source: Hide the annotation toolbar.
tr: Bilgi notu araç çubuğunu gizleyin.

source: By pressing &Shift; you can constrain the angle of line and polygon annotations to 15° steps, and the ratio of shape annotations (&eg; Rectangle, Ellipse) to 1:1. You can also get a toolbar button from <ulink url="help:/fundamentals/config.html#toolbars">Configure Toolbars...</ulink>.
tr: &Shift; düğmesini basılı tutarak, çizgi ve çokgen bilgi notu araçlarının açısını ve şekil bilgi notlarının (örneğin, Dörtgen, Elips) açısını 15° adımlara kısıtlayabilirsiniz. Ayrıca, <ulink url="help:/fundamentals/config.html#toolbars">Araç Çubuklarını Yapılandır…</ulink> ile araç çubuğu düğmeleri koyabilirsiniz.

source: The contents of the <guilabel>Quick Annotations</guilabel> menu can be configured using the <link linkend="configannotations">Annotations page of &okular; configuration dialog</link>. This page can be opened by clicking <guilabel>Quick Annotations</guilabel> button, then choosing <guimenuitem>Configure Annotations...</guimenuitem> from the pop-up menu.
tr: <guilabel>Tez Bilgi Notları</guilabel> menüsünün içeriği, <link linkend="configannotations">&okular; yapılandırma iletişim kutusunun bilgi notları sayfası</link> kullanılarak yapılandırılabilir. Bu sayfayı açmak için <guilabel>Tez Bilgi Notları</guilabel> düğmesine basın, sonrasında açılır menüden <guimenuitem>Bilgi Notlarını Yapılandır…</guimenuitem> ögesini seçin.

source: Activating the annotation toolbar will automatically switch to Browse Mode.
tr: Bilgi notu araç çubuğunu etkinleştirmek, kendiliğinden Göz At kipine geçilmesine neden olur.

source: You can stop annotating any time by pressing the button of the annotation you are using again, or by pressing the &Esc; key.
tr: Kullandığınız bilgi notu düğmesine yeniden veya &Esc; düğmesine basarak not eklemeyi istediğiniz zaman durdurabilirsiniz.

source: The newly created annotation will have the author you set in the <link linkend="configannotations"><guilabel>Annotations</guilabel> page</link> in &okular;s configuration dialog as its author. The <guilabel>Annotations</guilabel> page can also be used to configure the content of the annotations toolbar.
tr: Yeni oluşturulan bilgi notunun yazarı, &okular; yapılandırma iletişim kutusunun <link linkend="configannotations"><guilabel>Bilgi Notları</guilabel> sayfasında</link> ayarlanan kişiye (size) ayarlanır. <guilabel>Bilgi Notları</guilabel> sayfası aynı zamanda, bilgi notları araç çubuğunun içeriğini ayarlamak için de kullanılabilir.

source: Removing annotations
tr: Bilgi notlarını kaldırmak

source: To remove an annotation, first select the Browse tool (<menuchoice><guimenu>Tools</guimenu><guimenuitem>Browse</guimenuitem></menuchoice>) then just click on it with the &RMB;, and select <guimenuitem>Delete</guimenuitem> or select an annotation using the &LMB; and press the &Del; key.
tr: Bir bilgi notunu kaldırmak için önce Göz At aracını seçin (<menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Göz At</guimenuitem></menuchoice>), sonrasında &RMB; ile tıklayın ve <guimenuitem>Sil</guimenuitem>’i seçin veya bir bilgi notunu &LMB; ile seçip klavyede &Del; düğmesine basın.

source: When removing the annotation, its window will be closed if it is open.
tr: Bilgi notunu kaldırırken, penceresi açıksa kapatılır.

source: Editing annotations
tr: Bilgi notlarını düzenlemek

source: To edit an annotation, first select the Browse tool (<menuchoice><guimenu>Tools</guimenu><guimenuitem>Browse</guimenuitem></menuchoice>) then click on an annotation with the &RMB; and select <guimenuitem>Properties</guimenuitem>. A dialog will appear with the general annotation settings (like color and opacity, author, &etc;) and the settings specific to that annotation type.
tr: Bir bilgi notunu düzenlemek için önce Göz At aracını seçin (<menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Göz At</guimenuitem></menuchoice>), sonrasında &RMB; ile bir bilgi notunun üzerine tıklayın ve <guimenuitem>Özellikler</guimenuitem>’i seçin. Genel bilgi notu ayarlarını (renk, matlık, yazar vb.) ve o bilgi notu türüne özel ayarları içeren bir iletişim kutusu açılacaktır.

source: <screeninfo>Annotation Property Dialog</screeninfo>
tr: <screeninfo>Bilgi Notu Özellikleri İletişim Kutusu</screeninfo>

source: <phrase>Annotation Property Dialog</phrase>
tr: <phrase>Bilgi Notu Özellikleri İletişim Kutusu</phrase>

source: To move an annotation, hold down the &Ctrl; key, move the mouse pointer on it and then start dragging with the &LMB;.
tr: Bir bilgi notunu taşımak için &Ctrl; düğmesini basılı tutun, üzerinde fare işaretçisini hareket ettirin ve &LMB; ile sürüklemeye başlayın.

source: If you click with the &LMB; on an annotation, it gets selected. Resize handles appear on the selection rectangle. When the cursor is moved over one of the 8 resize handles on the corners or edges, the cursor shape changes to indicate the resize mode. Click anywhere else on the annotation to move it. Pressing &Esc; or clicking an area outside the annotation cancels a selection.
tr: Bir bilgi notuna &LMB; ile tıklarsanız seçilir. Seçim dikdörtgeninde yeniden boyutlandırma tutaçları görünür. İmleç köşelerdeki veya kenarlardaki 8 yeniden boyutlandırma tutacından birinin üzerine getirildiğinde, imlecin şekli yeniden boyutlandırma kipini gösterecek şekilde değişir. Notu taşımak için başka bir yere tıklayın. &Esc; düğmesine basmak veya bilgi notunun dışındaki bir alanı tıklatmak seçimi iptal eder.

source: Resizing is only available for the Inline Note, Typewriter, Stamp and Ellipse annotation types.
tr: Yeniden boyutlandırma yalnızc İç Not, Daktilo, Damga ve Elips bilgi notu türleri için kullanılabilirdir.

source: Some options may be disabled depending on the document's permissions (this typically only affects some &PDF; documents).
tr: Bazı seçenekler, belgenin izinlerine bağlı olarak devre dışı olabilir (bu genellikle yalnızca bazı &PDF; belgelerini etkiler).

source: Bookmark Management
tr: Yer İmi Yönetimi

source: &okular; has a very flexible bookmark system. &okular; saves the position on the page in bookmark and allows you to define more than one bookmark per page.
tr: &okular; çok esnek bir yer imi sistemine sahiptir. &okular;, sayfadaki konumu yer imine kaydeder ve sayfa başına birden fazla yer imi tanımlamanıza olanak tanır.

source: To manage bookmarks in &okular; you can use <guilabel>Bookmarks</guilabel> view from <guilabel>Sidebar</guilabel>, <link linkend="menubookmarks">Bookmarks menu</link> or context menu of document view (click with &RMB; to open it).
tr: &okular;’da yer imlerini yönetmek için <guilabel>Kenar Çubuğu</guilabel>’ndan, <link linkend="menubookmarks">Yer İmleri Menüsü</link>’nden veya belge görünümünün bağlam menüsünden (&RMB; ile tıklayın) <guilabel>Yer İmleri</guilabel>’ni kullanabilirsiniz.

source: Bookmarks view
tr: Yer İmleri görünümü

source: To open <guilabel>Bookmarks</guilabel> view, click on the <guilabel>Bookmarks</guilabel> tab at the top of the <guilabel>Sidebar</guilabel>. If the <guilabel>Sidebar</guilabel> is not shown, click the <guibutton>Show Sidebar</guibutton> button on the toolbar or the menu item, or the <menuchoice><shortcut><keycap>F7</keycap></shortcut> <guimenu>Settings</guimenu><guimenuitem>Show Sidebar</guimenuitem></menuchoice> menu item to make it visible.
tr: <guilabel>Yer İmleri</guilabel> görünümünü açmak için <guilabel>Kenar Çubuğu</guilabel>’ndaki <guilabel>Yer İmleri</guilabel> sekmesine tıklayın. <guilabel>Kenar Çubuğu</guilabel> gösterilmiyorsa onu görünür yapmak için araç çubuğundaki <guibutton>Kenar Çubuğu’nu Göster</guibutton> düğmesine veya menü ögesine veya <menuchoice><shortcut><keycap>F7</keycap></shortcut> <guimenu>Ayarlar</guimenu><guimenuitem>Kenar Çubuğunu Göster</guimenuitem></menuchoice> menü ögesine tıklayın.

source: <screeninfo>Bookmark view context menu</screeninfo>
tr: <screeninfo>Yer İmleri görünümü bağlam menüsü</screeninfo>

source: <phrase>Bookmark view context menu</phrase>
tr: <phrase>Yer İmleri görünümü bağlam menüsü</phrase>

source: The <guilabel>Show for all documents</guilabel> checkbox can be unchecked to show only the bookmarks from the current document.
tr: Yalnızca geçerli belge için olan yer imlerini göstermek için <guilabel>Tüm belgeler için göster</guilabel> işaret kutusunun işareti kaldırılabilir.

source: The filter bar at the top of <guilabel>Bookmarks</guilabel> view can be used to filter the content of bookmark list pane according to the text in the box.
tr: <guilabel>Yer İmleri</guilabel> görünümünün üst kısmındaki süzgeç çubuğu, metin kutusundaki metne göre yer imleri listesi panelinin içeriğini süzmek için kullanılabilir.

source: The list pane permits to view the bookmark list in a tree-like fashion: each document in the list can be <quote>expanded</quote> or <quote>collapsed</quote> by clicking on the <guiicon>&lt;</guiicon> or <guiicon>v</guiicon> icon next to it.
tr: Liste paneli, yer imleri listesini bir ağaç tarzında görüntülemeye izin verir; listedeki her bir belge <guiicon>&lt;</guiicon> veya yanındaki <guiicon>v</guiicon> simgesine tıklanılarak <quote>genişletilebilir</quote> veya <quote>daraltılabilir</quote>.

source: Right-click menu of document item can be used to open document, rename its item or remove it from the list. Remember that the removal of a document item leads to the removal of all bookmarks in the corresponding document.
tr: Belge ögesinin sağ tık menüsü, belgeyi açmak, ögesini yeniden adlandırmak veya listeden kaldırmak için kullanılabilir. Bir belge ögesinin kaldırılmasının, ilgili belgedeki tüm yer imlerinin de kaldırılmasına yol açacağını unutmayın.

source: Right-click menus of individual bookmark items allow you to go to the bookmark, rename or remove it.
tr: Bireysel yer imi ögelerinin sağ tık menüleri, yer imine gitmenize, onu yeniden adlandırmanıza veya kaldırmanıza olanak tanır.

source: The Right-click menu of items in the table of contents can be used to create bookmarks or go to the next or previous bookmark.
tr: İçindekiler tablosundaki ögelere ilişkin sağ tık menüsü, yer imleri oluşturmak veya sonraki veya önceki yer imlerine gitmek için kullanılabilir.

source: Command Line Options
tr: Komut Satırı Seçenekleri

source: Though &okular; may most often be started from the &kde; program menu, or a desktop icon, it can also be opened at the command line prompt of a terminal window. There are a few useful options that are available when doing this.
tr: &okular; çoğunlukla &kde; program menüsünden veya bir masaüstü simgesinden başlatılabilse de, bir uçbirim penceresinin komut satırı isteminden de açılabilir. Bunu yaparken kullanılabilecek birkaç yararlı seçenek vardır.

source: Specify a File
tr: Bir Dosya Belirt

source: By specifying the path and name of a particular file the user can have &okular; open that file immediately upon startup. This option might look something like the following:
tr: Kullanıcı, belirli bir dosyanın yolunu ve adını belirterek, &okular;’ın bu dosyayı başlatma sırasında hemen açmasını sağlayabilir. Bu seçenek aşağıdaki gibi görünebilir:

source: <prompt>%</prompt> <userinput><command>okular</command> <option><replaceable>/home/myhome/docs/mydoc.pdf</replaceable></option> </userinput>
tr: <prompt>%</prompt> <userinput><command>okular</command> <option><replaceable>/home/ben/belgeler/belgem.pdf</replaceable></option> </userinput>

source: For &PDF; documents, the name can be given as <replaceable>document_name</replaceable>#<replaceable>named_destination</replaceable> where <replaceable>named_destination</replaceable> is a particular named destination embedded in the document.
tr: &PDF; belgeleri için ad, <replaceable>belge_adı</replaceable>#<replaceable>konum_adı</replaceable> olarak verilebilir. Burada <replaceable>konum_adı</replaceable>, belgenin içinde gömülü olan belirli bir konum olabilir.

source: Other Command Line Options
tr: Diğer Komut Satırı Seçenekleri

source: The following command line help options are available
tr: Aşağıdaki komut satırı seçenekleri kullanılabilirdir

source: <command>okular</command> <option>-p --page <replaceable>number</replaceable></option>
tr: <command>okular</command> <option>-p --page <replaceable>sayı</replaceable></option>

source: Open a page with a given number in the document. Also available through <userinput><command>okular</command> <option>-p <replaceable>number</replaceable></option></userinput>
tr: Verilen sayfa numarasını belgede aç. Aynı zamanda, <userinput><command>okular</command> <option>-p <replaceable>sayı</replaceable></option></userinput> olarak da kullanılabilir

source: Start the document in presentation mode.
tr: Belgeyi sunum kipinde başlat.

source: Start with print dialog.
tr: Yazdırma iletişim kutusuyla başlat.

source: Start with print dialog and exit after printing.
tr: Yazdırma iletişim kutusuyla başlat ve yazdırma sonrası çık.

source: Unique instance control.
tr: Benzersiz örnek denetimi.

source: Allows to prevent &okular; window raising after the start.
tr: Başlangıç sonrası &okular; penceresinin yükseltilmesini önler.

source: <command>okular</command> <option>--find <replaceable>string</replaceable></option>
tr: <command>okular</command> <option>--find <replaceable>dizi</replaceable></option>

source: Tries to find and highlight a given string in the document. Only works if just one document is given as an argument of the <userinput><command>okular</command></userinput> command.
tr: Verilen diziyi belgede bulmayı ve onu vurgulamayı dener. Yalnızca <userinput><command>okular</command></userinput> komutuna argüman olarak 1 belge verilmişse çalışır.

source: <command>okular</command> <option>--editor-cmd <replaceable>string</replaceable></option>
tr: <command>okular</command> <option>--editor-cmd <replaceable>dizi</replaceable></option>
