Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/okular_man-okular.1.po
Languages: tr

source: Okular User's Manual
tr: Okular Kullanıcı Kılavuzu

source: <firstname>Yuri</firstname><surname>Chornoivan</surname> <contrib>Okular man page.</contrib> <email>yurchor@ukr.net</email>
tr: <firstname>Yuri</firstname><surname>Chornoivan</surname> <contrib>Okular man sayfası.</contrib> <email>yurchor@ukr.net</email>

source: a universal document viewer
tr: çok amaçlı bir belge görüntüleyicisi

source: <command>okular</command> <arg choice="opt"><replaceable>Okular options</replaceable></arg> <arg choice="opt"><replaceable>URL</replaceable></arg>
tr: <command>okular</command> <arg choice="opt"><replaceable>Okular seçenekleri</replaceable></arg> <arg choice="opt"><replaceable>URL</replaceable></arg>

source: Description
tr: Açıklama

source: <command>okular</command> is aimed to show documents in different formats.
tr: <command>okular</command>, değişik biçimlerdeki belgeleri göstermeyi amaçlar.

source: Okular options
tr: Okular seçenekleri

source: -p, --page <replaceable>number</replaceable>
tr: -p, --page <replaceable>sayı</replaceable>

source: Open a page with a given number in the document.
tr: Belgede numarası verilen bir sayfayı aç.

source: Start the document in presentation mode.
tr: Belgeyi sunum kipinde başlat.

source: Start with print dialog.
tr: Yazdırma iletişim kutusuyla başlat.

source: Start with print dialog and exit after printing.
tr: Yazdırma iletişim kutusuyla başlat ve yazdırma sonrası çık.

source: Unique instance control.
tr: Benzersiz örnek denetimi.

source: Allows to prevent Okular window raising after the start.
tr: Okular penceresinin başlatma sonrası öne gelmesini engelle.

source: --find <replaceable>string</replaceable>
tr: --find <replaceable>dizi</replaceable>

source: Tries to find and highlight a given string in the document. Only works if just one document is given as an argument of the okular command.
tr: Belgede belirli bir diziyi bulmaya ve vurgulamaya çalışır. Yalnızca okular komutunun argümanı olarak tek bir belge verildiğinde çalışır.

source: --editor-cmd <replaceable>string</replaceable>
tr: --editor-cmd <replaceable>dizi</replaceable>

source: Sets the external editor command. You cannot set the editor command in an already running Okular instance. Please note that <option>--unique</option> is not supported when setting the editor command at the commandline.
tr: Dış düzenleyici komutunu ayarlar. Zaten çalışan bir Okular örneğinde düzenleyici komutunu ayarlayamazsınız. Komut satırında düzenleyici komutunu ayarlarken <option>--unique</option>’in desteklenmediğini lütfen unutmayın.

source: Arguments
tr: Argümanlar

source: An address of the document to be opened. For PDF, can be given as <replaceable>document_name</replaceable>#<replaceable>named_destination</replaceable> where <replaceable>named_destination</replaceable> is a particular named destination embedded in the document.
tr: Açılacak belgenin adresi. PDF için <replaceable>belge_adı</replaceable>#<replaceable>adlı_hedef_konum</replaceable> olarak yapılır; burada <replaceable>adlı_hedef_konum</replaceable>, belgede gömülü özel bir konumdur.

source: Feedback
tr: Geri Bildirim

source: On IRC, irc.libera.chat #okular or via email, okular-devel@kde.org or on the web, &lt;<ulink url="https://okular.kde.org/">https://okular.kde.org/</ulink>&gt;.
tr: IRC’de irc.libera.chat #okular, e-posta ile okular-devel@kde.org veya web’de &lt;<ulink url="https://okular.kde.org/">https://okular.kde.org/</ulink>&gt;.

source: See Also
tr: Ayrıca

source: More detailed user documentation is available from <ulink url="help:/okular">help:/okular</ulink> (either enter this <acronym>URL</acronym> into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>help:/okular</parameter></userinput>).
tr: Ayrıntılı kullanıcı belgelendirmesine <ulink url="help:/okular">help:/okular</ulink> bölümünden ulaşabilirsiniz (ya bu &URL;’yi &konqueror;’a girin ya da <userinput><command>khelpcenter</command> <parameter>help:/okular</parameter></userinput> komutunu çalıştırın).

source: There is also further information available at <ulink url="https://okular.kde.org/">https://okular.kde.org/</ulink>
tr: Ayrıca <ulink url="https://okular.kde.org/">https://okular.kde.org/</ulink> adresinde ek bilgiler de bulunabilir

source: Copyright
tr: Telif Hakkı

source: Copyright &copy; 2002 Wilco Greven, Christophe Devriese
tr: Telif hakkı &copy; 2002 Wilco Greven, Christophe Devriese

source: Copyright &copy; 2004-2005 Enrico Ros
tr: Telif hakkı &copy; 2004–2005 Enrico Ros

source: Copyright &copy; 2005 Piotr Szymanski
tr: Telif hakkı &copy; 2005 Piotr Szymanski

source: Copyright &copy; 2004-2012 Albert Astals Cid
tr: Telif hakkı &copy; 2004–2012 Albert Astals Cid

source: Copyright &copy; 2006-2009 Pino Toscano
tr: Telif hakkı &copy; 2006–2009 Pino Toscano

source: License: GNU General Public Version 2 &lt;<ulink url="https://www.gnu.org/licenses/gpl-2.0.html">https://www.gnu.org/licenses/gpl-2.0.html</ulink>&gt;
tr: Lisans: GNU Genel Kamu Lisansı 2. Sürüm &lt;<ulink url="https://www.gnu.org/licenses/gpl-2.0.html">https://www.gnu.org/licenses/gpl-2.0.html</ulink>&gt;
