Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/okular.po
Languages: tr

source: <guilabel>Tap left/right side to go back/forward</guilabel>: Tapping on the left (right) half of the screen makes the presentation go to the previous (next) slide.
tr: <guilabel>İleri/Geri gitmek için sağ/sol tarafa dokun</guilabel>: Ekranın sol (sağ) yarısına dokunmak sunumun önceki (sonraki) slayda gitmesini sağlar.

source: <guilabel>Tap anywhere to go forward</guilabel> (default): Tapping on the screen makes the presentation go to the next slide, no matter where the screen is being tapped.
tr: <guilabel>İleri gitmek için herhangi bir yere dokun</guilabel> (öntanımlı): Ekrana dokunulduğunda, ekranın neresine dokunulursa dokunulsun sunum bir sonraki slayda geçer.

source: <guilabel>Disabled</guilabel>: Screen tapping does not do anything.
tr: <guilabel>Devre dışı</guilabel>: Ekrana dokunmak hiçbir şey yapmaz.

source: Background color
tr: Arka plan rengi

source: The color that will fill the part of the screen not covered by the page when on presentation mode.
tr: Sunum kipindeyken ekranın sayfanın kapsamadığı kısmını dolduracak renk.

source: Mouse cursor
tr: Fare imleci

source: Whether the mouse should be always hidden, always shown or hidden after a small time of inactivity.
tr: Farenin her zaman gizlenmesi mi, her zaman gösterilmesi mi yoksa kısa bir süre işlem yapılmadığında gizlenmesi mi gerektiği.

source: Show progress indicator
tr: İlerleme göstergesini göster

source: Whether to show a progress circle that shows the current page and the total number of pages on the upper right corner of the presentation screen every time you change the page.
tr: Sayfayı her değiştirdiğinizde sunum ekranının sağ üst köşesinde geçerli sayfayı ve toplam sayfa sayısını gösteren bir ilerleme çemberinin gösterilip gösterilmeyeceği.

source: Show summary page
tr: Özet sayfasını göster

source: Whether to show a summary page at the beginning of the presentation with the title, author and number of pages of the document.
tr: Sunumun başında belgenin başlığını, yazarını ve sayfa sayısını içeren bir özet sayfasının gösterilip gösterilmeyeceği.

source: Enable transitions
tr: Geçişleri etkinleştir

source: Use this check box to enable or disable transition effects between pages.
tr: Sayfalar arasındaki geçiş efektlerini etkinleştirmek veya devre dışı bırakmak için bu onay kutusunu kullanın.

source: Default transition
tr: Öntanımlı geçiş

source: The transition effect between page and page if the document does not specify one. Set this to <guilabel>Random Transition</guilabel> to make &okular; randomly choose one of the available effects.
tr: Belgede belirtilmemişse sayfalar arasındaki geçiş efekti. &okular;’ın kullanılabilir efektlerden birini rastgele seçmesini sağlamak için bunu <guilabel>Rastgele Geçiş</guilabel> olarak ayarlayın.

source: Placement
tr: Yerleştirme

source: In this section you can select the <guilabel>Screen</guilabel> used to display the presentation.
tr: Bu bölümde, sunumu görüntülemek için kullanılacak <guilabel>ekranı</guilabel> seçebilirsiniz.

source: <guilabel>Current Screen</guilabel> is same screen of the &okular; window that starts the presentation mode.
tr: <guilabel>Geçerli Ekran</guilabel>, sunum kipini başlatan &okular; penceresinin olduğu ekrandır.

source: <guilabel>Default Screen</guilabel> is the screen marked as default in the xinerama configuration.
tr: <guilabel>Öntanımlı Ekran</guilabel>, xinerama yapılandırmasında öntanımlı olarak imlenen ekrandır.

source: <guilabel>Screen 0</guilabel>, <guilabel>Screen 1</guilabel> &etc; are the available screens.
tr: <guilabel>Ekran 0</guilabel>, <guilabel>Ekran 1</guilabel> vb. kullanılabilir ekranlardır.

source: Drawing Tool Configuration
tr: Çizim Aracı Yapılandırması

source: Manage the colors of the pencil used when drawing on the pages during the presentation mode.
tr: Sunum kipinde sayfalarda çizim yaparken kullanılan kalemin renklerini yönetin.

source: <screeninfo>The Annotations page of the configuration dialog</screeninfo>
tr: <screeninfo>Yapılandırma iletişim kutusunun bilgi notları sayfası</screeninfo>

source: <phrase>The Annotations page of the configuration dialog</phrase>
tr: <phrase>Yapılandırma iletişim kutusunun bilgi notları sayfası</phrase>

source: Annotation toolbar
tr: Bilgi notu araç çubuğu

source: Allows switching between <guimenuitem>Full Annotation Toolbar</guimenuitem> (<link linkend="annotations-add">default toolbar</link> in the top section of the &okular; window) and <guimenuitem>Quick Annotation Toolbar</guimenuitem> (sliding toolbar with your favorite tools at the right part of the document pane).
tr: <guimenuitem>Tam Bilgi Notu Araç Çubuğu</guimenuitem> (&okular; penceresinin üst kısmındaki <link linkend="annotations-add">öntanımlı araç çubuğu</link>) ve <guimenuitem>Tez Bilgi Notu Araç Çubuğu</guimenuitem> (belge bölmesinin sağ kısmında favori araçlarınızın bulunduğu kayan araç çubuğu) arasında geçiş yapılmasına izin verir.

source: Author
tr: Yazar

source: The author of the contents added on a document. Default is the name from the <guilabel>Password &amp; User Account</guilabel> page of the &systemsettings; module <guilabel>Account Details</guilabel>.
tr: Bir belgeye eklenen içeriğin yazarı. Öntanımlı yazar adı, &systemsettings; <guilabel>Hesap Ayrıntıları</guilabel> modülünün <guilabel>Parola ve Kullanıcı Hesabı</guilabel> sayfasında belirtilen addır.

source: Annotation tools
tr: Bilgi notu araçları

source: This pane is used to configure your <link linkend="annotations-add">annotation toolbar</link>.
tr: Bu bölme, <link linkend="annotations-add">bilgi notu araç çubuğunuzu</link> yapılandırmak için kullanılır.

source: There are five buttons (<guibutton>Add</guibutton>, <guibutton>Edit</guibutton>, <guibutton>Remove</guibutton>, <guibutton>Move Up</guibutton>, <guibutton>Move Down</guibutton>) and a list box (which lists the contents of the current annotation toolbar) which are used to configure the toolbar.
tr: Araç çubuğunu yapılandırmak için kullanılan beş adet düğme (<guibutton>Ekle</guibutton>, <guibutton>Düzenle</guibutton>, <guibutton>Kaldır</guibutton>, <guibutton>Yukarı Taşı</guibutton>, <guibutton>Aşağı Taşı</guibutton>) ve (geçerli bilgi notu araç çubuğunun içeriğini listeleyen) bir liste kutusu vardır.

source: If you need to add some tool button on the toolbar click on the <guibutton>Add</guibutton> button. You can choose the <guilabel>Name</guilabel>, the <guilabel>Type</guilabel> and the <guilabel>Appearance</guilabel> of the created tool.
tr: Araç çubuğuna bir düğme eklemeniz gerekiyorsa <guibutton>Ekle</guibutton> düğmesine tıklayın. Oluşturulan aracın <guilabel>Ad</guilabel>, <guilabel>Tür</guilabel> ve <guilabel>Görünüş</guilabel> kalemlerini yapılandırabilirsiniz.

source: Please remember that annotation tools in &okular; are highly configurable. For example, you can have two buttons of the same tool but with different color. Do not hesitate to experiment in choosing the button set that is exactly tailored to your workflow.
tr: &okular;’daki bilgi notu araçlarının son derece yapılandırılabilir olduğunu lütfen unutmayın. Örneğin, aynı aracın farklı renklerde iki düğmesine sahip olabilirsiniz. İş akışınıza tam olarak uyarlanmış düğme kümesini seçmeyi denemekten çekinmeyin.

source: Click on some item in the list box then click on the corresponding button at the right part of the page to edit, remove, move up or move down the item. The keyboard shortcut of the tool (keys from <keycap>1</keycap> to <keycap>9</keycap>) depends on its position in the list of annotation toolbar.
tr: Liste kutusundaki bir ögeye tıklayın ve ardından ögeyi düzenlemek, kaldırmak, yukarı veya aşağı taşımak için sayfanın sağ kısmındaki ilgili düğmeye tıklayın. Aracın klavye kısayolu (<keycap>1</keycap> ile <keycap>9</keycap>), bilgi notu araç çubuğu listesindeki konumuna bağlıdır.

source: Using Custom Stamps
tr: Özel Damgalar Kullanmak

source: Create the icon you want to use for your own stamp and save it in any graphics format supported by &okular;
tr: Kendi damganız için kullanmak istediğiniz simgeyi oluşturun ve &okular; tarafından desteklenen herhangi bir grafik biçiminde kaydedin.

source: Click the <guibutton>Add</guibutton> button, select type <guilabel>Stamp</guilabel> and enter a name for your stamp.
tr: <guibutton>Ekle</guibutton> düğmesine tıklayın, tür olarak <guilabel>Damga</guilabel> seçin ve damganız için bir ad girin.

source: Enter the full path to your custom icon into the dropdown box in the <guilabel>Stamp Symbol</guilabel> group
tr: <guilabel>Damga Sembolü</guilabel> grubundaki açılır kutuya özel simgenizin tam yolunu girin.

source: <title>Editor</title>
tr: <title>Düzenleyici</title>

source: <guilabel>Editor</guilabel>
tr: <guilabel>Düzenleyici</guilabel>

source: Choose the editor you want to launch when &okular; wants to open a source file. This is the case when the document has references to the various points (usually row and column number) of sources it was generated from. The &DVI; format supports natively the addition of the information about the sources the &latex; document was generated from. A similar system exists for &PDF; documents, called <acronym>pdfsync</acronym>, which stores these extra information in an external file named after the &PDF; file itself (for example <filename>mydocument.pdfsync</filename> for <filename>mydocument.pdf</filename>).
tr: &okular; bir kaynak dosyasını açmak istediğinde başlatmak istediğiniz düzenleyiciyi seçin. Belgenin oluşturulduğu kaynakların çeşitli noktalarına (genellikle satır ve sütun numaraları) başvuruları olması durumunda bu durum söz konusudur. &DVI; biçimi, &latex; belgelerinin oluşturulduğu kaynaklar hakkındaki bilgilerin eklenmesini doğal olarak destekler. &PDF; belgeleri için <acronym>pdfsync</acronym> adı verilen benzer bir sistem mevcuttur ve bu ekstra bilgiler, &PDF; dosyasının adını taşıyan dış bir dosyada depolanır (örneğin, <filename>belgem.pdf</filename> için <filename>belgem.pdfsync</filename>).

source: &okular; ships with preconfigured settings for the following editors: <ulink url="https://kate-editor.org/">&kate;</ulink>, <ulink url="https://kile.sourceforge.io/">Kile</ulink>, <ulink url="https://www.scintilla.org/SciTE.html">SciTE</ulink>, <ulink url="https://www.gnu.org/software/emacs/">&Emacs; client</ulink>, <ulink url="https://www.lyx.org/">LyX client</ulink>, <ulink url="https://www.texstudio.org/">TeXstudio</ulink>, and <ulink url="https://github.com/hannah-sten/texify-idea">TeXiFy IDEA</ulink>.
tr: &okular;, aşağıdaki düzenleyiciler için önceden yapılandırılmış ayarlarla gelir: <ulink url="https://kate-editor.org/">&kate;</ulink>, <ulink url="https://kile.sourceforge.io/">Kile</ulink>, <ulink url="https://www.scintilla.org/SciTE.html">SciTE</ulink>, <ulink url="https://www.gnu.org/software/emacs/">&Emacs; client</ulink>, <ulink url="https://www.lyx.org/">LyX İstemcisi</ulink>, <ulink url="https://www.texstudio.org/">TeXstudio</ulink> ve <ulink url="https://github.com/hannah-sten/texify-idea">TeXiFy IDEA</ulink>.

source: To use inverse search in &kile;, you have to compile your &latex; file with the <guilabel>Modern</guilabel> configuration.
tr: &kile;’deki tersine aramayı kullanmak için &latex; dosyanızı <guilabel>Çağdaş</guilabel> yapılandırmayla derlemeniz gerekir.

source: Command
tr: Komut

source: This is the command and its parameters to invoke the selected editor with the source file of the actual document.
tr: Bu, seçili düzenleyiciyi asıl belgenin kaynak dosyasıyla çağırmak için kullanılan komut ve parametreleridir.

source: This field will be filled automatically if you use one of the preconfigured editors. Otherwise, please choose <guimenuitem>Custom Text Editor</guimenuitem> in <guilabel>Editor</guilabel> drop down box and refer to the documentation on your favorite editor to find the proper command.
tr: Önceden yapılandırılan düzenleyicilerden birini kullanırsanız bu alan kendiliğinden doldurulur. Aksi takdirde, lütfen <guilabel>Düzenleyici</guilabel> açılır kutusunda <guimenuitem>Özel Metin Düzenleyicisi</guimenuitem>’ni seçin ve uygun komutu bulmak için favori düzenleyicinizin belgelerine bakın.

source: You can use the following placeholders:
tr: Aşağıdaki yer tutucuları kullanabilirsiniz:

source: %f - the file name
tr: %f — dosya adı

source: %l - the line of the file to be reached
tr: %l — dosyada erişilecek satırın numarası

source: %c - the column of the file to be reached
tr: %c — dosyada erişilecek sütunun numarası

source: If %f is not specified, then the document name is appended to the specified command.
tr: %f belirtilmezse belge adı belirtilen komuta eklenir.

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Program Copyright:
tr: Program telif hakkı:

source: &Albert.Astals.Cid; &Albert.Astals.Cid.mail; Current maintainer
tr: &Albert.Astals.Cid; &Albert.Astals.Cid.mail; Şu anki bakımcı

source: Enrico Ros <email>eros.kde@email.it</email> &kpdf; developer
tr: Enrico Ros <email>eros.kde@email.it</email> &kpdf; geliştiricisi

source: Documentation Copyright:
tr: Belgelendirme telif hakkı:

source: &Albert.Astals.Cid; &Albert.Astals.Cid.mail; Author
tr: &Albert.Astals.Cid; &Albert.Astals.Cid.mail; Yazar

source: Titus Laska <email>titus.laska@gmx.de</email> Some updates and additions
tr: Titus Laska <email>titus.laska@gmx.de</email> Güncellemeler ve eklemeler

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
