Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/okular.po
Languages: tr

source: The &okular; Handbook
tr: &okular; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: &okular; is a &kde; universal document viewer based on &kpdf; code.
tr: &okular;, &kpdf; kodu üzerine temellendirilmiş &kde;’nin çok amaçlı belge görüntüleyicisidir.

source: annotation
tr: bilgi notu

source: Introduction
tr: Giriş

source: &okular; is a &kde; universal document viewer based on the code of the &kpdf; application. Although being based on &kpdf; code, &okular; has some unique features such as overview mode, improved presentation support and annotation support.
tr: &okular;, &kpdf; uygulamasının kodu üzerine temellindirilmiş, çok amaçlı bir &kde; belge görüntüleyicisidir. &kpdf;’yi temel almış olmasına rağmen; genel görünüm kipi, iyileştirilmiş sunum ve bilgi notu desteği gibi kendine has özellikleri vardır.

source: &okular; supports a lot of different formats like &PDF;, &PostScript;, Tiff, DjVU, Images (png, jpg, &etc;) XPS, Fiction Books, Comic Book, Plucker, EPub, Fax and Markdown. For all supported formats and their features see <ulink url="https://okular.kde.org/formats.php"> &okular; Document Format Handlers</ulink>.
tr: &okular;; &PDF;, &PostScript;, Tiff, DjVU, Görseller (png, jpg, &etc;) XPS, Fiction Books, Comic Book, Plucker, EPub, Fax ve Markdown gibi birçok farklı biçimi destekler. Desteklenen tüm biçimleri ve özelliklerini görmek için <ulink url="https://okular.kde.org/formats.php"> &okular; Belge Biçimi İşleyicileri</ulink> bölümüne bakın.

source: <screeninfo>&okular;s Main Window</screeninfo>
tr: <screeninfo>&okular;’ın Ana Penceresi</screeninfo>

source: <phrase>&okular;s Main Window</phrase>
tr: <phrase>&okular;’ın Ana Penceresi</phrase>

source: Basic Usage
tr: Temel Kullanım

source: Opening Files
tr: Belgeler Açmak

source: To open any supported file in &okular;, select <menuchoice><guimenu>File</guimenu><guimenuitem>Open...</guimenuitem> </menuchoice>, choose a supported file in the dialog and click <guibutton>Open</guibutton>. Your file should now be displayed in the main window.
tr: Desteklenen herhangi bir dosyayı &okular;’da açmak için <menuchoice><guimenu>Dosya</guimenu><guimenuitem>Aç…</guimenuitem> </menuchoice> yolunu izleyin, iletişim kutusunda desteklenen bir dosya seçin ve <guibutton>Aç</guibutton> düğmesine tıklayın. Dosyanız, şu an ana pencerede görüntüleniyor olmalıdır.

source: The new document will be opened in a new tab if the <guilabel>Open new files in tabs</guilabel> option on the <link linkend="configgeneral">General configuration page</link> is checked.
tr: <link linkend="configgeneral">Genel yapılandırma sayfasındaki</link> <guilabel>Yeni dosyaları sekmelerde aç</guilabel> seçeneği işaretliyse yeni belge bir sekmede açılır.

source: You can close the tab by clicking with &MMB; on it.
tr: Sekmeyi, üzerine &MMB; ile tıklarsanız kapatabilirsiniz.

source: The previously closed document in a tab can be reopened using the <menuchoice><shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>T</keycap></keycombo></shortcut><guimenu>File</guimenu> <guimenuitem>Undo close tab</guimenuitem></menuchoice> menu item.
tr: Önceden kapatılan belge, <menuchoice><shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>T</keycap></keycombo></shortcut><guimenu>Dosya</guimenu> <guimenuitem>Sekme Kapatmayı Geri Al</guimenuitem></menuchoice> menü ögesine tıklanarak bir sekmede yeniden açılabilir.

source: If you have already opened files in &okular; before, you can quickly access them by selecting them in the <menuchoice><guimenu>File</guimenu><guisubmenu>Open Recent</guisubmenu></menuchoice> menu.
tr: &okular;’da daha önceden dosyalar açtıysanız onlara <menuchoice><guimenu>Dosya</guimenu><guisubmenu>Son Kullanılanı Aç</guisubmenu></menuchoice> menüsünden geri ulaşabilirsiniz.

source: &okular; is the default &kde; application for &PDF; and &PostScript; files, launched when you click with the &LMB; on such a file type in the filemanager. If you want to open any file whose format is supported by &okular; use <menuchoice><guimenu>Open with...</guimenu><guimenuitem>&okular;</guimenuitem> </menuchoice> from context menu in the filemanager.
tr: &okular;, &PDF; ve &PostScript; dosyaları için öntanımlı &kde; uygulamasıdır. Bu dosyaları açmak için dosya yöneticisinde üzerilerine &LMB; ile tıklamanız yeterlidir. &okular; tarafından desteklenen herhangi başka bir dosyayı açmak için dosya yöneticisinde dosyanın bağlam menüsünden <menuchoice><guimenu>Birlikte Aç…</guimenu><guimenuitem>&okular;</guimenuitem> </menuchoice>’ı seçebilirsiniz.

source: After having a file opened you probably want to read it and therefore navigate through it. Go to the <link linkend="navigating">next section</link> to learn more about this.
tr: Bir dosya açtıktan sonra büyük olasılıkla onu okumak istersiniz. Bunun üzerine daha fazla bilgi almak için <link linkend="navigating">bir sonraki bölüme</link> bakın.

source: Navigating
tr: Dolaşım

source: This section describes how you can navigate through a document in &okular;.
tr: Bu bölüm, &okular;’da bir belge içinde nasıl dolaşacağınızı açıklar.

source: There are multiple ways of scrolling the viewing area. One is to use the &Up; and &Down; arrow keys. You may also use the scrollbar, your mousewheel or the &PgUp; and &PgDn; keys.
tr: Görüntüleme alanında sarma yapmanın birçok yolu vardır. Bunlardan biri, &Up; ve &Down; düğmelerini kullanmaktır. Ayrıca; sarma çubuğunu, fare tekerleğinizi veya &PgUp; ve &PgDn; düğmelerini de kullanabilirsiniz.

source: You can also use <application>vim</application>-like navigation keys, namely <keycap>H</keycap> to move to the top of the previous page, <keycap>L</keycap> to move to the top of the next page, <keycap>J</keycap> to move one line down, and <keycap>K</keycap> to move one line up.
tr: Ek olarak, <application>vim</application> tarzı dolaşım düğmeleri de kullanılabilir; örneğin, bir önceki sayfanın en üstüne gitmek için <keycap>H</keycap>, bir sonraki sayfanın en üstüne gitmek için <keycap>L</keycap>, bir satır aşağı inmek için <keycap>J</keycap> ve bir satır yukarı çıkmak için <keycap>K</keycap>.

source: Another way is to hold the &LMB; down at any place on the document while dragging the mouse in the opposite direction of where you want to move. This procedure only works if the Browse tool is enabled, which you can select by choosing <menuchoice><guimenu>Tools</guimenu> <guimenuitem>Browse</guimenuitem></menuchoice>.
tr: Başka bir yol ise &LMB; basılı tutulurken, fareyi gitmek istediğiniz yönün tam tersi yana hareket ettirmektir. Bu prosedür yalnızca Göz At aracı etkinse çalışır. Etkinleştirmek için <menuchoice><guimenu>Araçlar</guimenu> <guimenuitem>Göz At</guimenuitem></menuchoice> yolunu izleyin.

source: When viewing a document in the <link linkend="presentationMode">Presentation mode</link> use &Up; and &Down; arrow keys to switch between pages or slides. The number and the position of the current slide will be shown in the overlay at the right upper corner of screen.
tr: Bir belgeyi <link linkend="presentationMode">Sunum Kipi</link>’nde görüntülerken sayfalar veya slaytlar arasında geçiş yapmak için &Up; ve &Down; düğmelerini kullanın. Geçerli slaytın numarası ve konumu, ekranın sağ üst köşesindeki bir ekran üzeri görüntüde belirtilir.

source: If you want to read a document with several pages use the automatic scrolling feature of &okular;. Start automatic scrolling with <keycombo action="simul">&Shift;&Down;</keycombo> or <keycombo action="simul">&Shift;&Up;</keycombo>. Then use these keys to increase and decrease the scrolling speed. You can start or stop automatic scrolling temporarily by pressing the &Shift; key; pressing any other key deactivates this feature.
tr: Birkaç sayfadan oluşan bir belgeyi okumak istiyorsanız &okular;’ın kendiliğinden sarma özelliğini kullanın. Kendiliğinden sarmayı <keycombo action="simul">&Shift;&Down;</keycombo> veya <keycombo action="simul">&Shift;&Up;</keycombo> kısayollarıyla başlatın. Sonrasında bu düğmeleri kullanarak sarma hızını artırın veya azaltın. Kendiliğinden sarmayı &Shift; düğmesine basarak geçici olarak durdurabilir veya başlatabilirsiniz. Başka herhangi bir düğmeye basmak, bu özelliği kapatır.

source: Another way to navigate through a document with several pages is to use the mouse pointer. Drag the page up or down, continue to drag even while reaching the bottom or top of the screen and behold. Once you cross the border of a page, the mouse cursor appears on top or bottom of the screen again and you can just continue to drag.
tr: Çok sayfalı bir belgede gezinmenin başka bir yolu da fare işaretçisini kullanmaktır. Sayfayı yukarı veya aşağı sürükleyin, ekranın altına veya üstüne ulaştığınızda bile sürüklemeyi sürdürün ve bakın. Bir sayfanın kenarlığını geçtiğinizde fare imleci yeniden ekranın üstünde veya altında belirir ve sürüklemeyi sürdürebilirsiniz.

source: The sidebar on the left side of the screen enables two more ways of navigating through a document:
tr: Ekranın sol tarafındaki kenar çubuğu, belgede dolaşmanın iki yolunu daha sağlar:

source: If you click on a page thumbnail the viewing area will be brought to that page.
tr: Bir sayfa küçük görseline tıklarsanız görüntüleme alanı o sayfaya getirilir.

source: If the document has a table of contents, clicking on a table of contents item will bring the document to the page linked to that item.
tr: Belgenin bir içindekiler tablosu varsa, bir içindekiler tablosu ögesine tıklamak, belgeyi o ögeye bağlı sayfaya getirir.

source: If the document has layers, you can control the layers shown by checking or unchecking the items in the <guilabel>Layers</guilabel> list.
tr: Belgede katmanlar varsa <guilabel>Katmanlar</guilabel> listesindeki ögeleri işaretleyerek veya işaretlerini kaldırarak gösterilen katmanları denetleyebilirsiniz.

source: If the document has bookmarks, enable the <guilabel>Bookmarks</guilabel> view and click them to go to the associated page. If bookmarks are not only shown for the current document, you can quickly switch to bookmarks in all recently opened files.
tr: Belgede yer imleri varsa <guilabel>Yer İmleri</guilabel> görünümünü etkinleştirin ve ilgili sayfaya gitmek için bunlara tıklayın. Yer imleri yalnızca geçerli belge için gösterilmiyorsa yakın zamanda açılan tüm dosyalardaki yer imlerine tez geçiş yapabilirsiniz.

source: If the document has annotations, enable the <guilabel>Annotations</guilabel> view and click the annotations or select them with the &Up; and &Down; arrow keys and press &Enter; to go to the associated page.
tr: Belgede ek açıklamalar varsa <guilabel>Bilgi Notları</guilabel> görünümünü etkinleştirip ve ek açıklamalara tıklayın veya bunları &Up; ve &Down; kullanarak seçin ve ilgili sayfaya gitmek için &Enter; düğmesine basın.

source: Some documents have links. In this case you can click on them and the view will change to the page it links to. If the link is to a web page or some other document the default &kde; handler for that format will be invoked. For example, clicking on a link pointing to <quote>https://www.kde.org</quote> will open the web page in the default &kde;'s web browser.
tr: Bazı belgelerde bağlantılar bulunur. Bu durumda üzerlerine tıklayabilirsiniz; görünüm, bağlantı verdiği sayfaya dönüşür. Bağlantı bir web sayfasına veya başka bir belgeye ise, o biçim için öntanımlı olan &kde; işleyicisi çağrılacaktır. Örneğin, <quote>https://www.kde.org</quote> adresine işaret eden bir bağlantıya tıklamak, web sayfasını öntanımlı &kde; web tarayıcısında açacaktır.

source: The document internal links work only when <link linkend="menutools">Browse Tool</link> is used.
tr: Belgede bulunan bağlantılar yalnızca <link linkend="menutools">Göz At</link> aracı kullanılırken çalışır.

source: Additionally, you may use the following functionality to quickly move to specific places in the document:
tr: Ayrıca belgedeki belirli yerlere tez gitmek için aşağıdaki işlevleri kullanabilirsiniz:

source: You can go to the beginning of the document using <keycombo action="simul">&Ctrl;<keycap>Home</keycap></keycombo> or using <menuchoice> <guimenu>Go</guimenu> <guimenuitem>Beginning of the document</guimenuitem> </menuchoice>.
tr: Belgenin başına <keycombo action="simul">&Ctrl;<keycap>Baş</keycap></keycombo> veya <menuchoice><guimenu>Git</guimenu> <guimenuitem>Belge Başı</guimenuitem></menuchoice> ögesini kullanarak gidebilirsiniz.

source: You can go to the end of the document using <keycombo action="simul">&Ctrl;<keycap>End</keycap></keycombo> or using <menuchoice> <guimenu>Go</guimenu> <guimenuitem>End of the document</guimenuitem> </menuchoice>.
tr: Belgenin sonuna <keycombo action="simul">&Ctrl;<keycap>Son</keycap></keycombo> veya <menuchoice><guimenu>Git</guimenu> <guimenuitem>Belge Sonu</guimenuitem></menuchoice> ögesini kullanarak gidebilirsiniz.

source: You can go forward in the document using &Space; or &PgDn;. To go to the next page of the document use the <guibutton>Next Page</guibutton> Toolbar button or <menuchoice> <guimenu>Go</guimenu> <guimenuitem>Next Page</guimenuitem> </menuchoice> in the menubar.
tr: Belgede &Space; veya &PgDn; kullanarak ileri gidebilirsiniz. Belgedeki sonraki sayfaya gitmek için <guibutton>Sonraki Sayfa</guibutton> araç çubuğu düğmesini veya <menuchoice><guimenu>Git</guimenu><guimenuitem>Sonraki Sayfa</guimenuitem> </menuchoice> ögesini kullanın.

source: You can go back in the document using &Backspace; or &PgUp;. To go to the previous page of the document use <guibutton>Previous Page</guibutton> Toolbar button or <menuchoice> <guimenu>Go</guimenu> <guimenuitem>Previous Page</guimenuitem> </menuchoice> in the menubar.
tr: Belgede &Backspace; veya &PgUp; kullanarak geri gidebilirsiniz. Belgedeki sonraki sayfaya gitmek için <guibutton>Önceki Sayfa</guibutton> araç çubuğu düğmesini veya <menuchoice><guimenu>Git</guimenu><guimenuitem>Önceki Sayfa</guimenuitem> </menuchoice> ögesini kullanın.

source: You can go back to the positions in the document where you came from in a chronological order. Consider &eg; reading the phrase <quote>As shown in [15], …</quote>, and you want to know quickly lookup reference [15]. So you click on it, and &okular; will jump to the list of references. Using <keycombo>&Alt;&Shift;&Left;</keycombo> or <menuchoice> <guimenu>Go</guimenu> <guimenuitem>Back</guimenuitem> </menuchoice> in the menubar will bring you back to exactly the position where you came from.
tr: Belgede geldiğiniz konumlara kronolojik sırayla geri dönebilirsiniz. Örneğin, <quote>As shown in [15], …</quote> notunu okuduğunuzu varsayalım ve tez [15] numaralı başvuruyu okumak istiyorsunuz. Bunu yapmak için üzerine tıklayın ve &okular; başvurular listesine atlayacaktır. <keycombo>&Alt;&Shift;&Left;</keycombo> veya <menuchoice> <guimenu>Git</guimenu><guimenuitem>Geri</guimenuitem></menuchoice> menü ögesini kullanmak, sizi geldiğiniz yere geri götürecektir.

source: You can go forward in the document after the jumping back as described above using <keycombo>&Alt;&Shift;&Right;</keycombo> or <menuchoice> <guimenu>Go</guimenu> <guimenuitem>Forward</guimenuitem> </menuchoice> in the menubar.
tr: Geri atladıktan sonra <keycombo>&Alt;&Shift;&Right;</keycombo> veya menü çubuğunda <menuchoice><guimenu>Git</guimenu><guimenuitem>İleri</guimenuitem></menuchoice> düğmesini kullanmak sizi ileri götürür.

source: You can go to the next match when searching using <keycap>F3</keycap> or &Enter; (when the focus is on <guilabel>Find</guilabel> text field) keys or <menuchoice> <guimenu>Edit</guimenu> <guimenuitem>Find Next</guimenuitem> </menuchoice> menu item or move back to the previous match using <keycombo>&Shift;<keysym>F3</keysym></keycombo> or <keycombo>&Shift;&Enter;</keycombo> (when the focus is on <guilabel>Find</guilabel> text field) keys or <menuchoice> <guimenu>Edit</guimenu> <guimenuitem>Find Previous</guimenuitem> </menuchoice> menu item.
tr: Arama yaparken bir sonraki eşleşmeye <keycap>F3</keycap>, &Enter; (odak <guilabel>Bul</guilabel> metin alanındayken) veya <menuchoice><guimenu>Düzen</guimenu><guimenuitem>Sonrakini Bul</guimenuitem></menuchoice> menü ögesi ile gidebilir veya önceki ögeye <keycombo>&Shift;<keysym>F3</keysym></keycombo>, <keycombo>&Shift;&Enter;</keycombo> (odak <guilabel>Bul</guilabel> metin alanındayken) veya <menuchoice><guimenu>Düzen</guimenu><guimenuitem>Öncekini Bul</guimenuitem></menuchoice> menü ögesi ile dönebilirsiniz.

source: Presentation Mode
tr: Sunum Kipi

source: The Presentation mode represents another way to view documents in &okular;. It can be enabled in <menuchoice><guimenu>View</guimenu><guimenuitem>Presentation</guimenuitem></menuchoice>. It shows the document on a page per page basis. The pages are shown with zoom to page, that means all the page is visible.
tr: Sunum kipi, &okular;’da belgeleri görüntülemenin başka bir yolunu temsil eder. <menuchoice><guimenu>Görünüm</guimenu><guimenuitem>Sunum</guimenuitem></menuchoice> menü ögesiyle etkinleştirilebilir. Belgeyi sayfa bazında gösterir. Sayfalar sayfaya yakınlaştırılmış olarak gösterilir, yani tüm sayfa görünür.

source: &PDF; documents can even specify that they are always opened in presentation mode.
tr: &PDF; belgeleri, her zaman sunum kipinde açılacak biçimde yapılandırılabilir.

source: When in presentation mode, you have an helper bar located on the top of the screen. Just move the mouse cursor to the top of the screen to make it appear.
tr: Sunum kipindeyken ekranın üst kısmında bir yardım çubuğu bulunur. Görünmesini sağlamak için fare imlecini ekranın üstüne getirmeniz yeterlidir.

source: <screeninfo>&okular; in Presentation Mode</screeninfo>
tr: <screeninfo>Sunum Kipinde &okular;</screeninfo>

source: <phrase>&okular; in Presentation Mode</phrase>
tr: <phrase>Sunum Kipinde &okular;</phrase>

source: To navigate between pages you may use the &LMB; (next page) and the &RMB; (previous page), the mouse wheel, the arrow icons or the line edit in the top bar, or the keys specified in the <link linkend="navigating">Navigating</link> section.
tr: Sayfalar arasında dolaşmak için &LMB; (sonraki sayfa) ve &RMB; (önceki sayfa), fare tekerleği, ok simgeleri veya üst çubuktaki satır düzenleme kutusunu veya <link linkend="navigating">Dolaşım</link> bölümünde belirtilen düğmeleri kullanın.

source: Use <guilabel>Play/Pause</guilabel> button in the top bar to start playing presentation or pause it, correspondingly.
tr: Sunumu başlatmak/duraklatmak için üst çubuktaki <guilabel>Oynat/Duraklat</guilabel> düğmesini kullanın.

source: You can exit presentation mode at any time by pressing the &Esc; key or clicking the <guiicon>Quit</guiicon> icon in the top bar.
tr: Sunum kipinden herhangi bir anda &Esc; düğmesine basarak veya üst çubuktaki <guiicon>Çık</guiicon> simgesine tıklayarak çıkabilirsiniz.

source: You can also draw on the current page with a pencil. Click on the <guilabel>Toggle Drawing Mode</guilabel> icon in the top bar to enable or disable the possibility to draw in the presentation mode. The drawings are cleared automatically when leaving the presentation mode. You can also click on the <guilabel>Erase Drawings</guilabel> icon to remove the drawings in the current page.
tr: Aynı zamanda geçerli sayfada bir kalemle çizim de yapılabilir. Sunum kipinde çizim yapma olanağını etkinleştirmek veya devre dışı bırakmak için üst çubuktaki <guilabel>Çizim Kipini Aç/Kapat</guilabel> simgesine tıklayın. Sunum kipinden çıkarken yapılan çizimler kendiliğinden temizlenirler. Geçerli sayfadaki çizimleri temizlemek için aynı zamanda <guilabel>Çizimi Sil</guilabel> simgesini de kullanabilirsiniz.

source: The presentation mode has support for more than one screen in a multi-monitor configuration. With more than one screen a new button will appear in the top bar, with the icon of a screen: this is a drop down box that allows you to move the presentation to any of the other available screens.
tr: Sunum kipi, çoklu monitör yapılandırmasında birden fazla ekranı destekler. Birden fazla ekran olduğunda, üst çubukta bir ekran simgesiyle birlikte yeni bir düğme görünecektir: bu, sunumu diğer kullanılabilir ekranlardan herhangi birine taşımanıza olanak tanıyan bir açılır kutudur.

source: Presentation mode has some configuration options, you can find their description in the chapter <link linkend="configpresentation">Configuring &okular;</link>.
tr: Sunum kipinde bazı yapılandırma seçenekleri vardır; bunların açıklamasını <link linkend="configpresentation">&okular;’ı Yapılandırmak</link> faslında bulabilirsiniz.

source: Inverse Search between &latex; Editors and &okular;
tr: &latex; Düzenleyicileri ve &okular; Arasında Tersine Arama

source: Inverse search is a very useful feature when you are writing a &latex; document yourself. If everything is set up properly, you can click into &okular;'s window with the <mousebutton>left</mousebutton> mouse button while pressing &Shift;. After that editor loads the &latex; source file and jumps to the proper paragraph.
tr: Tersine arama, bir &latex; belgesi yazarken çok işe yarar bir özelliktir. Her şey düzgünce ayarlanmışsa &okular;’ın penceresine &Shift; düğmesini basılı tutarken <mousebutton>sol</mousebutton> fare düğmesi ile tıklayın. Sonrasında düzenleyici, &latex; kaynak dosyasını yükler ve olması gereken paragrafa atlar.

source: Inverse search cannot work unless:
tr: Tersine aramanın çalışması için şunlar tam olmalıdır:

source: The source file has been compiled successfully.
tr: Kaynak dosya düzgünce derlenmeli.

source: &okular; knows which editor you would like to use.
tr: &okular;’ın hangi düzenleyiciyi kullanmak istediğinizi biliyor olması gerekir.

source: The Browse tool has to be enabled, which you can select by choosing <menuchoice><guimenu>Tools</guimenu><guimenuitem>Browse </guimenuitem></menuchoice>.
tr: Göz At aracının etkin olması gerekir. Etkinleştirmek için <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Göz At</guimenuitem></menuchoice> yolunu izleyin.

source: With this feature of &okular;, a left mouse click while pressing &Shift; in the &DVI; or &PDF; document will result in editor opening the corresponding &latex; document and attempt to go to the corresponding line. Remember to tell &okular; to use proper editor, in &okular;'s menu item <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Okular...</guimenuitem></menuchoice> (on the page <guimenuitem>Editor</guimenuitem>).
tr: Bu &okular; özelliğiyle, bir &DVI; or &PDF; belgesinde &Shift; düğmesi basılı tutulurken yapılan bir sol fare tıklaması, ilgili &latex; belgesini düzenleyicide açar ve karşılık gelen satıra gider. &okular;’a kullanmak istediğiniz düzenleyiciyi söylemeyi unutmayın; bunu, &okular;’ın <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Okular Uygulamasını Yapılandır…</guimenuitem></menuchoice> iletişim kutusunun <guimenuitem>Düzenleyici</guimenuitem> sayfasında yapabilirsiniz.

source: For more details on editor configuration please refer to the <link linkend="configeditor">corresponding section of this manual</link>.
tr: Düzenleyici yapılandırması ile ilgili daha ayrıntılı bilgi için <link linkend="configeditor">bu kılavuzun ilgili bölümüne</link> gidin.

source: <screeninfo>Configuring &okular;</screeninfo>
tr: <screeninfo>&okular;’ı Yapılandırmak</screeninfo>

source: <phrase>Configuring editor in &okular;</phrase>
tr: <phrase>&okular; içinde düzenleyiciyi yapılandırmak</phrase>

source: <para>Configuring editor in &okular;</para>
tr: <para>&okular; içinde düzenleyiciyi yapılandırmak</para>

source: &okular; Advanced Features
tr: &okular; Gelişmiş Özellikleri

source: Embedded Files
tr: Gömülü Dosyalar
