Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/okular.po
Languages: tr

source: <guimenu>View</guimenu> <guisubmenu>Trim View</guisubmenu>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Görünümü Kırp</guisubmenu>

source: This submenu allows you to remove the white border of pages when viewing pages (<guimenuitem>Trim Margins</guimenuitem> item) or trim viewport to selection (<guimenuitem>Trim To Selection</guimenuitem> item).
tr: Bu alt menü, sayfaları görüntülerken onların beyaz kenarlıklarını kaldırmanıza (<guimenuitem>Kenar Boşluklarını Kırp</guimenuitem>) veya görüş alanını seçime sınırlamanıza (<guimenuitem>Seçime Kırp</guimenuitem>) olanak tanır.

source: The <quote>trim to selection</quote> mode allows you to draw a selection over the rendered page in order to define a visible bounding box to be applied to <emphasis>all pages</emphasis> in the document. Selecting a small trim bounding box enforces minimum dimensions size (20% as a percentage of total page size).
tr: <quote>Seçime kırpma</quote> kipi, belgedeki <emphasis>tüm sayfalara</emphasis> uygulanacak görünür bir sınırlama kutusu tanımlamak için oluşturulan sayfanın üzerine bir seçim çizmenize olanak tanır. Küçük bir kırpma sınırlama kutusu seçmek, en küçük ölçü boyutunu zorunlu kılar (toplam sayfa boyutunun yüzdesi olarak %​20).

source: The <quote>trim margins</quote> mode is persistent across &okular; restarts. The <quote>trim to selection</quote> mode is forgotten across &okular; restarts.
tr: <quote>Kenar boşluklarını kırpma</quote> kipi, &okular; uygulamasının yeniden başlatılması sonrasında anımsanır. <quote>Seçime kırpma</quote> kipi ise unutulur.

source: When you switch &okular; from <quote>trim margins</quote> mode to <quote>trim to selection</quote> mode, the view jumps out of <quote>trim margins</quote> mode for the bounding box selection interaction.
tr: &okular;’ı <quote>kenar boşluklarını kırpma</quote> kipinden <quote>seçime kırpma</quote> kipine geçirirseniz görünüm, <quote>kenar boşluklarını kırpma</quote> kipinden kutu seçimi etkileşimine geçiş yapar.

source: The trim mode can be deactivated by selecting the same menu item that activates it once again.
tr: Kırpma kipi, onu bir kez daha etkinleştiren aynı menü ögesi seçilerek devre dışı bırakılabilir.

source: <guimenu>View</guimenu> <guimenuitem>Show/Hide Forms</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Formları Göster/Gizle</guimenuitem>

source: <action>Show or hides the display</action> of the form fields of the document.
tr: Belgenin form alanlarının <action>görüntülenmesini açar veya kapatır</action>.

source: This menu item is active only if the current document has form fields.
tr: Bu menü ögesi yalnızca geçerli belgede form alanları varsa etkindir.

source: The Go Menu
tr: Git Menüsü

source: <guimenu>Go</guimenu> <guimenuitem>Previous Page</guimenuitem>
tr: <guimenu>Git</guimenu> <guimenuitem>Önceki Sayfa</guimenuitem>

source: <action>View the previous page</action> of the document.
tr: Belgenin <action>bir önceki sayfasını görüntüler</action>.

source: <guimenu>Go</guimenu> <guimenuitem>Next Page</guimenuitem>
tr: <guimenu>Git</guimenu> <guimenuitem>Sonraki Sayfa</guimenuitem>

source: <action>View the next page</action> of the document.
tr: Belgenin <action>bir sonraki sayfasını görüntüler</action>.

source: <shortcut><keycombo action="simul">&Ctrl;&Home;</keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>Beginning of the document</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Home;</keycombo></shortcut> <guimenu>Git</guimenu> <guimenuitem>Belge Başı</guimenuitem>

source: <action>Go to the beginning</action> of the document.
tr: Belgenin <action>başına gider</action>.

source: <shortcut><keycombo action="simul">&Ctrl;&End;</keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>End of the document</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&End;</keycombo></shortcut> <guimenu>Git</guimenu> <guimenuitem>Belge Sonus</guimenuitem>

source: <action>Go to the end</action> of the document.
tr: Belgenin <action>sonuna gider</action>.

source: <shortcut><keycombo action="simul">&Alt;&Shift;&Left;</keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>Back</guimenuitem>
tr: <shortcut><keycombo action="simul">&Alt;&Shift;&Left;</keycombo></shortcut> <guimenu>Git</guimenu> <guimenuitem>Geri</guimenuitem>

source: <action>Go back to the previous view</action> of the document.
tr: Belgenin <action>bir önceki görünümüne gider</action>.

source: <shortcut><keycombo action="simul">&Alt;&Shift;&Right;</keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>Forward</guimenuitem>
tr: <shortcut><keycombo action="simul">&Alt;&Shift;&Right;</keycombo></shortcut> <guimenu>Git</guimenu> <guimenuitem>İleri</guimenuitem>

source: <action>Move forward to the next view</action> of the document. This only works if you have already moved back before.
tr: Belgenin <action>bir sonraki görünümüne gider</action>. Bu, yalnızca oraya daha önce gittiyseniz çalışır.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>Go to Page...</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo></shortcut> <guimenu>Git</guimenu> <guimenuitem>Sayfaya Git…</guimenuitem>

source: Open a dialog which allows you to <action>go to any page</action> of the document.
tr: Belgenin <action>herhangi bir sayfasına gitmek</action> için kullanabileceğiniz bir iletişim kutusu açar.

source: The Bookmarks Menu
tr: Yer İmleri Menüsü

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo></shortcut> <guimenu>Bookmarks</guimenu> <guimenuitem>Add/Remove Bookmark</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo></shortcut> <guimenu>Yer İmleri</guimenu> <guimenuitem>Yer İmi Koy/Yer İmini Kaldır</guimenuitem>

source: <action>Add or remove a bookmark for the current position</action>.
tr: <action>Geçerli konum için bir yer imi ekleyin veya kaldırın</action>.

source: <guimenu>Bookmarks</guimenu> <guimenuitem>Rename Bookmark</guimenuitem>
tr: <guimenu>Yer İmleri</guimenu> <guimenuitem>Yer İmini Yeniden Adlandır</guimenuitem>

source: <action>Rename a bookmark for the current position</action>.
tr: <action>Geçerli konumdaki yer imini yeniden adlandırın</action>.

source: <guimenu>Bookmarks</guimenu> <guimenuitem>Previous Bookmark</guimenuitem>
tr: <guimenu>Yer İmleri</guimenu> <guimenuitem>Önceki Yer İmi</guimenuitem>

source: <action>Go to the previous bookmark</action>, or do nothing if there are no bookmarks prior to the current one.
tr: <action>Önceki yer imine gidin</action> veya geçerli yer iminden önce yer imi yoksa hiçbir şey yapmayın.

source: <guimenu>Bookmarks</guimenu> <guimenuitem>Next Bookmark</guimenuitem>
tr: <guimenu>Yer İmleri</guimenu> <guimenuitem>Sonraki Yer İmi</guimenuitem>

source: <action>Go to the next bookmark</action>, or do nothing if there are no bookmarks after the current one.
tr: <action>Sonraki yer imine gidin</action> veya geçerli yer iminden sonra yer imi yoksa hiçbir şey yapmayın.

source: <guimenu>Bookmarks</guimenu> <guimenuitem>No Bookmarks</guimenuitem>
tr: <guimenu>Yer İmleri</guimenu> <guimenuitem>Yer İmi Yok</guimenuitem>

source: This is an always disabled action that appears in this menu only if the current document has no bookmarks. Otherwise a list of all bookmarks is displayed here. Clicking on these bookmarks allows you to go directly to the associated position.
tr: Bu, yalnızca geçerli belgede yer imi yoksa bu menüde görünen, her zaman devre dışı bırakılan bir eylemdir. Aksi takdirde, tüm yer imlerinin bir listesi burada görüntülenir. Bu yer imlerine tıklamak, doğrudan ilgili konuma gitmenizi sağlar.

source: The Tools Menu
tr: Araçlar Menüsü

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>1</keycap></keycombo></shortcut> <guimenu>Tools</guimenu> <guimenuitem>Browse</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>1</keycap></keycombo></shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Göz At</guimenuitem>

source: The mouse will have its normal behavior, &LMB; for dragging the document and following links and &RMB; for adding bookmarks and fit to width.
tr: Fare normal davranışına sahip olacaktır; belgeyi sürüklemek ve bağlantıları takip etmek için &LMB; ve yer imleri eklemek ve genişliğe sığdırmak için &RMB;.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo></shortcut> <guimenu>Tools</guimenu> <guimenuitem>Zoom</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo></shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Yakınlaştır</guimenuitem>

source: The mouse will work as a zoom tool. Clicking &LMB; and dragging will zoom the view to the selected area, clicking &RMB; will bring the document back to the previous zoom.
tr: Fare yakınlaştırma aracı olarak çalışacaktır. &LMB;’ne tıklayıp sürüklemek, görünümü seçilen alana yakınlaştıracaktır; &RMB;’ne tıklamak ise belgeyi önceki yakınlaştırma durumuna geri getirecektir.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>3</keycap></keycombo></shortcut> <guimenu>Tools</guimenu> <guimenuitem>Area Selection</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>3</keycap></keycombo></shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Alan Seçimi</guimenuitem>

source: The mouse will work as a rectangular region selection tool. In that mode clicking &LMB; and dragging will draw a selection box and provide the option of copying the selected content to the clipboard, speaking the selected text, or transforming the selection region into an image and saving it to a file.
tr: Fare dikdörtgen bölge seçim aracı olarak çalışacaktır. Bu kipte, &LMB;’ne tıklamak ve sürüklemek bir seçim kutusu çizer ve seçilen içeriği panoya kopyalama, seçilen metni konuşma veya seçim bölgesini bir görsele dönüştürüp bir dosyaya kaydetme seçeneğini sunar.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>4</keycap></keycombo></shortcut> <guimenu>Tools</guimenu> <guimenuitem>Text Selection</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>4</keycap></keycombo></shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Metin Seçimi</guimenuitem>

source: The mouse will work as a text selection tool. In that mode clicking &LMB; and dragging will give the option of selecting the text of the document. Then, just click with the &RMB; to copy to the clipboard or speak the current selection.
tr: Fare bir metin seçim aracı olarak çalışacaktır. Bu kipte &LMB;’ne tıklamak ve sürüklemek, belgenin metnini seçme seçeneğini sunar. Ardından panoya kopyalamak veya geçerli seçimi konuşmak için &RMB; ile tıklamanız yeterlidir.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>5</keycap></keycombo></shortcut> <guimenu>Tools</guimenu> <guimenuitem>Table Selection</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>5</keycap></keycombo></shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Tablo Seçimi</guimenuitem>

source: Draw a rectangle around the text for the table, then click with the &LMB; to divide the text block into rows and columns. A &LMB; click on an existing line removes it and merges the adjacent rows or columns. Finally, just click with the &RMB; to copy the table to the clipboard.
tr: Tablo metninin çevresine bir dikdörtgen çizin, ardından metin bloğunu satırlara ve sütunlara bölmek için &LMB; ile tıklayın. Var olan bir satıra &LMB; tıklaması onu kaldırır ve bitişik satırları veya sütunları birleştirir. Son olarak tabloyu panoya kopyalamak için &RMB; ile tıklamanız yeterlidir.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>6</keycap></keycombo></shortcut> <guimenu>Tools</guimenu> <guimenuitem>Magnifier</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>6</keycap></keycombo></shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Büyüteç</guimenuitem>

source: Activates the magnifier mode for the mouse pointer. Press and hold the &LMB; to activate magnifier widget, move the pointer for panning through the document. The magnifier scales each pixel in the document into 10 pixels in the magnifier widget.
tr: Fare işaretçisi için büyüteç kipini etkinleştirir. Büyüteç araç takımını etkinleştirmek için &LMB;’ni basılı tutun, belgede gezinmek için işaretçiyi hareket ettirin. Büyüteç, belgedeki her pikseli, büyüteç araç takımında 10 piksele ölçeklendirir.

source: <shortcut><keycap>F6</keycap></shortcut> <guimenu>Tools</guimenu> <guimenuitem>Annotations</guimenuitem>
tr: <shortcut><keycap>F6</keycap></shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Bilgi Notları</guimenuitem>

source: <action>Open the annotation toolbar</action>. The annotation toolbar allows you to add annotations on the document you are reading. For more information, please see the section about <link linkend="annotations">Annotations</link>.
tr: <action>Bilgi notu araç çubuğunu açar</action>. Bilgi notu araç çubuğu, okuduğunuz belgeye notlar eklemenize olanak tanır. Daha fazla bilgi için <link linkend="annotations">Bilgi Notları</link> ile ilgili bölüme bakın.

source: <guimenu>Tools</guimenu> <guimenuitem>Digitally Sign...</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Sayısal Olarak İmzala…</guimenuitem>

source: <action>Starts the digital signature creation workflow</action>. Addition of digital signatures is only supported for PDF files at this point. For more information, please see the section about <link linkend="adding_digital_signatures">Adding Digital Signatures</link>.
tr: <action>Sayısal imza oluşturma iş akışını başlatır</action>. Sayısal imzaların eklenmesi şu aşamada yalnızca PDF dosyaları için desteklenir. Daha fazla bilgi için <link linkend="adding_digital_signatures">Sayısal İmzalar Eklemek</link> bölümüne bakın.

source: <guimenu>Tools</guimenu> <guimenuitem>Speak Whole Document</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Tüm Belgeyi Konuş</guimenuitem>

source: <guimenu>Tools</guimenu> <guimenuitem>Speak Current Page</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Geçerli Sayfayı Konuş</guimenuitem>

source: <guimenu>Tools</guimenu> <guimenuitem>Stop Speaking</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Konuşmayı Durdur</guimenuitem>

source: <guimenu>Tools</guimenu> <guimenuitem>Pause/Resume Speaking</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Konuşmayı Sürdür/Duraklat</guimenuitem>

source: These items allow you to speak the whole document or just the current page and stop speaking using the system speech service. This service is provided by a &Qt; library which wraps speech-dispatcher on &Linux;, and native speech systems on other platforms. It is possible to choose the current voice via &okular; <link linkend="configaccessibility">Accessibility</link> configuration page.
tr: Bu ögeler, belgenin tamamını veya yalnızca geçerli sayfayı seslendirmenize ve sistemin konuşma hizmetini kullanarak konuşmayı bırakmanıza olanak tanır. Bu hizmet, &Linux;’taki konuşma göndericiyi ve diğer platformlardaki yerel konuşma sistemlerini kapsayan bir &Qt; kitaplığı tarafından sağlanır. Geçerli sesi &okular; <link linkend="configaccessibility">Erişilebilirlik</link> yapılandırma sayfasında seçebilirsiniz.

source: The <guilabel>Speak ...</guilabel> actions are enabled only if a speech service is available in the system.
tr: <guilabel>Konuş …</guilabel> eylemleri yalnızca sisteminizde bir konuşma hizmeti kullanılabiliyorsa etkinleştirilir.

source: The Settings and Help Menu
tr: Ayarlar ve Yardım Menüsü

source: Apart from the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menus described in the <ulink url="help:/fundamentals/menus.html">Menu</ulink> chapter of the &kde; Fundamentals documentation &okular; has these application specific menu entries:
tr: &kde; Temelleri belgelendirmesinin <ulink url="help:/fundamentals/menus.html">Menü</ulink> bölümünde açıklanan ortak &kde; <guimenu>Ayarlar</guimenu> ve <guimenu>Yardım</guimenu> menülerine ek olarak, &okular;’da aşağıdaki uygulamaya özel menü girdileri vardır:

source: <shortcut><keycap>F7</keycap></shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Sidebar</guimenuitem>
tr: <shortcut><keycap>F7</keycap></shortcut> <guimenu>Ayarlar</guimenu> <guimenuitem>Kenar Çubuğunu Göster</guimenuitem>

source: Shows or hides the Sidebar.
tr: Kenar Çubuğu’nu gösterir veya gizler.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Page Bar</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Sayfa Çubuğunu Göster</guimenuitem>

source: <action>Toggle the page bar</action> at the bottom of document area on and off to save vertical place in &okular; window. Note that the page numbers will be shown on the default toolbar anyway.
tr: &okular; penceresinde dikey alandan tasarruf etmek için belge alanının alt kısmında bulunan <action>sayfa çubuğunu açar/kapatır</action>. Sayfa numaraları her halükarda öntanımlı araç çubuğunda gösterileceklerdir.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Backends...</guimenuitem>
tr: <guimenu>Ayarlar</guimenu> <guimenuitem>Arka Uçları Yapılandır…</guimenuitem>

source: Opens the <link linkend="configure-backends">Backend Configuration</link> window.
tr: <link linkend="configure-backends">Arka Uç Yapılandırması</link> iletişim kutusunu açar.

source: Configuring &okular; Backends
tr: &okular; Arka Uçlarını Yapılandırmak

source: You can configure &okular; backends by choosing <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure Backends...</guimenuitem> </menuchoice>. Currently, configuration options are provided for EPub, &PostScript;, FictionBook, Txt, OpenDocument Text, and &PDF; backends only.
tr: &okular; arka uçlarını <menuchoice><guimenu>Ayarlar</guimenu> <guimenuitem>Arka Uçları Yapılandır…</guimenuitem></menuchoice> seçimini yaparak yapılandırabilirsiniz. Şu anda yalnızca; EPub, &PostScript;, FictionBook, Txt, OpenDocument Text ve &PDF; arka uçları için yapılandırma seçenekleri sağlanır.

source: <screeninfo>The backends configuration dialog</screeninfo>
tr: <screeninfo>Arka uçlar yapılandırmasi iletişim kutusu</screeninfo>

source: <phrase>The backends configuration dialog</phrase>
tr: <phrase>Arka uçlar yapılandırması iletişim kutusu</phrase>

source: Using backend configuration pages for EPub, FictionBook, Mobipocket, Markdown, TXT, and OpenDocument Text you can define the font to render documents in the corresponding formats. The <guibutton>Choose...</guibutton> button in these pages opens standard &kde; font configuration window. Please refer to the <ulink url="help:/fundamentals/fonts.html">&kde; Fundamentals documentation</ulink> for the details.
tr: EPub, FictionBook, Mobipocket, Markdown, TXT ve OpenDocument Text için arka uç yapılandırma sayfalarını kullanarak belgeleri ilgili biçimlerde sunmak için yazıtipini tanımlayabilirsiniz. Bu sayfalardaki <guibutton>Seç…</guibutton> düğmesi, standart &kde; yazıtipi yapılandırma penceresini açar. Ayrıntılar için <ulink url="help:/fundamentals/fonts.html">&kde; Temelleri belgelendirmesine</ulink> başvurun.

source: The description of Markdown, &PostScript; and &PDF; backends configuration pages can be found below.
tr: Markdown, &PostScript; ve &PDF; arka uçlarının yapılandırma sayfalarının açıklamaları aşağıda bulunabilir.

source: Markdown backend configuration
tr: Markdown arka ucu yapılandırması

source: You can configure &okular; Markdown rendering backend based on <ulink url="https://www.pell.portland.or.us/~orc/Code/markdown/">Discount</ulink> by choosing <guilabel>Markdown</guilabel> from the list on the left part of the configuration dialog. An additional configurable option is as follows.
tr: Yapılandırma iletişim kutusunun sol tarafındaki listeden <guilabel>Markdown</guilabel>’u seçip <ulink url="https://www.pell.portland.or.us/~orc/Code/markdown/">Discount</ulink> tabanlı &okular; arka ucunu seçebilirsiniz. Aşağıda ek bir yapılandırma seçeneğini bulabilirsiniz.

source: Enable SmartyPants formatting
tr: SmartyPants biçimlendirmesini etkinleştir

source: When checked this option allows &okular; to process <ulink url="https://daringfireball.net/projects/smartypants/">SmartyPants</ulink> formatting. Such formatting can be troublesome in the technical texts because of unwanted substitutions (&eg;, it replaces <literal>(C)</literal> with a copyright symbol). This option is checked by default.
tr: Bu seçenek, işaretlendiğinde &okular;’ın <ulink url="https://daringfireball.net/projects/smartypants/">SmartyPants</ulink> biçimlendirmesini işlemesine olanak tanır. Bu biçimlendirme türü teknik metinlerde sorun yaratabilir; çünkü istenmeyebilecek değişimler yapar (örneğin, <literal>(C)</literal>’yi telif hakkı sembolüyle değiştirir). Bu seçenek öntanımlı olarak işaretlidir.

source: &PostScript; backend configuration
tr: &PostScript; arka ucu yapılandırması

source: You can configure &okular; &PostScript; rendering backend based on <ulink url="https://www.ghostscript.com/">Ghostscript</ulink> by choosing <guilabel>Ghostscript</guilabel> from the list on the left part of the configuration dialog. The only configurable option is as follows.
tr: Yapılandırma iletişim kutusunun sol tarafındaki listeden <guilabel>Ghostscript</guilabel>’i seçip <ulink url="https://www.ghostscript.com/">Ghostscript</ulink> tabanlı &okular; &PostScript; arka ucunu seçebilirsiniz. Aşağıda ek bir yapılandırma seçeneğini bulabilirsiniz.

source: Use platform fonts
tr: Platform yazıtiplerini kullan

source: This option determines whether Ghostscript should be allowed to use platform fonts, if unchecked only usage of fonts embedded in the document will be allowed. This option is checked by default.
tr: Bu seçenek Ghostscript’in platform yazıtiplerini kullanmasına izin verilip verilmeyeceğini belirler; işaretlenmezse yalnızca belgeye gömülü yazıtiplerinin kullanımına izin verilir. Bu seçenek öntanımlı olarak işaretlidir.

source: &PDF; backend configuration
tr: &PDF; arka ucu yapılandırması

source: You can configure &okular; &PDF; rendering backend based on <ulink url="https://poppler.freedesktop.org/">Poppler</ulink> by choosing <guilabel>&PDF;</guilabel> from the list on the left part of the configuration dialog. The only configurable option is as follows.
tr: Yapılandırma iletişim kutusunun sol tarafındaki listeden <guilabel>&PDF;</guilabel>’yi seçip <ulink url="https://poppler.freedesktop.org/">Poppler</ulink> tabanlı &okular; &PDF; arka ucunu seçebilirsiniz. Aşağıda ek bir yapılandırma seçeneğini bulabilirsiniz.

source: Enhance thin lines
tr: İnce satırları iyileştir

source: Drawing lines in &okular; is implemented in two steps: generation of the clipping path and filling this clipping path. When the line in the original document is less than one pixel this two step implementation could cause problems. For those lines, the clipping path is filled with the filling color that depends on the thickness of the line part inside the clipping area. If the part of the line inside the clipping area gets very small the contrast between the shape and the background color can become too low for the line to be recognizable. The grids of such lines then looks very unpretty.
tr: &okular;’da çizgi çizmek iki adımda gerçekleştirilir: Kırpma yolunun oluşturulması ve bu kırpma yolunun doldurulması. Özgün belgedeki çizgi bir pikselden küçük olduğunda bu iki aşamalı uygulama sorunlara neden olabilir. Bu çizgiler için kırpma yolu, kırpma alanı içindeki çizgi kısmının kalınlığına bağlı olan dolgu rengiyle doldurulur. Çizginin kırpma alanı içindeki kısmı çok küçülürse şekil ile arka plan rengi arasındaki karşıtlık çizginin tanınamayacağı kadar düşük olabilir. Bu tür çizgilerin ızgaraları daha sonra çok çirkin görünürler.
