Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/okular.po
Languages: tr

source: Thin line (red), its clipping path (dashed line) and pixel boundaries (black solid lines)
tr: İnce çizgi (kırmızı), kırpma yolu (kesikli çizgi) ve piksel sınırları (siyah düz çizgiler)

source: Thin line shown at a low contrast
tr: Düşük karşıtlıkta gösterilen ince çizgi

source: To enhance the look of the thin lines &okular; implements two options.
tr: İnce çizgilerin görünümünü geliştirmek için &okular; iki seçeneği uygular.

source: The first option is <guimenuitem>Solid</guimenuitem>. With this option &okular; adjusts clipping path and line position so that clipping path and line are on the same pixel boundary, &ie; &okular; enlarges the thin lines to one pixel on the output device. This mode is similar to the <guilabel>Enhance thin lines</guilabel> in <trademark class="registered">Adobe</trademark> <trademark class="registered">Reader</trademark>. If this option is chosen, the thin lines are always enlarged.
tr: İlk seçenek <guimenuitem>Katı</guimenuitem>’dır. Bu seçenekle &okular;, kırpma yolu ve çizgi konumunu, kırpma yolu ve çizgi aynı piksel sınırında olacak şekilde ayarlar; örneğin &okular;, ince çizgileri çıkış aygıtında bir piksele büyütür. Bu kip, <trademark class="registered">Adobe</trademark> <trademark class="registered">Reader</trademark>’daki <guilabel>İnce çizgileri iyileştir</guilabel> kipine benzerdir. Bu seçenek seçilirse ince çizgiler her zaman büyütülürler.

source: <phrase>Thin line with <guimenuitem>Solid</guimenuitem> enhancement</phrase>
tr: <phrase><guimenuitem>Katı</guimenuitem> iyileştirmeli ince çizgi</phrase>

source: <para>Thin line with <guimenuitem>Solid</guimenuitem> enhancement</para>
tr: <para><guimenuitem>Katı</guimenuitem> iyileştirmeli ince çizgi</para>

source: The second option is <guimenuitem>Shape</guimenuitem>. With this option the clipping path and line are adjusted to pixel boundary as well, but the line intensity is corrected according to its width.
tr: İkince seçenek <guimenuitem>Şekil</guimenuitem>’dir. Bu seçenekte kırpma yolu ve çizgi de piksel sınırına göre ayarlanır; ancak çizgi yoğunluğu genişliğine göre düzeltilir.

source: <phrase>Thin line with <guimenuitem>Shape</guimenuitem> enhancement</phrase>
tr: <phrase><guimenuitem>Şekil</guimenuitem> iyileştirmeli ince çizgi</phrase>

source: <para>Thin line with <guimenuitem>Shape</guimenuitem> enhancement</para>
tr: <para><guimenuitem>Şekil</guimenuitem> iyileştirmeli ince çizgi</para>

source: The thin lines are not enhanced by default (option <guimenuitem>No</guimenuitem>).
tr: İnce çizgiler öntanımlı olarak iyileştirilmezler (<guimenuitem>Hayır</guimenuitem> seçeneği).

source: &PDF; Digital Signature Certificates
tr: &PDF; Sayısal İmza Sertifikaları

source: This section allows you to set a custom Certificate Database to use when adding Digital Signatures to &PDF; files.
tr: Bu bölüm, &PDF; dosyalarına Sayısal İmzalar eklerken kullanılacak özel bir Sertifika Veritabanı ayarlamanıza olanak tanır.

source: It also lists the certificates available in the current Certificate Database (if any).
tr: Ayrıca geçerli Sertifika Veritabanında (varsa) bulunan sertifikaları da listeler.

source: <title>Configuring &okular;</title>
tr: <title>&okular;’ı Yapılandırmak</title>

source: General configuration
tr: Genel yapılandırma

source: You can configure &okular; by choosing <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &okular;...</guimenuitem></menuchoice>. The configuration dialog is split into six sections. This chapter describes the available options in detail.
tr: &okular;’ı <menuchoice><guimenu>Ayarlar</guimenu> <guimenuitem>&okular; Uygulamasını Yapılandır…</guimenuitem></menuchoice> seçimini yaparak yapılandırabilirsiniz. Yapılandırma iletişim kutusu altı bölüme ayrılmıştır. Bu fasıl, kullanılabilir seçenekleri ayrıntılarıyla açıklar.

source: <link linkend="configgeneral">General</link>
tr: <link linkend="configgeneral">Genel</link>

source: <link linkend="configaccessibility">Accessibility</link>
tr: <link linkend="configaccessibility">Erişilebilirlik</link>

source: <link linkend="configperformance">Performance</link>
tr: <link linkend="configperformance">Başarım</link>

source: <link linkend="configpresentation">Presentation</link>
tr: <link linkend="configpresentation">Sunum</link>

source: <link linkend="configannotations">Annotations</link>
tr: <link linkend="configannotations">Bilgi Notları</link>

source: <link linkend="configeditor">Editor</link>
tr: <link linkend="configeditor">Düzenleyici</link>

source: <screeninfo>The configuration dialog</screeninfo>
tr: <screeninfo>Yapılandırma iletişim kutusu</screeninfo>

source: <phrase>The configuration dialog</phrase>
tr: <phrase>Yapılandırma iletişim kutusu</phrase>

source: Depending on the currently installed backends, the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure Backends...</guimenuitem></menuchoice> menu item could be enabled. This particular configuration dialog holds the configurations of the backends that can actually be configured.
tr: Geçerli kurulu arka uçlara bağlı olarak, <menuchoice><guimenu>Ayarlar</guimenu> <guimenuitem>Arka Uçları Yapılandır…</guimenuitem></menuchoice> menü ögesi etkin olabilir. Bu yapılandırma iletişim kutusu, yapılandırılabilir olan arka uçların yapılandırmalarını barındırır.

source: <title>General</title>
tr: <title>Genel</title>

source: Use smooth scrolling
tr: Pürüzsüz sarma kullan

source: Whether to display animated transitions when scrolling using the mouse wheel and keyboard.
tr: Fare tekerleğini ve klavyeyi kullanarak sarma yaparken canlandırmalı geçişlerin görüntülenip görüntülenmeyeceği.

source: Show scrollbars
tr: Sarma çubuklarını göster

source: Whether to show scrollbars for the document view.
tr: Belge görünümü için sarma çubuklarının gösterilip gösterilmeyeceği.

source: Link the thumbnails with the page
tr: Küçük görselleri sayfaya bağlantıla

source: Whether the thumbnails view should always display the current page or not.
tr: Küçük görseller görünümünün her zaman geçerli sayfayı gösterip göstermeyeceği.

source: Show hints and info messages
tr: İpuçlarını ve bilgi iletilerini göster

source: Whether to show some informative messages on startup, file load, &etc;
tr: Başlangıçta, dosya yüklemede vb. bazı bilgilendirici iletilerin gösterilip gösterilmeyeceği

source: Notify about embedded files, forms, or signatures
tr: Gömülü dosyaları, formları veya imzaları bildir

source: Whether to show informative panels about embedded files, forms or signatures &etc;
tr: Gömülü dosyalar, formlar veya imzalar vb. hakkında bilgilendirici panellerin gösterilip gösterilmeyeceği

source: Display document title in titlebar if available
tr: Varsa belge başlığını başlık çubuğunda göster

source: Whether to show the current document title in the titlebar of &okular; window. If no metadata for title found in the document or this item is unchecked &okular; shows filename of the document.
tr: Geçerli belge başlığının &okular; pencerelerinin başlık çubuğunda gösterilip gösterilmeyeceği. Belgede başlık için üst veri bulunmazsa veya bu öge işaretlenmezse &okular; belgenin dosya adını gösterir.

source: When not displaying document title
tr: Belge başlığı görüntülenmediği zaman

source: You can choose any of two options, <guilabel>Display file name only</guilabel> or <guilabel>Display full file path</guilabel>.
tr: İki seçenekten birini seçebilirsiniz: <guilabel>Yalnızca dosya adını görüntüle</guilabel> veya <guilabel>Tam dosya yolunu görüntüle</guilabel>.

source: Use custom background color
tr: Özel arka plan rengi kullan

source: Enables <ulink url="help:/fundamentals/colors.html">choosing the document background color</ulink> (the color around the displayed page). By default, the &Qt; toolkit color is used when this option is unchecked.
tr: <ulink url="help:/fundamentals/colors.html">Belge arka plan rengi seçimini</ulink> etkinleştirir (görüntülenen sayfa etrafındaki renk). Bu seçenek işaretlenmediğinde öntanımlı olarak &Qt; araç kiti rengi kullanılır.

source: Open new files in tabs
tr: Yeni dosyaları sekmelerde aç

source: Whether to open new documents in tabs. The tabs are disabled by default.
tr: Yeni belgelerin sekmelerde açılıp açılmayacağı. Sekmeler öntanımlı olarak devre dışıdır.

source: The default shortcuts to switch between tabs are <keycombo>&Ctrl;<keycap>.</keycap></keycombo> (<guilabel>Next tab</guilabel>) and <keycombo>&Ctrl;<keycap>,</keycap></keycombo> (<guilabel>Previous tab</guilabel>).
tr: Sekmeler arasında geçiş yapmak için öntanımlı kısayollar: <keycombo>&Ctrl;<keycap>.</keycap></keycombo> (<guilabel>Sonraki sekme</guilabel>) ve <keycombo>&Ctrl;<keycap>,</keycap></keycombo> (<guilabel>Önceki sekme</guilabel>).

source: Switch to existing tab if file is already open
tr: Dosya halihazırda açıksa var olduğu sekmeye geç

source: Whether &okular; should switch to a tab if the file is already open instead of opening a new tab. This option is enabled by default. Can be toggled only if <guilabel>Open new files in tabs</guilabel> is enabled.
tr: Dosya zaten açıksa yeni bir sekme açmak yerine &okular;’ın var olan bir sekmeye geçip geçmeyeceği. Bu seçenek öntanımlı olarak etkindir. Yalnızca <guilabel>Yeni dosyaları sekmelerde aç</guilabel> etkinse açılabilir/kapatılabilir.

source: Obey DRM limitations
tr: DRM sınırlamalarına uy

source: Whether &okular; should obey <firstterm>DRM</firstterm> (Digital Rights Management) restrictions. DRM limitations are used to make it impossible to perform certain actions with &PDF; documents, such as copying content to the clipboard. Note that in some configurations of &okular;, this option is not available.
tr: &okular;’ın <firstterm>DRM</firstterm> (Sayısal Haklar Yönetimi) kısıtlamalarına uyması gerekip gerekmediği. DRM sınırlamaları, içeriğin panoya kopyalanması gibi &PDF; belgeleriyle belirli eylemlerin gerçekleştirilmesini olanaksızlaştırmak için kullanılır. &okular;’ın bazı yapılandırmalarında bu seçeneğin kullanılabilir olmadığını unutmayın.

source: Reload document on file change
tr: Dosya değiştirildiğinde belgeyi yeniden yükle

source: Whether opened files should be automatically checked for changes and updated, if necessary.
tr: Açık dosyaların değişiklikler açısından kendiliğinden denetlenip denetlenmeyeceği ve gerekirse güncellenip güncellenmeyeceği.

source: Show backend selection dialog
tr: Arka uç seçimi iletişim kutusunu göster

source: Whether &okular; should ask the user which backend to use in case of more than one backend able to open the current file. If unchecked, &okular; will use the backend with the highest priority.
tr: &okular;’ın geçerli dosyayı açabilen birden fazla arka uç olması durumunda kullanıcıya hangi arka ucun kullanılacağını sorması gerekip gerekmediği. İşaretlenmezse &okular;, en yüksek önceliğe sahip arka ucu kullanır.

source: Right to left reading direction
tr: Sağdan sola okuma yönü

source: Whether to use right to left reading direction by default for the opened files. Can be useful for <ulink url="https://en.wikipedia.org/wiki/Right-to-left">some writing systems</ulink>.
tr: Açık dosyalar için öntanımlı olarak sağdan sola okuma yönünün kullanılıp kullanılmayacağı. <ulink url="https://en.wikipedia.org/wiki/Right-to-left">Bazı yazma sistemleri</ulink> için yararlı olabilir.

source: Open in continuous mode by default
tr: Öntanımlı olarak sürdürülen kipte aç

source: Whether to use the continuous mode by default. In continuous mode, all pages of the document are shown, and you can smoothly scroll through them. Otherwise, only one page (or one row of pages) is shown at a time.
tr: Sürdürülen kipin öntanımlı olarak kullanılıp kullanılmayacağı. Sürdürülen kipte belgenin tüm sayfaları gösterilir ve bunlar arasında sorunsuz bir şekilde gezinebilirsiniz. Aksi takdirde, aynı anda yalnızca bir sayfa (veya sayfaların bir satırı) gösterilir.

source: When using Browse Tool, wrap cursor at screen edges
tr: Göz At aracını kullanırken, ekran kenarlarında imleci kaydır

source: Allows endless scrolling around the entire document with the <link linkend="menutools">Browse Tool</link>. If enabled, the mouse cursor will wrap to the opposite end of the screen when it touches the borders while dragging the document. This feature is only supported on X11.
tr: <link linkend="menutools">Göz At Aracı</link> ile belgenin tamamında sonsuz sarma yapılmasına olanak tanır. Etkinleştirilirse belgeyi sürüklerken kenarlara dokunulduğunda fare imleci ekranın diğer ucuna kaydırılır. Bu özellik yalnızca X11’de desteklenir.

source: Overview columns
tr: Genel görünüm sütunları

source: This option represents the number of columns to use in the overview mode.
tr: Bu seçenek, genel görünüm kipinde kullanılacak sütun sayısını temsil eder.

source: Page Up/Down overlap
tr: Sayfa Yukarı/Aşağı çakışması

source: Here you can define the percentage of the current viewing area that should be visible after pressing &PgUp;/&PgDn; keys.
tr: Burada, &PgUp;/&PgDn; düğmelerine bastıktan sonra görünür olması gereken geçerli görüntüleme alanının yüzdesini tanımlayabilirsiniz.

source: Default Zoom
tr: Öntanımlı yakınlaştırma

source: This option specifies the default zoom mode for files which were never opened before. For those files which were opened before, the previous zoom mode is applied.
tr: Bu seçenek, daha önce hiç açılmamış dosyalar için öntanımlı yakınlaştırma kipini belirtir. Önceki yakınlaştırma kipi uygulanmadan önce açılan dosyalar için.

source: <title>Accessibility</title>
tr: <title>Erişilebilirlik</title>

source: Draw border around links
tr: Bağlantıların çevresine kenarlık çiz

source: Whether to draw a border around links.
tr: Bağlantıların etrafına kenarlık çizilip çizilmeyeceği.

source: Change colors
tr: Renkleri değiştir

source: <action>Enables</action> the color changing options.
tr: Renk değiştirme seçeneklerini <action>etkinleştirir</action>.

source: Color mode
tr: Renk kipi

source: <action>Defines</action> the color changing mode.
tr: Renk değiştirme kipini <action>tanımlar</action>.

source: Invert Colors
tr: Renkleri Tersine Çevir

source: <action>Inverts</action> colors on the view, &ie; black objects will be shown white.
tr: Görünümdeki renkleri <action>tersine çevirir</action>; yani, siyah nesneler beyaz olarak gösterilirler.

source: Change Paper Color
tr: Kâğıt Rengini Değiştir

source: <action>Changes</action> the paper's color, &ie; the document's background.
tr: Kağıdın rengini; yani, belgenin arka planını <action>değiştirir</action>.

source: The color can be selected using the <guilabel>Paper color</guilabel> swatch below.
tr: Renk, aşağıdaki <guilabel>Kâğıt rengi</guilabel> örneğini kullanarak seçilebilir.

source: Change Dark &amp; Light Colors
tr: Koyu ve Açık Renkleri Değiştir

source: <action>Changes</action> the dark and light color to your preference, that means black will not be rendered as black but as the selected dark color and white will not be rendered as white but as the selected light color.
tr: Koyu ve açık rengi tercihinize göre <action>değiştirir</action>; bu, siyahın siyah olarak değil, seçilen koyu renk olarak, beyazın ise beyaz olarak değil, seçilen açık renk olarak sunulacağı anlamına gelir.

source: Convert to Black &amp; White
tr: Siyah–Beyaza Dönüştür

source: <action>Converts</action> the document to black and white. You can set the threshold and the contrast. Setting the threshold to a higher value by moving it to the right will result in lighter grays used.
tr: Belgeyi siyah–beyaza <action>dönüştürür</action>. Eşiği ve karşıtlığı ayarlayabilirsiniz. Eşiği sağa kaydırarak daha yüksek bir değere ayarlamak, daha açık grilerin kullanılmasına neden olur.

source: Invert Lightness
tr: Açıklığı Tersine Çevir

source: <action>Inverts</action> lightness of all colors. Light and dark colors will be swapped, but hue and saturation will not be affected. The Contrast in images will usually be worse than in <guilabel>Invert Luma (sRGB Linear)</guilabel>.
tr: Tüm renklerin açıklığını <action>tersine çevirir</action>. Açık ve koyu yer değiştirir; ancak renk tonu ve doygunluk etkilenmez. Görsellerdeki karşıtlık genellikle <guilabel>Parlaklığı Tersine Çevir (Doğrusal sRGB)</guilabel>’dan daha kötü olacaktır.

source: Invert Luma (sRGB Linear)
tr: Parlaklığı Tersine Çevir (Doğrusal sRGB)

source: <action>Inverts</action> luma of all colors. Light and dark will be swapped, but hue and saturation will not be affected. The Contrast in images is preserved better than in <guilabel>Invert Lightness</guilabel>, but graphics and colorful text markup usually look worse. Uses sRGB luma coefficients, but no gamma correction.
tr: Tüm renklerin parlaklığını <action>tersine çevirir</action>. Açık ve koyu yer değiştirir; ancak renk tonu ve doygunluk etkilenmez. Görsellerdeki karşıtlık, <guilabel>Açıklığı Tersine Çevir</guilabel>’e göre daha iyi korunur; ancak grafikler ve renkli metin işaretlemesi genellikle daha kötü görünür. sRGB parlaklığı katsayılarını kullanır; ancak gama düzeltmesi yapılmaz.

source: Invert Luma (Symmetric)
tr: Parlaklığı Tersine Çevir (Simetrik)

source: <action>Inverts</action> luma of all colors, using symmetric luma coefficients. Light and dark will be swapped, but hue and saturation will not be affected. Very similar to <guilabel>Invert Lightness</guilabel>, but the contrast is in some cases better.
tr: Simetrik parlaklık katsayılarını kullanarak tüm renklerin parlaklığını <action>tersine çevirir</action>. Açık ve koyu yer değiştirir; ancak renk tonu ve doygunluk etkilenmez. <guilabel>Açıklığı Tersine Çevir</guilabel>’e çok benzerdir; ancak bazı durumlarda karşıtlığı daha iyidir.

source: Shift Hue Positive
tr: Pozitif Renk Tonunu Kaydır

source: <action>Shifts</action> hue of all colors by 120 degrees. Can mitigate some contrast problems in colorful graphics.
tr: Tüm renklerin tonunu 120 derece <action>kaydırır</action>. Renkli grafiklerdeki bazı karşıtlık sorunlarını azaltabilir.

source: Shift Hue Negative
tr: Negatif Renk Tonunu Kaydır

source: <action>Shifts</action> hue of all colors by 240 degrees. Can mitigate some contrast problems in colorful graphics.
tr: Tüm renklerin tonunu 240 derece <action>kaydırır</action>. Renkli grafiklerdeki bazı karşıtlık sorunlarını azaltabilir.

source: You can configure keyboard shortcuts and toolbar actions for the color modes using the corresponding menu items in the <guimenu>Settings</guimenu> menu of the &okular; main window.
tr: &okular;’ın <guimenu>Ayarlar</guimenu> menüsündeki ilgili menü ögelerini kullanarak renk kiplerini için klavye kısayollarını ve araç çubuğu eylemlerini yapılandırabilirsiniz.

source: Text-to-speech engine
tr: Konuşma işletkesi

source: <action>Allows you to choose</action> the text-to-speech (<abbrev>TTS</abbrev>) engine to be used by &okular;. The default is <application>speechd</application> <abbrev>TTS</abbrev>.
tr: &okular; tarafından kullanılacak konuşma (<abbrev>TTS</abbrev>) işletkesini <action>seçmenize olanak tanır</action>. Öntanımlı uygulama, <application>speechd</application> <abbrev>TTS</abbrev> şeklindedir.

source: Text-to-speech voice
tr: Konuşma sesi

source: <action>Allows you to choose</action> a voice for the text-to-speech engine to be used by &okular;. You can use all languages and voices depending on the available synthesizers on your platform. On &Linux;, speech-dispatcher is used by default to determine available voices.
tr: &okular; tarafından kullanılacak konuşma işletkesi için bir ses <action>seçmenize</action> olanak tanır. Platformunuzdaki kullanılabilir sentezleyicilere bağlı olarak tüm dilleri ve sesleri kullanabilirsiniz. &Linux;’ta, kullanılabilir sesleri belirlemek için öntanımlı olarak speech-dispatcher kullanılır.

source: <title>Performance</title>
tr: <title>Başarım</title>

source: Enable transparency effects
tr: Saydamlık efektlerini etkinleştir

source: Draw selections and other special graphics using transparency effects. Disable the option to draw them using outline or opaque fill styles and increase speed on selections.
tr: Saydamlık efektlerini kullanarak seçimler ve diğer özel grafikler çizin. Ana hat veya mat dolgu biçemlerini kullanarak bunları çizme seçeneğini devre dışı bırakın ve seçimlerdeki hızı artırın.

source: Memory usage
tr: Bellek kullanımı

source: &okular; can achieve best performance by tuning the memory usage, based on your system and your tastes. The more memory you let it to use, the faster the program will behave. The Default profile is good for every system, but you can prevent &okular; from using more memory than necessary by selecting the Low profile, or let it get the most out of your system using Aggressive. Use Greedy profile to preload all pages without risk of system memory overfull (only 50% of total memory or free memory will be used).
tr: &okular;, sisteminize ve zevklerinize göre bellek kullanımını ayarlayarak en iyi başarımı elde edebilir. Ne kadar çok bellek kullanmasına izin verirseniz program o kadar hızlı davranır. Öntanımlı profil her sistem için iyidir; ancak Düşük profilini seçerek &okular;’ın gereğinden fazla bellek kullanmasını önleyebilir veya Yoğun’u kullanarak sisteminizden en iyi şekilde yararlanmasını sağlayabilirsiniz. Sistem belleğinin aşırı dolma riski olmadan tüm sayfaları önceden yüklemek için Çok Yoğun profilini kullanın (toplam belleğin veya boş belleğin yalnızca %​50’si kullanılacaktır).

source: Rendering options
tr: Sunum seçenekleri

source: Using this group of options you can improve text and image rendering in &okular;. The result depends on the device to display the document. <guilabel>Enable Text Antialias</guilabel> and <guilabel>Enable Graphics Antialias</guilabel> items can be used to switch on and off <ulink url="https://en.wikipedia.org/wiki/Spatial_anti-aliasing">spatial anti-aliasing</ulink> of text and images in document, correspondingly. <guilabel>Enable Text Hinting</guilabel> item is meant to be a switcher for <ulink url="https://en.wikipedia.org/wiki/Font_hinting">font hinting</ulink>. Antialiasing and hinting change how the documents are displayed, you may want to tweak them to your preference.
tr: Bu seçenek grubunu kullanarak &okular;’daki metin ve görsel sunumunu iyileştirebilirsiniz. Sonuç, belgeyi görüntüleyecek aygıta bağlıdır.<guilabel>Metin kenar yumuşatmasını etkinleştir</guilabel> ve <guilabel>Grafik kenar yumuşatmasını etkinleştir</guilabel> seçenekleri, belgedeki metin ve görsellerin <ulink url="https://en.wikipedia.org/wiki/Spatial_anti-aliasing">uzamsal kenar yumuşatmasını</ulink> sırasıyla açıp kapatmak için kullanılabilir. <guilabel>Metin düzgünleştirmeyi etkinleştir</guilabel> ögesi ise <ulink url="https://en.wikipedia.org/wiki/Font_hinting">yazıtipi düzgünleştirme</ulink> için bir anahtar olarak kullanılır. Kenar yumuşatma ve düzgünleştirme, belgelerin görüntülenme biçimini değiştirir; bunları tercihinize göre ayarlamak isteyebilirsiniz.

source: <title>Presentation</title>
tr: <title>Sunum</title>

source: Advance every
tr: Kendiliğinden ilerle

source: Enables automatic advancing of pages given a time period.
tr: Belirli bir süre içinde sayfaların kendiliğinden ilerlemesini sağlar.

source: Loop after last page
tr: Son sayfadan sonra başa dön

source: When navigating on presentation mode and going past the last page the first page will appear.
tr: Sunum kipinde dolaşımdayken ve son sayfayı geçtikten sonra ilk sayfa gelir.

source: Touch navigation
tr: Dokunma dolaşımı

source: Allows you to fine-tune touchscreen navigation with tapping in the presentation using the following three possible values:
tr: Aşağıdaki üç olası değeri kullanarak sunumda dokunarak dokunmatik ekranda gezinmeye ince ayar yapmanızı sağlar:
