Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/okular.po
Languages: tr

source: If the current document has some files embedded in it, when you open it a bar will appear above the page view to notify you about the embedded files.
tr: Geçerli belgede bazı gömülü dosyalar varsa onu açtığınızda sayfa görünümünün üzerinde sizi gömülü dosyalar hakkında bilgilendiren bir çubuk görünecektir.

source: <screeninfo>The embedded files bar</screeninfo>
tr: <screeninfo>Gömülü dosyalar çubuğu</screeninfo>

source: <phrase>The embedded files bar</phrase>
tr: <phrase>Gömülü dosyalar çubuğu</phrase>

source: In this case, you can either click on the link in the text of the bar or choose <menuchoice><guimenu>File</guimenu><guimenuitem>Embedded Files</guimenuitem></menuchoice> to open the embedded files dialog. The dialog allows you to view the embedded files and to extract them.
tr: Bu durumda, ya çubuk metnindeki bağlantıya tıklayabilir ya da gömülü dosyalar iletişim kutusunu açmak için <menuchoice><guimenu>Dosya</guimenu><guimenuitem>Gömülü Dosyalar</guimenuitem></menuchoice> yolunu izleyebilirsiniz. İletişim kutusu, gömülü dosyaları görüntülemenize ve onları çıkarmanıza olanak tanır.

source: Forms
tr: Formlar

source: If the current document has forms, when you open it a bar will appear above the page view where you can enable the forms.
tr: Geçerli belgede formlar varsa açtığınızda sayfa görünümünün üzerinde formları etkinleştirebileceğiniz bir çubuk görünecektir.

source: <screeninfo>The forms bar</screeninfo>
tr: <screeninfo>Formlar çubuğu</screeninfo>

source: <phrase>The forms bar</phrase>
tr: <phrase>Formlar çubuğu</phrase>

source: In this case, you can either click on <guilabel>Show Forms</guilabel> in the bar or choose <menuchoice><guimenu>View</guimenu><guimenuitem>Show Forms</guimenuitem></menuchoice> to enter data into the form fields.
tr: Bu durumda, ya çubuktaki <guilabel>Formları Göster</guilabel> üzerine tıklayabilir ya da veriyi form alanlarına girmek için <menuchoice><guimenu>Görünüm</guimenu><guimenuitem>Formları Göster</guimenuitem></menuchoice> yolunu izleyebilirsiniz.

source: Signatures
tr: İmzalar

source: If the current document has signatures a bar will appear above the page view after the document opening. It allows you to open the <guilabel>Signatures</guilabel> panel.
tr: Geçerli belgede imzalar varsa belgeyi açtıktan sonra sayfa görünümünün üstünde bir imzalar çubuğu görünecektir. Bu, <guilabel>Signatures</guilabel> panelini açmanıza olanak tanır.

source: <screeninfo>The signatures bar</screeninfo>
tr: <screeninfo>İmzalar çubuğu</screeninfo>

source: <phrase>The signatures bar</phrase>
tr: <phrase>İmzalar çubuğu</phrase>

source: Using the <guilabel>Signatures</guilabel> panel you can inspect the document signature and its certificate.
tr: <guilabel>İmzalar</guilabel> panelini kullanarak belge imzalarını ve sertifikalarını denetleyebilirsiniz.

source: <screeninfo>The signatures panel</screeninfo>
tr: <screeninfo>İmzalar paneli</screeninfo>

source: <phrase>The signatures panel</phrase>
tr: <phrase>İmzalar paneli</phrase>

source: This feature is available for &PDF; documents only. You need to install at least version 0.51 of <ulink url="https://poppler.freedesktop.org/">Poppler</ulink> to get most signature information, version 0.68 to get signature location/reason information, and version 0.73 to get signature certificate information.
tr: Bu özellik yalnızca &PDF; belgeleri için kullanılabilirdir. Çoğu imza bilgisini alabilmek için <ulink url="https://poppler.freedesktop.org/">Poppler</ulink>’ın en az 0.51 sürümünü, imza konum/gerekçe bilgisini almak için 0.68 sürümünü ve imza sertifikası bilgisini almak için 0.73 sürümünü kurmanız gerekir.

source: Adding Digital Signatures
tr: Sayısal İmzalar Eklemek

source: You can add digital signatures to documents using the corresponding action in the <menuchoice><guimenu>Tools</guimenu></menuchoice> menu.
tr: Belgelerinize, <menuchoice><guimenu>Araçlar</guimenu></menuchoice> menüsündeki ilgili eylemi kullanarak imzalar ekleyebilirsiniz.

source: To be able to sign a document you need to have a proper <acronym>PKCS</acronym> signing certificate available on your system. &okular; does not have the ability to create such certificates since they need to be issued by certificate authorities to be useful for validation, &etc;
tr: Bir belgeyi imzalayabilmek için sisteminizde doğru bir <acronym>PKCS</acronym> imzalama sertifikasının kullanılabilir olması gerekir. &okular;’ın böyle sertifikalar oluşturma yeteneği yoktur; çünkü bu tür sertifikalar doğrulama gerektirdiklerinden; ancak yetkili sertifika organları tarafından verilebilirler.

source: We use the Poppler library to handle signing of &PDF; documents and Poppler is using the NSS library to handle certificates. At the point of writing, Poppler will try to use one of the following NSS certificate stores in order (the first that exists):
tr: &PDF; belgelerinin imzalanmasını işlemek için Poppler kitaplığını kullanırız. Poppler da sertifikaları işlemek için NSS kitaplığını kullanır. Bu belgenin yazıldığı tarihte, Poppler sırasıyla aşağıdaki NSS sertifikası depolarını kullanmaya çalışır (ilk var olanı):

source: The current Firefox user certificate store.
tr: Geçerli Firefox kullanıcı sertifikası deposu.

source: The system-wide <filename>/etc/pki/nssdb</filename> certificate store.
tr: Sistem geneli <filename>/etc/pki/nssdb</filename> sertifika deposu.

source: The current user <filename>$HOME/.pki/nssdb</filename>
tr: Geçerli kullanıcının <filename>$HOME/.pki/nssdb</filename> deposu

source: If you want to use a custom certificate store you can do so by setting it in the <link linkend="config-pdf-digital-signatures">&PDF; Backend Configuration</link> section of the <link linkend="configure-backends">Configure Backends...</link> dialog.
tr: Özel bir sertifika deposu kullanmak istiyorsanız bunu <link linkend="configure-backends">Arka Uçları Yapılandır…</link> iletişim kutusunun <link linkend="config-pdf-digital-signatures">&PDF; Arka Ucu Yapılandırması</link> bölümünden ayarlayabilirsiniz.

source: This feature is available for &PDF; documents only. You need to install at least version 21.01 of <ulink url="https://poppler.freedesktop.org/">Poppler</ulink> to be able to add digital signatures to a document.
tr: Bu özellik yalnızca &PDF; belgeleri için kullanılabilirdir. Bir belgeye sayısal imzalar ekleyebilmek için <ulink url="https://poppler.freedesktop.org/">Poppler</ulink> kitaplığının en az 21.01 sürümünün kurulu olması gerekir.

source: <title>Annotations</title>
tr: <title>Bilgi Notları</title>

source: &okular; allows you to review and annotate your documents.
tr: &okular;, belgelerinizi gözden geçirmenize ve bilgi notları eklemenize olanak tanır.

source: <screeninfo>&okular;'s Annotations</screeninfo>
tr: <screeninfo>&okular;’ın Bilgi Notları</screeninfo>

source: <phrase>&okular;'s Annotations</phrase>
tr: <phrase>&okular;’ın Bilgi Notları</phrase>

source: &okular; has two different kind of annotations:
tr: &okular;’da iki tür bilgi notu vardır:

source: Text annotations like <guilabel>Yellow Highlighter</guilabel> and <guilabel>Black Underlining</guilabel> can be used with files containing text (&eg; &PDF;).
tr: Metin içeren belgeler için <guilabel>Sarı Vurgulayıcı</guilabel> ve <guilabel>Siyah Altı Çizili</guilabel> gibi notlar kullanılabilir (&eg;, &PDF;).

source: Graphic annotations like <guilabel>Pop-up Note</guilabel>, <guilabel>Inline Note</guilabel>, <guilabel>Freehand Line</guilabel>, <guilabel>Highlighter</guilabel>, <guilabel>Straight Line</guilabel>, <guilabel>Polygon</guilabel>, <guilabel>Stamp</guilabel>, <guilabel>Underline</guilabel>, <guilabel>Ellipse</guilabel>, and <guilabel>Typewriter</guilabel>.
tr: <guilabel>Açılır Not</guilabel>, <guilabel>İç Not</guilabel>, <guilabel>Serbest Çizim</guilabel>, <guilabel>Vurgulayıcı</guilabel>, <guilabel>Düz Çizgi</guilabel>, <guilabel>Çokgen</guilabel>, <guilabel>Damga</guilabel>, <guilabel>Altı Çizili</guilabel>, <guilabel>Elips</guilabel> ve <guilabel>Daktilo</guilabel> gibi grafiksel bilgi notları.

source: Graphic annotations are not limited to &PDF; files; they can be used for any format that &okular; supports.
tr: Grafiksel bilgi notları &PDF; dosyalarıyla sınırlı değildirler; &okular;’ın desteklediği herhangi bir dosyada kullanılabilirler.

source: Using the <guilabel>Annotations</guilabel> menu, you can add a <guilabel>Pop up Note</guilabel> or any other kind of annotation to add or edit comments.
tr: <guilabel>Bilgi Notları</guilabel> menüsünü kullanarak, yorumlar eklemek veya düzenlemek için <guilabel>Açılır Not</guilabel> veya başka bir tür bilgi notu ekleyebilirsiniz.

source: &okular; has the "document archiving" feature. This is an &okular;-specific format for carrying the document plus various metadata related to it (currently only annotations). You can save a "document archive" from the open document by choosing <menuchoice><guimenu>File</guimenu><guisubmenu>Save As</guisubmenu></menuchoice> and selecting <guilabel>Okular document archive</guilabel> in the <guilabel>Filter</guilabel> selector. Documents saved this way will get <filename>.okular</filename> as their filename extension. To open an &okular; document archive, just open it with &okular; as it would be &eg; a &PDF; document.
tr: &okular;’da bu “belge arşivleme” özelliği vardır. Bu, belgeyi ve belgeyle ilişkili çeşitli üst veriyi taşımak için &okular;’a özel bir biçimdir (şu anda yalnızca bilgi notlarını destekler). <menuchoice><guimenu>Dosya</guimenu><guisubmenu>Farklı Kaydet</guisubmenu></menuchoice> menüsüne gidip <guilabel>Süzgeç</guilabel> seçicisinde belge türü olarak <guilabel>Okular belge arşivi</guilabel>’ni seçtiğinizde bir “belge arşivi” kaydedebilirsiniz. Böyle kaydedilen belgeler dosya uzantısı olarak <filename>.okular</filename> alırlar. Bir &okular; belge arşivini açmak için normal bir &PDF; belgesini açarmışçasına onu &okular; ile açın.

source: You can <emphasis>also</emphasis> save annotations directly into &PDF; files. You can use <menuchoice><guimenu>File</guimenu> <guimenuitem>Save</guimenuitem></menuchoice> to save it over the current file or <menuchoice><guimenu>File</guimenu> <guimenuitem>Save As...</guimenuitem></menuchoice> to save it to a new file.
tr: <emphasis>Ayrıca</emphasis>, bilgi notlarını doğrudan &PDF; dosyalarının içine kaydedebilirsiniz. Geçerli dosyanın üzerine kaydetmek için <menuchoice><guimenu>Dosya</guimenu> <guimenuitem>Kaydet</guimenuitem></menuchoice> ögesini veya yeni bir dosyaya kaydetmek için <menuchoice><guimenu>Dosya</guimenu> <guimenuitem>Farklı Kaydet…</guimenuitem></menuchoice> ögesini kullanın.

source: Note that adding, editing, or removing annotations may not be possible with DRM-enabled files.
tr: DRM kullanan dosyalarda bilgi notu eklenmesi, onların düzenlenmesi veya kaldırılması geçerli olamaz.

source: It is possible to <link linkend="edit-undo">undo</link> or <link linkend="edit-redo">redo</link> any annotation action by using the corresponding item from the <guimenu>Edit</guimenu> menu. It is also possible to undo the action by pressing <keycombo>&Ctrl;<keycap>Z</keycap></keycombo> and to redo a previously undone action by pressing <keycombo>&Ctrl;&Shift;<keycap>Z</keycap></keycombo>.
tr: Bir bilgi notunu, <guimenu>Edit</guimenu> menüsünden <link linkend="edit-undo">Geri Al</link> veya <link linkend="edit-redo">Yinele</link> yapabilirsiniz. Son eylemi <keycombo>&Ctrl;<keycap>Z</keycap></keycombo> yaparak geri almak ve <keycombo>&Ctrl;&Shift;<keycap>Z</keycap></keycombo> yaparak yinelemek olanaklıdır.

source: You can configure the default properties and appearance of each annotation tool. Please refer to the <link linkend="configannotations">corresponding section in this documentation</link>.
tr: Her bir bilgi notu aracının öntanımlı özelliklerini ve görünüşünü yapılandırabilirsiniz. Lütfen belgelendirmenin <link linkend="configannotations">ilgili bölümüne</link> bir göz atın.

source: Adding annotations
tr: Bilgi notları eklemek

source: To add annotations to the document, you can use <guilabel>Quick Annotations</guilabel> button on the main &okular; toolbar, or activate the annotation toolbar. This is done by either selecting <menuchoice><guimenu>Tools</guimenu><guimenuitem>Annotations</guimenuitem></menuchoice> or pressing <keycap>F6</keycap>. Once the annotation toolbar is shown, just press one of its buttons or use keyboard shortcuts (keys from <keycap>1</keycap> to <keycap>9</keycap>) to use that annotation.
tr: Belgeye bilgi notları eklemek için ana &okular; araç çubuğundaki <guilabel>Tez Bilgi Notları</guilabel> düğmesini kullanabilir veya bilgi notu araç çubuğunu etkinleştirebilirsiniz. Bu, <menuchoice><guimenu>Araçlar</guimenu><guimenuitem>Bilgi Notları</guimenuitem></menuchoice> yolunu izleyerek veya <keycap>F6</keycap> düğmesine basılarak yapılır. Bilgi notları araç çubuğu gösterildiğinde herhangi bir notu kullanmak için düğmelerinden birine basın veya klavye kısayollarını kullanın (<keycap>1</keycap> ile <keycap>9</keycap> arası düğmeler).

source: The annotation toolbar helps you to make annotations with drawings, shapes, and text messages. You can use the annotation toolbar to mark up a document (&eg; add lines, ellipses, polygons, stamps, highlights, underlines &etc;). The table below describes exactly what the default set of annotation toolbar buttons does.
tr: Bilgi notu araç çubuğu çizimler, şekiller ve metin iletileriyle ek açıklamalar oluşturmanıza yardımcı olur. Bir belgeyi işaretlemek için bilgi notu araç çubuğunu kullanabilirsiniz (örneğin; çizgiler, elipsler, çokgenler, damgalar, vurgular, alt çizgiler vb. eklemek için). Aşağıdaki tablo, öntanımlı bilgi notu araç çubuğu düğmeleri kümesinin tam olarak ne yaptığını açıklamaktadır.

source: Button
tr: Düğme

source: Tool Name
tr: Araç Adı

source: Description
tr: Açıklama

source: Highlighter
tr: Vurgulayıcı

source: Highlights text in the document with a given background color.
tr: Belgedeki metni belirli bir arka plan rengiyle vurgular.

source: Click on the tool button, then click with the &LMB; and drag to highlight a text snippet.
tr: Araç düğmesine tıklayın, ardından &LMB; ile tıklayın ve bir metin parçacığını vurgulamak için sürükleyin.

source: It is possible to define the <guilabel>Type</guilabel> (<guimenuitem>Highlight</guimenuitem>, <guimenuitem>Squiggle</guimenuitem>, <guimenuitem>Underline</guimenuitem> or <guimenuitem>Strike out</guimenuitem>), <guilabel>Color</guilabel>, and <guilabel>Opacity</guilabel> for the highlighter. Just right-click on the highlighted text and select the <guimenuitem>Properties</guimenuitem> menu item.
tr: Vurgulayıcı <guilabel>Tür</guilabel>’ünü (<guimenuitem>Vurgu</guimenuitem>, <guimenuitem>Dalgalı Çizgili</guimenuitem>, <guimenuitem>Altı Çizili</guimenuitem> veya <guimenuitem>Üzeri Çizili</guimenuitem>), <guilabel>Renk</guilabel>’ini ve <guilabel>Matlık</guilabel>’ını tanımlamak da olanaklıdır. Yalnızca vurgulanan metnin üzerine sağ tıklayın ve <guimenuitem>Özellikler</guimenuitem> menü ögesini kullanın.

source: Underline
tr: Altı Çizili

source: Underlines text with a straight line.
tr: Metnin altını düz bir çizgiyle çizer.

source: Click on the tool button, then click with the &LMB; and drag to underline a text snippet.
tr: Araç düğmesine tıklayın, ardından &LMB; ile tıklayın ve bir metin parçacığının altını çizmek için sürükleyin.

source: It is possible to define the <guilabel>Type</guilabel> (<guimenuitem>Highlight</guimenuitem>, <guimenuitem>Squiggle</guimenuitem>, <guimenuitem>Underline</guimenuitem> or <guimenuitem>Strike out</guimenuitem>), <guilabel>Color</guilabel>, and <guilabel>Opacity</guilabel> for the underline. Just right-click on the underlined text and select the <guimenuitem>Properties</guimenuitem> menu item.
tr: Altı çizili metin <guilabel>Tür</guilabel>’ünü (<guimenuitem>Vurgu</guimenuitem>, <guimenuitem>Dalgalı Çizgili</guimenuitem>, <guimenuitem>Altı Çizili</guimenuitem> veya <guimenuitem>Üzeri Çizili</guimenuitem>), <guilabel>Renk</guilabel>’ini ve <guilabel>Matlık</guilabel>’ını tanımlamak da olanaklıdır. Yalnızca altı çizilen metnin üzerine sağ tıklayın ve <guimenuitem>Özellikler</guimenuitem> menü ögesini kullanın.

source: Squiggle
tr: Dalgalı Çizgili

source: Underlines text with a squiggly line.
tr: Metnin altını dalgalı bir çizgiyle çizer.

source: Click on the tool button, then click with the &LMB; and drag to squiggly underline a text snippet.
tr: Araç düğmesine tıklayın, ardından &LMB; ile tıklayın ve bir metin parçacığının altını dalgayı çizgiyle çizmek için sürükleyin.

source: Strike Out
tr: Üzeri Çizili

source: Strikes out some text.
tr: Metinlerin üzerini çizer.

source: Click on the tool button, then click with the &LMB; and drag to squiggly strike out a text snippet.
tr: Araç düğmesine tıklayın, ardından &LMB; ile tıklayın ve bir metin parçacığının üzerini çizmek için sürükleyin.

source: Typewriter
tr: Daktilo

source: Adds text on a transparent background. This is useful for filling out forms lacking integrated editable text fields.
tr: Saydam bir arka plana metin ekler. Bu, tümleşik düzenlenebilir metin alanlarının bulunmadığı formları doldurmak için kullanışlıdır.

source: Click on the tool button, then click with the &LMB; where you wish to add the top-left corner of the text, then drag to place the bottom-right one. Type some text, then click on the <guibutton>OK</guibutton> to save it, <guibutton>Clear</guibutton> to clear the text and start over, or <guibutton>Cancel</guibutton> to cancel.
tr: Araç düğmesine tıklayın, ardından metnin sol üst köşesini eklemek istediğiniz yere &LMB; ile tıklayın, ardından sağ alt köşeyi yerleştirmek için sürükleyin. Biraz metin yazın, ardından kaydetmek için <guibutton>Tamam</guibutton>’a, metni temizleyip baştan başlamak için <guibutton>Temizle</guibutton>’ye veya iptal etmek için <guibutton>İptal</guibutton>’e tıklayın.

source: It is possible to define the <guilabel>Font</guilabel> and <guilabel>Text color</guilabel> for the text. Just right-click on the typewriter text created and select the <guimenuitem>Properties</guimenuitem> menu item.
tr: Metnin <guilabel>Yazıtipi</guilabel>’ni ve <guilabel>Metin rengi</guilabel>’ni tanımlamak olanaklıdır. Oluşturulan metnin üzerine sağ tıklayın ve <guimenuitem>Özellikler</guimenuitem> menü ögesini seçin.

source: Inline Note
tr: İç Not

source: Draws an inline note. The note will be shown inline as is.
tr: Satır içi bir not çizer. Not olduğu gibi satır içi olarak gösterilecektir.

source: Click on the tool button, then click with the &LMB; where you wish to add the top-left corner of the note, then drag to place the bottom-right one. Enter the text of the note then click on the <guibutton>OK</guibutton> to save the note, <guibutton>Clear</guibutton> to clear the note's text, or <guibutton>Cancel</guibutton> to cancel note creation.
tr: Araç düğmesine tıklayın, ardından notun sol üst köşesini eklemek istediğiniz yere &LMB; ile tıklayın, ardından sağ alt köşeyi yerleştirmek için sürükleyin. Notunuzu yazın, ardından kaydetmek için <guibutton>Tamam</guibutton>’a, notu temizleyip baştan başlamak için <guibutton>Temizle</guibutton>’ye veya iptal etmek için <guibutton>İptal</guibutton>’e tıklayın.

source: It is possible to define the <guilabel>Color</guilabel>, <guilabel>Opacity</guilabel>, <guilabel>Font</guilabel>, <guilabel>Align</guilabel>, and <guilabel>Border width</guilabel> for the note. Just right-click on the note icon created and select the <guimenuitem>Properties</guimenuitem> menu item.
tr: Notun <guilabel>Renk</guilabel>’ini, <guilabel>Matlık</guilabel>’ını <guilabel>Yazıtipi</guilabel>’ni, <guilabel>Hizalama</guilabel>’sını ve <guilabel>Kenarlık genişliği</guilabel>’ni tanımlamak olanaklıdır. Oluşturulan notun üzerine sağ tıklayın ve <guimenuitem>Özellikler</guimenuitem> menü ögesini seçin.

source: Pop-up Note
tr: Açılır Not

source: Draws a multiline note. The note can be viewed by double clicking on the icon created in the document.
tr: Çok satırlı bir not çizer. Not, belgede oluşturulan simgeye çift tıklanarak görüntülenebilir.

source: Click on the tool button, then click on the place in the document where the pop-up note should be added. Enter the text of pop-up note then click on the <guilabel>Close this note</guilabel> button in the top right corner of the pop-up window.
tr: Araç düğmesine tıklayın, ardından belgede açılır notun eklenmesi gereken yere tıklayın. Açılır notun metnini girin ve ardından açılır pencerenin sağ üst köşesindeki <guilabel>Bu notu kapat</guilabel> düğmesine tıklayın.

source: It is possible to define the <guilabel>Color</guilabel>, <guilabel>Opacity</guilabel>, and <guilabel>Icon</guilabel> for the note. Just right-click on the note icon created and select the <guimenuitem>Properties</guimenuitem> menu item.
tr: Notun <guilabel>Renk</guilabel>’ini, <guilabel>Matlık</guilabel>’ını ve <guilabel>Simge</guilabel>’sini tanımlamak olanaklıdır. Oluşturulan notun üzerine sağ tıklayın ve <guimenuitem>Özellikler</guimenuitem> menü ögesini seçin.

source: Freehand Line
tr: Serbest Çizim

source: Draws free-form lines.
tr: Serbest biçimli çizgiler çizer.

source: Click on the tool button, then click with the &LMB; and drag to draw the line.
tr: Araç düğmesine tıklayın, ardından &LMB; ile tıklayın ve çizgiyi çizmek için sürükleyin.

source: It is possible to define the <guilabel>Color</guilabel>, <guilabel>Opacity</guilabel>, and <guilabel>Width</guilabel> for the line. Just right-click on the line created and select the <guimenuitem>Properties</guimenuitem> menu item.
tr: Çizginin <guilabel>Renk</guilabel>’ini, <guilabel>Matlık</guilabel>’ını ve <guilabel>Genişlik</guilabel>’ini tanımlamak olanaklıdır. Oluşturulan çizginin üzerine sağ tıklayın ve <guimenuitem>Özellikler</guimenuitem> menü ögesini seçin.

source: Arrow (drop-down list)
tr: Ok (Açılır Liste)

source: Draws an arrow between two points.
tr: İki nokta arasında bir ok çizer.

source: Click on the tool button, then click with the &LMB; to place the starting point of the arrow, then drag to place the ending point of the line and click once more.
tr: Araç düğmesine tıklayın, ardından okun başlangıç noktasını yerleştirmek için &LMB; ile tıklayın, ardından çizginin bitiş noktasını yerleştirmek için sürükleyin ve bir kez daha tıklayın.

source: It is possible to define the <guilabel>Color</guilabel>, <guilabel>Opacity</guilabel>, <guilabel>Width</guilabel>, <guilabel>Line start</guilabel>, <guilabel>Line end</guilabel>, <guilabel>Leader line length</guilabel>, and <guilabel>Leader line extension length</guilabel> for the line. Just right-click on the line created and select the <guimenuitem>Properties</guimenuitem> menu item.
tr: Çizginin <guilabel>Renk</guilabel>’ini, <guilabel>Matlık</guilabel>’ını, <guilabel>Genişlik</guilabel>’ini, <guilabel>Çizgi başı</guilabel>’nı, <guilabel>Çizgi sonu</guilabel>’nu, <guilabel>Lider çizgi uzunluğu</guilabel>’nu ve <guilabel>Lider çizgi uzantısı uzunluğu</guilabel>’nu tanımlamak olanaklıdır. Oluşturulan çizginin üzerine sağ tıklayın ve <guimenuitem>Özellikler</guimenuitem> menü ögesini seçin.

source: Straight line (drop-down list)
tr: Düz Çizgi (Açılır Liste)

source: Draws a line between two points.
tr: İki nokta arasında bir çizgi çizer.

source: Click on the tool button, then click with the &LMB; to place the starting point of the line, then drag to place the ending point of the line and click once more.
tr: Araç düğmesine tıklayın, ardından çizginin başlangıç noktasını yerleştirmek için &LMB; ile tıklayın, ardından çizginin bitiş noktasını yerleştirmek için sürükleyin ve bir kez daha tıklayın.

source: Rectangle (drop-down list)
tr: Dörtgen (Açılır Liste)

source: Draws a rectangle around the chosen area.
tr: Seçili alan çevresinde bir dörtgen çizer.
