Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/okular.po
Languages: tr

source: Sets the external editor command. You cannot set the editor command in an already running &okular; instance. Please note that <option>--unique</option> is not supported when setting the editor command at the commandline.
tr: Dış düzenleyici komutunu ayarlar. Düzenleyici komutunu halihazırda çalışan bir &okular; örneğinde ayarlayamazsınız. Komut satırında düzenleyici komutunu ayarlarken <option>--unique</option> seçeneğinin desteklenmediğini unutmayın.

source: Fit window to page
tr: Pencereyi Sayfaya Sığdır

source: The Fit window to page feature resizes the window so that it is exactly the same size as the page at the current zoom factor. If the page doesn't completely fit on the screen, the window is enlarged so that the largest possible part of the page is shown.
tr: Pencereyi sayfaya sığdır özelliği, pencereyi, geçerli yakınlaştırma çarpanındaki sayfayla tam olarak aynı boyutta olacak şekilde yeniden boyutlandırır. Sayfa ekrana tam olarak sığmazsa pencere sayfanın olabilen en büyük kısmı gösterilecek şekilde büyütülür.

source: This feature can be accessed by using the keyboard shortcut <keycombo action="simul">&Ctrl;<keycap>J</keycap></keycombo>.
tr: Bu özelliğe <keycombo action="simul">&Ctrl;<keycap>J</keycap></keycombo> klavye kısayoluyla erişilebilir.

source: The Menubar
tr: Menü Çubuğu

source: The File Menu
tr: Dosya Menüsü

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Aç…</guimenuitem>

source: <action>Open</action> a supported file or &okular; document archive. If there is already an opened file it will be closed. For more information, see the section about <link linkend="opening">Opening Files</link>.
tr: Desteklenen bir dosyayı veya &okular; belge arşivini <action>açın</action>. Halihazırda açık bir dosya varsa kapatılır. Daha fazla bilgi için <link linkend="opening">Belgeler Açmak</link> ile ilgili bölüme bakın.

source: <guimenu>File</guimenu> <guisubmenu>Open Recent</guisubmenu>
tr: <guimenu>Dosya</guimenu> <guisubmenu>Son Kullanılanı Aç</guisubmenu>

source: <action>Open</action> a file which was used previously from a submenu. If a file is currently being displayed it will be closed. For more information, see the section about <link linkend="opening">Opening Files</link>.
tr: Bir alt menüden daha önce kullanılmış bir dosyayı <action>açın</action>. Halihazırda açık bir dosya varsa kapatılır. Daha fazla bilgi için <link linkend="opening">Belgeler Açmak</link> ile ilgili bölüme bakın.

source: <guimenu>File</guimenu> <guimenuitem>Import PostScript as &PDF;...</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>PostScript’i &PDF; Olarak İçe Aktar…</guimenuitem>

source: <action>Open</action> a &PostScript; file and convert it to &PDF;.
tr: Bir &PostScript; dosyasını <action>açın</action> ve onu &PDF;’ye dönüştürün.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>T</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Undo close tab</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>T</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Sekme Kapatmayı Geri Al</guimenuitem>

source: <action>Reopen</action> the last closed document. This action is active only if you have closed some document in tab during the current session.
tr: Son kapatılan belgeyi <action>yeniden açın</action>. Bu seçenek, geçerli oturumda daha önceden bir belge kapatmışsanız etkin olur.

source: <guimenu>File</guimenu> <guimenuitem>Open Containing Folder</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>İçeren Klasörü Aç</guimenuitem>

source: <action>Open</action> folder that contains the current document in your favorite file manager. This action is especially useful for the case when you have downloaded a &PDF; file from the internet that opens itself in &okular;. The location of this file may not be clear or easy to find without this feature.
tr: Geçerli belgeyi içeren klasörü yeğlediğiniz dosya yöneticisinde <action>açar</action>. Bu, özellikle internetten indirdiğiniz ve &okular; ile açılan bir &PDF; dosyasını bulmak için yararlıdır. Dosyanın konumu açık olmayabilir veya bu özellik olmadan bulması zor olabilir. Ancak günümüzde çoğu web tarayıcısı indirmeler için sistem öntanımlısı İndirmeler klasörünü kullanır.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Kaydet</guimenuitem>

source: <action>Saves</action> the document including all the changes (annotations, form contents, &etc;), provided the document backend supports saving those changes. If the backend does not support saving the changes, the user will be given the option to either discard or to save them together with the document in an &okular; document archive.
tr: Belge arka ucu desteklediği sürece, belgedeki tüm değişiklikleri (bilgi notları, formlar vb.) <action>kaydeder</action>. Arka uç bu değişiklikleri desteklemiyorsa bu değişikliklerden vazgeçmek veya belgeyi bir &okular; belge arşivi olarak kaydetmek seçeneği sunulur.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save As...</guimenuitem>
tr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Farklı Kaydet…</guimenuitem>

source: <action>Saves</action> the document under a new name including all the changes (annotations, form contents, &etc;), provided the document backend supports saving changes. If the backend does not support saving the changes, the user will be given the option to either discard or to save them together with the document in an &okular; document archive.
tr: Belge arka ucu desteklediği sürece, belgedeki tüm değişiklikleri (bilgi notları, formlar vb.) yeni bir adla bir kopyaya <action>kaydeder</action>. Arka uç bu değişiklikleri desteklemiyorsa bu değişikliklerden vazgeçmek veya belgeyi bir &okular; belge arşivi olarak kaydetmek seçeneği sunulur.

source: Note that, due to the way this is implemented, even if there are no changes to the file, the new file need not to be an exact bit-for-bit copy of the original file (&eg; can have a different SHA-1 hash, &etc;).
tr: Bunun uygulanma biçimi nedeniyle, dosyada herhangi bir değişiklik olmasa bile, yeni dosyanın özgün dosyanın tam bir bit kopyası olması gerekmediğini unutmayın (örneğin, farklı bir SHA-1 sağlaması gibi).

source: <shortcut><keycap>F5</keycap></shortcut> <guimenu>File</guimenu> <guimenuitem>Reload</guimenuitem>
tr: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Yeniden Yükle</guimenuitem>

source: <action>Reload</action> the currently open file.
tr: Şu anda açık dosyayı <action>yeniden yükleyin</action>.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Print...</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo></shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Yazdır…</guimenuitem>

source: <action>Print</action> the currently displayed document. Please take into account that &okular; has some specific options for printing &PDF; which are available via pressing the <guibutton>Options >></guibutton> button then choosing the <guilabel>&PDF; Options</guilabel>. Use these options to print your annotations or configure rasterization mode if you have problems with printing some symbols or need to change the scale mode.
tr: Şu anda görüntülenen belgeyi <action>yazdırın</action>. &okular;’ın &PDF; yazdırması için çeşitli seçenekler sunduğunu aklınızdan çıkarmayın; bu seçeneklere <guibutton>Seçenekler >></guibutton> ve sonrasında <guilabel>&PDF; Seçenekleri</guilabel> ile ulaşabilirsiniz. Bazı sembollerin yazdırılmasında sorun yaşıyorsanız veya ölçek kipini değiştirmeniz gerekiyorsa bilgi notlarınızı yazdırmak veya rasterleştirme kipini yapılandırmak için bu seçenekleri kullanın.

source: The scale mode options are only available when you check the <guilabel>Force rasterization</guilabel> option.
tr: Ölçek kipi seçenekleri yalnızca <guilabel>Rasterleştirmeyi zorla</guilabel> seçeneğini işaretlerseniz kullanılabilir.

source: <guimenu>File</guimenu> <guimenuitem>Print Preview...</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Yazdırma Önizlemesi…</guimenuitem>

source: <action>Show a preview</action> of how the currently displayed document would be printed with the default options.
tr: Şu anda görüntülenen belgenin öntanımlı seçeneklerle yazdırılması durumunda nasıl görüneceğinin <action>bir önizlemesini gösterin</action>.

source: <shortcut><keycombo action="simul">&Alt;<keycap>Return</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Properties</guimenuitem>
tr: <shortcut><keycombo action="simul">&Alt;<keycap>Dönüş</keycap></keycombo></shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Özellikler</guimenuitem>

source: <action>Display some basic information</action> about the document, such as title, author, creation date, and details about the fonts used. The available information depends on the type of document.
tr: Belge hakkında; başlığı, yazarı, oluşturulma tarihi ve kullanılan yazıtipleri gibi bilgileri içeren <action>bazı temel bilgileri görüntüleyin</action>. Kullanılabilir bilgiler, belgenin türüne bağlı olarak değişir.

source: Please pay attention on the information about substituting font in the <guilabel>Fonts</guilabel> tab of the <guilabel>Properties</guilabel> dialog. Many problems with font rendering can be solved by installing of the substituted fonts.
tr: Lütfen <guilabel>Özellikler</guilabel> iletişim kutusunun <guilabel>Yazıtipleri</guilabel> sekmesindeki yazıtipi değiştirme ile ilgili bilgilere dikkat edin. Yazıtipi sunumu ile ilgili birçok sorun, değiştirilen yazıtiplerini kurarak çözülebilir.

source: <guimenu>File</guimenu> <guimenuitem>Embedded Files...</guimenuitem>
tr: <guimenu>Dosya</guimenu> <guimenuitem>Gömülü Dosyalar…</guimenuitem>

source: <action>Show the files embedded</action> in the document, if the document has any. For more information, see the section about the <link linkend="embedded-files">Embedded Files</link>.
tr: Belgede varsa <action>gömülü dosyaları gösterin</action>. Daha fazla bilgi için <link linkend="embedded-files">Gömülü Dosyalar</link> ile ilgili bölüme bakın.

source: <guimenu>File</guimenu> <guisubmenu>Export As</guisubmenu>
tr: <guimenu>Dosya</guimenu> <guisubmenu>Farklı Dışa Aktar</guisubmenu>

source: This item contains the export formats the current document can be exported to. The first entry for all kind of documents is always <guimenuitem>Plain Text...</guimenuitem>.
tr: Bu öge, geçerli belgenin dışa aktarılabileceği biçimlerin bir listesini içerir. Her tür belge için ilk girdi her zaman <guimenuitem>Düz Metin…</guimenuitem> olarak ayarlıdır.

source: The second entry is <guimenuitem>Document Archive</guimenuitem>, which allows you to save the document with your annotations into an &okular;-specific archive format. Thus it is easily possible to share the original document and your annotations with other &okular; users or work with them collaboratively.
tr: İkinci girdi ise <guimenuitem>Belge Arşivi</guimenuitem>’dir. Bu biçim, belgeyi notlarınızla birlikte &okular;’a özel bir arşiv biçimine kaydetmenize olanak tanır. Böylece başka &okular; kullanıcılarıyla özgün belgeyi kolaylıkla paylaşabilir veya üzerinde birlikte çalışabilirsiniz.

source: <guimenu>File</guimenu> <guisubmenu>Share</guisubmenu>
tr: <guimenu>Dosya</guimenu> <guisubmenu>Paylaş</guisubmenu>

source: This item contains the services which can be used to share the current document with other people or send it to your devices. The entries in this sub-menu are controlled by the system. They depend on the current document format and the installed KPurpose plugins.
tr: Bu öge, geçerli belgeyi diğer kişilerle paylaşmak veya aygıtlarınıza göndermek için kullanılabilecek hizmetleri içerir. Bu alt menüdeki girdiler sistem tarafından denetlenir. Geçerli belge biçimine ve kurulu KPurpose eklentilerine bağlıdırlar.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Çık</guimenuitem>

source: <action>Close</action> &okular;.
tr: &okular;’ı <action>kapatın</action>.

source: The Edit Menu
tr: Düzen Menüsü

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Geri Al</guimenuitem>

source: <action>Undo</action> the last annotation editing command (creation and removal of annotations, editing arbitrary annotation properties, relocating annotations with &Ctrl;+drag, and editing the text contents of an annotation).
tr: Son bilgi notu düzenleme komutunu <action>geri alın</action> (bilgi notlarının oluşturulması ve kaldırılması, isteğe bağlı not özelliklerinin düzenlenmesi, notların &Ctrl;+sürükle ile yeniden konumlandırılması ve metin içeriğinin düzenlenmesi vb.).

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Redo</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Yinele</guimenuitem>

source: <action>Redo</action> the last undo step when editing annotations.
tr: Bilgi notlarını düzenlerken son geri alma adımını <action>yeniden yapın</action>.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Kopyala</guimenuitem>

source: <action>Copy</action> the currently selected text in <guibutton>Text Selection</guibutton> mode to the clipboard.
tr: <guibutton>Metin Seçimi</guibutton> kipindeyken seçilen geçerli metni panoya <action>kopyalayın</action>.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Select All</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Tümünü Seç</guimenuitem>

source: <action>Selects</action> all the text (if the document provides it). This works only in <guibutton>Text Selection</guibutton> mode.
tr: Tüm metni <action>seçer</action> (eğer belgede varsa). Bu özellik yalnızca <guibutton>Metin Seçimi</guibutton> kipindeyken çalışır.

source: <guimenu>Edit</guimenu> <guimenuitem>Select All Text on Current Page</guimenuitem>
tr: <guimenu>Düzen</guimenu> <guimenuitem>Geçerli Sayfadaki Tüm Metni Seç</guimenuitem>

source: <action>Selects</action> all the text (if the document provides it) of the current page.
tr: Geçerli sayfadaki tüm metni <action>seçer</action> (eğer belgede varsa).

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find...</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Bul…</guimenuitem>

source: Show the find bar on the bottom of the viewing area that allows you to <action>search for a string in the document</action>.
tr: Görüntüleme alanının alt kısmında, <action>belgede bir dizi aramanıza</action> olanak tanıyan bulma çubuğunu gösterin.

source: <shortcut><keycap>F3</keycap></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find Next</guimenuitem>
tr: <shortcut><keycap>F3</keycap></shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Sonrakini Bul</guimenuitem>

source: Try to <action>find the previous searched string again</action> in the document.
tr: Belgede <action>daha önce aranan diziyi yeniden bulmaya</action> çalışın.

source: <shortcut><keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find Previous</guimenuitem>
tr: <shortcut><keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Öncekini Bul</guimenuitem>

source: <action>Goes to the previous occurrence of the search string</action> in the document.
tr: Belgede, arama dizisinin <action>bir önceki oluşuna</action> gider.

source: The View Menu
tr: Görünüm Menüsü

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>P</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Presentation</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>P</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Sunum</guimenuitem>

source: <action>Activates</action> the Presentation Mode. For more information, see the section about <link linkend="presentationMode">Presentation Mode</link>.
tr: Sunum Kipi’ni <action>etkinleştirir</action>. Daha fazla bilgi için <link linkend="presentationMode">Sunum Kipi</link> ile ilgili bölüme bakın.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Full Screen Mode</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Tam Ekran Kipi</guimenuitem>

source: <action>Enables the full screen mode</action>. Note that full screen mode is different from presentation mode insofar as the only peculiarity of full screen mode is that it hides the window decorations, the menubar and the toolbar.
tr: <action>Tam ekran kipini etkinleştirir</action>. Tam ekran kipinin sunum kipinden farklı olduğunu, tam ekran kipinin tek özelliğinin pencere dekorasyonlarını, menü çubuğunu ve araç çubuğunu gizlemesi olduğunu unutmayın.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom In</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Yakınlaştır</guimenuitem>

source: <action>Increase the magnification</action> of the document view.
tr: Belge görünümünün <action>büyütmesini artırın</action>.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom Out</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo></shortcut> <guimenu>Görünüm</guimenu> <guimenuitem>Uzaklaştır</guimenuitem>

source: <action>Decrease the magnification</action> of the document view.
tr: Belge görünümünün <action>büyütmesini azaltın</action>.

source: <guimenu>View</guimenu> <guimenuitem>Zoom to 100%</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>%​100’e Yakınlaştır</guimenuitem>

source: <action>Zoom the document image to the actual size</action> as prescribed by the document parameters.
tr: <action>Belge görselini, belge parametrelerinin öngördüğü şekilde gerçek boyutuna yakınlaştırın</action>.

source: <guimenu>View</guimenu> <guimenuitem>Fit Width</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Genişliğe Sığdır</guimenuitem>

source: <action>Change the magnification</action> of the document view to a value that makes the pages' width equal to the document view's width.
tr: Belge görünümünün büyütme oranını, sayfaların genişliğini <action>belge görünümünün genişliğine eşit yapacak bir değerle değiştirin</action>.

source: <guimenu>View</guimenu> <guimenuitem>Fit Page</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Sayfayı Sığdır</guimenuitem>

source: <action>Change the magnification</action> of the document view to a value that makes at least one whole page visible.
tr: Belge görünümünün büyütme oranını, <action>en az bir sayfanın tamamını görünür kılacak bir değerle değiştirin</action>.

source: <guimenu>View</guimenu> <guimenuitem>Auto Fit</guimenuitem>
tr: <guimenu>Görünüm</guimenu> <guimenuitem>Kendiliğinden Sığdır</guimenuitem>

source: <action>Change the magnification</action> of the document view to a value that, depending on the size relation between the page and the view area, automatically either makes the pages' width equal to the document view's width (like fit-width), the pages' height equal to the document view's height (like fit-height), or the whole page visible (like fit-page).
tr: Belge görünümünün büyütme oranını, sayfa ve görünüm alanındaki boyut ilişkisine bağlı olarak ya sayfaların genişliğini belge görünümlerinin genişliğine eşit yapacak biçimde (genişliğe sığdır gibi) ya sayfaların yüksekliğini belge görünümlerinin yüksekliğine eşit yapacak biçimde (yüksekliğe sığdır gibi) ya da tüm sayfayı görünür yapacak biçimde (sayfayı sığdır gibi) <action>değiştirin</action>.

source: <guimenu>View</guimenu> <guisubmenu>View Mode</guisubmenu>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Görünüm Kipi</guisubmenu>

source: This submenu makes you choose the view mode for the pages. The possible options are: <guimenuitem>Single Page</guimenuitem> (only one page per row), <guimenuitem>Facing Pages</guimenuitem> (two pages per row, in a book style), <guimenuitem>Facing Pages (Center First Page)</guimenuitem> and <guimenuitem>Overview</guimenuitem> (the number of columns is the one specified in the <link linkend="configure">&okular; settings</link>).
tr: Bu alt menü, sayfaları için olar görünüm kipini seçmenize olanak tanır. Olası seçenekler: <guimenuitem>Tek Sayfa</guimenuitem> (satır başına tek sayfa), <guimenuitem>Yüzleşen Sayfalar</guimenuitem> (satır başına iki sayfa, kitap gibi), <guimenuitem>Yüzleşen Sayfalar (İlk Sayfayı Ortala)</guimenuitem> ve <guimenuitem>Genel Görünüm</guimenuitem> (sütun sayısı, <link linkend="configure">&okular; ayarlarında belirtildiği gibidir</link>).

source: Additionally, you can enable the <guimenuitem>Continuous</guimenuitem> mode. In continuous mode, all pages of the document are shown, and you can smoothly scroll through them. Otherwise, only one page (or one row of pages) is shown at a time.
tr: Ayrıca <guimenuitem>Sürekli</guimenuitem> kipini etkinleştirebilirsiniz. Sürekli kipte belgenin tüm sayfaları gösterilir ve bunlar arasında sorunsuz bir şekilde gezinebilirsiniz. Aksi takdirde, aynı anda yalnızca bir sayfa (veya sayfaların bir satırı) gösterilir.

source: <guimenu>View</guimenu> <guisubmenu>Orientation</guisubmenu>
tr: <guimenu>Görünüm</guimenu> <guisubmenu>Yönelim</guisubmenu>

source: This submenu allows you to <action>changes the orientation</action> of the pages of the document.
tr: Bu alt menü, belgenin sayfalarının <action>yönelimini değiştirmenize</action> olanak tanır.

source: The rotation is applied to the orientation of every page.
tr: Döndürme, her bir sayfanın yönelimine uygulanır.

source: You can select <guimenuitem>Original Orientation</guimenuitem> to restore the orientation of the document, discarding all the rotations applied manually.
tr: Elle uygulanan tüm döndürmeleri yok sayarak belgenin yönlendirmesini geri yüklemek için <guimenuitem>Özgün Yönlendirme</guimenuitem>’yi seçebilirsiniz.
