Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/onlinehelp.po
Languages: tr

source: Online Help
tr: Çevrimiçi Yardım

source: Applications 18.04
tr: Uygulamalar 18.04

source: On this page, you can find different ways to find online help and additional information provided by the &kde; community.
tr: Bu sayfada, &kde; topluluğu tarafından sağlanan çevrimiçi yardım ve ek bilgileri bulmanın farklı yollarını bulabilirsiniz.

source: <ulink url="https://userbase.kde.org/Special:myLanguage/An_introduction_to_KDE">An Introduction to &kde;</ulink>&nbsp;
tr: <ulink url="https://userbase.kde.org/Special:myLanguage/An_introduction_to_KDE">&kde;’ye Bir Giriş</ulink>&nbsp;

source: Learn more about the <ulink url="https://kde.org/community/whatiskde/"> &kde; community and its software</ulink> and find information to help you get started. Also, discover what <ulink url="https://userbase.kde.org/Special:myLanguage/Welcome_to_KDE_UserBase"> UserBase</ulink> is and how it can help you.
tr: <ulink url="https://kde.org/community/whatiskde/">&kde; topluluğu ve yazılımları</ulink> hakkında bilgi alın ve başlamanızı sağlayacak bilgiye ulaşın. Ayrıca, <ulink url="https://userbase.kde.org/Special:myLanguage/Welcome_to_KDE_UserBase">Kullanıcı Tabanı</ulink>’nın ne olduğunu ve size nasıl yardımcı olabileceğini öğrenin.

source: <ulink url="https://userbase.kde.org/Special:myLanguage/Getting_Help">Getting Help</ulink>&nbsp;
tr: <ulink url="https://userbase.kde.org/Special:myLanguage/Getting_Help">Yardım Almak</ulink>&nbsp;

source: Need some help? Here are some suggested places where you can get help with problems, as well some hints on how to improve the quality of answers you receive.
tr: Yardıma mı gereksiniminiz var? Sorunlarla ilgili yardım alabileceğiniz bazı önerilen yerlerin yanı sıra aldığınız yanıtların kalitesini nasıl artırabileceğinize dair bazı ipuçlarını burada bulabilirsiniz.

source: <ulink url="https://userbase.kde.org/Special:myLanguage/Applications">Applications</ulink>&nbsp;
tr: <ulink url="https://userbase.kde.org/Special:myLanguage/Applications">Uygulamalar</ulink>&nbsp;

source: Discover the wide variety of applications from the &kde; Community, and find out what program suits your needs and preferences.
tr: &kde; Topluluğu tarafından yaratılmış çok sayıda uygulamayı keşfedin. Gereksinimlerinize ve tercihlerinize en uygun uygulamayı bulun.

source: <ulink url="https://userbase.kde.org/Special:myLanguage/Tutorials">Tutorials</ulink>&nbsp;
tr: <ulink url="https://userbase.kde.org/Special:myLanguage/Tutorials">Öğreticiler</ulink>&nbsp;

source: How-To's, Tips &amp; Tricks that can help make your &kde; software experience more enjoyable and productive.
tr: &kde; yazılımları ile olan deneyiminizi daha keyifli ve üretken kılmanıza yardımcı olacak nasıl yapılırlar, ipuçları ve kestirmeler.

source: &kde; Forum
tr: &kde; Forumu

source: <ulink url="https://forum.kde.org/">&kde; Community Forums</ulink>&nbsp;
tr: <ulink url="https://discuss.kde.org/">&kde; Topluluğu Forumları</ulink>&nbsp;

source: The &kde; Forums offer users, developers and people interested in &kde; a place to help each other, discuss &kde;-related topics and exchange ideas. You can find <ulink url="https://forum.kde.org/viewforum.php?f=14/">Tutorials &amp; Tips</ulink> in the forum.
tr: &kde; Forumları; &kde; ile ilgilenen kullanıcılar, geliştiriciler ve diğer kişilerin birbirlerine yardım edebileceği, &kde; ile ilgili konuları tartışıp birbirlerine düşüncelerini aktarabileceği bir yer sunar. Forumda <ulink url="https://forum.kde.org/viewforum.php?f=14/">öğreticiler ve ipuçları</ulink> bulabilirsiniz.

source: Information for developers and help to set up a &kde; development environment.
tr: Geliştiriciler için bilgiler ve &kde; geliştirme ortamı kurulumu ile ilgili yardım belgeleri.

source: &kde; Documentation
tr: &kde; Belgelendirmesi

source: <ulink url="https://docs.kde.org/">&kde; Documentation site</ulink>&nbsp;
tr: <ulink url="https://docs.kde.org/">&kde; Belgelendirmesi</ulink>&nbsp;

source: This page holds the complete &kde; User Documentation in over 25 languages for the released and the development version of &kde-frameworks;, &plasma-workspaces; and &applications;.
tr: Bu sayfa; &kde-frameworks;, &plasma-workspaces; ve &applications; kararlı ve geliştirme yayımları için tüm &kde; kullanıcı belgelendirmesini 25’ten fazla dilde sunar.
