Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/partitionmanager_copyhowto.po
Languages: tr

source: How-To: Copying a Partition
tr: Nasıl Yapılır: Bölüntü Kopyalama

source: This how-to describes copying a partition. We will assume the intention is to copy a partition from one device to another and overwriting an existing target partition, but the general procedure would not be much different when copying to the same device or to some unallocated area.
tr: Bu nasıl yapılır, bir bölüntüyü kopyalamayı açıklar. Amacın bir bölüntüyü bir aygıttan diğerine kopyalamak ve var olan bir hedef bölüntünün üzerine yazmak olduğunu varsayacağız; ancak aynı aygıta veya ayrılmamış bir alana kopyalarken genel prosedür çok farklı olmayacaktır.

source: The following screenshot shows how the source device looks like:
tr: Aşağıdaki ekran görüntüsü, kaynak aygıtın nasıl göründüğünü gösterir:

source: Main window with source device
tr: Kaynak aygıt ile ana pencere

source: The source partition in our example will be <quote>sdb1</quote> which is currently mounted, indicated by the lock-icon next to the mount point name in the screen shot. A mounted partition can not be copied, thus you first need to unmount it: Click on it then select <xref linkend="menu-partition-mount"/>.
tr: Örneğimizdeki kaynak bölüntü, ekran görüntüsünde bağlama noktası adının yanındaki kilit simgesiyle gösterilen, şu anda takılı olan <quote>sdb1</quote> olacaktır. Bağlanan bir bölüntü kopyalanamaz, bu nedenle önce onun bağlantısını kesmeniz gerekir: Üzerine tıklayın ve ardından <xref linkend="menu-partition-mount"/> ögesini seçin.

source: After unmounting the partition the lock icon has gone and it is now possible to select <xref linkend="menu-partition-copy"/>. This puts <quote>sdb1</quote> in &partman;'s clipboard; in other words: <quote>sdb1</quote> is now the partition that will be inserted when you select <xref linkend="menu-partition-paste"/>.
tr: Bölüntü bağlantısını kestikten sonra kilit simgesi kayboldu ve artık <xref linkend="menu-partition-copy"/> ögesini seçmek olanaklı. Bu, <quote>sdb1</quote> ögesini &partman; uygulamasının panosuna yerleştirir; başka bir deyişle: <quote>sdb1</quote> artık <xref linkend="menu-partition-paste"/> seçtiğinizde eklenecek olan bölüntüdür.

source: The destination device for copying in this how-to is <quote>/dev/sdc</quote>. Click on it in the Devices panel. This is how the device looks like before copying:
tr: Bu nasıl yapılır belgesinde kopyalama için hedef aygıt <quote>/dev/sdc</quote> şeklindedir. Aygıtlar panelinde üzerine tıklayın. Kopyalamadan önce aygıt şu şekilde görünür:

source: Main window with destination device before copying
tr: Kopyalamadan önce hedef aygıtı içeren ana pencere

source: The partition to overwrite is <quote>sdc5</quote>. To paste the copied partition into it, click on it and select <xref linkend="menu-partition-paste"/>. You will see the operation to copy the partition has been added to the list of pending operations. Note that there is no dialog box required to insert the partition as would be the case if you pasted into an unallocated area: Beginning and end of the pasted partition are determined by the overwritten partition.
tr: Üzerine yazılacak bölüntü <quote>sdc5</quote> biçimindedir. Kopyalanan bölüntüyü içine yapıştırmak için üzerine tıklayın ve <xref linkend="menu-partition-paste"/> ögesini seçin. Bölüntüyü kopyalama işleminin bekleyen işlemler listesine eklendiğini göreceksiniz. Ayrılmamış bir alana yapıştırdığınızda olduğu gibi, bölüntüyü eklemek için gerekli bir iletişim kutusu olmadığını unutmayın: Yapıştırılan bölüntünün başlangıcı ve sonu, üzerine yazılan bölüntü tarafından belirlenir.

source: Now select <xref linkend="menu-edit-apply"/> and the partition will be copied. See the <link linkend="howto-resizepartition">how-to on resizing partitions</link> for details about applying operations.
tr: Şimdi <xref linkend="menu-edit-apply"/> ögesini seçin, bölüntü kopyalanacaktır. İşlemleri uygulamayla ilgili ayrıntılar için <link linkend="howto-resizepartition">bölüntüleri yeniden boyutlandırma hakkında nasıl yapılır</link> konusuna bakın.
