Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/partitionmanager_glossary.po
Languages: tr

source: Command
tr: Komut

source: In &partman; commands are what <link linkend="glossary-job">jobs</link> are made up of. These are very low level steps being taken, often executed by an external tool, and only visible in the detailed progress report.
tr: &partman; uygulamasında, komutlar, <link linkend="glossary-job">işler</link> tarafından yapılan şeylerdir. Bunlar atılan çok düşük düzeyli adımlardır, genellikle dış bir araç tarafından yürütülür ve yalnızca ayrıntılı ilerleme raporunda görünür.

source: The user normally does not have to bother with commands at all.
tr: Kullanıcı normalde komutlarla hiç uğraşmak zorunda değildir.

source: Cylinder
tr: Silindir

source: A unit used to divide up a <link linkend="glossary-device">device</link>. Some operating systems and many disk tools require <link linkend="glossary-partition">partitions</link> to begin and end on a cylinder. &partman; therefore automatically snaps partitions to cylinder boundaries when changing their start or end.
tr: Bir birim, <link linkend="glossary-device">bir aygıtı</link> bölmek için kullanılır. Bazı işletim sistemleri ve birçok disk aracı, bir silindirde başlayıp bitmek için <link linkend="glossary-partition">bölüntülere</link> gereksinim duyar. &partman; bu nedenle, başlangıç veya bitişlerini değiştirirken bölüntüleri otomatik olarak silindir sınırlarına yaslar.

source: Cylinder Size
tr: Silindir Boyutu

source: The number of <link linkend="glossary-sector">sectors</link> per <link linkend="glossary-cylinder">cylinder</link> on a <link linkend="glossary-device">device</link>. Calculated as the number of <link linkend="glossary-head">heads</link> multiplied by the number of <link linkend="glossary-sector">sectors</link> per track.
tr: <link linkend="glossary-device">Aygıt </link> üzerinde <link linkend="glossary-cylinder">silindir</link> başına düşen <link linkend="glossary-sector">dilimlerin</link> numarası. İz başına <link linkend="glossary-sector">dilim</link> numaraları tarafından çarpılan <link linkend="glossary-head">kafa</link> numaraları olarak hesaplanmıştır.

source: Device
tr: Aygıt

source: A physical disk device. Physical disk devices are divided into logical sections called <link linkend="glossary-partition">partitions</link> with the use of <link linkend="glossary-partitiontable">partition tables</link>.
tr: Fiziksel disk aygıtı. Fiziksel disk aygıtları, <link linkend="glossary-partitiontable">bölüntü tabloları</link> kullanımı ile <link linkend="glossary-partition">bölüntüler</link> olarak adlandırılan mantıksal bölümlere ayrılmıştır.

source: Disk Label
tr: Disk Etiketi

source: Another name for a <link linkend="glossary-partitiontable">partition table</link> stemming from the SUN/BSD world.
tr: SUN/BSD dünyasından kaynaklanan bir <link linkend="glossary-partitiontable">bölüntü tablosu</link> için başka bir ad.

source: They are easy to mix up, but a disk label has nothing to do with a <link linkend="glossary-filesystemlabel">file system label</link>.
tr: Karıştırması kolaydır; ancak bir disk etiketinin <link linkend="glossary-filesystemlabel">dosya sistemi etiketi</link> ile hiçbir ilgisi yoktur.

source: See <ulink url="http://en.wikipedia.org/wiki/BSD_disklabel">this Wikipedia entry</ulink> for details on the name.
tr: Adla ilgili ayrıntılar için <ulink url="http://en.wikipedia.org/wiki/BSD_disklabel">bu Wikipedia girdisine</ulink> bakın.

source: Extended Partition
tr: Genişletilmiş Bölüntü

source: A <link linkend="glossary-partition">partition</link> that contains other partitions. Extended partitions can only be <link linkend="glossary-primarypartition">primary partitions</link> themselves. Whether extended partitions are available or not depends on the <link linkend="glossary-partitiontable">partition table</link> type used. MS-DOS partition tables allow one extended partition per <link linkend="glossary-device">device</link>.
tr: Diğer bölüntüleri içeren bir <link linkend="glossary-partition">bölüntü</link>. Genişletilmiş bölüntüler yalnızca kendilerine <link linkend="glossary-primarypartition">birincil bölüntüler</link> olabilirler. Genişletilmiş bölüntülerin var olup olmaması, kullanılan <link linkend="glossary-partitiontable">bölüntü tablosu</link> türüne bağlıdır. MS-DOS bölüntü tabloları her <link linkend="glossary-device">aygıt</link> başına bir genişletilmiş bölüntü sağlar.

source: File System
tr: Dosya Sistemi

source: A file system defines how the storage of data (files with their metadata, folders and their metadata, free space) is organized within a <link linkend="glossary-partition">partition</link>. There are various different types of file systems, some coming originally from the Unix/Linux world, some not. Examples for commonly used file systems on Unix/Linux are Btrfs, ext4 and XFS.
tr: Bir dosya sistemi, verilerin (üst verilerle dosyalar, klasörler ve üst veriyi, boş alan) bir <link linkend="glossary-partition">bölüntü</link> içinde nasıl düzenlendiğini tanımlar. Bazıları özgün olarak Unix/Linux dünyasından gelen, bazıları olmayan çeşitli dosya sistemi türleri vardır. Unix/Linux’ta yaygın olarak kullanılan dosya sistemlerine örnek olarak Btrfs, ext4 ve XFS verilebilir.

source: File System Label
tr: Dosya Sistem Etiketi

source: A title of a file system. Some file systems (among them Btrfs, ext2/3/4, FAT16/32 and NTFS) support setting a label for the file system so it can be identified in tools like &partman; or other applications.
tr: Bir dosya sisteminin başlığı. Bazı dosya sistemleri (aralarında Btrfs, ext2/3/4, FAT16/32 ve NTFS), &partman; gibi veya diğer uygulamalarda tanımlanabilmesi için dosya sistemi için bir etiket belirlemeyi destekler.

source: They are easy to mix up, but a file system label has nothing to do with a <link linkend="glossary-disklabel">disk label</link>.
tr: Karıştırması kolaydır; ancak bir dosya sistemi etiketinin <link linkend="glossary-disklabel">disk etiketi</link> ile hiçbir ilgisi yoktur.

source: Flag
tr: Bayrak

source: A modern partition table format supported by most modern computers and operating systems. It supports more than 4 <link linkend="glossary-primarypartition">primary partitions</link> unlike older MS-DOS partition table.
tr: Çoğu çağdaş bilgisayar ve işletim sistemi tarafından desteklenen çağdaş bir bölüntü tablosu biçimi. Eski MS-DOS bölüntü tablosunun aksine 4’ten fazla <link linkend="glossary-primarypartition">birincil bölüntüyü</link> destekler.

source: Head
tr: Kafa

source: A unit used to divide up a <link linkend="glossary-device">device</link>.
tr: Bir <link linkend="glossary-device">aygıtı</link> bölmek için kullanılan birim.

source: <glossterm>Job</glossterm>
tr: <glossterm>İş</glossterm>

source: In &partman; a number of jobs is what <link linkend="glossary-operation">operations</link> are made up of. You normally do not have to bother with jobs at all; it only becomes apparent when applying the list of pending operations: &partman; will then show a progress dialog that is made up of all operations and their jobs and show which operation and which job is currently being executed.
tr: &partman; uygulamasında,<link linkend="glossary-operation">işlemler</link> birkaç işten oluşur. Normalde işlerle hiç uğraşmanıza gerek yoktur; yalnızca bekleyen işlemler listesi uygulanırken görünür hale gelir: &partman; daha sonra tüm işlemlerden ve bunların işlerinden oluşan bir ilerleme iletişim kutusu gösterecek ve şu anda hangi işlemin ve hangi işin yürütülmekte olduğunu gösterecektir.

source: Label
tr: Etiket

source: Either a <link linkend="glossary-disklabel">disk label</link> or a <link linkend="glossary-filesystemlabel">file system label</link>.
tr: Bir <link linkend="glossary-disklabel">disk etiketi</link> veya bir <link linkend="glossary-filesystemlabel">dosya sistemi etiketi</link>.

source: Logical Partition
tr: Mantıksal Bölüntü

source: A <link linkend="glossary-partition">partition</link> inside an <link linkend="glossary-extendedpartition">extended partition</link>.
tr: Bir <link linkend="glossary-partition">genişletilmiş bölüntü</link> içindeki bir <link linkend="glossary-partition">bölüntü</link>.

source: Linux Unified Key Setup is the standard encryption format for Linux.
tr: Linux Unified Key Setup, Linux için standart şifreleme biçimidir.

source: LVM is a system for managing logical partitions that is more flexible than normal partitions. It consists of three main components:
tr: LVM, normal bölüntülerden daha esnek olan mantıksal bölüntüleri yönetmek için bir sistemdir. Üç ana bileşenden oluşur:

source: LVM physical volumes are partitions on the disk whose space is managed by LVM.
tr: LVM fiziksel disk bölümleri, alanı LVM tarafından yönetilen diskteki bölüntülerdir.

source: LVM volume group is a collection of LVM physical volumes that can be partitioned into logical partitions. It might be used to create file systems spanning over multiple devices or to split encrypted <link linkend="glossary-luks">LUKS</link> volume into smaller partitions.
tr: LVM disk bölümü grubu, mantıksal bölüntülere ayrılabilen bir LVM fiziksel disk bölümleri koleksiyonudur. Birden fazla aygıta yayılan dosya sistemleri oluşturmak veya şifrelenmiş <link linkend="glossary-luks">LUKS</link> birimini daha küçük bölüntülere ayırmak için kullanılabilir.

source: LVM logical volumes are similar to normal partitions except that they reside on LVM volume group. Also, the location of LVM logical partitions does not matter and they do not have to be physically contiguous. Therefore, &partman; does not allow to move LVM logical volumes and displays the remaining free space at the end of the device.
tr: LVM mantıksal disk bölümleri, LVM disk bölümü grubunda bulunmaları dışında normal bölüntülere benzer. Ayrıca, LVM mantıksal bölüntülerinin konumu önemli değildir ve fiziksel olarak bitişik olmaları gerekmez. Bu nedenle &partman; LVM mantıksal disk bölümlerinin taşınmasına izin vermez ve aygıtın sonunda kalan boş alanı görüntüler.

source: Operation
tr: İşlem

source: &partman; divides the work it does into operations, <link linkend="glossary-job">jobs</link> and <link linkend="glossary-command">commands</link>.
tr: &partman;, işini işlemlere, <link linkend="glossary-job">işlere</link> ve <link linkend="glossary-command">komutlara</link> ayırır.

source: Operations are the most visible of the three. If you pick an action in the graphical user interface, this will likely result in a new operation being added to the list of pending operations. The idea behind that is: You will most probably want to set up quite a number of steps to transform the current state of your disk devices to the state you have in mind. Some of these steps may take quite a long time to execute (like copying a large file system or resizing a file system that is nearly full). To save you from having to sit in front of your computer for a long time waiting for one step to finish and then starting the next one, operations allow you to exactly specify how the computer's devices should look like once everything is finished, then let &partman; apply the operations and come back when it has executed all of them.
tr: İşlemler, üçü arasında en görünür olanıdır. Grafik kullanıcı arabiriminde bir eylem seçerseniz bu büyük olasılıkla bekleyen işlemler listesine yeni bir işlemin eklenmesiyle sonuçlanacaktır. Bunun arkasındaki fikir şudur: Büyük olasılıkla, disk aygıtlarınızın geçerli durumunu aklınızdaki duruma dönüştürmek için epeyce adım ayarlamak isteyeceksiniz. Bu adımlardan bazılarının yürütülmesi oldukça uzun zaman alabilir (büyük bir dosya sistemini kopyalamak veya neredeyse dolu olan bir dosya sistemini yeniden boyutlandırmak gibi). Sizi uzun süre bilgisayarınızın başında oturup bir adımın bitmesini bekleyip bir sonraki adıma geçmek zorunda kalmaktan kurtarmak için işlemler, her şey bittiğinde bilgisayarın aygıtlarının nasıl görüneceğini tam olarak belirlemenize olanak tanır, ardından &partman; uygulamasının işlemleri uygulamasına izin verin ; işlemleri uygulayın ve hepsini yürüttüğünde geri gelin.

source: Operations are kept in a list of pending operations. As long as an operation has not been applied it can still be <link linkend="menu-edit-undo">taken back easily</link> and nothing will have been modified.
tr: İşlemler, bekleyen işlemler listesinde tutulur. Bir işlem uygulanmadığı sürece <link linkend="menu-edit-undo">kolaylıkla geri alınabilir</link> ve hiçbir şey değiştirilmemiş olur.

source: Partition
tr: Bölüntü

source: A section of a <link linkend="glossary-device">hard disk device</link> that can hold a <link linkend="glossary-filesystem">file system</link> or other partitions. Without at least one valid partition, a disk can not be used.
tr: Bir <link linkend="glossary-device">sabit disk aygıtının</link> bir <link linkend="glossary-filesystem">dosya sistemini</link> veya diğer bölüntüleri tutabilen bölümü. En az bir geçerli bölüntü olmadan disk kullanılamaz.

source: Partition Flag
tr: Bölüntü Bayrağı

source: A marker for a <link linkend="glossary-partition">partition</link>. The availability of these flags depends on the type of <link linkend="glossary-partitiontable">partition table</link> used.
tr: Bir <link linkend="glossary-partition">bölüntü</link> için imleyici. Bu bayrakların kullanılabilirliği, kullanılan <link linkend="glossary-partitiontable">bölüntü tablosu</link> türüne bağlıdır.

source: Partition Table
tr: Bölüntü Tablosu

source: A small section at the beginning of a <link linkend="glossary-device">device</link> used to store information about the layout of the device's <link linkend="glossary-partition">partitions</link>. There are different types of partition tables, each with their own limitations.
tr: Bir <link linkend="glossary-device">aygıtın</link> başındaki küçük bir bölüm, aygıtın <link linkend="glossary-partition">bölüntülerinin</link> yerleşimi hakkında bilgi depolamak için kullanılır. Her biri kendi sınırlamalarına sahip farklı türde bölüntü tabloları vardır.

source: Sometimes also referred to as <quote>disk label</quote>.
tr: Bazen de <quote>disk etiketi</quote> olarak söz edilir.

source: Primary Partition
tr: Birincil Bölüntü

source: A <link linkend="glossary-partition">partition</link> directly inside a <link linkend="glossary-partitiontable">partition table</link>, as opposed to <link linkend="glossary-logicalpartition">logical partitions</link>, which are in <link linkend="glossary-extendedpartition">extended partitions</link>.
tr: <link linkend="glossary-extendedpartition">Genişletilmiş bölüntülerde</link> <link linkend="glossary-logicalpartition">mantıksal bölüntülerin</link> aksine bir <link linkend="glossary-partitiontable">bölüntü tablosu</link> içinde doğrudan bir <link linkend="glossary-partition">bölüntü</link>dür.

source: <link linkend="glossary-partitiontable">Partition tables</link> usually impose restrictions on the maximum number of primary partitions that can be created on a <link linkend="glossary-device">device</link>. For MS-DOS type partition tables, for example, this maximum number is four.
tr: <link linkend="glossary-partitiontable">Bölüntü tabloları</link> genellikle bir <link linkend="glossary-device">aygıt</link> üzerinde oluşturulabilen birincil bölüntülerde en çok sayıda kısıtlamaları dayatır. MS-DOS bölüntüsü tablo türleri için; örneğin, en büyük sayı 4’tür.

source: Sector
tr: Dilim

source: A unit used to divide up a <link linkend="glossary-device">device</link>. <link linkend="glossary-partition">Partitions</link> must always begin and end on a sector.
tr: Bir <link linkend="glossary-device">aygıtı</link> bölmek için kullanılan birim. <link linkend="glossary-partition">Bölüntüler</link>, her zaman bir dilimde başlamalı ve bitmelidir.

source: Sector Size
tr: Dilim Boyutu

source: The number of bytes per <link linkend="glossary-sector">sector</link> on a <link linkend="glossary-device">device</link>. The sector size of most devices in use today is 512 bytes.
tr: Bir <link linkend="glossary-device">aygıt</link> üzerindeki <link linkend="glossary-sector">dilim</link> başına bayt sayısı. Günümüzde kullanılan çoğu aygıtın dilim boyutu 512 bayttır.
