Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/partitionmanager_installoshowto.po
Languages: tr

source: How-To: Installing a New Operating System
tr: Nasıl Yapılır: Yeni Bir İşletim Sistemi Kurulumu

source: This how-to describes the preparation of a new hard disk device for an OS installation: Suppose you bought a new hard disk and now intend to use it as a replacement for the old one that currently holds your OS and data partitions. You would also like to take this opportunity to install a new operating system. Several steps will have to be taken to make the transition from the old to the new system and drive.
tr: Bu nasıl yapılır belgesi, bir işletim sistemi kurulumu için yeni bir sabit disk aygıtının hazırlanmasını açıklar: Yeni bir sabit disk satın aldığınızı ve şimdi bunu, işletim sisteminizi ve veri bölüntülerinizi tutan eski sabit diskin yerine kullanmak istediğinizi varsayalım. Bu fırsatı yeni bir işletim sistemi kurmak için de kullanmak istersiniz. Eski sistemden yeni sisteme ve sürücüye geçiş yapmak için birkaç adım atılması gerekecektir.

source: In the following, <quote>/dev/sdb</quote> is the old hard disk and <quote>/dev/sdc</quote> is the new one. This screenshot shows the situation on the source device:
tr: Aşağıda, <quote>/dev/sdb</quote> eski sabit disk ve <quote>/dev/sdc</quote> yeni sabit disktir. Bu ekran görüntüsü, kaynak aygıttaki durumu gösterir:

source: Main window with source device
tr: Kaynak aygıt ile ana pencere

source: The new device will look like this. Note that it doesn't yet have valid partition table, thus the first step to take is to create one by selecting <xref linkend="menu-device-createpartitiontable"/>:
tr: Yeni aygıt böyle görünecek. Henüz geçerli bir bölüntüleme tablosu olmadığını unutmayın, bu nedenle atılacak ilk adım <xref linkend="menu-device-createpartitiontable"/> ögesini seçerek bir tane oluşturmaktır:

source: Main window with destination device
tr: Hedef aygıt ile birlikte ana pencere

source: After confirming the warning dialog you can begin creating partitions on the new device by clicking the extended partition and selecting <xref linkend="menu-partition-new"/>. Begin with an extended partition at the end of the device to later hold the home and swap partitions:
tr: Uyarı iletişim kutusunu onayladıktan sonra, genişletilmiş bölüntüye tıklayıp <xref linkend="menu-partition-new"/> ögesini seçerek yeni aygıtta bölüntüler oluşturmaya başlayabilirsiniz. Daha sonra home ve diğer bölüntülerideğiştirmek için aygıtın sonunda genişletilmiş bir bölüntüyle başlayın:

source: Creating an extended partition
tr: Genişletilmiş bir bölüntü oluşturma

source: Click <guibutton>OK</guibutton> and the operation to create this extended partition is added to the list.
tr: <guibutton>Tamam</guibutton>’a tıklayın ve bu genişletilmiş bölüntüyü oluşturma işlemi listeye eklenir.

source: Now create a primary partition on the rest of the device where the new OS will be installed. Make it as large as the unallocated area in front of the extended partition:
tr: Şimdi, aygıtın geri kalanında yeni işletim sisteminin kurulacağı bir birincil bölüntü oluşturun. Genişletilmiş bölüntünün önündeki ayrılmamış alan kadar büyük yapın:

source: Creating a primary partition
tr: Bir birincil bölüntü oluşturma

source: Click <guibutton>OK</guibutton> in the dialog to accept your choice. The operation to create the new primary partition is then added to the operation list.
tr: Seçiminizi kabul etmek için iletişim kutusunda <guibutton>Tamam</guibutton>’a tıklayın. Yeni birincil bölüntüyü oluşturma işlemi daha sonra işlem listesine eklenir.

source: Now it is time to copy the home partition from the old device to the extended partition on the new device. Select the old device in the Device List panel, click on partition <quote>sdb5</quote> and pick <xref linkend="menu-partition-copy"/>.
tr: Şimdi eski aygıttaki home bölüntüsünü yeni aygıttaki genişletilmiş bölüntüye kopyalamanın zamanı geldi. Aygıt Listesi panelinde eski aygıtı seçin, <quote>sdb5</quote> bölüntüsüne tıklayın ve <xref linkend="menu-partition-copy"/> ögesini seçin.

source: Then go back to the new device and click the extended partition. Select <xref linkend="menu-partition-paste"/>. The following dialog will come up:
tr: Ardından yeni aygıta geri dönün ve genişletilmiş bölüntüye tıklayın. <xref linkend="menu-partition-paste"/> ögesini seçin. Aşağıdaki iletişim kutusu gelecektir:

source: Pasting the home partition
tr: Bir home bölüntüsünü yapıştırmak

source: This already looks mostly okay but you already know that you will not need that much free space after the home partition because you will later create a swap partition there.
tr: Bu zaten çoğunlukla iyi görünüyor; ancak daha sonra orada bir takas bölüntüsü oluşturacağınız için home bölüntüsünden sonra o kadar boş alana gereksiniminiz olmayacağını zaten biliyorsunuz.

source: So grab the right resize handle in the dialog's resizer widget and move it to the right until the free space after the pasted partition has a size more suitable for a swap partition:
tr: Bu nedenle, iletişim kutusunun yeniden boyutlandırma araç takımında doğru yeniden boyutlandırma tutacını alın ve yapıştırılan bölüntüden sonraki boş alan, bir takas bölüntüsü için daha uygun bir boyuta sahip olana kadar sağa hareket ettirin:

source: Resizing a pasted partition
tr: Yapıştırılan bir bölüntüyü yeniden boyutlandırma

source: This looks fine. Click <guibutton>OK</guibutton> to accept and close the dialog. A new operation to paste the copied partition to the extended partition on <quote>sdc</quote> is added to the operation list. Note that this operation will also set the new size.
tr: Bu iyi görünüyor. İletişim kutusunu kabul etmek ve kapatmak için <guibutton>Tamam</guibutton>’a tıklayın. Kopyalanan bölüntüyü <quote>sdc</quote> üzerindeki genişletilmiş bölüntüye yapıştırmak için yeni bir işlem, işlem listesine eklenir. Bu işlemin yeni boyutu da belirleyeceğini unutmayın.

source: Finally you will want to create a new swap partition at the end of the extended partition on <quote>sdc</quote>. There is no need to copy the existing swap partition from <quote>sdb</quote> because swap does not hold any permanent information worth keeping. Simply create a new partition with type linuxswap that fills the whole of the unallocated area after the new home partition.
tr: Son olarak, <quote>sdc</quote> üzerindeki genişletilmiş bölüntünün sonunda yeni bir takas bölüntüsü oluşturmak isteyeceksiniz. Var olan takas bölüntüsünü <quote>sdb</quote>’den kopyalamaya gerek yoktur; çünkü takas, saklamaya değer herhangi bir kalıcı bilgi tutmaz. Yeni home bölüntüsünden sonra ayrılmamış alanın tamamını dolduran linuxswap türünde yeni bir bölüntü oluşturmanız yeterlidir.

source: The main window with all operations and the preview of how <quote>sdc</quote> will look like once they are applied now looks like this:
tr: Tüm işlemleri içeren ana pencere ve <quote>sdc</quote>’nin uygulandıktan sonra nasıl görüneceğinin önizlemesi artık şuna benzer:

source: Main window after setting up all operations
tr: Tüm işlemleri ayarladıktan sonra ana pencere

source: This looks great so select <xref linkend="menu-edit-apply"/>, confirm the warning dialog and wait until the operations have all been executed. For details on executing operations see <link linkend="howto-resizepartition">the how-to on resizing partitions</link>.
tr: Bu harika görünüyor, bu nedenle <xref linkend="menu-edit-apply"/> ögesini seçin, uyarı iletişim kutusunu onaylayın ve işlemlerin tümü yürütülene kadar bekleyin. Yürütme işlemleriyle ilgili ayrıntılar için <link linkend="howto-resizepartition">bölüntüleri yeniden boyutlandırma hakkında nasıl yapılır</link>’a bakın.

source: Your new hard disk device is now ready for the installation of your new operating system.
tr: Yeni sabit disk aygıtınız artık yeni işletim sisteminizin kurulumu için hazırdır.
