Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/partitionmanager_referencemanual.po
Languages: tr

source: <action>Shows the file system support dialog.</action> This dialog shows in detail which operations can be performed for which of the supported file systems.
tr: <action>Dosya sistemi desteği iletişim kutusunu gösterir.</action> Bu iletişim kutusu, desteklenen dosya sistemlerinden hangileri için hangi işlemlerin gerçekleştirilebileceğini ayrıntılı olarak gösterir.

source: Here is an example how the dialog might look like with most external tools installed:
tr: Çoğu dış araç kuruluyken iletişim kutusunun nasıl görünebileceğine bir örnek:

source: File system support dialog with most external tools installed
tr: Çoğu dış aracın yüklü olduğu dosya sistemi desteği iletişim kutusu

source: The blue check marks mean <quote>supported</quote>, the red crosses mean <quote>not supported</quote>. Some combinations are never supported, for example checking a linuxswap file system, because they are inherently impossible. Others cannot be supported because the external tools lack the functionality.
tr: Mavi onay işaretleri <quote>destekleniyor</quote>, kırmızı çarpılar <quote>desteklenmiyor</quote> anlamına gelir. Bazı kombinasyonlar, örneğin bir linuxswap dosya sisteminin denetlenmesi gibi, hiçbir zaman desteklenmez; çünkü bunlar doğası gereği olanaksızdır. Diğerleri, dış araçlar işlevsellikten yoksun olduğu için desteklenemez.

source: If you have installed new tools while &partman; is running click on <guibutton>Rescan Support</guibutton> to force a recheck of installed file system support tools.
tr: &partman; çalışırken kurulu dosya sistemi destek araçlarını yeniden denetlemeye zorlamak için <guibutton>Desteği Yeniden Tara</guibutton> seçeneğine tıklayın.

source: The Settings and Help Menu
tr: Ayarlar ve Yardım Menüsü

source: &partman; has the common &kde; <ulink url="help:/fundamentals/menus.html#menus-settings">Settings</ulink> and <ulink url="help:/fundamentals/menus.html#menus-help">Help</ulink> menu described in the &kde; Fundamentals with an additional submenu <guisubmenu>Panels Shown</guisubmenu>, where you can toggle the display of the <guimenuitem>Devices</guimenuitem>, <guimenuitem>Pending Operations</guimenuitem>, <guimenuitem>Information</guimenuitem> and panels <guimenuitem>Log Output</guimenuitem> on and off.
tr: &partman;, &kde; Temelleri içinde açıklanan &kde; <ulink url="help:/fundamentals/menus.html#menus-settings">Ayarlar</ulink> ve <ulink url="help:/fundamentals/menus.html#menus-help">Yardım</ulink> menüsüne ve ek olarak <guimenuitem>Aygıtlar</guimenuitem>, <guimenuitem>Bekleyen İşlemler</guimenuitem>, <guimenuitem>Bilgi</guimenuitem> ve <guimenuitem>Günlük Çıktısı</guimenuitem> panellerinin gösterilip gösterilmeyeceğini denetleyen bir <guisubmenu>Gösterilen Paneller</guisubmenu> ek alt menüsüne sahiptir.
