Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/partitionmanager_faq.po
Languages: tr

source: Questions and Answers
tr: Sorular ve Yanıtlar

source: How dangerous is &partman; for my data?
tr: Verilerim için &partman; ne kadar zararlıdır?

source: First of all, you should never perform any destructive operations (delete, move, resize) without first making a complete backup of everything affected.
tr: Her şeyden önce, etkilenen her şeyin tam bir yedeğini almadan asla yıkıcı işlemler (silme, taşıma, yeniden boyutlandırma) yapmamalısınız.

source: Having said that, &partman; is safe to use. It performs extensive checks before and after every operation. It calls external tools written and supported by the file system authors. And it has been tested extensively.
tr: Bunu söyledikten sonra, &partman; kullanımı güvenlidir. Her operasyon öncesi ve sonrasında kapsamlı denetimler gerçekleştirir. Dosya sistemi yazarları tarafından yazılan ve desteklenen dış araçları çağırır; kapsamlı bir biçimde sınanmıştır.

source: There is always the risk of data loss due to an unknown bug. &partman;'s authors try to minimize this risk, but there are of course no guarantees.
tr: Bilinmeyen bir hata nedeniyle veri kaybı riski her zaman vardır. &partman;’nin yazarları bu riski en aza indirmeye çalışırlar; ancak elbette bunun garantisi yoktur.

source: I have installed all recommended external file system support packages and still do not get support for all operations on all file systems.
tr: Önerilen tüm dış dosya sistemi destek paketlerini kurdum ve hâlâ tüm dosya sistemlerindeki tüm işlemler için destek alamıyorum.

source: Not everything &partman; can do in principle can be done with all file systems.
tr: &partman; uygulamasının prensipte yapabileceği her şey tüm dosya sistemleriyle yapılamaz.

source: One example is performing a file system check on linuxswap: It is just not possible. There are other limitations like that inherent in some file systems. You cannot shrink JFS or XFS file systems because neither of the two supports shrinking at all, with or without &partman;.
tr: Bir örnek, linuxswap’te bir dosya sistemi denetimi yapmaktır: Bu olanaklı değildir. Bazı dosya sistemlerinde bulunan buna benzer başka sınırlamalar da vardır. JFS veya XFS dosya sistemlerini küçültemezsiniz; çünkü ikisi de &partman; ile veya başka bir uygulamayla küçültmeyi kesinlikle desteklemez.

source: Why can't I see any meaningful progress information when resizing a partition?
tr: Bir disk bölüntüsünü yeniden boyutlandırırken neden herhangi bir anlamlı ilerleme bilgisi göremiyorum?

source: &partman; can only show progress information when it knows how long the jobs in an operation will take. Unfortunately this is usually not the case when resizing partitions because the by far longest job when doing so is resizing the file system on the partition. Resizing file systems is in most cases something an external tool will do on behalf of &partman; and these external tools do not provide useful progress information to &partman;, so there's nothing to report while they are running.
tr: &partman;, yalnızca bir operasyondaki işlerin ne kadar süreceğini bildiğinde ilerleme bilgilerini gösterebilir. Ne yazık ki bu genellikle bölüntüleri yeniden boyutlandırırken geçerli değildir; çünkü bunu yaparken en uzun iş, bölüntüdeki dosya sistemini yeniden boyutlandırmaktır. Dosya sistemlerini yeniden boyutlandırmak çoğu durumda dış bir aracın &partman; adına yapacağı bir şeydir. ve bu dış araçlar &partman;’a yararlı ilerleme bilgileri sağlamaz, bu nedenle çalışırken raporlanacak hiçbir şey yoktur.

source: Why can't I resize the root partition? How can I resize the partition /home is on?
tr: Kök bölüntüyü neden yeniden boyutlandıramıyorum? /home’un bağlı olduğu bölüntüyü nasıl yeniden boyutlandırabilirim?

source: To modify a partition it must not be mounted. You can however not unmount the root partition. Neither will you be able to unmount the home partition if the home directory of the currently logged in user is on it.
tr: Bir bölüntüyü değiştirmek için bağlı olmamalıdır. Ancak, kök bölüntünün bağlantısını kaldıramazsınız. Şu anda oturum açmış olan kullanıcının ana dizini üzerindeyse ana bölüntünün bağlantısını da kaldıramazsınız.

source: The solution for this problem is to boot from a Linux Live CD that comes with &partman; and modify these partitions from there.
tr: Bu sorunun çözümü, &partman; ile birlikte gelen bir Linux Canlı CD’sinden önyükleme yapmaktır. Bu bölüntüleri oradan değiştirin.

source: I'm getting a warning message in the log output about something that a partition cannot be created with the size I requested and that it will instead be smaller. What happened?
tr: Günlük çıktısında, istediğim boyutta bir bölüntünün oluşturulamayacağına ve bunun yerine daha küçük olacağına dair bir uyarı ileti alıyorum. Ne oldu?

source: On MS-DOS partition tables, partitions have to begin and end on cylinder boundaries. This is mainly for historical reasons. &partman; will deal with this internally and try not to bother the user with that limitation.
tr: MS-DOS bölüntü tablolarında, bölüntülerin silindir sınırlarında başlaması ve bitmesi gerekir. Bu esas olarak tarihsel nedenlerden kaynaklanmaktadır. &partman;, bununla içsel olarak ilgilenecek ve kullanıcıyı bu sınırlama ile rahatsız etmemeye çalışacaktır.

source: Under rare circumstances, &partman; will however not be able to set up an operation in the way the user requested it due to this limitation. For example, if one cylinder on a device is 8 MiB large and you try to resize a partition by 6 MiB, this will not work.
tr: Nadir durumlarda, &partman;; ancak bu sınırlama nedeniyle kullanıcının istediği şekilde bir işlem ayarlayamayacaktır. Örneğin, bir aygıttaki bir silindir 8 MiB büyüklüğündeyse ve bir bölüntüyü 6 MiB olarak yeniden boyutlandırmaya çalışırsanız bu işe yaramaz.

source: You might also encounter this message if you have a device and partition table where the partitions are, for whatever reason, not correctly snapped to cylinder boundaries and you try to move or copy these partitions for the first time.
tr: Ayrıca, bölüntülerin herhangi bir nedenle silindir sınırlarına doğru şekilde oturtulmadığı bir aygıtınız ve bölüntü tablonuz varsa ve bu bölüntüleri ilk kez taşımaya veya kopyalamaya çalışıyorsanız da bu iletiyle karşılaşabilirsiniz.

source: The message itself is harmless and only exists to inform the user that something can not be done quite exactly the way the user expects. Your partitions and data will not be negatively affected in any way if you see this message.
tr: İletinin kendisi zararsızdır ve yalnızca kullanıcıya bir şeyin tam olarak kullanıcının beklediği şekilde yapılamayacağını bildirmek için vardır. Bu iletiyi görürseniz bölüntüleriniz ve verileriniz hiçbir şekilde olumsuz etkilenmeyecektir.

source: How many operations can I add to the list of pending operations?
tr: Bekleyen işlemler listesine kaç tane işlem ekleyebilirim?

source: There is no limit.
tr: Herhangi bir sınır yoktur.

source: It is however not recommended to add too many operations to the list. There is always a small chance an operation might fail with an error, in which case &partman; will stop executing operations. In that case it is a lot easier to find out what happened (and to re-add all the operations that could not be executed) if the list of pending operations was not exceedingly long.
tr: Ancak listeye çok fazla işlem eklenmesi önerilmez. Bir işlemin bir hatayla başarısız olma olasılığı her zaman vardır, bu durumda &partman; işlemleri yürütmeyi durduracaktır. Bu durumda, bekleyen işlemler listesi çok uzun değilse ne olduğunu bulmak (ve yürütülemeyen tüm işlemleri yeniden eklemek) çok daha kolaydır.

source: Resizing an ext2 or ext3 file system failed with something in the report about <quote>no space left on device</quote>. What happened? Is my data corrupted now?
tr: Bir ext2 veya ext3 dosya sistemini yeniden boyutlandırma, rapordaki <quote>aygıtta yer kalmadı</quote> ile ilgili bir şey nedeniyle başarısız oldu. Ne oldu? Verilerim şimdi bozuldu mu?

source: This is a problem of the <command>e2resize</command> command and the underlying ext2/3/4 file system. If a file system is nearly full, <command>e2resize</command> cannot make it any smaller even though that should be possible from the number of free sectors left. &partman; can unfortunately not know beforehand if <command>e2resize</command> will abort with this error for a given file system or not. If it happens, nothing will be done at all and your data will not be negatively affected.
tr: Bu, <command>e2resize</command> komutu ve temeldeki ext2/3/4 dosya sistemi sorunudur. Bir dosya sistemi neredeyse doluysa, <command>e2resize</command> onu daha fazla küçültemez; ancak bu kalan boş dilim sayısı nedeniyle olanaklı olabilir. &partman;, <command>e2resize</command> ögesinin belirli bir dosya sistemi için bu hatayla iptal edilip edilmeyeceğini ne yazık ki önceden bilemez. Olursa hiçbir şey yapılmaz ve verileriniz olumsuz etkilenmez.

source: There is no real workaround for this problem right now.
tr: Şu anda bu sorun için gerçek bir geçici çözüm yok.

source: Why can't I format my floppy disk with &partman;? Why is there no support for CD writing or DVD burning?
tr: Disketimi neden &partman; ile biçimlendiremiyorum? Neden CD yazma veya DVD yazma desteği yok?

source: None of this is what &partman; has been designed to do: It is an application that deals with partitions and the file systems on these partitions. Floppy disks, CDs or DVDs do not need or use partitions.
tr: Bunların hiçbiri, &partman; ile yapılmak için tasarlanmıştır: Bölüntüler ve bu bölüntülerdeki dosya sistemleri ile ilgilenen bir uygulamadır. Disketler, CD’ler veya DVD’ler bölüntülere gereksinim duymaz veya bunları kullanmaz.

source: Why can't I modify partitions on a device with an amiga or bsd partition table?
tr: Neden bir Amiga veya BSD bölüntüleme tablosu olan bir aygıttaki disk bölüntülerini değiştiremiyorum?

source: &partman; currently only allows read-only access to any other partition table type than MS-DOS. This is for safety reasons: Support in &partman; for this partition table types is not really there and what is there (or just incidentally works) has not been tested enough to use it with confidence.
tr: &partman;, şu anda yalnızca MS-DOS dışındaki herhangi bir bölüntü tablosu türüne saltokunur erişime izin vermektedir. Bu, güvenlik nedeniyledir: &partman;, bu bölüntü tablosu türleri için destek henüz yoktur ve olanlar da (veya tesadüfen çalışanlar) onu güvenli bir biçimde kullanmak için yeterince sınanmamıştır.

source: Of course you can still create a new MS-DOS partition table on the device in question, but that is probably not what you want.
tr: Tabii ki yine de söz konusu aygıtta yeni bir MS-DOS bölüntüleme tablosu oluşturabilirsiniz; ancak büyük olasılıkla istediğiniz bu değildir.

source: On startup, &partman; hangs for a couple of minutes while it apparently tries to scan the floppy drive on my computer.
tr: Başlangıçta &partman;, görünüşe göre bilgisayarımdaki disket sürücüsünü taramaya çalışırken birkaç dakika takılıyor.

source: This happens if you have a floppy drive configured in your computer's BIOS settings but have not actually connected one. If you do not have a floppy drive check your BIOS settings and disable any floppy drives configured there to see if this makes the problem go away.
tr: Bu, bilgisayarınızın BIOS ayarlarında yapılandırılmış bir disket sürücünüz varsa; ancak gerçekte bir tane bağlamadıysanız olur. Bir disket sürücünüz yoksa BIOS ayarlarınızı denetleyin ve sorunun çözülüp çözülmediğini görmek için burada yapılandırılmış tüm disket sürücülerini devre dışı bırakın.

source: During startup, &partman; prints some message about probing devices and that it might even crash or at least take a long time.
tr: Başlatma sırasında &partman;, sonda aygıtları ve hatta çökebileceği veya en azından uzun zaman alabileceği hakkında bazı iletiler yazdırıyor.

source: LibParted, a backend library &partman; uses, has problems with systems where the Linux Device Mapper is used in a way it doesn't understand. Unfortunately it reacts to some of these situations with segmentation faults, i.e. crashes. &partman; therefore tries to avoid these situations by using an alternative way to scan your computer for disks. If it cannot do that, however, and therefore has to rely on LibParted, it will print a message like the one mentioned. If the scanning for disks works, you can safely disregard the message.
tr: &partman; uygulamasının kullandığı bir arka uç kitaplığı olan LibParted, Linux Aygıt Eşleyicisi’nin anlamadığı bir şekilde kullanıldığı sistemlerde sorun yaşar. Ne yazık ki bu durumların bazılarına bölütleme hatalarıyla, yani çökmelerle tepki verir. &partman; bu nedenle, bilgisayarınızı diskler için taramanın alternatif bir yolunu kullanarak bu durumlardan kaçınmaya çalışır. Ancak bunu yapamıyorsa ve bu nedenle LibParted’a güvenmek zorundaysa belirtilene benzer bir ileti yazdıracaktır. Disk taraması çalışırsa iletiyi güvenle göz ardı edebilirsiniz.
