Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/partitionmanager_referencemanual.po
Languages: tr

source: Command Reference
tr: Komut Başvurusu

source: Overview
tr: Genel Görünüm

source: This chapter gives detailed explanations of all commands available in &partman;. It is intended as a reference to accompany the information given in <xref linkend="usermanual"/>.
tr: Bu fasıl ;&partman;’de bulunan tüm komutların ayrıntılı açıklamalarını verir. Bu, verilen <xref linkend="usermanual"/> için eşlik edecek bir başvuru olarak tasarlanmıştır.

source: The File Menu
tr: Dosya Menüsü

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Dosya</guimenu> <guimenuitem>Çık</guimenuitem>

source: <action>Quits &partman;</action> without applying any pending operations. The application will however ask you to confirm your choice to quit if there are pending operations.
tr: Bekleyen işlemleri uygulamadan <action>&partman; uygulamasından çıkar</action>. Uygulama, bekleyen işlemleriniz varsa sizden yine de onay isteyecektir.

source: The Edit Menu
tr: Düzen Menüsü

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Düzen</guimenu> <guimenuitem>Geri Al</guimenuitem>

source: <action>Undoes the last operation</action> that has been added to the operation stack.
tr: İşlem yığınına eklenen <action>son işlemi geri alır</action>.

source: This command is only enabled if the list of operations is not empty.
tr: Bu komut, yalnızca işlem listesi boş değilse etkindir.

source: <guimenu>Edit</guimenu> <guimenuitem>Clear</guimenuitem>
tr: <guimenu>Düzen</guimenu> <guimenuitem>Temizle</guimenuitem>

source: <action>Clears the list of operations</action> without applying any of them.
tr: Herhangi bir işlemi uygulamadan <action>işlem listesini temizler</action>.

source: <guimenu>Edit</guimenu> <guimenuitem>Apply</guimenuitem>
tr: <guimenu>Düzen</guimenu> <guimenuitem>Uygula</guimenuitem>

source: <action>Applies the list of operations</action>. This command will apply all operations in the list so that all changes are permanently written to your disks. After the operations have been applied, the list is cleared and there will be no way to undo any operation.
tr: <action>İşlemlerin listesini uygular</action>. Bu komut, listedeki tüm işlemleri uygular ve böylece listedeki tüm değişiklikler kalıcı olarak diskinize kaydedilir. İşlemler uygulandıktan sonra liste temizlenir ve işlemi geri almanız için bir yol yoktur.

source: The Device Menu
tr: Aygıt Menüsü

source: <guimenu>Device</guimenu> <guimenuitem>Select Current Device</guimenuitem>
tr: <guimenu>Aygıt</guimenu> <guimenuitem>Geçerli Aygıtı Seç</guimenuitem>

source: Allows you to select a device from a submenu with all available devices of the system.
tr: Sistemin tüm kullanılabilir aygıtlarının bulunduğu bir alt menüden bir aygıt seçmenizi sağlar.

source: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Device</guimenu> <guimenuitem>Refresh Devices</guimenuitem>
tr: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Aygıt</guimenu> <guimenuitem>Aygıtları Yenile</guimenuitem>

source: <action>Refreshes the devices</action>: This command forces &partman; to scan and read the devices on your computer again. This may for example be useful if you plugged in an external USB hard disk after you started &partman;.
tr: <action>Aygıtları yeniler</action>: Bu komut, &partman; uygulamasına bilgisayarınızdaki aygıtları yeniden okumasını ve taramasını söyler. Bu, &partman; uygulamasını başlattıktan sonra dış bir USB sabit disk taktığınızda algılanabilmesi için kullanışlıdır.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>N</keycap></keycombo></shortcut> <guimenu>Device</guimenu> <guimenuitem>New Partition Table</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>N</keycap></keycombo></shortcut> <guimenu>Aygıt</guimenu> <guimenuitem>Yeni Bölüntü Tablosu</guimenuitem>

source: <action>Creates a new partition table</action>: This command creates a new and empty GPT or MSDOS partition table on the currently selected device. This will delete all partitions on the device and all data on them, so you will want to be careful with this command.
tr: <action>Yeni bir bölüntü tablosu oluşturur</action>: Bu komut, seçili olan aygıtta yeni ve boş bir GPT veya MSDOS bölüntü tablosu oluşturur. Bu, aygıttaki tüm bölüntüleri ve üzerilerindeki tüm verileri silecektir, bu nedenle bu komuta dikkat etmek isteyeceksiniz.

source: This command is only enabled if a device is selected and no partition on this device is currently mounted.
tr: Bu komut yalnızca bir aygıt seçiliyse ve bu aygıtta şu anda hiçbir bölüntü takılı değilse etkinleştirilir.

source: <guimenu>Device</guimenu> <guimenuitem>Export Partition Table</guimenuitem>
tr: <guimenu>Aygıt</guimenu> <guimenuitem>Bölüntü Tablosunu Dışa Aktar</guimenuitem>

source: Allows you to export a list of all partitions on the selected device into a file.
tr: Seçili aygıttaki tüm bölüntülerin bir listesini bir dosyaya aktarmanıza izin verir.

source: <guimenu>Device</guimenu> <guimenuitem>Import Partition Table</guimenuitem>
tr: <guimenu>Aygıt</guimenu> <guimenuitem>Bölüntü Tablosu İçe Aktar</guimenuitem>

source: Allows you to import partition table from a previously exported file.
tr: Daha önce dışa aktarılan bir dosyadan bölüntü tablosu içe aktarmanıza izin verir.

source: This will delete all partitions on the device and all data on them, so you will want to be careful with this command.
tr: Bu, aygıttaki tüm bölüntüleri ve üzerilerindeki tüm verileri silecektir, bu nedenle bu komuta dikkat etmek isteyeceksiniz.

source: This command is only enabled if a device is selected and no partition on this device is currently mounted. Importing into logical devices such as LVM Volume Groups is currently not supported.
tr: Bu komut yalnızca bir aygıt seçiliyse ve bu aygıtta şu anda hiçbir bölüntü takılı değilse etkinleştirilir. LVM Disk Bölümü Grupları gibi mantıksal aygıtlara içe aktarım şu anda desteklenmemektedir.

source: <guimenu>Device</guimenu> <guimenuitem>SMART Status</guimenuitem>
tr: <guimenu>Aygıt</guimenu> <guimenuitem>SMART Durumu</guimenuitem>

source: Shows a SMART report. SMART is a monitoring system included in hard disk and solid-state drives that detects and reports on various indicators of drive reliability, with the intent of enabling the anticipation of hardware failures.
tr: Bir SMART raporu gösterir. SMART, donanım arızalarının önceden tahmin edilmesini sağlamak amacıyla sürücü güvenilirliğinin çeşitli göstergelerini algılayan ve raporlayan sabit disk ve katı hal sürücülerinde bulunan bir izleme sistemidir.

source: <guimenu>Device</guimenu> <guimenuitem>Properties</guimenuitem>
tr: <guimenu>Aygıt</guimenu> <guimenuitem>Özellikler</guimenuitem>

source: Shows information about currently selected devices. In this dialog you can find capacity, sector sizes, partition table type as well as used and maximum number of primary partitions.
tr: Geçerli olarak seçili aygıtlarla ilgili bilgileri gösterir. Bu iletişim kutusunda, sığayı, dilim boyutlarını, bölüntü tablosu türünün yanı sıra kullanılan ve en çok birincil bölüntü sayısını bulabilirsiniz.

source: The Partition Menu
tr: Bölüntü Menüsü

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Partition</guimenu> <guimenuitem>New</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Bölüntü</guimenu> <guimenuitem>Yeni</guimenuitem>

source: <action>Creates a new partition</action>: Opens the dialog to create a new partition where you will be able to set type, size, position and file system of the partition to create.
tr: <action>Yeni bir bölüntü oluşturur</action>: Oluşturacak bölüntünün türünü, boyutunu, konumunu ve dosya sistemini ayarlayabileceğiniz yeni bir bölüntü oluşturmak için iletişim penceresini açar.

source: Please note that the partition table on a device may impose restrictions on how many partitions can be created. MS-DOS partition tables, for example, allow only four primary partitions.
tr: Lütfen bir aygıttaki bölüntü tablosunun kaç bölüntünün oluşturulabileceği konusunda kısıtlamalar getirebileceğini unutmayın. Örneğin, MS-DOS bölüntü tabloları yalnızca dört birincil bölüntüye izin verir.

source: This command is only enabled if an unallocated area on a device is selected.
tr: Bu komut yalnızca bir aygıtta ayrılmamış bir alan seçildiğinde etkinleştirilir.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Partition</guimenu> <guimenuitem>Resize/Move</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Bölüntü</guimenu> <guimenuitem>Yeniden Boyutlandır/Taşı</guimenuitem>

source: <action>Resizes or moves a partition</action>: Opens the dialog to resize or move an existing partition. Depending on the partition's file system and the external tools installed on your computer, not all three possible resize-related actions -- that is, moving the partition, making it smaller (<quote>shrinking</quote> it) or making it larger (<quote>growing</quote> it) -- may be available in this dialog. See <xref linkend="menu-tools-filesystemsupport"/>.
tr: <action>Bir bölüntüyü yeniden boyutlandırır veya taşır</action>: Var olan bir bölüntüyü yeniden boyutlandırmak veya taşımak için iletişim kutusunu açar. Bölüntünün dosya sistemine ve bilgisayarınızda kurulu dış araçlara bağlı olarak, yeniden boyutlandırmayla ilgili olası üç eylemin tümü — yani bölüntüyü taşıma, küçültme (<quote>küçültme</quote>) veya büyütme (<quote>büyütme</quote>) — bu iletişim kutusunda bulunabilir. <xref linkend="menu-tools-filesystemsupport"/> bölümüne bakın.

source: This command is only enabled if a partition is selected that is not currently mounted and whose file system can be shrunk, grown or moved. For an extended partition, it is only enabled if none of the logicals in the extended partition are mounted.
tr: Bu komut yalnızca şu anda takılı olmayan ve dosya sistemi küçültülebilen, büyütülebilen veya taşınabilen bir bölüntü seçildiğinde etkinleştirilir. Genişletilmiş bir bölüntü için yalnızca genişletilmiş bölüntüdeki mantıksalların hiçbiri bağlanmamışsa etkinleştirilir.

source: <shortcut>&Del;</shortcut> <guimenu>Partition</guimenu> <guimenuitem>Delete</guimenuitem>
tr: <shortcut>&Del;</shortcut> <guimenu>Bölüntü</guimenu> <guimenuitem>Sil</guimenuitem>

source: <action>Deletes a partition</action>: This command deletes the currently selected partition.
tr: <action>Bir bölüntüyü siler</action>: Bu komut, şu anda seçili olan bölüntüyü siler.

source: This command is only enabled if a partition is selected that is not currently mounted. For an extended partition, it is only enabled if it does not contain any logical partitions.
tr: Bu komut yalnızca şu anda bağlı olmayan bir bölüntü seçildiğinde etkinleştirilir. Genişletilmiş bir bölüntü için yalnızca herhangi bir mantıksal bölüntü içermiyorsa etkinleştirilir.

source: Warning: Possible loss of data
tr: Uyarı: Olası veri kaybı

source: Deleting a partition means that all data on the partition is destroyed.
tr: Bir bölüntünün silinmesi, bölüntüdeki tüm verilerin yok edilmesi anlamına gelir.

source: <shortcut><keycombo action="simul">&Ctrl;&Del;</keycombo></shortcut> <guimenu>Partition</guimenu> <guimenuitem>Shred</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Del;</keycombo></shortcut> <guimenu>Bölüntü</guimenu> <guimenuitem>Parçala</guimenuitem>

source: <action>Shreds a partition</action>: This command shreds the currently selected partition.
tr: <action>Bir bölüntüyü parçalar</action>: Bu komut geçerli olarak seçili bölüntüyü parçalar.

source: Warning: Loss of data
tr: Uyarı: Olası veri kaybı

source: Shredding a partition means that all data on the partition is destroyed.
tr: Bir bölüntüyü parçalamak, bölüntüdeki tüm verilerin yok edilmesi anlamına gelir.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Partition</guimenu> <guimenuitem>Copy</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Bölüntü</guimenu> <guimenuitem>Kopyala</guimenuitem>

source: <action>Copies a partition</action>: This command copies the currently selected partition to &partman;'s clipboard.
tr: <action>Bir bölüntüyü kopyalar</action>: Bu komut, seçili olan bölüntüyü &partman; panosuna kopyalar.

source: This command is only enabled if a partition is selected that is not currently mounted and whose file system can be copied. Extended partitions can not be copied.
tr: Bu komut yalnızca şu anda bağlı olmayan ve dosya sistemi kopyalanabilen bir bölüntü seçildiğinde etkinleştirilir. Genişletilmiş bölüntüler kopyalanamaz.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo></shortcut> <guimenu>Partition</guimenu> <guimenuitem>Paste</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo></shortcut> <guimenu>Bölüntü</guimenu> <guimenuitem>Yapıştır</guimenuitem>

source: <action>Paste a partition</action>: This command pastes the partition from &partman;'s clipboard to the currently selected partition or unallocated area.
tr: <action>Bir bölüntüyü yapıştır</action>: Bu komut, bölüntüyü &partman; panosundan seçili olan bölüntüye veya ayrılmamış alana yapıştırır.

source: When pasting to an unallocated area, a dialog will open allowing you to move or grow the inserted copy. When overwriting an existing partition this dialog will not be shown.
tr: Ayrılmamış bir alana yapıştırırken, eklenen kopyayı taşımanıza veya büyütmenize izin veren bir iletişim kutusu açılır. Var olan bir bölüntünün üzerine yazarken bu iletişim kutusu gösterilmeyecektir.

source: This command is only enabled if a partition is currently in the clipboard and a valid target (either a partition or an unallocated area) is selected. The target must also be large enough to hold the source and can not be mounted. You can not copy a partition onto itself.
tr: Bu komut yalnızca panoda o anda bir bölüntü varsa ve geçerli bir hedef (bölüntü veya ayrılmamış bir alan) seçilirse etkinleştirilir. Hedef ayrıca kaynağı tutacak kadar büyük olmalı ve bağlanamaz. Bir bölüntüyü kendi üzerine kopyalayamazsınız.

source: Pasting a partition on an existing one means that all data on the existing partition is destroyed and replaced with the data from the pasted partition.
tr: Var olan bir bölüntüyü başka bir bölüntüye yapıştırmak, var olan bölüntüdeki tüm verilerin yok edilmesi ve yapıştırılan bölüntüdeki verilerle değiştirilmesi anlamına gelir.

source: <guimenu>Partition</guimenu> <guimenuitem>Edit Mount Point</guimenuitem>
tr: <guimenu>Bölüntü</guimenu> <guimenuitem>Bağlama Noktasını Düzenle</guimenuitem>

source: <action>Opens a dialog</action> to edit the mount point and the mount options.
tr: Bağlama noktasını ve bağlama seçeneklerini düzenlemek için <action>bir iletişim kutusu açar</action>.

source: This command is only enabled if a partition is unmounted.
tr: Bu komut, yalnızca bir bölüntünün bağlantısı kesilmişse etkinleştirilir.

source: <guimenu>Partition</guimenu> <guimenuitem>Mount/Unmount</guimenuitem>
tr: <guimenu>Bölüntü</guimenu> <guimenuitem>Bağla/Bağlantıyı Kes</guimenuitem>

source: <action>Mounts or unmounts a partition</action>: This command mounts or unmounts the selected partition, depending on its current state.
tr: <action>Bir bölüntüyü bağlar veya bağlantısını keser</action>: Bu komut, geçerli durumuna bağlı olarak seçilen bölüntüyü bağlar veya bağlantısını keser.

source: This command is only enabled if a partition is selected that can be mounted or unmounted. If the operating system does not know a mount point for the partition you can not mount it from &partman;.
tr: Bu komut yalnızca bağlanabilen veya bağlantısı kesilebilen bir bölüntü seçildiğinde etkinleştirilir. İşletim sistemi bölüntü için bir bağlama noktası bilmiyorsa bölüntüyü &partman; uygulamasından bağlayamazsınız.

source: <guimenu>Partition</guimenu> <guimenuitem>Check</guimenuitem>
tr: <guimenu>Bölüntü</guimenu> <guimenuitem>Denetle</guimenuitem>

source: <action>Checks a partition</action>: This command checks the selected partition and its file system for errors and tries to correct any problems it finds. During this process the file system on the partition will also be resized to fill the partition completely.
tr: <action>Bir bölüntüyü denetler</action>: Bu komut, seçili bölüntüyü ve dosya sistemini hatalara karşı denetler ve bulduğu sorunları düzeltmeye çalışır. Bu işlem sırasında bölüntüdeki dosya sistemi de bölüntüyü tamamen dolduracak şekilde yeniden boyutlandırılacaktır.

source: This command is only enabled if a partition is selected that can be checked and is not currently mounted.
tr: Bu komut, yalnızca denetlenebilen ve şu anda bağlı olmayan bir bölüntü seçildiğinde etkinleştirilir.

source: <guimenu>Partition</guimenu> <guimenuitem>Backup</guimenuitem>
tr: <guimenu>Bölüntü</guimenu> <guimenuitem>Yedekle</guimenuitem>

source: <action>Backs up a partition</action>: This command backs up the file system on the selected partition to a file. You will be asked where to store the image file after activating this command.
tr: <action>Bir bölüntüyü yedekler</action>: Bu komut, seçilen bölüntüdeki dosya sistemini bir dosyaya yedekler. Bu komutu etkinleştirdikten sonra kalıp dosyasının nerede saklanacağı sorulacaktır.

source: The created image file is a sector-for-sector copy of the file system on the partition. It is not compressed and does not have any additional meta information or header added to it, thus it can be directly mounted using a loop device outside of &partman; if the operating system supports that.
tr: Oluşturulan kalıp dosyası, bölüntüdeki dosya sisteminin dilim dilim kopyasıdır. Sıkıştırılmamıştır ve herhangi bir ek üst bilgisi veya eklenmiş başlığı yoktur, bu nedenle işletim sistemi destekliyorsa &partman; dışında bir döngü aygıtı kullanılarak doğrudan bağlanabilir.

source: This command is only enabled if a partition is selected and the file system on it can be backed up. The partition must also not be mounted.
tr: Bu komut yalnızca bir bölüntü seçildiğinde ve bu bölüntüdeki dosya sistemi yedeklenebildiğinde etkinleştirilir. Bölüntü ayrıca bağlanmamalıdır.

source: <guimenu>Partition</guimenu> <guimenuitem>Restore</guimenuitem>
tr: <guimenu>Bölüntü</guimenu> <guimenuitem>Geri Yükle</guimenuitem>

source: <action>Restores a partition</action>: This command restores a file system from an image file to a partition. You will be asked for the name of the image file to restore after activating this command. The target to restore to must be large enough for the image file.
tr: <action>Bir bölüntüyü geri yükler</action>: Bu komut, bir dosya sistemini bir kalıp dosyasından bir bölüntüye geri yükler. Bu komutu etkinleştirdikten sonra geri yüklenecek kalıp dosyasının adı sorulacaktır. Geri yüklenecek hedef, kalıp dosyası için yeterince büyük olmalıdır.

source: The command is only enabled if either an unallocated area is selected or a partition that is not currently mounted.
tr: Komut yalnızca ayrılmamış bir alan seçildiğinde veya şu anda bağlı olmayan bir bölüntü seçildiğinde etkinleştirilir.

source: Restoring a partition on an existing one means that all data on the existing partition is destroyed and replaced with the data from the restored image file.
tr: Var olan bir bölüntüdeki bir bölüntüyü geri yüklemek, var olan bölüntüdeki tüm verilerin yok edildiği ve geri yüklenen kalıp dosyasındaki verilerle değiştirildiği anlamına gelir.

source: <guimenu>Partition</guimenu> <guimenuitem>Properties</guimenuitem>
tr: <guimenu>Bölüntü</guimenu> <guimenuitem>Özellikler</guimenuitem>

source: <action>Shows a partition's properties</action>: This command shows a dialog with information about the currently selected partition or unallocated space.
tr: <action>Bir bölüntünün özelliklerini gösterir</action>: Bu komut, seçili olan bölüntü veya ayrılmamış alan hakkında bilgi içeren bir iletişim kutusu gösterir.

source: What is displayed and what can be modified in this dialog depends on the type of partition, the type of the file system on the partition and on the partition being currently mounted or not.
tr: Bu iletişim kutusunda nelerin görüntüleneceği ve nelerin değiştirilebileceği bölüntünün türüne, bölüntüdeki dosya sisteminin türüne ve bölüntünün şu anda bağlı olup olmamasına bağlıdır.

source: Not all file systems, for example, support setting a label. It is also generally not possible to modify any properties if the partition is mounted.
tr: Örneğin, tüm dosya sistemleri bir etiket ayarlamayı desteklemez. Bölüntü bağlıysa herhangi bir özelliği değiştirmek de genellikle olanaklı değildir.

source: This is a list of all partition and file system properties that can in general be modified in this dialog:
tr: Bu, genel olarak bu iletişim kutusunda değiştirilebilen tüm bölüntü ve dosya sistemi özelliklerinin bir listesidir:

source: Set or modify a file system's label
tr: Bir dosya sisteminin etiketini ayarla veya değiştir

source: Change the partition's file system.
tr: Bölüntünün dosya sistemini değiştirin.

source: Changing the file system for a partition always means that all data on the partition is destroyed.
tr: Bir bölüntünün dosya sistemini değiştirmek, her zaman bölüntüdeki tüm verilerin yok edilmesi anlamına gelir.

source: Recreate the file system on the partition
tr: Bölüntüdeki dosya sistemini yeniden oluştur

source: Recreating a file system on a partition always means that all data on the partition is destroyed. Recreating a file system should only be used as a last resort if the file system on a partition cannot be repaired anymore.
tr: Bir dosya sistemini bir bölüntü üzerinde yeniden oluşturmak, her zaman bölüntüdeki tüm verilerin yok edilmesi anlamına gelir. Bir dosya sistemini yeniden oluşturmak, yalnızca bir bölüntüdeki dosya sistemi artık onarılamazsa son çare olarak kullanılmalıdır.

source: Change a partition's flags
tr: Bir bölüntünün bayraklarını değiştir

source: Depending on the type of partition table used, there will be several flags available for each partition on the partition table. In most cases, modifying the flags is not necessary and should be considered an advanced feature.
tr: Kullanılan bölüntüleme tablosunun türüne bağlı olarak, bölüntüleme tablosundaki her bölüntü için birkaç bayrak olacaktır. Çoğu durumda bayrakları değiştirmek gerekli değildir ve gelişmiş bir özellik olarak düşünülmelidir.

source: The command is only enabled if either an unallocated area or a partition is selected.
tr: Komut yalnızca ayrılmamış bir alan veya bir bölüntü seçildiğinde etkinleştirilir.

source: The Tools Menu
tr: Araçlar Menüsü

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>L</keycap></keycombo></shortcut> <guimenu>Tools</guimenu> <guimenuitem>New Volume Group</guimenuitem>
tr: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>L</keycap></keycombo></shortcut> <guimenu>Araçlar</guimenu> <guimenuitem>Yeni Disk Bölümü Grubu</guimenuitem>

source: Create a new logical device such as <link linkend="glossary-lvm">LVM</link> Volume Group.
tr: <link linkend="glossary-lvm">LVM</link> Disk Bölümü Grubu gibi yeni bir mantıksal aygıt oluşturun.

source: <guimenu>Tools</guimenu> <guimenuitem>File System Support</guimenuitem>
tr: <guimenu>Araçlar</guimenu> <guimenuitem>Dosya Sistemi Desteği</guimenuitem>
