Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/partitionmanager_usermanual.po
Languages: tr

source: Using &partman;
tr: &partman; Kullanımı

source: The Main Window
tr: Ana Pencere

source: Besides the main view showing the currently selected device in a graphical and a tree view, &partman; uses &Qt;'s <quote>dock widgets</quote> or panels to display some information and allow selections. See the following screen shot for an overview of &partman;'s main window.
tr: O anda seçili olan aygıtı grafik ve ağaç görünümünde gösteren ana görünümün yanı sıra, &partman; bazı bilgileri görüntülemek ve seçimlere izin vermek için &Qt;’nin <quote>rıhtım araç takımlarını</quote> veya panellerini kullanır. &partman; uygulamasının ana penceresine genel bir bakış için aşağıdaki ekran görüntüsüne bakın.

source: &partman;'s main window
tr: &partman; uygulamasının ana penceresi

source: Main Window
tr: Ana Pencere

source: Menubar: The menu bar presents some custom and some non-standard menus to choose actions to perform. All commands are described in detail in <xref linkend="reference"/>.
tr: Menü çubuğu: Menü çubuğu, gerçekleştirilecek eylemleri seçmek için bazı özel ve bazı standart olmayan menüler sunar. Tüm komutlar ayrıntılı olarak <xref linkend="reference"/> içinde açıklanmıştır.

source: Toolbar: &partman;'s tool bar is a standard tool bar. It can be fully customized; for details see <xref linkend="menu-settings-help"/>.
tr: Araç Çubuğu: &partman;’nin araç çubuğu standart bir araç çubuğudur. Tümüyle özelleştirilebilirdir; ayrıntılar için <xref linkend="menu-settings-help"/> bölümüne bakın.

source: Devices Panel: This panel lists all <glossterm linkend="glossary-device">devices</glossterm> found on your computer that &partman; can handle. Select a device in this panel to view or modify it in the graphical device view or in the tree device view.
tr: Aygıtlar Paneli: Bu panel, bilgisayarınızda bulunan &partman; baş edebilir. Grafik aygıt görünümünde veya ağaç aygıt görünümünde görüntülemek veya değiştirmek için bu panelde bir aygıt seçin.

source: Graphical Device View: In this view &partman; shows a graphical representation of the currently selected device. Each of the device's <glossterm linkend="glossary-partition">partitions</glossterm> has its own box with device node name (<quote>sda1</quote> for the first partition in the screenshot above) and usage information (the dark violet area in the screenshot).
tr: Grafik Aygıt Görünümü: Bu görünümde &partman;, seçili olan aygıtın grafiksel bir temsilini gösterir. Aygıtın <glossterm linkend="glossary-partition">bölüntülerin</glossterm> her birinin, aygıt düğüm adını (yukarıdaki ekran görüntüsündeki ilk bölüntü için <quote>sda1</quote>) ve kullanım bilgilerini ( ekran görüntüsündeki koyu mor alan) gösteren bir kutusu vardır.

source: <glossterm linkend="glossary-extendedpartition">Extended partitions</glossterm> are visually distinct by their extra border (light green in the screenshot above) around them.
tr: <glossterm linkend="glossary-extendedpartition">Genişletilmiş bölüntüler</glossterm>, etraflarındaki ek kenarlıklarıyla (yukarıdaki ekran görüntüsünde açık yeşil) görsel olarak farklıdır.

source: You can select a partition by clicking on it in the graphical device view. A double click opens <link linkend="menu-partition-properties">the partition's properties dialog</link>. A right click shows the partition context menu.
tr: Grafik aygıt görünümünde üzerine tıklayarak bir bölüntü seçebilirsiniz. Çift tıklama, <link linkend="menu-partition-properties">bölüntünün özellikler iletişim kutusunu</link> açar. Sağ tıklama, bölüntü içerik menüsünü gösterir.

source: Tree Device View: The tree device view shows extended information about each partition on the selected device. The currently selected partition is highlighted. Double-clicking a partition opens <link linkend="menu-partition-properties">the partition's properties dialog</link>. A right click shows the partition context menu.
tr: Ağaç Aygıt Görünümü: Ağaç aygıt görünümü, seçilen aygıttaki her bölüntü hakkında genişletilmiş bilgileri gösterir. Seçili bölüntü vurgulanır. Bir bölüntüye çift tıklamak, <link linkend="menu-partition-properties">bölüntünün özellikler iletişim kutusunu</link> açar. Sağ tıklama, bölüntü içerik menüsünü gösterir.

source: Information Panel: The information panel shows some details about the currently selected device or partition. It is not enabled by default.
tr: Bilgi Paneli: Bilgi paneli, seçili olan aygıt veya bölüntü hakkında bazı ayrıntıları gösterir. Öntanımlı olarak etkin değildir.

source: Pending Operations Panel: This panel lists all operations that will be executed once you choose <xref linkend="menu-edit-apply"/>.
tr: Bekleyen İşlemler Paneli: Bu panel, <xref linkend="menu-edit-apply"/> ögesini seçtiğinizde yürütülecek tüm işlemleri listeler.

source: In the screenshot above, one operation is pending: If the user applies the operations now, the <glossterm linkend="glossary-filesystem">file system</glossterm> on /dev/sdb3 will be checked for errors and, if required, repaired.
tr: Yukarıdaki ekran görüntüsünde bekleyen bir işlem var: Kullanıcı işlemleri şimdi uygularsa /dev/sdb3 üzerindeki <glossterm linkend="glossary-filesystem">dosya sistemi</glossterm> hatalara karşı denetlenecek ve gerekirse onarılacak.

source: Statusbar: The status bar shows how many operations are currently pending.
tr: Durum Çubuğu: Durum çubuğu, o anda kaç işlemin beklemede olduğunu gösterir.

source: Log Output Panel: This panel shows log information. It is only of secondary importance for non-advanced users and is not enabled by default.
tr: Günlük Çıktı Paneli: Bu panel, günlük bilgilerini gösterir. Gelişmiş olmayan kullanıcılar için yalnızca ikincil öneme sahiptir ve öntanımlı olarak etkin değildir.
