Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/plasma-sdk_engineexplorer_man-plasmaengineexplorer.1.po
Languages: tr

source: plasmaengineexplorer User's Manual
tr: plasmaengineexplorer Kullanıcı Kılavuzu

source: Provides direct access to plasma data engines
tr: Plasma veri işletkelerine doğrudan erişim sağlar

source: <command>plasmaengineexplorer</command> <group choice="opt"><option>-v, --version</option></group> <group choice="opt"><option>-h, --help</option></group> <group choice="opt"><option>--list</option></group> <group choice="opt"><option>--height</option> <replaceable>pixels</replaceable></group> <group choice="opt"><option>--width</option> <replaceable>pixels</replaceable></group> <group choice="opt"><option>-x</option> <replaceable>pixels</replaceable></group> <group choice="opt"><option>-y</option> <replaceable>pixels</replaceable></group> <group choice="opt"><option>--engine</option> <replaceable>data engine</replaceable></group> <group choice="opt"><option>--source</option> <replaceable>data engine</replaceable></group> <group choice="opt"><option>--interval</option> <replaceable>ms</replaceable></group> <group choice="opt"><option>--app</option> <replaceable>application</replaceable></group>
tr: <command>plasmaengineexplorer</command> <group choice="opt"><option>-v, --version</option></group> <group choice="opt"><option>-h, --help</option></group> <group choice="opt"><option>--list</option></group> <group choice="opt"><option>--height</option> <replaceable>piksel</replaceable></group> <group choice="opt"><option>--width</option> <replaceable>piksel</replaceable></group> <group choice="opt"><option>-x</option> <replaceable>piksel</replaceable></group> <group choice="opt"><option>-y</option> <replaceable>piksel</replaceable></group> <group choice="opt"><option>--engine</option> <replaceable>veri işletkesi</replaceable></group> <group choice="opt"><option>--source</option> <replaceable>veri işletkesi</replaceable></group> <group choice="opt"><option>--interval</option> <replaceable>zaman (ms)</replaceable></group> <group choice="opt"><option>--app</option> <replaceable>uygulama</replaceable></group>

source: <command>plasmaengineexplorer</command> <arg choice="opt">KDE Generic Options</arg> <arg choice="opt">Qt Generic Options</arg>
tr: <command>plasmaengineexplorer</command> <arg choice="opt">KDE Genel Seçenekleri</arg> <arg choice="opt">Qt Genel Seçenekleri</arg>

source: Description
tr: Açıklama

source: <command>plasmaengineexplorer</command> is a graphical tool allowing developers to test Plasma data engines without writing a Plasma applet.
tr: <command>plasmaengineexplorer</command>, geliştiricilerin bir Plasma uygulamacığı yazmasına gerek kalmadan Plasms veri işletkelerini sınamalarına izin veren grafiksel bir araçtır.

source: If no options are given, it will start without any data engine selected. The required data engine can be selected from a drop-down list.
tr: Hiçbir seçenek verilmezse herhangi bir veri işletkesi seçilmeden başlayacaktır. Gerekli veri işletkesi bir açılır listeden seçilebilir.

source: Only installed data engines will be found. <command>kbuildsycoca4</command> may need to be run for newly-installed data engines to be found.
tr: Yalnızca kurulu veri işletkeleri bulunur. Yeni kurulan veri işletkelerinin bulunabilmesi için <command>kbuildsycoca4</command> komutunun çalıştırılması gerekebilir.

source: Options
tr: Seçenekler

source: Displays version information.
tr: Sürüm bilgisini görüntüler.

source: Displays this help.
tr: Bu yardımı görüntüler.

source: --list <replaceable>pixels</replaceable>
tr: --list <replaceable>piksel</replaceable>

source: Displays a list of known engines and their descriptions.
tr: Bilinen işletkelerin bir listesini ve açıklamalarını görüntüler.

source: Sets the height of the window, in pixels.
tr: Pencerenin yüksekliğini piksel türünden ayarlar.

source: --width <replaceable>pixels</replaceable>
tr: --width <replaceable>piksel</replaceable>

source: Sets the width of the window, in pixels.
tr: Pencerenin genişliğini piksel türünden ayarlar.

source: -x <replaceable>pixels</replaceable>
tr: -x <replaceable>piksel</replaceable>

source: Sets the x (horizontal) co-ordinate of the top left corner of the window, in pixels.
tr: Piksel türünden pencerenin sol üst köşesinin x (yatay) koordinatını ayarlar.

source: -y <replaceable>pixels</replaceable>
tr: -y <replaceable>piksel</replaceable>

source: Sets the y (vertical) co-ordinate of the top left corner of the window, in pixels.
tr: Piksel türünden pencerenin sol üst köşesinin y (dikey) koordinatını ayarlar.

source: --engine <replaceable>data engine</replaceable>
tr: --engine <replaceable>veri işletkesi</replaceable>

source: Start <command>plasmaengineexplorer</command> with the given data engine selected. <parameter>data engine</parameter> is the internal name of the data engine given by the X-KDE-PluginInfo-Name key of the desktop file.
tr: Verilen veri işletkesiyle <command>plasmaengineexplorer</command>’ı başlatın. <parameter>veri işletkesi</parameter>, veri işletkesinin desktop dosyasının X-KDE-PluginInfo-Name anahtarı tarafından verilen iç adıdır.

source: --source <replaceable>data engine</replaceable>
tr: --source <replaceable>veri işletkesi</replaceable>

source: Only valid in conjunction with <option>--engine</option>. Requests a specific source from the data engine when <command>plasmaengineexplorer</command> is started.
tr: Yalnızca <option>--engine</option> ile birlikte geçerlidir. <command>plasmaengineexplorer</command> başlatıldığında veri işletkesinden belirli bir kaynak ister.

source: --interval <replaceable>time</replaceable>
tr: --interval <replaceable>zaman (ms)</replaceable>

source: Sets the default update interval for requested sources to <parameter>time</parameter> milliseconds. If not set, the source will update on demand (for some sources, this will be when new data is available).
tr: İstenen kaynaklar için öntanımlı güncelleme aralığını <parameter>time</parameter> milisaniye olarak ayarlar. Ayarlanmazsa kaynak istek üzerine güncellenecektir (bazı kaynaklar için bu, yeni veri kullanılabilirken olur).

source: If <option>--source</option> is specified, this is the update interval that will be used when requesting that source.
tr: <option>--source</option> belirtilmişse o kaynağı isterken kullanılacak olan güncelleme aralığıdır.

source: --app <replaceable>application</replaceable>
tr: --app <replaceable>uygulama</replaceable>

source: Only show engines associated with the parent application; maps to the X-KDE-ParentApp entry in the DataEngine's .desktop file.
tr: Yalnızca ana uygulamayla ilişkili işletkeleri göster; DataEngine’in .desktop dosyasındaki X-KDE-ParentApp girişiyle eşleşir.

source: See Also
tr: Ayrıca Bakınız

source: More detailed user documentation is available from <ulink url="help:/plasma-desktop">help:/plasma-desktop</ulink> (either enter this <acronym>URL</acronym> into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>help:/plasma-desktop</parameter></userinput>).
tr: Daha ayrıntılı kullanıcı belgelendirmesine <ulink url="help:/plasma-desktop">help:/plasma-desktop</ulink> (ya bu &URL;’yi &konqueror;’a girin ya da <userinput><command>khelpcenter</command> <parameter>help:/plasma-desktop</parameter></userinput> komutunu çalıştırın) adresinden ulaşabilirsiniz.

source: Examples
tr: Örnekler

source: Load the time data engine, showing the local time and updating every second:
tr: Yerel saati gösteren ve her saniye güncellenen zaman veri işletkesini yükleyin:

source: Authors
tr: Yazarlar

source: <command>plasmaengineexplorer</command> was written by <personname><firstname>Aaron</firstname><surname>Seigo</surname></personname> <email>aseigo@kde.org</email>.
tr: <command>plasmaengineexplorer</command>, <personname><firstname>Aaron</firstname><surname>Seigo</surname></personname> <email>aseigo@kde.org</email> tarafından yazılmıştır.
