Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/plasma-desktop.po
Languages: tr

source: The &plasma; Handbook
tr: &plasma; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Serdar</firstname><surname>Soytetir</surname><affiliation><address><email>tulliana@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit> <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: &plasma; is the core user interface to the desktop.
tr: &plasma;, masaüstünün çekirdek kullanıcı arayüzüdür.

source: Widget
tr: Araç Takımı

source: <keyword>Containments</keyword>
tr: <keyword>Kapsamalar</keyword>

source: Desktop
tr: Masaüstü

source: Runner
tr: Çalıştırıcı

source: Introduction
tr: Giriş

source: &plasma; provides a modern and customizable environment for running your favorite applications and accessing your information wherever it may be. Other common attributes of the &plasma; Desktop include advanced window management and desktop effects, support for &kde; &plasma; Widgets, integrated search, hardware management and a high degree of customizability.
tr: &plasma; favori uygulamalarınızı çalıştırmak ve bilgilerinize nerede olursa olsun erişmek için çağdaş ve özelleştirilebilir bir ortam sağlar. &plasma; Masaüstü’nün diğer ortak öznitelikleri gelişmiş pencere yönetimi ve masaüstü efektleri, &kde; &plasma; araç takımları desteği, tümleşik arama, donanım yönetimi ve yüksek derecede özelleştirilebilirlik içerir.

source: Using &plasma;
tr: &plasma; Kullanımı

source: &plasma; Components
tr: &plasma; Bileşenleri

source: &plasma; Widgets and Containments
tr: &plasma; Araç Takımları ve Kapsamaları

source: The essence of &plasma; revolves around two basic concepts:
tr: &plasma;’nın özü iki ana bağlamda değerlendirilebilir:

source: &plasma; Widgets
tr: &plasma; Araç Takımları

source: Applets, or small applications that live on the desktop.
tr: Uygulamacıklar, masaüstünde yaşayan küçük uygulamalar.

source: <term>Containments</term>
tr: <term>Kapsamalar</term>

source: Applets that act as the container for the &plasma; widgets
tr: &plasma; araç takımları için kapsayıcılar olarak rol alan uygulamacıklar

source: On a default desktop, there are two main elements: the Panel and the Desktop itself. Both are containments in the &plasma; sense.
tr: Öntanımlı masaüstünde iki ana öge vardır: Panel ve Masaüstü’nün kendisi. &plasma;’nın yapı mantığına göre bunların ikisi de kapsamadır.

source: Default &plasma; Desktop
tr: Öntanımlı &plasma; Masaüstü

source: The &plasma; Desktop can be configured in countless ways. The screenshot seen below shows a fairly standard desktop. Some distributions apply extensive customizations, so your desktop may look different.
tr: &plasma; Masaüstü, sayısız biçimde yapılandırılabilir. Aşağıda görülen ekran görüntüsü oldukça standart bir masaüstünü göstermektedir. Bazı dağıtımlar kapsamlı özelleştirmeler uygular, bu nedenle masaüstünüz farklı görünebilir.

source: Similarly, the graphical appearance of the interface elements can be styled. These screenshots uses the &plasma; default style, Breeze.
tr: Benzer şekilde, arayüz ögelerinin grafiksel görünümünün biçemi değiştirilebilir. Bu ekran görüntüleri &plasma;’nın öntanımlı biçemi olan Esinti’yi kullanır.

source: A fairly standard &plasma; Desktop
tr: Oldukça standart bir &plasma; Masaüstü

source: The program starter. Usually this will be <link linkend="panel-launcher">Application Launcher</link>.
tr: Program başlatıcısı. Genellikle, <link linkend="panel-launcher">Uygulama Başlatıcısı</link> olur.

source: A couple of icons giving easy access to often used applications
tr: Sık kullanılan uygulamalara kolay erişim sağlayan birkaç simge

source: The <link linkend="panel-taskbar">Task Manager</link>, which shows the titles of windows belonging to the applications currently running. No application had opened a window, when the screenshot was taken
tr: <link linkend="panel-taskbar">Görev Yöneticisi</link>, şu anda çalışan uygulamaların pencerelerinin başlığını gösterir. Ekran görüntüsü alındığında açık hiçbir uygulama yoktu

source: The <link linkend="panel-system-tray">System Tray</link>
tr: <link linkend="panel-system-tray">Sistem Tepsisi</link>

source: The <link linkend="panel-digital-clock">Digital Clock</link> widget
tr: <link linkend="panel-digital-clock">Sayısal Saat</link> araç takımı

source: The <link linkend="panel-toolbox">Panel Toolbox</link>
tr: <link linkend="panel-toolbox">Panel Araç Çubuğu</link>

source: The <link linkend="desktop">Desktop</link> Toolbox
tr: <link linkend="desktop">Masaüstü</link> Araç Çubuğu

source: A Folder View widget, showing the content of the Desktop folder
tr: Masaüstü klasörünün içeriğini gösteren Klasör Görünümü araç takımı

source: The Panel
tr: Panel

source: The default panel holds a few &plasma; widgets: starting from the left, there is the application launcher.
tr: Öntanımlı panel, birkaç &plasma; araç takımını barındırır: soldan başlayarak uygulama başlatıcısını görebilirsiniz.

source: Application Launcher
tr: Uygulama Başlatıcısı

source: <screeninfo>Application launcher</screeninfo>
tr: <screeninfo>Uygulama başlatıcısı</screeninfo>

source: <phrase>Application launcher</phrase>
tr: <phrase>Uygulama başlatıcısı</phrase>

source: You can use it to start applications, open recently opened files and the usual logout/shutdown options. There is also a structure that allows you to browse through your applications. The layout has been optimized for the use case that is most common: starting an application. The default tab is the <guilabel>Favorites</guilabel> tab that holds the most-used entries. In the beginning, you'll probably find yourself using the <guilabel>Applications</guilabel> tab more often. Once you have found out what your most frequently started applications are, <mousebutton>right</mousebutton> click on the items and select the <guimenuitem>Add to Favorites</guimenuitem> to add them to your <guilabel>Favorites</guilabel> (or directly into the panel or on the desktop. Note that you need to <quote>unlock</quote> &plasma; by means of <mousebutton>right</mousebutton> clicking on the desktop for any kind of modification).
tr: Uygulamaları başlatmak, yakın zamanda açılmış dosyaları açmak ve normal çıkış/kapatma seçeneklerini kullanmak için kullanabilirsiniz. Uygulamalarınıza göz atmanızı sağlayan bir yapı da vardır. Yerleşim, en yaygın kullanılan durum olan bir uygulamayı başlatma için eniyilenmiştir. Öntanımlı sekme olan <guilabel>Sık Kullanılanlar</guilabel>, en çok kullanılan girdileri tutar. Başlangıçta <guilabel>Uygulamalar</guilabel> sekmesini daha fazla kullanabilirsiniz. Bir kere sık kullandığınız uygulamayı bulduğunuzda ona <mousebutton>sağ</mousebutton> fare düğmesiyle tıklayın ve onu <guilabel>Sık Kullanılanlar</guilabel>’a (veya doğrudan panelin içine veya masaüstüne) eklemek için <guilabel>Sık Kullanılanlara Ekle</guilabel>’yi seçin. Unutmayın, bunu yapmadan önce masaüstünde herhangi bir değişiklik yapmak için <mousebutton>sağ</mousebutton> tıklayarak &plasma;’nın <quote>kilidini açmanız</quote> gerekiyor).

source: Application Menu
tr: Uygulama Menüsü

source: If you prefer the traditional menu-style application launcher, change it by <mousebutton>right</mousebutton> clicking on the menu button and selecting <guimenuitem>Alternatives</guimenuitem>.
tr: Eğer geleneksel menü biçemli uygulama başlatıcısını tercih ediyorsanız bunu menü düğmesine <mousebutton>sağ</mousebutton> tıklayıp <guimenuitem>Alternatifler</guimenuitem>’i seçerek yapabilirsiniz.

source: <screeninfo>Application menu</screeninfo>
tr: <screeninfo>Uygulama menüsü</screeninfo>

source: <phrase>Application menu</phrase>
tr: <phrase>Uygulama menüsü</phrase>

source: Application Launcher Settings
tr: Uygulama Başlatıcısı Ayarları

source: If you want to configure the application launcher, change it by <mousebutton>right</mousebutton> clicking on the menu button and selecting <guimenuitem>Configure Application Launcher</guimenuitem>.
tr: Uygulama başlatıcısını yapılandırmak istiyorsanız menü düğmesine <mousebutton>sağ</mousebutton> tıklayın ve <guimenuitem>Uygulama Başlatıcısı Ögesini Yapılandır</guimenuitem>’ı seçin.

source: <screeninfo>Application launcher settings</screeninfo>
tr: <screeninfo>Uygulama başlatıcısı ayarları</screeninfo>

source: <phrase>Application launcher settings</phrase>
tr: <phrase>Uygulama başlatıcısı ayarları</phrase>

source: Taskbar
tr: Görev Çubuğu

source: The taskbar is another widget on the panel. It shows an area for all open windows on all desktops by default. You can make it show all open windows on the current desktop only by checking <guimenuitem>Only show tasks from the current desktop</guimenuitem> when you right click on the task manager, between two windows. The size of the text on the taskbar items can be set in &systemsettings; under the <menuchoice><guimenu>Appearance</guimenu><guisubmenu>Fonts</guisubmenu> </menuchoice>. Right-clicking on the taskbar brings the Settings dialog where you can choose several options to customize your taskbar.
tr: Görev çubuğu, paneldeki başka bir pencere araç takımıdır. Öntanımlı olarak tüm masaüstlerindeki tüm açık pencereler için bir alan gösterir. İki pencere arasında görev yöneticisine sağ tıkladığınızda <guimenuitem>Yalnızca geçerli masaüstünün pencerelerini göster</guimenuitem> seçeneğini işaretleyerek geçerli masaüstündeki tüm açık pencereleri göstermesini sağlayabilirsiniz. Görev çubuğu ögeleri üzerindeki metnin boyutu &systemsettings; <menuchoice><guimenu>Görünüş</guimenu><guisubmenu>Yazıtipleri</guisubmenu> </menuchoice> altında ayarlanabilir. Görev çubuğuna sağ tıklamak, görev çubuğunuzu özelleştirmek için çeşitli seçenekler seçebileceğiniz Ayarlar iletişim kutusunu getirir.

source: Here is a screenshot of the taskbar settings dialog
tr: Görev çubuğu ayarları iletişim kutusunun ekran görüntüsü

source: Taskbar settings dialog
tr: Görev çubuğu ayarları iletişim kutusu

source: System Tray
tr: Sistem Tepsisi

source: Another default panel item is the <application>System Tray</application>, which is used by traditional applications and widgets as a dock. Right clicking on the <application>System Tray</application> allows you to open the settings dialog, where you can set entries to display and their visibility.
tr: Diğer bir öntanımlı panel ögesi ise geleneksel uygulamalar ve araç takımları tarafından rıhtım olarak kullanılan <application>Sistem Tepsisi</application>’dir. <application>Sistem Tepsisi</application> ögesine sağ tıklamak, görüntülenecek girdileri ve bunların görünürlüğünü ayarlayabileceğiniz ayarlar iletişim kutusunu açmanıza olanak tanır.

source: <screeninfo>System Tray settings dialog</screeninfo>
tr: <screeninfo>Sistem Tepsisi ayarları penceresi</screeninfo>

source: <phrase>System Tray settings dialog</phrase>
tr: <phrase>Sistem Tepsisi ayarları penceresi</phrase>

source: Device Notifier
tr: Aygıt Bildirici

source: An icon located usually in the system tray is the <application>Device Notifier</application>. Plug in a &USB; disk and a dialog will open that allows you to open the device in &dolphin; or another associated application.
tr: Sistem tepsisinde yer alan simgelerden biri de genellikle <application>Aygıt Bildiricisi</application>’dir. Bir &USB; disk bağladığınızda onu &dolphin; veya başka bir ilişkili uygulamayla açıp açmamak istediğinizi soran bir iletişim kutusu belirir.

source: The <application>Device Notifier</application> is used for handling pluggable devices such as &USB; pendrives (also called flash drives or thumb drives), digital cameras, external &USB; hard drives, &etc; It also comes into play when a medium such as a &CD; or DVD is loaded into an optical drive.
tr: <application>Aygıt Bildirici</application>, &USB; bellekler, sayısal kameralar, dış &USB; sabit sürücüler vb. gibi takılabilir aygıtları yönetmek için kullanılır. Optik sürücüye bir &CD; veya DVD koyulduğunda da çalışır.

source: When you plug in an external device, or load a new medium into a drive, the <guilabel>Notifier</guilabel> window pops up (you can also open it explicitly by clicking on its Panel icon.) It stays open while the cursor is over it, otherwise it hides itself after a few seconds.
tr: Bir dış aygıt taktığınızda veya bir sürücüye yeni bir ortam taktığınızda <guilabel>Bildirici</guilabel> penceresi kendiliğinden açılır (Bu pencereyi paneldeki simgesine tıklayarak da açabilirsiniz). Fare işaretçisi üzerine gelene kadar açık kalır, gelmezse birkaç saniye sonra kendiliğinden kapanır.

source: The <guilabel>Notifier</guilabel> window shows a list of all the devices it currently knows about. Moving the mouse cursor over a device will highlight how many possible actions are associated with that device.
tr: <guilabel>Bildirici</guilabel> penceresi tanıdığı aygıtların listesini gösterir. Fare işaretçisi ile listedeki bir aygıtın üzerine geldiğinizde bu aygıta uygun olan, yapılabilecek birçok eylem gösterilir.

source: Clicking anywhere in the shaded box around the device name (but not on the eject/unmount icon if present) expands the entry to show the list of possible actions for that device. The set of actions depends on the device; it is configurable from the <application>Device Notifier</application>'s context menu or from the &systemsettings; modules <ulink url="help:/kcontrol/solid-actions/index.html">Device Actions</ulink> and <ulink url="help:/kcontrol/solid-device-automounter/index.html">Removable Devices</ulink>. Simply select one with the mouse or keyboard to launch that action.
tr: Aygıt adının etrafındaki gölgeli kutuda herhangi bir yeri tıklamak (ancak varsa çıkar/bağlantıyı kes simgesini tıklamak), o aygıt için olası eylemlerin listesini gösterecek biçimde girişi genişletir. Eylemler dizisi aygıta bağlıdır; <application>Aygıt Bildiricisi</application>’nin içerik menüsünden veya &systemsettings; penceresinin <ulink url="help:/kcontrol/solid-actions/index.html">Aygıt Eylemleri</ulink> ve <ulink url="help:/kcontrol/solid-device-automounter/index.html">Çıkarılabilir Aygıtlar</ulink> bölümlerinden yapılandırılabilir. Bir eylemi başlatmak için fare veya klavyeyle birini seçmeniz yeterlidir.

source: There is also a small icon to the right of each entry showing whether that device is currently accessible (or <emphasis>mounted</emphasis>) or not. Only when a device is not mounted is it safe to physically disconnect it from the computer. Clicking on the icon causes the device to be unmounted and/or the medium to be ejected if it is currently mounted, and will mount it if it is not. Note that unmounting/ejecting might fail if the device still has open files on it, &eg; if a large file copy hasn't finished. In most cases you can just wait a while and try again. When an unmounting has succeeded, a success icon will be shown on the <application>Device Notifier</application>'s icon.
tr: Ayrıca her girişin sağında, söz konusu aygıtın şu anda erişilebilir (veya <emphasis>bağlanmış</emphasis>) olup olmadığını gösteren küçük bir simge vardır. Yalnızca bir aygıt bağlı olmadığında bilgisayardan fiziksel olarak bağlantısını kesmek güvenlidir. Simgeye tıklamak, aygıtın bağlantısının kesilmesine ve/veya o anda takılıysa ortamın çıkarılmasını sağlar ve takılı değilse onu bağlar. Aygıtta hâlâ açık dosyalar varsa örn. büyük bir dosya kopyalaması tamamlanmadıysa çıkarma ve/veya bağlantısını kesme işlemi başarısız olabilir. Çoğu durumda bir süre bekleyip yeniden deneyebilirsiniz. Kaldırma işlemi başarılı olduğunda, <application>Aygıt Bildirici</application> simgesinde bir başarı simgesi gösterilecektir.

source: Hidden Items
tr: Gizli Ögeler

source: The <application>System Tray</application> normally holds some more entries like &klipper;, &kmix; &etc;
tr: <application>Sistem Tepsisi</application>; normalde &klipper;, &kmix; vb. gibi ögeler barındırır.

source: Some of the default entries in the <application>System Tray</application> are hidden to save space in the bar. To display these entries click on the small white triangle <inlinemediaobject><imageobject><imagedata fileref="system-tray-up-arrow.png" format="PNG"/> </imageobject></inlinemediaobject>, then use the &LMB; to launch a widget or the &RMB; to open its settings dialog.
tr: <application>Sistem Tepsisi</application>’ndeki bazı girdiler, alandan tasarruf etmek için gizlenmiştir. Bu girdileri görüntülemek için küçük beyaz yukarı ok simgesine <inlinemediaobject><imageobject><imagedata fileref="system-tray-up-arrow.png" format="PNG"/> </imageobject></inlinemediaobject> tıklayın ve sonrasında bir araç takımını başlatmak için &LMB;, ayarlarını açmak için &RMB; kullanın.

source: Digital Clock
tr: Sayısal Saat

source: The right-most &plasma; widget in the default panel holds the <application>Digital Clock</application>. This clock can display the time in different timezones as well as have its size changed. The clock will adjust its font size to the area it is given by the surrounding containment (that is the panel in this case). If you choose to display the date, this date will be rendered using the <guimenuitem>Small font</guimenuitem> option from the &systemsettings; <guilabel>Font</guilabel> dialog. The time will take the rest of the space. So in the end, you'll choose yourself the amount of information displayed, and if that fits. If you want to display more information, make the panel larger or put the clock on the desktop where it can grow freely.
tr: Öntanımlı panelde en sağdaki &plasma; araç takımı <application>Sayısal Saat</application>’i barındırır. Bu saat, çeşitli saat dilimlerindeki saati görüntüleyebilir ve büyüklüğü ayarlanabilir. Saat, çevresindeki alanın büyüklüğüne göre yazıtipi puntosunu ayarlar (bu durumda panelin). Tarihi görüntülemeyi seçerseniz bu saat, &systemsettings; <guilabel>Yazıtipi</guilabel> bölümündeki <guimenuitem>Küçük yazıtipi</guimenuitem> ayarı kullanılarak görüntülenir. Zaman ise geri kalan alanı kaplar. Özet olarak, görüntülemek isteyeceğiniz bilgi miktarını sığdığı sürece siz seçersiniz. Daha fazla bilgi görüntülemek istiyorsanız paneli daha büyük yapın veya saati rahatça büyüyebileceği masaüstüne koyun.

source: Pager
tr: Sayfalayıcı

source: An optional item on your panel is the <application>Pager</application>. It allows you to switch between your virtual desktops. If you change the layout of the <application>Pager</application> through the <guimenuitem>Number of rows</guimenuitem> option, which will also affect the layout and animations that are shown in &kwin;’s <guimenuitem>Desktop Grid</guimenuitem> effect. For larger pagers, selecting <guimenuitem>Display windows icons</guimenuitem> typically makes sense.
tr: Panelinizdeki isteğe bağlı ögelerden biri de <application>Sayfalayıcı</application>’dır. Sanal masaüstleriniz arasında geçiş yapmanızı sağlar. <guimenuitem>Satır sayısı</guimenuitem> seçeneği ile <application>Sayfalayıcı</application>’nın yerleşiminde değişiklik yaparsanız bu, &kwin;’in <guimenuitem>Masaüstü Izgarası</guimenuitem>’nda gösterilen yerleşimi ve canlandırmaları da etkiler. Daha büyük sayfalayıcılar için <guimenuitem>Pencerelerin simgelerini görüntüle</guimenuitem> seçeneği genelde işe yarar.

source: The Panel Toolbox
tr: Panel Araç Kutuları

source: If your desktop is unlocked (you can do that by <mousebutton>right</mousebutton> clicking on the desktop, or when no application has the focus, with <keycombo action="simul">&Alt;<keycap>D</keycap></keycombo>, <keycap>L</keycap>), a small &plasma; logo will appear in the bottom right corner in the panel. Click on this toolbox, and the panel controller opens.
tr: Masaüstünüzün kilidi açıksa (bunu masaüstünde <mousebutton>sağ</mousebutton> tıklayarak veya herhangi bir uygulama odakta değilse <keycombo action="simul">&Alt;<keycap>D</keycap></keycombo>, <keycap>L</keycap> düğmeleriyle yapabilirsiniz) panelin sağ alt köşesinde bir &plasma; logosu görünecektir. Bu araç kutusuna tıklayın ve panel denetleyicisi açılır.

source: <screeninfo>Panel Settings</screeninfo>
tr: <screeninfo>Panel Ayarları</screeninfo>

source: <phrase>Panel Settings</phrase>
tr: <phrase>Panel Ayarları</phrase>

source: The panel controller allows you to reposition, resize and realign the panel. The &plasma; widgets living in this panel will adjust their size automatically. &plasma; widgets have basic knowledge about sizing, provided by the containment. They are programmed to take advantage of that size, and inform the applet about how much space they possibly need. In the end, the containment gives a possible size to the applets, the applets obey.
tr: Panel denetleyici, paneli yeniden konumlandırmanıza, yeniden boyutlandırmanıza ve yeniden hizalamanıza olanak tanır. &plasma; bu panelde yaşayan araç takımlarının boyutlarını kendiliğinden ayarlayacaktır. &plasma; araç takımları, kapsama tarafından sağlanan boyutlandırma hakkında temel bilgilere sahiptir. Bu boyuttan yararlanmak üzere programlanmışlardır ve uygulamaya ne kadar alana gereksinim duydukları hakkında bilgi verirler. Demek oluyor ki, kapsama uygulamacıklara olası bir boyut verir ve uygulamacıklar buna uyar.

source: Adding Applets
tr: Uygulamacıklar Eklemek

source: Unlock the desktop and you'll be able to add and remove &plasma; widgets from panel or desktop. You add &plasma; widgets by simply dragging them where you want them. <mousebutton>Right</mousebutton> click on an widget to remove it. <screenshot> <screeninfo>Add Widgets</screeninfo> <mediaobject> <imageobject> <imagedata fileref="add-widgets.png" format="PNG"/> </imageobject> <textobject> <phrase>Add Widgets</phrase> </textobject> </mediaobject> </screenshot> The <guibutton>Get New Widgets</guibutton> button allows you to add widgets you've previously downloaded and download new &plasma; widgets. Currently it supports native &plasmagik; packages and some &Mac; OS&nbsp;X dashboard widgets. Widgets you install this way can then be accessed just like regular, preinstalled widgets.
tr: Masaüstü kilidini açtığınızda panele ve masaüstüne &plasma; araç takımları ekleyip kaldırabilirsiniz. &plasma; araç takımlarını basit bir şekilde sürükleyerek istediğiniz yere bırakabilirsiniz. Bir araç takımının üzerine <mousebutton>sağ</mousebutton> tıklayarak o araç takımını kaldırabilirsiniz. <screenshot> <screeninfo>Araç Takımı Ekle</screeninfo> <mediaobject> <imageobject> <imagedata fileref="add-widgets.png" format="PNG"/> </imageobject> <textobject> <phrase>Araç Takımı Ekle</phrase> </textobject> </mediaobject> </screenshot> <guibutton>Yeni Araç Takımları Al</guibutton> düğmesi daha önce indirdiğiniz araç takımlarınızı eklemenize ve yeni &plasma; araç takımları indirmenize olanak sağlar. Şu anda bu özellik yerel &plasmagik; paketlerini ve bazı &Mac; OS&nbsp;X Dashboard araç takımlarını desteklemektedir. Bu yolu kullanarak indirdiğiniz araç takımlarına daha önceden kurulu olan araç takımları ile aynı biçimde erişebilirsiniz.

source: The Desktop
tr: Masaüstü
