Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/plasma-sdk_kqml_man-kqml.1.po
Languages: tr

source: kqml User's Manual
tr: kqml Kullanıcı Kılavuzu

source: QML Runtime with KLocalizedContext
tr: KLocalizedContext ile QML Çalışma Zamanı

source: <command>kqml</command> <group choice="opt"><option>-v, --version</option></group> <group choice="opt"><option>-h, --help</option></group> <group choice="opt"><option>-d, --domain</option> <replaceable>domain</replaceable></group> <arg choice="opt"><replaceable>files</replaceable>...</arg> <arg choice="opt"><option>--</option> <replaceable>args</replaceable>...</arg>
tr: <command>kqml</command> <group choice="opt"><option>-v, --version</option></group> <group choice="opt"><option>-h, --help</option></group> <group choice="opt"><option>-d, --domain</option> <replaceable>etki alanı</replaceable></group> <arg choice="opt"><replaceable>dosyalar</replaceable>…</arg> <arg choice="opt"><option>--</option> <replaceable>argümanlar</replaceable>…</arg>

source: Description
tr: Açıklama

source: <command>kqml</command> is a QML runtime with initialized KLocalizedContext.
tr: <command>kqml</command>, KLocalizedContext ile ilklendirilen bir QML çalışma zamanıdır.

source: Unlike the qml tool that comes with qt-declarative package, kqml initializes KLocalizedContext that allows testing real-world applications and scratch files with i18n calls throughout their code and imported libraries.
tr: qt-declarative paketiyle birlikte gelen qml aracının aksine kqml, kod ve içe aktarılan kitaplıklar boyunca i18n çağrılarıyla gerçek dünya uygulamalarını ve eskiz dosyalarını sınamaya izin veren KLocalizedContext’i başlatır.

source: Options
tr: Seçenekler

source: Displays version information.
tr: Sürüm bilgisini görüntüler.

source: <option>-d</option>, <option>--domain</option> <replaceable>domain</replaceable>
tr: <option>-d</option>, <option>--domain</option> <replaceable>etki alanı</replaceable>

source: The main localization domain.
tr: Ana yerelleştirme etki alanı.

source: Displays this help.
tr: Bu yardımı görüntüler.

source: Any number of QML files can be loaded. They will share the same engine.
tr: Aynı işletkeyi paylaşan herhangi bir sayıda QML dosyası yüklenebilir.

source: <replaceable>args</replaceable>...
tr: <replaceable>argümanlar</replaceable>…

source: Arguments after '<option>--</option>' are ignored, but passed through to the application.arguments variable in QML.
tr: “<option>--</option>” sonrası argümanlar yok sayılır; ancak QML’deki application.arguments değişkenine geçirilirler.

source: See Also
tr: Ayrıca

source: More detailed user documentation is available from <ulink url="help:/plasma-desktop">help:/plasma-desktop</ulink> (either enter this <acronym>URL</acronym> into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>help:/plasma-desktop</parameter></userinput>).
tr: Ayrıntılı kullanıcı belgelendirmesine <ulink url="help:/plasma-desktop">help:/plasma-desktop</ulink> üzerinden ulaşılabilir (ya bu <acronym>URL</acronym>’yi &konqueror;’a girin ya da <userinput><command>khelpcenter</command> <parameter>help:/plasma-desktop</parameter></userinput> çalıştırın).

source: Authors
tr: Yazarlar

source: <command>kqml</command> was written by <personname><firstname>ivan</firstname><surname>tkachenko</surname></personname> <email>me@raitjas.tk</email>.
tr: <command>kqml</command>, <personname><firstname>İvan</firstname><surname>Tkaçenko</surname></personname> <email>me@raitjas.tk</email> tarafından yazılmıştır.
