Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/plasma-sdk_plasmoidviewer_man-plasmoidviewer.1.po
Languages: tr

source: plasmoidviewer User's Manual
tr: plasmoidviewer Kullanıcı Kılavuzu

source: Run Plasma widgets in their own window
tr: Plasma araç takımlarını kendi pencerelerinde çalıştırın

source: <command>plasmoidviewer</command> <group choice="opt"><option>-v, --version</option></group> <group choice="opt"><option>-c, --containment</option> <replaceable>name</replaceable></group> <group choice="opt"><option>-a, --applet</option> <replaceable>name</replaceable></group> <group choice="opt"><option>-f, --formfactor</option> <replaceable>name</replaceable></group> <group choice="opt"><option>-l, --location</option> <replaceable>name</replaceable></group> <group choice="opt"><option>-x, --xPosition</option> <replaceable>xPosition</replaceable></group> <group choice="opt"><option>-y, --yPosition</option> <replaceable>yPosition</replaceable></group> <group choice="opt"><option>-s, --size</option> <replaceable>widthXheight</replaceable></group> <group choice="opt"><option>-p, --pixmapcache</option> <replaceable>size</replaceable></group> <group choice="opt"><option>-t, --theme</option> <replaceable>name</replaceable></group> <group choice="opt"><option>-h, --help</option></group> <arg choice="opt">args</arg>
tr: <command>plasmoidviewer</command> <group choice="opt"><option>-v, --version</option></group> <group choice="opt"><option>-c, --containment</option> <replaceable>ad</replaceable></group> <group choice="opt"><option>-a, --applet</option> <replaceable>ad</replaceable></group> <group choice="opt"><option>-f, --formfactor</option> <replaceable>ad</replaceable></group> <group choice="opt"><option>-l, --location</option> <replaceable>ad</replaceable></group> <group choice="opt"><option>-x, --xPosition</option> <replaceable>x-konumu</replaceable></group> <group choice="opt"><option>-y, --yPosition</option> <replaceable>y-konumu</replaceable></group> <group choice="opt"><option>-s, --size</option> <replaceable>genişlik-X-yükseklik</replaceable></group> <group choice="opt"><option>-p, --pixmapcache</option> <replaceable>boyut</replaceable></group> <group choice="opt"><option>-t, --theme</option> <replaceable>ad</replaceable></group> <group choice="opt"><option>-h, --help</option></group> <arg choice="opt">argümanlar</arg>

source: Description
tr: Açıklama

source: <command>plasmoidviewer</command> is a graphical tool allowing developers to test Plasma applets.
tr: <command>plasmoidviewer</command>, geliştiricilerin Plasma uygulamacıklarını sınamaları için grafiksel bir araçtır.

source: Only installed applets will be found. <command>kbuildsycoca5</command> may need to be run for newly-installed applets to be found.
tr: Yalnızca kurulu uygulamacıklar bulunur. Yeni kurulan uygulamacıkların bulunabilmesi için <command>kbuildsycoca5</command> komutunun çalıştırılması gerekebilir.

source: Options
tr: Seçenekler

source: Displays version information.
tr: Sürüm bilgisini görüntüler.

source: -c, --containment <replaceable>name</replaceable>
tr: -c, --containment <replaceable>ad</replaceable>

source: The name of the containment plugin.
tr: Kapsama eklentisinin adı.

source: -a, --applet <replaceable>name</replaceable>
tr: -a, --applet <replaceable>ad</replaceable>

source: The name of the applet plugin.
tr: Uygulamacık eklentisinin adı.

source: -f, --formfactor <replaceable>name</replaceable>
tr: -f, --formfactor <replaceable>ad</replaceable>

source: The formfactor to use (horizontal, vertical, mediacenter, planar or application).
tr: Kullanılacak biçim etmeni (horizontal, vertical, mediacenter, planar veya application).

source: -l, --location <replaceable>name</replaceable>
tr: -l, --location <replaceable>ad</replaceable>

source: The location constraint to start the Containment with (floating, desktop, fullscreen, topedge, bottomedge, leftedge, rightedge).
tr: Kapsamayı başlatmak için konum kısıtlaması (floating, desktop, fullscreen, topedge, bottomedge, leftedge, rightedge).

source: -x, --xPosition <replaceable>xPosition</replaceable>
tr: -x, --xPosition <replaceable>x-konumu</replaceable>

source: Set the x position of the plasmoidviewer on the Plasma desktop.
tr: Plasma masaüstünde plasmoidviewer’ın x konumunu ayarlayın.

source: -y, --yPosition <replaceable>yPosition</replaceable>
tr: -y, --yPosition <replaceable>y-konumu</replaceable>

source: Set the y position of the plasmoidviewer on the Plasma desktop.
tr: Plasma masaüstünde plasmoidviewer’ın y konumunu ayarlayın.

source: -s, --size <replaceable>widthXheight</replaceable>
tr: -s, --size <replaceable>genişlik-x-yükseklik</replaceable>

source: Set the window size of the plasmoidview.
tr: plasmoidview’un pencere boyutunu ayarlayın.

source: -p, --pixmapcache <replaceable>size</replaceable>
tr: -p, --pixmapcache <replaceable>boyut</replaceable>

source: The size in KB to set the pixmap cache to.
tr: pixmap önbelleğinin ayarlanacağı KB türünden boyut.

source: -t, --theme <replaceable>name</replaceable>
tr: -t, --theme <replaceable>ad</replaceable>

source: The name of the theme which the shell will use.
tr: Kabuğun kullanacağı temanın adı.

source: Displays this help.
tr: Bu yardımı görüntüler.

source: args
tr: argümanlar

source: Data that should be passed to the applet as 'externalData' event.
tr: Uygulamacığa “externalData” olayı olarak geçirilmesi gereken veri.

source: See Also
tr: Ayrıca Bakınız

source: More detailed user documentation is available from <ulink url="help:/plasma-desktop">help:/plasma-desktop</ulink> (either enter this <acronym>URL</acronym> into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>help:/plasma-desktop</parameter></userinput>).
tr: Daha ayrıntılı kullanıcı belgelendirmesine <ulink url="help:/plasma-desktop">help:/plasma-desktop</ulink> (ya bu &URL;’yi &konqueror;’a girin ya da <userinput><command>khelpcenter</command> <parameter>help:/plasma-desktop</parameter></userinput> komutunu çalıştırın) adresinden ulaşabilirsiniz.

source: Authors
tr: Yazarlar

source: <command>plasmoidviewer</command> was written by <personname><firstname>Aaron</firstname><surname>Seigo</surname></personname> <email>aseigo@kde.org</email>.
tr: <command>plasmoidviewer</command>, <personname><firstname>Aaron</firstname><surname>Seigo</surname></personname> <email>aseigo@kde.org</email> tarafından yazılmıştır.
