Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/plasma-desktop.po
Languages: tr

source: The desktop is in fact another containment. One that does not put size constraints on the applets. Applets can be moved and sized freely. On the unlocked desktop, &plasma; widgets will show a frame when you move the mouse over them. This applet handle allows you to move, resize, relocate and realign the panel. It also allows you to drag &plasma; widgets on the desktop. The buttons in the corner are used to resize, rotate configure and remove the applet. When rotated, a &plasma; widget will act magnetic towards 12 o'clock, so it is easy to get them back into sensible position. By default, most applets keep their aspect ratio when they are being resized. If you want to freely resize an applet, hold the &Ctrl; key pressed while resizing.
tr: Masaüstü, aslında başka bir kapsamadır. Uygulamacıklar üzerinde boyut sınırlandırması yapmayan. Uygulamacıklar serbestçe taşınabilir ve boyutlandırılabilir. Kilidi açılmış bir masaüstünde, &plasma; araç takımlar, onların üzerine fareyi getirdiğinizde bir dörtgen gösterirler. Bu uygulamacık; paneli taşımanıza, yeniden boyutlandırmanıza, yeniden konumlandırmanıza ve yeniden hizalamanıza olanak sağlar. Ayrıca, &plasma; masaüstüne sürükleyip bırakmayı da halleder. Köşedeki düğmeler yeniden boyutlandırmak, döndürmek, yapılandırmak ve kaldırmak için kullanılır. Döndürüldüğünde, bir &plasma; araç takımı saat 12 yönüne manyetik olarak çekilir; böylelikle onu düzgün bir duruma rahatlıkla geri sokabilirsiniz. Öntanımlı olarak, çoğu uygulamacık yeniden boyutlandırılırken en-boy oranını korur. Bir uygulamacığı serbestçe yeniden boyutlandırmak istiyorsanız yeniden boyutlarken &Ctrl; düğmesini basılı tutun.

source: Right clicking on the desktop also offers you to configure aspects such as the wallpaper and the layout used, and the mouse actions. It offers to download new wallpapers through &knewstuff;.
tr: Masaüstüne sağ tıklamak size duvar kağıdını, kullanılan yerleşimi ve fare eylemlerini değiştirme olanağı sağlar. Ayrıca &knewstuff; ile yeni duvar kâğıtları indirmenize izin verir.

source: On the <guilabel>Tweaks</guilabel> page you can configure to hide the desktop Toolbox and adjust the widget handling.
tr: <guilabel>İnce Ayarlar</guilabel> sayfasında masaüstü araç çubuğunu gizleyecek şekilde yapılandırabilir ve araç takımı kullanımını ayarlayabilirsiniz.

source: <screeninfo>Desktop Settings</screeninfo>
tr: <screeninfo>Masaüstü Ayarları</screeninfo>

source: <phrase>Desktop Settings</phrase>
tr: <phrase>Masaüstü Ayarları</phrase>

source: To change the &plasma; theme or download a new one through &knewstuff; open the <menuchoice><guimenu>Appearance</guimenu> <guimenuitem>Desktop Theme</guimenuitem></menuchoice> page in the &systemsettings;.
tr: &plasma; temasını değiştirmek veya &knewstuff; kullanarak yeni temalar almak için &systemsettings; içindeki <menuchoice><guimenu>Görünüş</guimenu> <guimenuitem>Masaüstü Teması</guimenuitem></menuchoice> yolunu izlemelisiniz.

source: With open applications, it quickly gets hard to see the &plasma; widgets on your desktop. The <emphasis role="bold">Dashboard</emphasis> gets those &plasma; widgets in front of you, much like the <guilabel>Peek at Desktop</guilabel> functionality you are used to from traditional desktops.
tr: Açık uygulamalar varken masaüstünizdeki &plasma; araç takımlarını görmeniz zorlaşır. Bu durumda <emphasis role="bold">Denetim Paneli</emphasis>, tıpkı geleneksel masaüstünde kullandığınız <guilabel>Masaüstünü Göster</guilabel> düğmesi gibi &plasma; araç takımlarını önünüze getirir.

source: <title>Folder View</title>
tr: <title>Klasör Görünümü</title>

source: The <guilabel>Folder View</guilabel> widget is used to display entries like folders or files from a folder, by default from <filename class="directory">$<envar>HOME</envar>/Desktop</filename>.
tr: <guilabel>Klasör Görünümü</guilabel> araç takımı, öntanımlı olarak <filename class="directory">$<envar>HOME</envar>/Masaüstü</filename> konumundaki bir klasörden dosyalar veya klasörler gibi girdiler görüntülemek için kullanılır.

source: You can choose to view either all files, or filter either by specific regular expressions (&eg;, all files with a certain extension) or by file type (&eg; just images).
tr: Tüm dosyaları görmeyi veya düzenli ifadelerle (örn., belirli uzantıya sahip tüm dosyalar) tanımlanmışları süzerek veya dosya türüne göre (örn. yalnızca görseller) seçebilirsiniz.

source: This widget also supports basic file management properties (moving, copying, cutting and pasting for example), and you can have as many as you want on your desktop.
tr: Bu araç takımı, aynı zamanda temel dosya yönetimi özelliklerini destekler (taşıma, kopyalama, kesme ve yapıştırma gibi) ve masaüstünüze istediğiniz kadar çok koyabilirsiniz.

source: <screeninfo>Folder View</screeninfo>
tr: <screeninfo>Klasör Görünümü</screeninfo>

source: <phrase>Folder View</phrase>
tr: <phrase>Klasör Görünümü</phrase>

source: If you select the layout <guilabel>Folder View</guilabel> in the <guilabel>Desktop Settings</guilabel> you can use one Folder View as the whole desktop, effectively replicating the "old style" desktop paradigm.
tr: <guilabel>Masaüstü Ayarları</guilabel>’ndan <guilabel>Klasör Görünümü</guilabel> yerleşimini seçerseniz bir Klasör Görünümünü tüm masaüstü olarak kullanabilir ve "eski tarz" masaüstü anlayışını tümüyle değiştirebilirsiniz.

source: &krunner; is a versatile mini command-line. You can use it to start applications, open web pages, access bookmarks, search through your desktop data, calculate short equations, and many more. Pressing <keycombo action="simul">&Alt;&Space;</keycombo> or <keycombo action="simul">&Alt;<keysym>F2</keysym></keycombo> opens the &krunner; dialog. You just start typing and &krunner; will start searching matches as soon as you've entered more than two characters. You can open the settings dialog to learn about &krunner;’s functionality, provided by plugins. You can navigate through the matches using the tab and arrow keys.
tr: &krunner; becerikli bir mini komut satırıdır. Uygulamaları başlatmak, web sayfalarını açmak, yer imlerine erişmek, masaüstü araması yapmak, basit eşitlikleri hesaplamak ve daha birçok amaç için kullanılabilir. <keycombo action="simul">&Alt;&Space;</keycombo> veya <keycombo action="simul">&Alt;<keysym>F2</keysym></keycombo> klavye kısayolu ile &krunner; iletişim kutusunu açabilirsiniz. Açıldıktan sonra yazmaya başladığınızda iki karakterden sonra &krunner; eşleşmeleri aramaya başlar. Ayrıca ayarlar penceresini açarak eklentiler tarafından sağlanan &krunner; işlevleri hakkında bilgi alabilirsiniz. Eşleşmeler arasında gezinmek için sekme veya ok düğmelerini kullanabilirsiniz.

source: <screeninfo>&krunner; dialog</screeninfo>
tr: <screeninfo>&krunner; iletişim kutusu</screeninfo>

source: <phrase>&krunner; dialog</phrase>
tr: <phrase>&krunner; iletişim kutusu</phrase>

source: Use the <inlinemediaobject><imageobject><imagedata fileref="krunner-configure.png" format="PNG"/> </imageobject></inlinemediaobject> button to open the <guilabel>KRunner</guilabel> &systemsettings; module and configure where and what to search for in &krunner;.
tr: <guilabel>K Çalıştır</guilabel> &systemsettings; modülünü açmak ve &krunner;’da neyi nasıl arayacağınızı yapılandırmak için <inlinemediaobject><imageobject><imagedata fileref="krunner-configure.png" format="PNG"/> </imageobject></inlinemediaobject> düğmesini kullanın.

source: &krunner; supports <quote>Desktop Actions</quote> which are additional actions an application can offer to perform common actions or jump directly to a certain task from Task Manager. Common examples are <guilabel>Open New Incognito Window</guilabel> to open your browser directly in private mode, <guilabel>Compose Email</guilabel> without launching the full-fledged email client first or the actions provided by &spectacle;:
tr: &krunner;, bir uygulamanın ortak eylemler gerçekleştirmek veya Görev Yöneticisi’nden belirli bir göreve doğrudan atlamak için sunabileceği ek eylemler olan <quote>Masaüstü Eylemleri</quote>’ni destekler. Yaygın örnekler, tarayıcınızı gizli kipte açmak için <guilabel>Yeni Gizli Pencere Aç</guilabel>, tam teşekküllü eposta istemcisini açmadan <guilabel>E-posta Oluştur</guilabel> veya &spectacle; tarafınan sağlanan eylemler:

source: <screeninfo>&krunner; Desktop Actions</screeninfo>
tr: <screeninfo>&krunner; Masaüstü Eylemleri</screeninfo>

source: <phrase>&krunner; Desktop Actions</phrase>
tr: <phrase>&krunner; Masaüstü Eylemleri</phrase>

source: If you press the &Down; key in an empty &krunner; a history of the recent entities is shown. After invoking a search result, its query will move to the top, so repeatedly used commands never fall out of the list.
tr: Boş bir &krunner;’da &Down; düğmesine basarsanız son varlıkların geçmişi gösterilir. Bir arama sonucu çağrıldıktan sonra, onun sorgusu en başa taşınır, böylelikle sürekli kullanılan komutlar hiçbir zaman bu liste dışına çıkmaz.

source: Remove single entries from the list using the <inlinemediaobject><imageobject><imagedata fileref="remove.png" format="PNG"/> </imageobject></inlinemediaobject> button or clear the complete history in the &krunner; settings.
tr: <inlinemediaobject><imageobject><imagedata fileref="remove.png" format="PNG"/> </imageobject></inlinemediaobject> düğmesini kullanarak listeden tekil girdileri kaldırın veya &krunner; ayarlarından bütün geçmişi temizleyin.

source: If you want to know what is going on on your system, pressing <keycombo action="simul">&Ctrl;&Esc;</keycombo> gives you quick access to a list of windows and processes, with options to monitor their output and kill processes.
tr: Eğer sisteminizde neler olduğunu görmek istiyorsanız <keycombo action="simul">&Ctrl;&Esc;</keycombo> düğmelerine basarak tez pencerelerin ve süreçlerin listesine erişebilirsiniz. Açılan bu pencereden süreçlerin ve pencerelerin çıktılarını sağlanan seçenekler ile izleyebilir ve süreçleri sonlandırabilirsiniz.

source: <title>Activities</title>
tr: <title>Etkinlikler</title>

source: The desktop toolbox, accessed via the upper left corner has a button for displaying your activities, of which &plasma; allows you to have more than one. Basically, that is multiple desktop containments hosting multiple sets of &plasma; widgets. Display the <quote>Activities</quote> bar, select one of the predefined activities or choose <guilabel>Create Activity</guilabel> to create a new containment, select your new containment and customize suiting your taste. &plasma;’s activities and &kwin;’s desktop grid are similar in that respect, but there is a fundamental difference. While virtual desktop are used to group and organize windows, &plasma;’s activities are used to group and organize &plasma; widgets. This way, you can switch between activities and have relevant &plasma; widgets supporting the task you are currently trying to accomplish. You can create a <quote>Free time</quote> activity, with comic strips, a puzzle and other &plasma; widgets, and a <quote>Work</quote> activity, with relevant <acronym>RSS</acronym> feeds, calculator and calendar, for example.
tr: Masaüstü araç kutusuna sağ üst köşedeki düğme ile erişebilirsiniz. Bu düğme masaüstünüzde kullandığınız etkinlikleri gösterir. &plasma; birden fazla etkinlik oluşturmanıza izin verir. Etkinlik kavramı temelde bir masaüstünde birden fazla masaüstü kapsamasının birden fazla &plasma; araç takımını barındırmasıdır. <quote>Etkinlikler</quote> çubuğunu görüntülediğinizde önceden tanımlanmış etkinliklerden birini seçebilirsiniz veya <guilabel>Etkinlik Oluştur</guilabel> seçeneği ile zevkinize göre yapılandırarak yeni bir etkinlik oluşturabilirsiniz. &plasma;’nın etkinlikleri ve &kwin;’in masaüstü ızgarası aslında aynıdır ancak köken itibariyle farklıdır. Sanal masaüstleri pencereleri gruplandırıp düzenlerken &plasma;’nın etkinlikleri &plasma; araç takımlarını gruplandırır ve düzenler. Bu yolla etkinlikler arasında geçiş yapabilir ve erişmek istediğiniz görevleri destekleyen &plasma; araç takımlarına ulaşabilirsiniz. Karikatürlerle, bulmacalarla ve diğer &plasma; araç takımları ile bir <quote>Boş zaman</quote> etkinliği veya <acronym>RSS</acronym> beslemeleri, hesap makinesi ve takvim ile bir <quote>İş</quote> etkinliği oluşturabilirsiniz.

source: To delete an activity, press the <guibutton>Stop Activity</guibutton> button on <quote>Activities</quote> bar (press <keycombo action="simul">&Alt;<keycap>D</keycap></keycombo> then <keycombo action="simul">&Alt;<keycap>A</keycap></keycombo> to open this bar) then click the red 'X' (or press <keycombo action="simul">&Alt;<keycap>D</keycap></keycombo> then <keycombo action="simul">&Alt;<keycap>R</keycap></keycombo>) and confirm the deletion.
tr: Bir etkinliği silmek için <quote>Etkinlikler</quote> çubuğundaki (bu çubuğu açmak için <keycombo action="simul">&Alt;<keycap>D</keycap></keycombo> düğmelerine, ardından <keycombo action="simul">&Alt;<keycap>A</keycap></keycombo> düğmelerine basın) <guibutton>Etkinliği Durdur</guibutton> düğmesine, kırmızı “X”e basıp (veya <keycombo action="simul">&Alt;<keycap>D</keycap></keycombo> ardından <keycombo action="simul">&Alt;<keycap>R</keycap></keycombo> düğmelerine basın) silme işlemini onaylayın.

source: Shortcuts
tr: Kısayollar

source: Most of &plasma;’s functionality is also accessible through keyboard shortcuts. The various combinations should be pressed in sequence, that is for example <keycombo action="simul">&Alt;<keycap>D</keycap></keycombo>, <keycap>A</keycap> means: Press &Alt; and <keycap>D</keycap>, release and press <keycap>A</keycap>.
tr: &plasma; işlevlerinin birçoğuna klavye kısayolları ile de erişilebilir. Çeşitli düğmelere birlikte ard arda basılarak bu işlevlere kullanılabilir; örneğin, <keycombo action="simul">&Alt;<keycap>D</keycap></keycombo>, <keycap>A</keycap> dizilimi; &Alt; ve <keycap>D</keycap> düğmesine basılıyken, <keycap>A</keycap> düğmesine basıp bırakın demektir.

source: Currently, the following default shortcuts can be used:
tr: Öntanımlı olarak şu kısayollar kullanılır:

source: Add Widgets
tr: Araç Takımları Ekle

source: Remove Widget
tr: Araç Takımını Kaldır

source: Lock/Unlock Widgets
tr: Araç Takımlarını Kilitle/Kilitlerini Aç

source: Zoom out
tr: Uzaklaştır

source: Zoom in
tr: Yakınlaştır

source: Next Widget
tr: Sonraki Araç Takımı

source: Previous Widget
tr: Önceki Araç Takımı

source: Widget settings
tr: Araç Takımı Ayarları

source: <para>Activities</para>
tr: <para>Etkinlikler</para>

source: Remove this Activity
tr: Bu Etkinliği Kaldır

source: <para>Desktop Settings</para>
tr: <para>Masaüstü Ayarları</para>

source: Next Activity
tr: Sonraki Etkinlik

source: Previous Activity
tr: Önceki Etkinlik

source: Peek at Desktop
tr: Masaüstüne Bak

source: Run the Associated Application
tr: İlişkilendirilmiş Uygulamayı Çalıştır

source: Open the Activities panel
tr: Etkinlikler Panelini Aç

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Program copyright 2008 &Aaron.J.Seigo; &Aaron.J.Seigo.mail;
tr: Uygulamanın telif hakkı 2008 &Aaron.J.Seigo; &Aaron.J.Seigo.mail;

source: Documentation Copyright &copy; 2008&ndash;2010 Sebastian Kügler <email>sebas@kde.org</email>
tr: Belgelendirme Telif Hakkı &copy; 2008&ndash;2010 Sebastian Kügler <email>sebas@kde.org</email>

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Serdar Soytetir <email>tulliana@gmail.com</email></para> <para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
