Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/qt6options_man-qt6options.7.po
Languages: tr

source: &Qt; Command Line Documentation
tr: &Qt; Komut Satırı Belgelendirmesi

source: Common commandline options for all applications based on the &Qt; toolkit
tr: &Qt; araç takımını kullanan tüm uygulamalar için genel komut satırı seçenekleri

source: <command><replaceable>Qt application</replaceable></command> <arg choice="opt"><option>-style=</option> <replaceable>style</replaceable> / <option>-style</option> <replaceable>style</replaceable></arg> <arg choice="opt"><option>-stylesheet=</option> <replaceable>stylesheet</replaceable> / <option>-stylesheet</option> <replaceable>stylesheet</replaceable></arg> <arg choice="opt"><option>-widgetcount</option></arg> <arg choice="opt"><option>-reverse</option></arg> <arg choice="opt"><option>-qmljsdebugger=</option> <replaceable>port</replaceable></arg> <arg choice="opt"><option>-platform</option> <replaceable>platformName[:options]</replaceable></arg> <arg choice="opt"><option>-platformpluginpath</option> <replaceable>path</replaceable></arg> <arg choice="opt"><option>-platformtheme</option> <replaceable>platformTheme</replaceable></arg> <arg choice="opt"><option>-plugin</option> <replaceable>plugin</replaceable></arg> <arg choice="opt"><option>-qwindowgeometry</option> <replaceable>geometry</replaceable></arg> <arg choice="opt"><option>-qwindowicon</option> <replaceable>icon</replaceable></arg> <arg choice="opt"><option>-qwindowtitle</option> <replaceable>title</replaceable></arg> <arg choice="opt"><option>-reverse</option></arg> <arg choice="opt"><option>-session</option> <replaceable>session</replaceable></arg> <arg choice="opt"><option>-display</option> <replaceable>hostname:screen_number</replaceable></arg> <arg choice="opt"><option>-geometry</option> <replaceable>geometry</replaceable></arg> <arg choice="opt"><option>-dialogs=</option> <replaceable>[xp|none]</replaceable></arg> <arg choice="opt"><option>-fontengine=</option> <replaceable>freetype</replaceable></arg> <arg choice="opt"><option>-h, --help and -? on &Windows;</option></arg> <arg choice="opt"><option>-v --version</option></arg>
tr: <command><replaceable>Qt uygulaması</replaceable></command> <arg choice="opt"><option>-style=</option> <replaceable>biçem</replaceable> / <option>-style</option> <replaceable>style</replaceable></arg> <arg choice="opt"><option>-stylesheet=</option> <replaceable>biçem sayfası</replaceable> / <option>-stylesheet</option> <replaceable>biçem sayfası</replaceable></arg> <arg choice="opt"><option>-widgetcount</option></arg> <arg choice="opt"><option>-reverse</option></arg> <arg choice="opt"><option>-qmljsdebugger=</option> <replaceable>kapı</replaceable></arg> <arg choice="opt"><option>-platform</option> <replaceable>platformAdı[:seçenekler]</replaceable></arg> <arg choice="opt"><option>-platformpluginpath</option> <replaceable>yol</replaceable></arg> <arg choice="opt"><option>-platformtheme</option> <replaceable>platformTeması</replaceable></arg> <arg choice="opt"><option>-plugin</option> <replaceable>eklenti</replaceable></arg> <arg choice="opt"><option>-qwindowgeometry</option> <replaceable>geometri</replaceable></arg> <arg choice="opt"><option>-qwindowicon</option> <replaceable>simge</replaceable></arg> <arg choice="opt"><option>-qwindowtitle</option> <replaceable>başlık</replaceable></arg> <arg choice="opt"><option>-reverse</option></arg> <arg choice="opt"><option>-session</option> <replaceable>oturum</replaceable></arg> <arg choice="opt"><option>-display</option> <replaceable>makine adı:ekran_numarası</replaceable></arg> <arg choice="opt"><option>-geometry</option> <replaceable>geometri</replaceable></arg> <arg choice="opt"><option>-dialogs=</option> <replaceable>[xp|yok]</replaceable></arg> <arg choice="opt"><option>-fontengine=</option> <replaceable>freetype</replaceable></arg> <arg choice="opt"><option>-h, --help and -? on &Windows;</option></arg> <arg choice="opt"><option>-v --version</option></arg>

source: Options
tr: Seçenekler

source: The following options apply to all &Qt; applications:
tr: Bu seçenekler tüm &Qt; uygulamalarına uygulanabilir:

source: <option>-style=</option> <replaceable>style</replaceable> / <option>-style</option> <replaceable>style</replaceable>
tr: <option>-style=</option> <replaceable>biçem</replaceable> / <option>-style</option> <replaceable>biçem</replaceable>

source: Set the application &GUI; style. Possible values depend on the system configuration. If &Qt; is compiled with additional styles or has additional styles as plugins these will be available to the <option>-style</option> command line option.
tr: Uygulama &GUI; biçemini ayarlayın. Olası değerler, sistem yapılandırmasına bağlıdır. &Qt; ek biçemlerle derlenir veya eklenti olarak ek biçemlere sahipse bunlar <option>-style</option> komut satırı seçeneğinde kullanılabilir.

source: <option>-stylesheet=</option> <replaceable>stylesheet</replaceable> / <option>-stylesheet</option> <replaceable>stylesheet</replaceable>
tr: <option>-stylesheet=</option> <replaceable>biçem sayfası</replaceable> / <option>-stylesheet</option> <replaceable>biçem sayfası</replaceable>

source: Set the application styleSheet. The value must be a path to a file that contains the Style Sheet.
tr: Uygulama biçem sayfasını ayarlayın. Değer, biçem sayfasını içeren dosyanın yolu olmalıdır.

source: Print debug message at the end about number of widgets left undestroyed and maximum number of widgets existed at the same time.
tr: Sonunda, yok edilmeden bırakılan araç takımı sayısı ve aynı anda var olan en çok araç takımı sayısı hakkında hata ayıklama iletisi yazdırın.

source: Set the application's layout direction to <methodname>Qt::RightToLeft</methodname>. This option is intended to aid debugging and should not be used in production. The default value is automatically detected from the user's locale (see also <methodname>QLocale::textDirection()</methodname>).
tr: Uygulama yerleşimi yönünü <methodname>Qt::RightToLeft</methodname> olarak ayarlayın. Bu seçenek hata ayıklama için düşünülmüştür, üretimde kullanılmamalıdır. Öntanımlı değer kendiliğinden kullanıcı yerelinden algılanır (ayrıca bkz <methodname>QLocale::textDirection()</methodname>).

source: <option>-qmljsdebugger=</option> <replaceable>port</replaceable>
tr: <option>-qmljsdebugger=</option> <replaceable>kapı</replaceable>

source: Activate the QML/JS debugger with a specified port. The value must be of format port:1234[,block], where block is optional and will make the application wait until a debugger connects to it.
tr: Belirtilen kapıyla QML/JS hata ayıklayıcıyı etkinleştirin. Değer, kapı:1234[,blok] biçiminde olmalıdır; burada blok isteğe bağlıdır ve uygulamanın bir hata ayıklayıcı bağlanana kadar beklemesini sağlar.

source: <option>-platform</option> <replaceable>platformName[:options]</replaceable>
tr: <option>-platform</option> <replaceable>platformAdı[:seçenekler]</replaceable>

source: Specify the &Qt; Platform Abstraction (QPA) plugin.
tr: &Qt; Platform Soyutlama (QPA) eklentisini belirtin.

source: <option>-platformpluginpath</option> <replaceable>path</replaceable>
tr: <option>-platformpluginpath</option> <replaceable>yol</replaceable>

source: Specify the path to platform plugins.
tr: Platform eklentilerinin yolunu belirtin.

source: <option>-platformtheme</option> <replaceable>platformTheme</replaceable>
tr: <option>-platformtheme</option> <replaceable>platformTeması</replaceable>

source: Specify the platform theme.
tr: Platform temasını belirtin.

source: <option>-plugin</option> <replaceable>plugin</replaceable>
tr: <option>-plugin</option> <replaceable>eklenti</replaceable>

source: Specify additional plugins to load. The argument may appear multiple times.
tr: Yüklenecek ek eklentileri belirtin. Bu değişken birden çok kez belirebilir.

source: <option>-qwindowgeometry</option> <replaceable>geometry</replaceable>
tr: <option>-qwindowgeometry</option> <replaceable>geometri</replaceable>

source: Specify the window geometry for the main window using the &X11;-syntax. For example: -qwindowgeometry 100x100+50+50
tr: &X11;-sözdizimini kullanarak ana pencere için pencere geometrisini belirtin. Örneğin: -qwindowgeometry 100x100+50+50

source: <option>-qwindowicon</option> <replaceable>icon</replaceable>
tr: <option>-qwindowicon</option> <replaceable>simge</replaceable>

source: Set the default window icon.
tr: Öntanımlı pencere simgesini ayarlayın.

source: <option>-qwindowtitle</option> <replaceable>title</replaceable>
tr: <option>-qwindowtitle</option> <replaceable>başlık</replaceable>

source: Set the title of the first window.
tr: İlk pencerenin başlığını ayarlayın.

source: <option>-session</option> <replaceable>session</replaceable>
tr: <option>-session</option> <replaceable>oturum</replaceable>

source: Restore the application from an earlier session.
tr: Uygulamayı önceki bir oturumdan geri yükleyin.

source: <option>-display</option> <replaceable>hostname:screen_number</replaceable>
tr: <option>-display</option> <replaceable>makineadı:oturum_numarası</replaceable>

source: Switch displays on &X11;. Overrides the <envar>DISPLAY</envar> environment variable.
tr: Ekranları &X11; üzerinde değiştirin. <envar>DISPLAY</envar> çevre değişkenini geçersiz kılar.

source: <option>-geometry</option> <replaceable>geometry</replaceable>
tr: <option>-geometry</option> <replaceable>geometri</replaceable>

source: Specify the window geometry for the main window on &X11;. For example: -geometry 100x100+50+50
tr: &X11;’deki ana pencere için pencere geometrisini belirtin. Örneğin: -geometri 100x100+50+50

source: <option>-dialogs=</option> <replaceable>[xp|none]</replaceable>
tr: <option>-dialogs=</option> <replaceable>[xp|yok]</replaceable>

source: Only available for the &Windows; platform. XP uses native style dialogs and none disables them.
tr: Yalnızca &Windows; platformu. XP yerel biçemli iletişim kutuları kullanır ve hiçbiri bunları devre dışı bırakmaz.

source: Use the FreeType font engine.
tr: FreeType yazıtipi işletkesini kullanın.

source: -h, --help and -? on &Windows;
tr: &Windows; üzerinde -h, --help ve -?

source: Print all options and the application description.
tr: Tüm seçenekleri ve uygulama açıklamasını yazdırın.

source: Display the version string of the application.
tr: Uygulamanın sürüm bilgisini görüntüleyin.

source: See Also
tr: Ayrıca Bakınız

source: Authors
tr: Yazarlar

source: Man page originally written by &Lauri.Watts; &Lauri.Watts.mail;
tr: Man sayfası ilk olarak &Lauri.Watts; &Lauri.Watts.mail; tarafından yazılmıştır

source: Updated to &frameworks; 5 by &Burkhard.Lueck; &Burkhard.Lueck.mail;
tr: &frameworks; 5 güncellemesi &Burkhard.Lueck; &Burkhard.Lueck.mail; tarafından yapılmıştır

source: The infos for this man page are from <ulink url="https://doc.qt.io/qt-6/qapplication.html#QApplication">QApplication documentation</ulink>, <ulink url="https://doc.qt.io/qt-6/qguiapplication.html#QGuiApplication">QGuiApplication documentation</ulink> and <ulink url="https://doc.qt.io/qt-6/qcommandlineparser.html">QCommandLineParser documentation</ulink>.
tr: Bu man sayfasındaki bilgiler <ulink url="https://doc.qt.io/qt-6/qapplication.html#QApplication">QApplication belgelendirmesinden</ulink>, <ulink url="https://doc.qt.io/qt-6/qguiapplication.html#QGuiApplication">QGuiApplication belgelendirmesinden</ulink> ve <ulink url="https://doc.qt.io/qt-6/qcommandlineparser.html">QCommandLineParser belgelendirmesinden</ulink> alınmıştır.
