Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/rsibreak.po
Languages: tr

source: The &rsibreak; Handbook
tr: &rsibreak; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@îcloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Repetitive Strain Injury is an illness which can occur as a result of continuous work with a mouse and keyboard. The risk of suffering injury increases the longer users work without breaks. &rsibreak; simply offers reminders to take a break now and then.
tr: Yineleyen Gerilme Yaralanması, bir fare ve klavye ile sürekli çalışmanın bir sonucu olarak ortaya çıkabilecek bir hastalıktır. Yaralanma riski, kullanıcıların daha uzun süre ara vermeden çalışmasını artırır. &rsibreak; yalnızca şimdi ve sonra mola vermek için anımsatıcılar sunar.

source: project
tr: proje

source: Introduction
tr: Giriş

source: Repetitive Strain Injury can occur as a result of working with a mouse and keyboard. This utility can be used to remind you to take a break now and then. It displays a random picture from a collection at specified intervals for defined durations. You can configure the pictures to show and lengths of time to show them. You might use the breaks reminders to do some stretching exercises, for example, or as a reminder to walk away from the computer for a while.
tr: Yineleyen Gerilme Yaralanması, bir fare ve klavye ile çalışmanın bir sonucu olarak ortaya çıkabilir. Bu izlence, şimdi ve sonra bir mola vermenizi anımsatmak için kullanılabilir. Tanımlanmış süreler için belirli aralıklarla bir koleksiyondan rastgele bir resim görüntüler. Resimleri gösterecek şekilde ve gösterecek zaman uzunluklarını yapılandırabilirsiniz. Örneğin, bazı germe egzersizleri yapmak için veya bilgisayardan bir süre uzaklaşmak için bir anımsatıcı olarak molalar anımsatıcılarını kullanabilirsiniz.

source: <screeninfo>Logo &rsibreak;</screeninfo>
tr: <screeninfo>&rsibreak; logosu</screeninfo>

source: <phrase>Logo &rsibreak;</phrase>
tr: <phrase>&rsibreak; logosu</phrase>

source: &rsibreak; was originally written by Tom Albers. Early in the development Bram Schoenmakers joined the project
tr: &rsibreak; ilk olarak Tom Albers tarafından yazıldı. Geliştirme sürecinin erken aşamalarında Bram Schoenmakers projeye katıldı.

source: Using &rsibreak;
tr: &rsibreak; Kullanımı

source: The idea of &rsibreak; is to interrupt you in your work. The intention is to do that in a user-friendly manner. There will be times, though, that it will display itself when you are very busy. The configuration options in &rsibreak; are an effort to allow you to customize the interruptions. In that way we hope you will be able to improve your effectiveness at work while lessening your chances of injury.
tr: &rsibreak;’in amacı, işinizde sizi kesintiye uğratmaktır. Bunu kullanıcı dostu bir yapmaya çalışır. Yine de, çok meşgul olabileceğiniz zamanlar da olabilir. &rsibreak;’in yapılandırma seçenekleri, kesintileri özelleştirmenize izin verir. Böylece, yaralanma şansınızı azaltırken işinizdeki etkinliğinizi artırabileceğinizi umuyoruz.

source: After starting, you can see an icon in your tray and you will see a welcome pop up. Although the application should be useful with default settings, it may be wise to take control by examining the settings. To discover and to obtain an access to the options available, right click on the tray icon; in the context menu that appears, select <guilabel>Configure</guilabel>. The following chapters contain further configuration information.
tr: Başladıktan sonra, sistem tepsinizde bir simge görebilirsiniz ve bir karşılama açılır penceresi ortaya çıkar. Uygulama öntanımlı ayarlarla yararlı olsa da, ayarları inceleyerek denetimi ele almak akıllıca olabilir. Keşfetmek ve var olan seçeneklere erişim elde etmek için tepsi simgesine sağ tıklayın; görünen bağlam menüsünde, <guilabel>Yapılandır</guilabel>’ı seçin. Aşağıdaki fasıllar daha fazla yapılandırma bilgisi içerir.

source: &rsibreak; statistics
tr: &rsibreak; istatistikleri

source: Left click on the tray icon to see statistics
tr: İstatistikleri görmek için tepsi simgesine sağ tıklayın.

source: When you left click on the tray icon you will see some statistics. If you configure &rsibreak; to break at fixed times your idle time will not be measured. In that case, some of the options in the statistics may not be very informative.
tr: Tepsi simgesine sol fare düğmesiyle tıkladığınızda bazı istatistikler göreceksiniz. &rsibreak;’i sabit zamanlarda mola vermesi için yapılandırırsanız boşta kalma süreniz ölçülmez. Bu durumda, istatistiklerdeki bazı seçenekler çok bilgilendirici olmayabilir.

source: The upper left block shows general statistics: some totals and some information about idle time. The bottom left block shows something about your work pace. You will see the total amount of activity since you started the current log-in session. The amount of activity during some other intervals will also be shown. The Pause Score decreases every time you skip a break. The blocks to the right report on which short and long breaks have already passed. At present, the labels in the dialog can either be black or red and green. In the latter case a red statistic indicates a recommendation to relax and take a break, which will bring the color closer to green.
tr: Sol üst blok genel istatistikleri gösterir: bazı toplamlar ve boşta kalma süresi hakkında bazı bilgiler vardır. Sol alt blok, çalışma hızınızla ilgili bir şeyler gösterir. Geçerli oturumunu başlattığınızdan beri toplam etkinlik miktarını göreceksiniz. Diğer bazı aralıklardaki etkinlik miktarı da gösterilecektir. Duraklatma Puanı, her mola atladığınızda azalır. Kısa ve uzun molaların çoktan geçtiği sağ rapordaki bloklar. Şu anda, iletişim kutusundaki etiketler siyah veya kırmızı ve yeşil olabilir. İkinci durumda, kırmızı bir istatistik, rengi yeşile yaklaştıracak şekilde gevşemek ve mola vermek için bir öneri olduğunu gösterir.

source: When you right-click the tray icon, the context menu will show an option to <guilabel>Suspend</guilabel> &rsibreak;. When you don't want to be interrupted, such as during a game or a presentation, you can use this to silence &rsibreak; You can resume &rsibreak; when you click right on the icon again and select <guilabel>Resume</guilabel>.
tr: Tepsi simgesine sağ tıkladığınızda bağlam menüsü, &rsibreak;’i <guilabel>Askıya Al</guilabel>’mak için bir seçenek gösterir. Dikkatinizin dağılmasını istemiyorsanız; örneğin bir oyun veya sunum sırasında, bunu &rsibreak;’i susturmak için kullanabilirsiniz. Simgeye yeniden sağ tıklayıp <guilabel>Sürdür</guilabel> yaparsanız &rsibreak;’in işleyişini sürdürebilirsiniz.

source: Suspended &rsibreak;
tr: Askıya alınmış &rsibreak;

source: The tray icon when &rsibreak; is suspended
tr: &rsibreak; askıya alındığında tepsi simgesi

source: The last way to influence &rsibreak; is via &DBus;. There are &DBus; commands available to force breaks and to suspend and resume &rsibreak;. You can use these to suspend &rsibreak; automatically when you start a game or any other specified program. Execute <command>qdbus org.kde.rsibreak /rsibreak</command> to see the possibilities.
tr: &rsibreak;’i denetlemenin başka bir yolu da &DBus;’tır. &rsibreak;’ askıya almak ve sürdürmek veya molaları zorlamak için kullanabileceğiniz &DBus; komutları bulunur. Bunları kullanarak; örneğin bir oyuna başladığınızda veya başka bir program belirttiğinizde &rsibreak;’i kendiliğinden askıya alabilirsiniz. Olasılıkları görmek için <command>qdbus org.kde.rsibreak /rsibreak</command> komutunu yürütün.

source: Break types
tr: Mola türleri

source: Most settings are straightforward. On the general page, there is an option to start up automatically at &kde; startup. You might wonder why that is because the session manager should take care of that. Some users may need to start &rsibreak; at startup while they are not using the session manager. Note that <application>Gnome</application> will ignore the setting.
tr: Çoğu ayar gayet basittir. Genel sayfasında, &kde; başlangıcında kendiliğinden başlatmak için bir ayar bulunur. Bunun neden olduğunu merak edebilirsiniz; normalde oturum yöneticisinin bunu ayarlaması gerekir. Bazı kullanıcılar, oturum yöneticisi kullanmadıkları zamanlarda &rsibreak;’i kendiliğinden başlatmak isteyebilirler. <application>GNOME</application>’un bu ayarı yok sayacağını not edin.

source: There are two behavior options in &rsibreak;. There is an option to break at fixed intervals for fixed periods, and there is an option to reset the timers when &rsibreak; detects that you have been idle for the duration of a break.
tr: &rsibreak;’te iki davranış ayarı bulunur. İlk ayar, sabit aralıklarla sabit molalar verir ve &rsibreak; bir mola süresi kadar boşta kaldığınızı algıladığında sayaçları sıfırlamak için bir seçenek bulunur.

source: You can indicate that you do not want RSIBreak to interfere with presentations, games, video playback, and any other fullscreen application on the current virtual desktop using the <guilabel>Suppress if fullscreen windows present</guilabel> option.
tr: &rsibreak;’in sunumlar, oyunlar, video oynatımı veya geçerli sanal masaüstünde başka bir tam ekran uygulama sırasında işinize karışmasını istemiyorsanız <guilabel>Tam ekran pencereler varken sustur</guilabel> seçeneğini kullanın.

source: &rsibreak; popup
tr: &rsibreak; açılır penceresi

source: The lock button enables you to lock your screen whenever you leave your computer
tr: Kilit düğmesi, bilgisayarınızın başından ayrılırken bilgisayarınızı kilitlemenize izin verir.

source: You may find the full-screen notice to take a break inconvenient at the time it appears. In this case, on the <guilabel>During Breaks</guilabel> page you can indicate that you want to use a popup; a small popup near the tray will appear asking you to take a break. If you choose to ignore that, the full-screen activity-block will appear anyway.
tr: Tam ekran bildirimini bazen rahatsız edici bulabilirsiniz. Bu durumda, <guilabel>Molalar Sırasında</guilabel> sayfasından tepsinin yanında küçük bir açılır pencere kullanması için yapılandırabilirsiniz. Bunu yok sayarsanız, normal tam ekran bildirim gösterilecektir.

source: There are three options for the full screen break. It can show a <guilabel>Complete Black Effect</guilabel> (this is the default action), <guilabel>Show Plasma Dashboard</guilabel> or <guilabel>Show Slide Show of Images</guilabel> where a path may be set up to specify a folder on your hard disk which contains images. During a break, you will see a slideshow of those images.
tr: Tam ekran mola ekranı için üç adet seçenek vardır. <guilabel>Tam siyah efekt</guilabel> (bu, öntanımlı eylemdir), <guilabel>Plasma denetim panelini göster</guilabel> veya sabit diskinizdeki bir klasördeki görselleri göstermesi için <guilabel>Görsellerden oluşan bir slayt gösterisi göster</guilabel> seçeneğini kullanabilirsiniz.

source: Duration/Interval of a break
tr: Bir molanın süresi/aralığı

source: &rsibreak; supports two different types of break: <quote>Tiny breaks</quote> and <quote>Big breaks</quote>. The usual way to use these is to take frequent tiny breaks, and occasional big breaks. For example, a break of 20 seconds every 20 minutes (the tiny break), and a longer break of 2 minutes every hour (the big break).
tr: &rsibreak; iki tür molayı destekler: <quote>Kısa molalar</quote> ve <quote>Uzun molalar</quote>. Bunları kullanmanın olağan yolu, sık sık kısa molalar ve arada sırada da uzun molalar almaktır. Örneğin her yirmi dakikada bir yirmi saniyelik bir mola (kısa mola) ve her saatte bir iki dakikalık mola (uzun mola).

source: It is no use to set up intervals which are irritating. Those will, by definition, get on your nerves and you will be more likely to hit &Esc; &ndash; or any other key you have setup on the <guilabel>During Breaks</guilabel> page &ndash; to skip the break.
tr: Sizi irite eden aralıklar koymanın pek bir yararı yoktur. Bunlar sizi bıktırır ve &Esc; düğmesine veya <guilabel>Molalar Sırasında</guilabel> sayfasında belirleyeceğiniz başka bir düğmeye basma isteğinizi artırır.

source: If you find that you are often skipping breaks, you could decide to disable the shortcut and hide the minimize button. Remember, you choose how strictly to follow the break sequence.
tr: Molaları pek sık atladığınızı fark ettiyseniz kısayolu devre dışı bırakmayı ve simge durumuna küçült düğmesini devre dışı bırakmayı deneyebilirsiniz. Unutmayın; disiplininizi yalnızca siz koruyabilirsiniz.

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: &rsibreak; copyright 2005-2015 Tom Albers, Bram Schoenmakers, Albert Astals Cid
tr: &rsibreak; telif hakkı 2005–2015 Tom Albers, Bram Schoenmakers, Albert Astals Cid

source: Documentation copyright 2006 Rob Moore, Tom Albers, Bram Schoenmakers
tr: Belgelendirme telif hakkı 2006 Rob Moore, Tom Albers, Bram Schoenmakers

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
