Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/spectacle.po
Languages: tr

source: The <guilabel>Quit after manual Save or Copy</guilabel> option will quit &spectacle; after any saving or copying operations. Note that a copied screenshot will only be retained if you are running a clipboard manager that accepts images. KDE Klipper can be configured in this manner by right-clicking on its icon, selecting <guilabel>Configure Clipboard...</guilabel>, and unchecking <guilabel>Ignore images</guilabel>.
tr: <guilabel>Elle kaydet veya kopyala işleminden sonra çık</guilabel> seçeneği, herhangi bir kaydetme veya kopyalama işleminden sonra &spectacle;’dan çıkar. Kopyalanan ekran görüntüsünün yalnızca görüntüleri kabul eden bir pano yöneticisi çalıştırıyorsanız saklanacağını unutmayın. KDE Klipper simgesine sağ tıklayıp <guilabel>Panoyu Yapılandır…</guilabel> seçeneğini seçerek ve <guilabel>Görselleri yok say</guilabel> seçeneğinin işaretini kaldırarak bu şekilde yapılandırabilirsiniz.

source: Additional Functionality
tr: Ek İşlevsellik

source: Buttons
tr: Düğmeler

source: There are some buttons located at the bottom of the &spectacle; window. Their functions are described below:
tr: &spectacle; penceresinin alt kısmında bazı düğmeler bulunur. Bunların işlevleri aşağıda açıklanmıştır:

source: Help
tr: Yardım

source: Gives you the common menu items described in the <ulink url="help:/fundamentals/menus.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
tr: &kde; Temelleri’nin <ulink url="help:/fundamentals/menus.html#menus-help">Yardım Menüsü</ulink> bölümünde açıklanan temel menü ögelerini sağlar.

source: Configure...
tr: Yapılandır…

source: Gives you access to &spectacle;'s Configure window where you can change the capture settings and default save location and filename.
tr: Yakalama ayarlarını ve öntanımlı kaydetme konumunu ve dosya adını değiştirebileceğiniz &spectacle;’ın Yapılandır penceresine erişmenizi sağlar.

source: Annotate
tr: Bilgi Notu

source: Opens an annotation editor window that offers various annotating tools:
tr: Çeşitli bilgi notu ekleme araçları sunan bir not düzenleyici penceresi açar:

source: Annotation editor
tr: Bilgi notu düzenleyicisi

source: Give a try to the annotating tools. You might find everything that is needed to explain your screenshots there: arrows, pen, markers, text boxes, numbers, even smileys. It is possible to change the tool parameters and add effects (shadow, grayscale, and border).
tr: Bilgi notu araçlarını deneyin. Ekran görüntülerinizi açıklamak için gereksiniminiz olan her şeyi burada bulabilirsiniz: Oklar, kalemler, işaretleyiciler, metin kutuları, sayılar ve hatta suratlar. Araç parametrelerini değiştirmek ve efektler (gölge, gri tonlama ve kenarlık) eklemek olanaklıdır.

source: When you think that annotating is finished press the <guibutton>Annotation Done</guibutton> button.
tr: İşinizi bitirdiğinizde <guibutton>Tamam</guibutton> düğmesine basın.

source: Tools
tr: Araçlar

source: Opens a drop-down menu which offers various tools:
tr: Çeşitli araçlar sunan bir açılır menüyü açar:

source: <guimenuitem>Open Default Screenshots Folder</guimenuitem> will highlight the last saved screenshot in the default file manager
tr: <guimenuitem>Öntanımlı Ekran Görüntüleri Klasörünü Aç</guimenuitem>, öntanımlı dosya yöneticisinde son kaydedilen ekran görüntüsünü vurgular

source: Access to the <guimenuitem>Print</guimenuitem> dialog
tr: <guimenuitem>Yazdır</guimenuitem> iletişim kutusuna erişim

source: A range of external programs for Screen Recording
tr: Ekran Kaydı için çeşitli dış programlar

source: Export
tr: Dışa Aktar

source: Opens a drop-down menu that will allow you to directly open the screenshot with all programs that are associated with the PNG (Portable Network Graphics) &MIME; type. Depending on what programs are installed, you will be able to open and edit the snapshot in your graphics applications or viewers.
tr: PNG (Taşınabilir Ağ Grafikleri) &MIME; türü ile ilişkili tüm programların ekran görüntüsünü doğrudan açmanıza olanak tanıyan bir açılır menüyü açar. Hangi programların kurulu olduğuna bağlı olarak, anlık görüntüyü grafik uygulamalarınızda veya görüntüleyicilerinizde açıp düzenleyebilirsiniz.

source: Copy Image to Clipboard/Copy Location to Clipboard
tr: Görseli Panoya Kopyala/Konumu Panoya Kopyala

source: Copies the current screenshot or its location to the clipboard. You can also use the <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> keyboard shortcut for this.
tr: Geçerli ekran görüntüsünü veya konumunu panoya kopyalar. Bunun için <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> klavye kısayolunu da kullanabilirsiniz.

source: Save As
tr: Farklı Kaydet

source: Saves the screenshot as a PNG image in your default Pictures folder and immediately exits the application.
tr: Ekran görüntüsünü öntanımlı Resimler klasörünüze PNG görüntüsü olarak kaydeder ve uygulamadan hemen çıkar.

source: Configure
tr: Yapılandır

source: Use the <guibutton>Configure...</guibutton> button to open the configuration dialog.
tr: Yapılandırma iletişim kutusunu açmak için <guibutton>Yapılandır…</guibutton> düğmesini kullanın.

source: <title>General</title>
tr: <title>Genel</title>

source: <phrase>General</phrase>
tr: <phrase>Genel</phrase>

source: When launching Spectacle
tr: Spectacle başlatıldığında

source: Allows to <guilabel>Take full screen screenshot</guilabel>, use last-used capture mode, or do not take a screenshot automatically. The last-used capture mode is the one set in Capture Mode
tr: <guilabel>Bütün ekranın görüntüsünü al</guilabel>maya, son kullanılan yakalama kipini kullanmaya veya kendiliğinden ekran görüntüsü almamaya olanak tanır. En son kullanılan yakalama kipi, Yakalama Kipi’nde ayarlanmiş kiptir

source: After taking a screenshot
tr: Bir ekran görüntüsü aldıktan sonra

source: Allows <guilabel>Save file to default folder</guilabel>, switching off any clipboard actions, copying the image to clipboard, or copying screenshot path to the clipboard. The default location can be configured using the <link linkend="save-page">Save</link> configuration page. It is possible to <guilabel>Copy file location to clipboard</guilabel>. You can then paste it anywhere that accepts text input. Note that you must be running a clipboard manager in order to keep the path in the clipboard after &spectacle; quits.
tr: Herhangi bir pano eylemini, görseli panoya kopyalamayı veya ekran görüntüsü yolunu panoya kopyalamayı <guilabel>Dosyayı öntanımlı klasöre kaydet</guilabel> ile devre dışı bırakabilirsiniz. Öntanımlı konum, <link linkend="save-page">Kaydet</link> yapılandırma sayfasından yapılandırılabilir. <guilabel>Dosya konumunu panoya kopyala</guilabel>mak olanaklıdır. Sonrasında bunu metin girişi kabul eden herhangi bir yere yapıştırabilirsiniz. &spectacle; çıktıktan sonra yolu panoda tutmayı sürdürmek için bir pano yöneticisi çalıştırmanız gerektiğini not edin.

source: Press screenshot key to
tr: Ekran görüntüsü düğmesine basınca

source: When a shortcut to make screenshot is pressed and &spectacle; is already running it is possible to configure the behavior of the screenshoting system. You can choose between taking a new screenshot, opening of a new &spectacle; window, and returning focus to the existing &spectacle; window.
tr: Ekran görüntüsü almak için bir kısayola basıldığında ve &spectacle; halihazırda çalışıyorsa ekran görüntüsü alma sisteminin davranışını yapılandırmak olanaklıdır. Yeni bir ekran görüntüsü almak, yeni bir &spectacle; penceresi açmak veya pencere ve odağın var olan &spectacle; penceresine döndürülmesi arasında seçim yapabilirsiniz.

source: Use light background
tr: Açık renkli arka plan kullan

source: Use a light background color to mask the cropped-out area in the rectangular region selector. This may make dark cursors easier to see.
tr: Dikdörtgen bölge seçicide kırpılan alanı maskelemek için açık renkli bir arka plan rengi kullanın. Bu, koyu renkli imleçlerin görülmesini kolaylaştırabilir.

source: Show magnifier
tr: Büyüteci göster

source: When a screenshot is saved, copy the location at which the file was saved to the clipboard. You can then paste it anywhere that accepts text input. Note that you must be running a clipboard manager in order to keep the path in the clipboard after &spectacle; quits.
tr: Bir ekran görüntüsü kaydedildiğinde, dosyanın kaydedildiği konumu panoya kopyalayın. Daha sonra bunu metin girişini kabul eden herhangi bir yere yapıştırabilirsiniz. &spectacle;’dan çıkıldıktan sonra yolu panoda tutmak için bir pano yöneticisi çalıştırmanız gerektiğini unutmayın.

source: Accept on click-and-release
tr: Tıkla ve bırak yapınca kabul et

source: If checked, accept the selected region as soon as the mouse button is released in the <guilabel>Rectangular Region</guilabel> mode.
tr: İşaretliyse <guilabel>Dikdörtgen Bölge</guilabel> kipinde fare düğmesi bırakılır bırakılmaz seçilen bölgeyi kabul edin.

source: When selecting a new region, without a previously saved region available, clicking, dragging, and releasing the mouse button should immediately capture the selected region. When a previously saved region is shown, the saved region can be manipulated further and saving this region requires manual confirmation (&Enter; or double click with the &LMB;). Clicking and dragging outside of the previously saved region captures the newly selected region immediately.
tr: Yeni bir bölge seçerken, önceden kaydedilmiş bir bölge kullanılabilir değilken fare düğmesinin tıklatılması, sürüklenmesi ve bırakılması, seçilen bölgenin hemen yakalanmasını sağlayacaktır. Daha önce kaydedilmiş bir bölge gösterildiğinde, kaydedilen bölge daha fazla değiştirilebilir ve bu bölgenin kaydedilmesi elle onay gerektirir (&Enter; veya &LMB; ile çift tıklama). Önceden kaydedilen bölgenin dışına tıklayıp sürüklemek, yeni seçilen bölgeyi hemen yakalar.

source: Remember selected area
tr: Seçili alanı anımsa

source: By default, &spectacle; remembers an initial selection when you take a screenshot of a rectangular region until you close the &spectacle; window. You can also choose to make &spectacle; never remember selected area or remember it between the screenshoting sessions.
tr: Öntanımlı olarak &spectacle;, kapatılıncaya kadar dikdörtgen bir bölgenin ekran görüntüsünü aldığınızda ilk seçimi anımsar. Ayrıca &spectacle;’ın seçili alanı her zaman veya ekran görüntüsü oturumları arasında anımsamamasını da sağlayabilirsiniz.

source: <title>Save</title>
tr: <title>Kaydet</title>

source: When you use the <guilabel>Save</guilabel> function, &spectacle; saves the image with a default filename, in your Pictures folder (which is inside your home folder). The default filename includes the date and time when the image was taken.
tr: <guilabel>Kaydet</guilabel> işlevini kullandığınızda &spectacle;, görüntüyü öntanımlı dosya adıyla Resimler klasörünüze (ana klasörünüzün içindedir) kaydeder. Öntanımlı dosya adı, görüntünün çekildiği tarih ve saati içerir.

source: The <guilabel>Save</guilabel> page allows you to set the default save location and filename. Clicking this option brings up a dialog box like the following:
tr: <guilabel>Kaydet</guilabel> sayfası, öntanımlı kaydetme konumunu ve dosya adını ayarlamanıza olanak tanır. Bu seçeneğe tıklamak aşağıdaki gibi bir iletişim kutusu açar:

source: <phrase>Save</phrase>
tr: <phrase>Kaydet</phrase>

source: Save Location
tr: Kaydetme konumu

source: In the location text box set the folder where you'd like to save your screenshots when you press <guibutton>Save</guibutton>.
tr: Konum metin kutusunda <guibutton>Kaydet</guibutton>’e bastığınızda ekran görüntülerinizi kaydetmek istediğiniz klasörü ayarlayın.

source: Compression Quality
tr: Sıkıştırma kalitesi

source: Choose the image quality when saving with lossy image formats like JPEG. The higher values give better quality but increase the file size. See <ulink url="https://en.wikipedia.org/wiki/Image_file_formats">Wikipedia page</ulink> for the details on the image formats that are used in &spectacle;.
tr: JPEG gibi kayıplı görsel biçimleriyle kaydederken kullanılan görsel kalitesini seçin. Daha yüksek değerler daha iyi kalite sağlar; ancak dosya boyutunu artırır. &spectacle;’da kullanılan dosya biçimleriyle ilgili daha fazla bilgi için ilgili <ulink url="https://en.wikipedia.org/wiki/Image_file_formats">Vikipedi</ulink> sayfasına bakın.

source: Filename
tr: Dosya adı

source: Set a default filename for saved screenshots.
tr: Kaydedilen ekran görüntüleri için öntanımlı bir dosya adı ayarlayın.

source: You can use the following placeholders in the filename, which will be replaced with actual text when the file is saved:
tr: Dosya adında, dosya kaydedildiğinde gerçek metinle değiştirilecek olan aşağıdaki yer tutucuları kullanabilirsiniz:

source: <userinput>&lt;dd&gt;</userinput>: Day
tr: <userinput>&lt;dd&gt;</userinput>: Gün

source: <userinput>&lt;hh&gt;</userinput>: Hour
tr: <userinput>&lt;hh&gt;</userinput>: Saat

source: <userinput>&lt;MM&gt;</userinput>: Month
tr: <userinput>&lt;MM&gt;</userinput>: Ay

source: <userinput>&lt;ss&gt;</userinput>: Second
tr: <userinput>&lt;ss&gt;</userinput>: Saniye

source: <userinput>&lt;title&gt;</userinput>: Window title
tr: <userinput>&lt;title&gt;</userinput>: Pencere başlığı

source: <userinput>&lt;yyyy&gt;</userinput>: Year (4 digit)
tr: <userinput>&lt;yyyy&gt;</userinput>: Yıl (4 basamak)

source: <userinput>&lt;#&gt;</userinput>: Sequential number
tr: <userinput>&lt;#&gt;</userinput>: Sıralı numara

source: <userinput>&lt;mm&gt;</userinput>: Minute
tr: <userinput>&lt;mm&gt;</userinput>: Dakika

source: <userinput>&lt;yy&gt;</userinput>: Year (2 digit)
tr: <userinput>&lt;yy&gt;</userinput>: Yıl (2 basamak)

source: You can click on placeholders in the reference list below to insert them into the <guilabel>Filename</guilabel> line.
tr: Aşağıdaki başvuru listesindeki yer tutuculara tıklayarak <guilabel>Dosya adı</guilabel> satırına ekleyebilirsiniz.

source: If a file with this name already exists, a serial number will be appended to the filename. For example, if the filename is <filename>Screenshot</filename>, and <filename>Screenshot.png</filename> already exists, the image will be saved as <filename>Screenshot-1.png</filename>.
tr: Bu adda bir dosya varsa dosya adına bir seri numarası eklenir. Örneğin, dosya adı <filename>Ekran görüntüsü</filename> ise ve <filename>Ekran görüntüsü.png</filename> halihazırda varsa <filename>Ekran görüntüsü-1.png</filename> olarak kaydedilir.

source: Use the drop-down box next to the text field to select the default image format for screenshots. See <ulink url="https://en.wikipedia.org/wiki/Image_file_formats">Wikipedia page</ulink> for the details on the image formats that are used in &spectacle;.
tr: Ekran görüntüleri için öntanımlı görsel biçimini seçmek üzere metin alanının yanındaki açılır kutuyu kullanın. &spectacle;’da kullanılan dosya biçimleriyle ilgili daha fazla bilgi için ilgili <ulink url="https://en.wikipedia.org/wiki/Image_file_formats">Vikipedi</ulink> sayfasına bakın.

source: Shortcuts
tr: Kısayollar

source: This configuration page can be used to change the default shortcuts of &spectacle;. It is possible to configure shortcuts for starting &spectacle; and capturing different parts of your desktop.
tr: Bu yapılandırma sayfası, &spectacle;’ın öntanımlı kısayollarını değiştirmek için kullanılabilir. &spectacle;’ı başlatmak ve masaüstünüzün farklı bölümlerini yakalamak için kısayollar yapılandırmak olanaklıdır.

source: Drag and Drop
tr: Sürükle ve Bırak

source: A captured image can be dragged to another application or document. If the application is able to handle images, a copy of the full image is inserted there.
tr: Yakalanan bir görüntü başka bir uygulamaya veya belgeye sürüklenebilir. Uygulama görüntüleri işleyebiliyorsa tam görüntünün bir kopyası buraya eklenir.

source: If you drag a screenshot into a file manager window, a dialog pops up where you can edit the filename and select the image format and the file will be inserted into the actual folder.
tr: Bir ekran görüntüsünü dosya yöneticisi penceresine sürüklerseniz dosya adını düzenleyebileceğiniz ve görsel biçimini seçebileceğiniz bir iletişim kutusu açılır ve sonrasında dosya gerçek klasöre eklenir.

source: If you drag the screenshot to a text box, the path to the temporary saved file is inserted. This is useful for example to upload a screenshot through web forms or to attach screenshots into bug reports on the <ulink url="https://bugs.kde.org/">&kde; bugtracker</ulink>.
tr: Ekran görüntüsünü bir metin kutusuna sürüklerseniz geçici olarak kaydedilen dosyanın yolu eklenir. Bu, web formlarına veya <ulink url="https://bugs.kde.org/">&kde; hata izleyicisine</ulink> bir ekran görüntüsü eklerken yararlıdır.

source: This works with all clients that do not pick up the image data, but only look for a &URL; in the dragged mimedata.
tr: Bu, görsel verisini almayan ve yalnızca sürüklenen MIME verisinde bir &URL; arayan tüm istemcilerle çalışır.

source: Credits and License
tr: Emeği Geçenler ve Lisans

source: Program copyright &copy; 2015 &Boudhayan.Gupta; &Boudhayan.Gupta.mail;.
tr: Program telif hakkı &copy; 2015 &Boudhayan.Gupta; &Boudhayan.Gupta.mail;.

source: Portions of the code are based directly on code from the &ksnapshot; project. Copyright &copy; 1997-2011 The &ksnapshot; Developers. Detailed copyright assignment notices are available in the headers in the source code.
tr: Kodun bazı kısımları doğrudan &ksnapshot; projesinden alınmıştır. Telif hakkı &copy; 1997–2011 &ksnapshot; geliştiricileri. Ayrıntılı telif hakkı devri bildirimleri kaynak kodundaki başlıklarda vardır.

source: Portions of the code are based directly on code from the &kwin; project. Copyright &copy; 2008, 2013 The &kwin; Developers. Detailed copyright assignment notices are available in the headers in the source code.
tr: Kodun bazı kısımları doğrudan &kwin; projesinden alınmıştır. Telif hakkı &copy; 2008, 2013 &kwin; geliştiricileri. Ayrıntılı telif hakkı devri bildirimleri kaynak kodundaki başlıklarda vardır.

source: Documentation based on the original &ksnapshot; documentation:
tr: Belgelendirme, özgün &ksnapshot; belgelendirmesi temellidir:

source: Copyright &copy; 1997-2000 &Richard.J.Moore; &Richard.J.Moore.mail;
tr: Telif hakkı &copy; 1997–2000 &Richard.J.Moore; &Richard.J.Moore.mail;

source: Copyright &copy; 2000 &Matthias.Ettrich; &Matthias.Ettrich.mail;
tr: Telif hakkı &copy; 2000 &Matthias.Ettrich; &Matthias.Ettrich.mail;

source: CREDIT_FOR_TRANSLATORS
tr: <para>Çeviri: Emir SARI <email>emir_sari@icloud.com</email></para>
