Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/spectacle.po
Languages: tr

source: The &spectacle; Handbook
tr: &spectacle; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Emir</firstname><surname>SARI</surname><affiliation><address><email>emir_sari@icloud.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: Applications 21.08
tr: Uygulamalar 21.08

source: &spectacle; is an application for capturing and editing desktop screenshots. It can capture images of the entire desktop, a single monitor, the currently active window, the window currently under the mouse, or a rectangular region of the screen. The images can then be annotated, printed, sent to other applications for manipulation, or quickly be saved as-is.
tr: &spectacle;, masaüstü ekran görüntülerini yakalamak için kullanılan yalın bir uygulamadır. Tüm masaüstünün görüntüsünü, tek bir monitörü, geçerli etkin pencereyi, farenin altındaki pencereyi veya ekranın dörgen bir bölgesini yakalayabilir. Görseller daha sonra yazdırılabilir, başka uygulamalara gönderilebilir veya dosyaya kaydedilebilir.

source: kdegraphics
tr: kde grafikleri

source: screenshot
tr: ekran görüntüsü

source: screen capture
tr: ekran yakalama

source: screen grab
tr: ekran tutma

source: Introduction
tr: Giriş

source: Please report any problems or feature requests to the <ulink url="https://bugs.kde.org/">&kde; Bug Tracking System</ulink>.
tr: Herhangi bir sorunu veya özellik isteğini lütfen <ulink url="https://bugs.kde.org/">&kde;’nin Hata İzleme Sistemi</ulink>’ne bildirin.

source: Starting &spectacle;
tr: &spectacle;’ı Başlatmak

source: &spectacle; can be started in a variety of ways, as described below:
tr: &spectacle;, aşağıda açıklanan birden çok yol ile başlatılabilir:

source: In the application launcher menu, &spectacle; can be found at <menuchoice><guisubmenu>Applications</guisubmenu><guisubmenu>Utilities</guisubmenu><guimenuitem>Screenshot Capture Utility &spectacle;</guimenuitem></menuchoice>
tr: &spectacle;’ı uygulama başlatıcısı menüsünde <menuchoice><guisubmenu>Uygulamalar</guisubmenu><guisubmenu>İzlenceler</guisubmenu><guimenuitem>&spectacle;</guimenuitem></menuchoice> altında bulabilirsiniz.

source: Pressing the <keysym>Print Screen</keysym> button on the keyboard (often labeled <keycap>PrtSc</keycap>, <keycap>PrtScn</keycap> or similar) will immediately launch &spectacle;. Additionally, three more keyboard shortcuts are available to take screenshots and save them in your default save folder without showing the &GUI;:
tr: Klavyenizdeki <keysym>Ekranı Yazdır</keysym> düğmesine basmak (genelde <keycap>PrtSc</keycap>, <keycap>PrtScn</keycap> veya benzeri biçimde etiketlidir), &spectacle;’ı anında başlatır. Ek olarak, grafik arayüzü göstermeden ekran görüntüsü almak ve onları öntanımlı kaydetme klasörünüze kaydetmek için üç tane daha klavye kısayolu vardır:

source: <keycombo action="simul"><keycap>Meta</keycap><keysym>Print Screen</keysym></keycombo> will take a screenshot of the active window
tr: <keycombo action="simul"><keycap>Meta</keycap><keysym>Ekranı Yazdır</keysym></keycombo>, etkin pencerenin ekran görüntüsünü alır

source: <keycombo action="simul">&Shift;<keysym>Print Screen</keysym></keycombo> will take a screenshot of your entire desktop, &ie; all monitors
tr: <keycombo action="simul">&Shift;<keysym>Ekranı Yazdır</keysym></keycombo>, tüm monitörleri içerecek biçimde tüm masaüstünüzün ekran görüntüsünü alır

source: <keycombo action="simul"><keycap>Meta</keycap>&Shift;<keysym>Print Screen</keysym></keycombo> will take a rectangular region screenshot
tr: <keycombo action="simul"><keycap>Meta</keycap>&Shift;<keysym>Ekranı Yazdır</keysym></keycombo>, dörtgen bir bölgenin ekran görüntüsünü alır

source: You can configure the default save location and filename by starting &spectacle; normally and clicking on the <guibutton>Configure...</guibutton> button, then navigating to the Save section.
tr: Öntanımlı kaydetme konumunu ve dosya adını &spectacle;’ı normal bir biçimde başlatıp <guibutton>Yapılandır…</guibutton> düğmesine bastıktan sonra Kaydetme bölümüne giderek yapılandırabilirsiniz.

source: The mini command line &krunner; (invoked with <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo>) may also be used to start &spectacle;.
tr: &krunner; mini komut satırı da (<keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> düğme kombinasyonuyla çağrılır) &spectacle;’ı başlatmak için kullanılabilir.

source: &spectacle; can be started from the command-line. &spectacle; has an extensive set of command-line options, including a background mode which can be used to script the capture of screenshots without showing the &GUI; or requiring user interaction.
tr: &spectacle; komut satırından başlatılabilir. &spectacle; grafik arayüzü göstermeden veya kullanıcı etkileşimi gerektirmeden.ekran görüntülerini yakalamak üzere betik oluşturmak için kullanılabilecek bir arka plan kipi da dahil olmak üzere, kapsamlı bir komut satırı seçenekleri kümesine sahiptir.

source: To start &spectacle; from the command prompt, type in:
tr: &spectacle;’ı komut satırından başlatmak için şunu yazın:

source: To view the full list of command-line options and their explanation, type in:
tr: Komut satırı seçeneklerinin tam listesini ve açıklamalarını görmek için şunu yazın:

source: Using &spectacle;
tr: &spectacle; Kullanımı

source: Once &spectacle; starts, you will see a window like the following:
tr: &spectacle; başlatıldığında şuna benzer bir pencere görürsünüz:

source: &spectacle; Main Window
tr: &spectacle; Ana Penceresi

source: &spectacle; grabs an image of your entire desktop immediately after it is started, but before it displays itself on screen. This allows you to quickly create full-desktop screenshot images.
tr: &spectacle;, başlatıldıktan hemen sonra; ancak ekranda kendini göstermeden önce tüm masaüstünüzün görüntüsünü alır. Bu, tez tam masaüstü ekran görüntüsü görüntüleri oluşturmanıza olanak tanır.

source: The snapshot taken by &spectacle; is displayed in the preview window, which is located on the left-hand side of the &spectacle; application window.
tr: &spectacle; tarafından alınan ekran görüntüsü, önizleme penceresine görüntülenir. Bu pencere, &spectacle; uygulama penceresinin sol tarafında yer alır.

source: The image can be saved to a location of your choice by clicking on the <guibutton>Save As</guibutton> button or typing <keycombo action="simul">&Ctrl;&Shift;<keycap>S</keycap></keycombo>. This opens the standard save dialog, where you can choose the filename, the folder location, and the format that your screenshot will be saved in. You may edit the filename to anything you wish, including the name of a previously saved screenshot.
tr: Görseli istediğiniz yere kaydetmek için <guibutton>Farklı Kaydet</guibutton> düğmesini kullanın veya <keycombo action="simul">&Ctrl;&Shift;<keycap>S</keycap></keycombo> düğme kombinasyonunu kullanın. Bu, standart kaydetme iletişim kutusunu açar; burada dosya adını, klasör konumunu ve ekran görüntüsünün kaydedileceği biçimi seçebilirsiniz. Dosya adını istediğiniz herhangi bir şeye değiştirebilirsiniz.

source: To save a screenshot to the default location, click on the arrow portion of the <guibutton>Save As...</guibutton> button and press the <guimenuitem>Save </guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo>) button. The new save mode will be remembered for next time. The default save location and filename can be configured, as described later.
tr: Öntanımlı konuma bir ekran görüntüsü kaydetmek için <guibutton>Farklı Kaydet…</guibutton> düğmesinin ok kısmına tıklayın ve <guimenuitem>Kaydet</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo>) düğmesine basın. Yeni kaydetme kipi bir sonraki başlangıçta anımsanacaktır. Daha sonra açıklandığı üzere, öntanımlı kaydetme konumu ve dosya adları özelleştirilebilirdir.

source: To quickly save the image and quit &spectacle;, click on the checkbox beside <guilabel>Quit after manual Save or Copy</guilabel>, then click the arrow portion of the <guibutton>Save As...</guibutton> button and press the <guimenuitem>Save</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo>) item. This saves the image as a PNG file in your default <filename class="directory">Pictures</filename> folder, and exits the application immediately. As above, this new save mode will be remembered.
tr: Tez bir görsel kaydedip &spectacle;’dan çıkmak için <guilabel>Elle kaydet veya kopyala işleminden sonra çık</guilabel> yanındaki onay kutusuna tıklayıp <guibutton>Farklı Kaydet…</guibutton> düğmesinin ok kısmına basın ve <guimenuitem>Kaydet</guimenuitem> ögesini seçin (<keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo>). Bu, görseli öntanımlı <filename class="directory">Resimler</filename> klasörünüzde bir PNG görseli olarak kaydeder ve uygulamadan çıkar. Yukarıda da söz edildiği üzere, bu yeni kaydetme kipi daha sonrası için anımsanacaktır.

source: Taking A Screenshot
tr: Bir Ekran Görüntüsü Almak

source: When you open &spectacle;, it immediately takes a screenshot, unless otherwise set in the general options, of the whole screen as a convenience and shows a preview of it in the main window. You can save this screenshot using the buttons on the bottom of the window, or take a new one using the controls to the right of the preview.
tr: &spectacle;’ı açtığınızda, genel seçeneklerde aksi belirtilmediği sürece kolaylık sağlamak amacıyla hemen tüm ekranın ekran görüntüsünü alır ve ana pencerede bunun bir önizlemesini gösterir. Bu ekran görüntüsünü pencerenin altındaki düğmeleri kullanarak kaydedebilir veya önizlemenin sağındaki denetimleri kullanarak yeni bir ekran görüntüsü alabilirsiniz.

source: To discard the current screenshot and take another screenshot, press the <guibutton>Take a New Screenshot</guibutton> (<keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo>) button.
tr: Geçerli ekran görüntüsünü atıp başka bir tane almak için <guibutton>Yeni Bir Ekran Görüntüsü Al</guibutton> (<keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo>) düğmesine basın.

source: After capturing a screenshot, &spectacle; will show you an info panel with a link to the screenshot file and propose you to <guibutton>Open Containing Folder</guibutton> of this file.
tr: Bir ekran görüntüsü yakaladıktan sonra &spectacle;, size ekran görüntüsü dosyasına bağlantı içeren bir bilgi paneli gösterecek ve bu dosyanın <guibutton>İçeren Klasörünü Açmanızı</guibutton> önerecektir.

source: You may configure certain options on the right hand side of the application window before taking a new screenshot. These options allow you to select the area of the screen that is to be captured, set a delay before capturing the image, and configure whether the mouse cursor and/or the window decorations should be captured along with the screenshot.
tr: Yeni bir ekran görüntüsü almadan önce uygulama penceresinin sağ tarafında belirli seçenekleri yapılandırabilirsiniz. Bu seçenekler ekranın yakalanacak alanını seçmenize, görüntüyü yakalamadan önce bir gecikme ayarlamanıza ve ekran görüntüsüyle birlikte fare imlecinin ve/veya pencere dekorasyonlarının de yakalanması gerekip gerekmediğini yapılandırmanıza olanak tanır.

source: Capture Mode
tr: Yakalama Kipi

source: The capture mode settings allow you to set the area of the screen that should be captured, and whether there should be a delay between pressing the <guibutton>Take a New Screenshot</guibutton> (<keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo>) button and taking the screenshot. You may also enable the <guilabel>On Click</guilabel> checkbox, which disables the delay function and only takes the screenshot after you click anywhere on the screen after clicking the <guibutton>Take a New Screenshot</guibutton> (<keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo>) button.
tr: Yakalama kipi ayarları, size ekranın yakalanması gereken alanını ayarlamanıza ve <guibutton>Yeni bir ekran görüntüsü al</guibutton> (<keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo>) düğmesine basmak ve ekran görüntüsünü almak arasında bir gecikme olup olmaması gerektiğini ayarlamanıza olanak tanır. Ayrıca, <guilabel>Tıklamada</guilabel> onay kutusunu işaretlemek gecikme işlevini devre dışı bırakır ve <guibutton>Yeni bir ekran görüntüsü al</guibutton> (<keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo>) düğmesine bastıktan sonraki ilk tıklamada ekran görüntüsünü alır.

source: The <guilabel>Area</guilabel> combo-box allows you to set the area of the screen that should be captured. There are five options to select from, as described below.
tr: <guilabel>Alan</guilabel> çoklu kutusu, ekranın yakalanması gereken alanını ayarlamanıza olanak tanır. Aşağıda açıklandığı üzere, seçebileceğiniz beş seçenek vardır.

source: The <guilabel>Full Screen (All Monitors)</guilabel> option takes a screenshot of your entire desktop, spread across all the outputs, including all the monitors, projectors etc.
tr: <guilabel>Tam Ekran (Tüm Monitörler)</guilabel> seçeneği, tüm monitörler, projektörler vb. dahil olmak üzere tüm çıktılara yayılmış olarak tüm masaüstünüzün ekran görüntüsünü alır.

source: The <guilabel>Current Screen</guilabel> option takes a screenshot of the output that currently contains the mouse pointer.
tr: <guilabel>Geçerli Ekran</guilabel> seçeneği, o anda fare işaretçisini içeren çıktının ekran görüntüsünü alır.

source: The <guilabel>Rectangular Region</guilabel> option allows you to select a rectangular region of your desktop with your mouse. This region may be spread across different outputs.
tr: <guilabel>Dikdörtgen Bölge</guilabel> seçeneği, farenizle masaüstünüzün dikdörtgen bir bölgesini seçmenizi sağlar. Bu bölge farklı çıktılara yayılabilir.

source: This mode does not immediately take a screenshot but allows you to draw a rectangle on your screen, which can be moved and resized as needed. Once the desired selection rectangle has been drawn, double-clicking anywhere on the screen, or pressing the &Enter; button on the keyboard will capture the screenshot.
tr: Bu kip anında ekran görüntüsü almaz; ancak ekranınızda gerektiğinde taşınabilen ve yeniden boyutlandırılabilen bir dikdörtgen çizmenize olanak tanır. İstenilen seçim dikdörtgenini çizdikten sonra ekranın herhangi bir yerine çift tıklayarak veya &Enter; düğmesine basarak ekran görüntüsünü alabilirsiniz.

source: You can use the arrow keys to move and adjust the rectangle. Pressing the arrow keys will move the rectangle. Holding the &Shift; key while pressing the arrow keys will move the rectangle slowly, for fine-tuning your selection. Holding the &Alt; key while pressing the arrow keys will adjust the size of the rectangle.
tr: Dikdörtgeni taşımak ve ayarlamak için ok düğmelerini kullanabilirsiniz. Ok düğmelerine basıldığında dikdörtgen hareket eder. &Shift; düğmesini basılı tutarken ok düğmelerini kullanmak, seçiminize ince ayar yapmak için dikdörtgeni yavaşça hareket ettirecektir. &Alt; düğmesini basılı tutarken ok düğmelerini kullanmak ise dikdörtgenin boyutunu ayarlayacaktır.

source: The <guilabel>Active Window</guilabel> option takes a screenshot of the window that currently has focus. It is advisable to use a delay with this mode, to give you time to select and activate a window before the screenshot is taken.
tr: <guilabel>Etkin Pencere</guilabel> seçeneği, o anda odaklanılan pencerenin ekran görüntüsünü alır. Ekran görüntüsü alınmadan önce bir pencereyi seçip etkinleştirmeniz için size zaman tanımak amacıyla bu kipte bir gecikme kullanılması tavsiye edilir.

source: The <guilabel>Window Under Cursor</guilabel> option takes a screenshot of the window that is under the mouse cursor. If the cursor is on top of a popup menu, &spectacle; tries to take a screenshot of the menu as well as its parent window.
tr: <guilabel>İmleç Altındaki Pencere</guilabel> seçeneği, fare imlecinin altındaki pencerenin ekran görüntüsünü alır. İmleç açılır menünün üstündeyse &spectacle; menünün ve ana penceresinin ekran görüntüsünü almaya çalışır.

source: While this works most of the time, in certain cases it may fail to obtain information about the parent window. In this case, &spectacle; falls back to old way of capturing the image automatically, and captures an image of only the popup menu. You can also force the old way of capturing the image by checking the <guilabel>Capture the current pop-up only</guilabel> checkbox under <guilabel>Options</guilabel>
tr: Bu çoğu zaman işe yarasa da bazı durumlarda ana pencere hakkında bilgi almakta başarısız olabilir. Bu durumda &spectacle; görüntüyü eski usul yakalamaya çalışır ve yalnızca açılır menünün görüntüsünü çeker. Ayrıca, <guilabel>Seçenekler</guilabel> altındaki <guilabel>Yalnızca geçerli açılır pencereyi yakala</guilabel> onay kutusunu işaretleyerek eski görüntü yakalama yöntemini de zorlayabilirsiniz.

source: The <guilabel>Delay</guilabel> spin-box allows you to set the delay between pressing the <guibutton>Take a New Screenshot</guibutton> (<keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo>) button and taking the screenshot. This delay can be set in increments of 1 seconds using the spinbox buttons or the keyboard.
tr: <guilabel>Gecikme</guilabel> döndürme kutusu, <guibutton>Yeni Bir Ekran Görüntüsü Al</guibutton> (<keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo>) düğmesine basma ve ekran görüntüsü alma arasındaki gecikmeyi ayarlamanıza olanak tanır. Bu gecikme, döndürme kutusu düğmeleri veya klavye kullanılarak 1 saniyelik artışlarla ayarlanabilir.

source: When taking a time-delayed screenshot, &spectacle; displays the remaining time before the screenshot is taken in its window title, and makes it visible in its Task Manager item. &spectacle;'s Task Manager button also shows a progress bar, so you can keep track of when the snap will be taken.
tr: Zaman gecikmeli ekran görüntüsü alırken &spectacle; ekran görüntüsü alınmadan önce kalan süreyi pencere başlığında görüntüler ve Görev Yöneticisi ögesinde görünür hale getirir. &spectacle;’ın Görev Yöneticisi düğmesi aynı zamanda bir ilerleme çubuğu da gösterir, böylece görüntünün ne zaman çekileceğini takip edebilirsiniz.

source: While waiting for the delayed screenshot, you can un-minimize &spectacle; and the <guibutton>Take a New Screenshot</guibutton> button will turn into a <guibutton>Cancel</guibutton> button. The progress bar will also be shown here, giving you the chance to stop the countdown.
tr: Gecikmeli ekran görüntüsünü beklerken, &spectacle;’ı geri yükleyebilirsiniz Bu durumda, <guibutton>Yeni Ekran Görüntüsü Al</guibutton> düğmesi <guibutton>İptal</guibutton> düğmesine dönüşecektir. İlerleme çubuğu da burada gösterilir ve size geri sayımı durdurma şansını verir.

source: Enabling the <guilabel>On Click</guilabel> checkbox overrides the delay. When this checkbox is enabled, pressing the <guibutton>Take a New Screenshot</guibutton> (<keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo>) button hides the &spectacle; window and changes the mouse cursor to a crosshair. The screenshot is captured when the mouse is left-clicked, or aborted if any other mouse buttons are clicked. Note that you cannot interact with the desktop using the mouse while the cursor is a crosshair, but you can use the keyboard.
tr: <guilabel>Tıklamada</guilabel> onay kutusunun etkinleştirilmesi gecikmeyi geçersiz kılar. Bu onay kutusu etkinleştirildiğinde, <guibutton>Yeni Bir Ekran Görüntüsü Al</guibutton> (<keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo>) düğmesine basıldığında &spectacle; penceresini açar ve fare imlecini artı işaretine dönüştürür. Ekran görüntüsü, fareye sol tıklandığında yakalanır veya başka herhangi bir fare düğmesine tıklandığında iptal edilir. İmleç artı işareti konumundayken fareyi kullanarak masaüstüyle etkileşim kuramayacağınızı; ancak klavyeyi kullanabileceğinizi unutmayın.

source: Options
tr: Seçenekler

source: The Options settings allow you to select whether the mouse cursor should be included in the screenshots, and whether to capture window decorations along with the image of a single application window. In <guilabel>Window Under Cursor</guilabel> mode, it also allows you to select if &spectacle; shall only capture the image of the current popup menu under the cursor, or also include the parent window. Finally, <guilabel>Quit after Save or Copy</guilabel> will quit &spectacle; after any save or copy operations.
tr: Seçenekler, fare imlecinin ekran görüntülerine dahil edilip edilmeyeceğini ve tek bir uygulama penceresinin görüntüsüyle birlikte pencere dekorasyonlarının yakalanıp yakalanmayacağını seçmenizi sağlar. <guilabel>İmleç Altındaki Pencere</guilabel> kipinde, &spectacle; yalnızca imlecin altındaki geçerli açılır menünün görüntüsünü yakalayacak veya aynı zamanda ana pencereyi de içerecektir. Son olarak, <guilabel>Kaydet veya Kopyaladıktan sonra Çık</guilabel> seçeneği, herhangi bir kaydetme veya kopyalama işleminden sonra &spectacle;’dan çıkacaktır.

source: Enabling the <guilabel>Include mouse pointer</guilabel> checkbox includes an image of the mouse pointer in the screenshot.
tr: <guilabel>Fare işaretçisini içer</guilabel> onay kutusunun etkinleştirilmesi, ekran görüntüsüne fare işaretçisini de dahil eder.

source: The <guilabel>Include window titlebar and borders</guilabel> option is only enabled when either the <guilabel>Active Window</guilabel> mode or the <guilabel>Window Under Cursor</guilabel> mode is selected in the <guilabel>Area</guilabel> combo-box. Checking this option includes the window borders and decoration in the screenshot, while unchecking it gives an image of only the window contents.
tr: <guilabel>Pencere başlık çubuğunu ve kenarlıklarını içer</guilabel> seçeneği yalnızca <guilabel>Alan</guilabel> çoklu kutusunda <guilabel>Etkin Pencere</guilabel> kipi veya <guilabel>İmleç Altındaki Pencere</guilabel> kipi seçiliyse etkindir. Bu seçeneği işaretlemek pencere kenarlıklarını ve dekorasyonlarını ekran görüntüsüne dahil eder; işareti kaldırmak yalnızca pencere içeriğini alır.

source: The <guilabel>Include window shadow</guilabel> option is only enabled when either the <guilabel>Active Window</guilabel> mode or the <guilabel>Window Under Cursor</guilabel> mode is selected in the <guilabel>Area</guilabel> combo-box. Checking this option includes the window shadow in the screenshot, while unchecking it gives an image of the window without the shadow.
tr: <guilabel>Pencere gölgesini içer</guilabel> seçeneği yalnızca <guilabel>Alan</guilabel> çoklu kutusunda <guilabel>Etkin Pencere</guilabel> kipi veya <guilabel>İmleç Altındaki Pencere</guilabel> kipi seçiliyse etkindir. Bu seçeneği işaretlemek pencere gölgesini ekran görüntüsüne dahil eder; işareti kaldırmak pencerenin gölgesiz bir görselini verir.

source: The <guilabel>Capture the current pop-up only</guilabel> option is only enabled when the <guilabel>Window Under Cursor</guilabel> mode is selected in the <guilabel>Area</guilabel> combo-box. Checking this option captures only the popup menu under the cursor, without its parent window.
tr: <guilabel>Yalnızca geçerli açılır pencereyi yakala</guilabel> seçeneği yalnızca <guilabel>Alan</guilabel> çoklu kutusunda <guilabel>İmleç Altındaki Pencere</guilabel> kipi seçiliyse etkindir. Bu seçeneği işaretlenmek, ana penceresi olmadan yalnızca imlecin altındaki açılır menüyü yakalar.
