Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/spectacle_man-spectacle.1.po
Languages: tr

source: Spectacle User's Manual
tr: Spectacle Kullanıcı Kılavuzu

source: KDE Applications
tr: KDE Uygulamaları

source: screenshot capture Utility
tr: Ekran görüntüsü yakalama izlencesi

source: <command>spectacle</command> <arg choice="opt"><replaceable>Spectacle options</replaceable></arg>
tr: <command>spectacle</command> <arg choice="opt"><replaceable>Spectacle seçenekleri</replaceable></arg>

source: Description
tr: Açıklama

source: <command>spectacle</command> is a simple application for capturing desktop screenshots. It can capture images of the entire desktop, a single monitor, the currently active window, the window currently under the mouse, or a rectangular region of the screen. The images can then be annotated, printed, sent to other applications for manipulation, or quickly be saved as-is.
tr: <command>spectacle</command>, masaüstü ekran görüntülerini yakalamak için kullanılan yalın bir uygulamadır. Tüm masaüstünün görüntüsünü, tek bir monitörü, geçerli etkin pencereyi, farenin altındaki pencereyi veya ekranın dörgen bir bölgesini yakalayabilir. Görsellere daha sonra bilgi notları eklenebilir, yazdırılabilir, başka uygulamalara gönderilebilir veya dosyaya kaydedilebilir.

source: Spectacle options
tr: Spectacle seçenekleri

source: Displays help on commandline options.
tr: Komut satırı seçenekleri üzerine yardım görüntüler.

source: Displays help including Qt specific options.
tr: Qt’a özel seçenekler içerilecek biçimde yardım görüntüler.

source: Displays version information.
tr: Sürüm bilgisini görüntüler.

source: Capture the entire desktop (default).
tr: Tüm masaüstünü yakala (öntanımlı).

source: Capture the current monitor.
tr: Geçerli monitörü yakala.

source: Capture the active window.
tr: Etkin pencereyi yakala.

source: Capture the window currently under the cursor, including parents of pop-up menus.
tr: İmlecin altındaki pencereyi ve açılır menüleri yakala.

source: Capture the window currently under the cursor, excluding parents of pop-up menus.
tr: İmlecin altındaki pencereyi, açılır menülerin üst ögeleri içerilmeden yakala.

source: Capture a rectangular region of the screen.
tr: Ekranın dörtgen bir bölgesini yakala.

source: Launch Spectacle without taking a screenshot.
tr: Bir ekran görüntüsü almadan Spectacle’ı başlat.

source: Start in GUI mode (default).
tr: Grafik arayüz kipinde başlat (öntanımlı).

source: Take a screenshot and exit without showing the GUI.
tr: Bir ekran görüntüsü al ve grafik arayüzü göstermeden çık.

source: Start in DBus-Activation mode.
tr: DBus etkinleştirme kipinde başlat.

source: In background mode, do not pop up a notification when the screenshot is taken.
tr: Arka plan kipinde, ekran görüntüsü alındığında bir bildirim gösterme.

source: -o, --output <replaceable>fileName</replaceable>
tr: -o, --output <replaceable>dosya</replaceable>

source: In background mode, save image to specified file <replaceable>fileName</replaceable>.
tr: Arka plan kipinde, ekran görüntüsünü <replaceable>dosya</replaceable>’ya kaydet.

source: -d, --delay <replaceable>delayMsec</replaceable>
tr: -d, --delay <replaceable>milisaniye-gecikme</replaceable>

source: In background mode, delay before taking the shot (in milliseconds).
tr: Arka plan kipinde, görüntüyü almadan önceki gecikme (milisaniye türünden).

source: In background mode, copy screenshot only to clipboard, unless -o is also used.
tr: Arka plan kipinde, -o da kullanılmamışsa ekran görüntüsünü yalnızca panoya kopyala.

source: In background mode, copy screenshot file path to clipboard.
tr: Arka plan kipinde, ekran görüntüsü dosyası yolunu panoya kopyala.

source: Wait for a click before taking screenshot. Invalidates delay..
tr: Ekran görüntüsünü almadan önce bir tıklamayı bekle. Gecikmeyi geçersiz kılar.

source: Starts a new GUI instance of spectacle without registering to DBus.
tr: DBus kaydını yapmadan yeni bir grafik arayüz örneği açar.

source: In background mode, include pointer in the screenshot.
tr: Arka plan kipinde, ekran görüntüsünde işaretçiyi içer.

source: In background mode, do not include window decorations in the screenshot.
tr: Arka plan kipinde, ekran görüntüsünde pencere dekorasyonlarını içerme.

source: -E, --edit-existing <replaceable>existingFileName</replaceable>
tr: -E, --edit-existing <replaceable>var-olan-dosya-adı</replaceable>

source: Open and edit existing screenshot file.
tr: Var olan ekran görüntüsü dosyasını düzenle.

source: Feedback
tr: Geri bildirim

source: On IRC, irc.libera.chat #kde or via email, kde-graphics-devel@kde.org or on the web, &lt;<ulink url="https://apps.kde.org/spectacle">https://apps.kde.org/spectacle</ulink>&gt;
tr: IRC için irc.libera.chat sunucusunda #kde odasını, de-graphics-devel@kde.org e-postasını veya web üzerinde &lt;<ulink url="https://apps.kde.org/spectacle">https://apps.kde.org/spectacle</ulink>&gt; adresini kullanabilirsiniz

source: See Also
tr: Ayrıca

source: More detailed user documentation is available from <ulink url="help:/spectacle">help:/spectacle</ulink> (either enter this <acronym>URL</acronym> into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>help:/spectacle</parameter></userinput>).
tr: Daha ayrıntılı kullanıcı belgelendirmesine <ulink url="help:/spectacle">help:/spectacle</ulink> adresinden ulaşılabilir (bu <acronym>URL</acronym>’yi &konqueror;’a girin veya <userinput><command>khelpcenter</command> <parameter>help:/spectacle</parameter></userinput> komutunu çalıştırın).

source: There is also further information available at <ulink url="https://apps.kde.org/spectacle">https://apps.kde.org/spectacle</ulink>
tr: Ayrıca ek bilgiye <ulink url="https://apps.kde.org/spectacle">https://apps.kde.org/spectacle</ulink> adresinden ulaşılabilir

source: Copyright
tr: Telif hakkı

source: Copyright &copy; 2015 Boudhayan Gupta
tr: Telif hakkı &copy; 2015 Boudhayan Gupta

source: License: GNU General Public Version 2 &lt;<ulink url="https://www.gnu.org/licenses/gpl-2.0.html">https://www.gnu.org/licenses/gpl-2.0.html</ulink>&gt;
tr: Lisans: GNU Genel Kamu Lisansı Sürüm 2 &lt;<ulink url="https://www.gnu.org/licenses/gpl-2.0.html">https://www.gnu.org/licenses/gpl-2.0.html</ulink>&gt;
