Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/symmy_man-symmy.1.po
Languages: tr

source: Symmy User's Manual
tr: Symmy Kullanıcı El Kitabı

source: &Elvis.Angelaccio; &Elvis.Angelaccio.mail; <personblurb><para>Authored this program and this man page</para></personblurb>
tr: &Elvis.Angelaccio; &Elvis.Angelaccio.mail; <personblurb><para>Bu programı ve man sayfasını düzenleyen</para></personblurb>

source: Frontend for the symmetric encryption functionality of GPG.
tr: GPG’nin simetrik şifreleme işlevi için ön yüz.

source: <command>symmy</command> <arg rep="repeat"><replaceable>OPTIONS</replaceable></arg> <arg rep="repeat"><replaceable>FILES</replaceable></arg>
tr: <command>symmy</command> <arg rep="repeat"><replaceable>SEÇENEKLER</replaceable></arg> <arg rep="repeat"><replaceable>DOSYALAR</replaceable></arg>

source: DESCRIPTION
tr: AÇIKLAMA

source: <command>symmy</command> is a simple application that can be used to encrypt or decrypt one or more files using the symmetric encryption functionality of GPG. A file encrypted by <command>symmy</command> can be decrypted by anyone who has access to the GPG program and the encryption key.
tr: <command>symmy</command> GPG’nin simetrik şifreleme işlevini kullanarak bir ya da daha fazla dosyayı şifreleme veya dosya şifresini çözmek için kullanılan basit bir uygulamadır. <command>symmy</command> tarafından şifrelenen bir dosya GPG programına ve şifreleme anahtarına sahip herkes tarafından çözülebilir.

source: <command>symmy</command> can also be used from &dolphin; or &plasma; Folder View thanks to the <guimenuitem>Encrypt</guimenuitem> and <guimenuitem>Decrypt</guimenuitem> items in the context menu.
tr: <command>symmy</command> &dolphin; veya &plasma; Klasör Görünümü içinden de içerik menüsündeki <guimenuitem>Şifrele</guimenuitem> ve <guimenuitem>Şifre Aç</guimenuitem> ögeleri sayesinden kullanılabilir.

source: ENCRYPTION
tr: ŞİFRELEME

source: You can encrypt one or more files by writing their paths after the <option>encrypt</option> option. You can also select them in &dolphin; or &plasma; Folder View and click the <guimenuitem>Encrypt</guimenuitem> entry in the context menu.
tr: <option>encrypt</option> seçeneğinden sonra yollarını yazarak bir ya da daha fazla dosyayı şifreleyebilirsiniz. Ayrıca bunları &dolphin; veya &plasma; Klasör Görünümünde seçerek içerik menüsündeki <guimenuitem>Şifrele</guimenuitem>ye tıklayarak seçebilirsiniz.

source: Note that you cannot encrypt a folder. If you need to do that, you should compress the folder and then encrypt the resulting archive. It's also not possible to encrypt remote files or files that are already encrypted.
tr: Bir klasörü şifreleyemeyeceğinizi unutmayın. Bunu yapmanız gerekirse klasörü sıkıştırmalı ve ortaya çıkan arşivi şifrelemelisiniz. Uzak dosyaları ve zaten şifrelenmiş dosyaları da şifreleyemezsiniz.

source: Choosing an Encryption Key
tr: Bir Şifreleme Anahtarı Seçmek

source: <command>symmy</command> will ask you a password (or passphrase) that will be used as encryption key for <emphasis>all</emphasis> the selected files. You should choose a strong encryption key and you should store it in a secure place (such as a password manager). If you need to send the key to another person, you should do so over a secure channel (for example, by meeting in person).
tr: <command>symmy</command> <emphasis>tüm</emphasis> seçilen dosyalarda şifreleme anahtarı olarak kullanılmak üzere bir parola soracaktır. Güçlü bir şifreleme anahtarı seçmeli ve bunu güvenli bir yerde saklamalısınız (bir parola yönetici gibi). Anahtarı başka birine göndermeniz gerekirse bunu güvenli bir kanal üzerinde yapmalısınız (örneğin gerçekten buluşarak).

source: GPG Requirement
tr: GPG Gereksinimi

source: <command>symmy</command> uses GPG to perform the actual encryption, so it assumes that the <command>gpg-agent</command> process is running and properly configured.
tr: <command>symmy</command> asıl şifrelemeyi yapmak için GPG kullanır, yani <command>gpg-agent</command> sürecinin çalıştığını ve düzgün yapılandırıldığını varsayar.

source: Managing an Encryption Operation
tr: Bir Şifreleme İşlemini Yönetmek

source: The encryption operation will take some time depending on the number of files and on their size. You can track the progress of the operation from the notification applet provided by &plasma;. From the notification plasmoid you can also abort the encryption operation if necessary.
tr: Şifreleme işlevi dosya sayısı ve boyutuna bağlı olarak biraz zaman alır. İşlemin ilerleyişini &plasma; tarafından sağlanan bir bilgilendirme uygulamacığı ile izleyebilirsiniz. Bilgilendirme Plasmoid’inden şifreleme işlemini de gerektiğinde iptal edebilirsiniz.

source: DECRYPTION
tr: ŞİFRE ÇÖZME

source: You can decrypt one or more encrypted files by writing their paths after the <option>decrypt</option> option. You can also select them in &dolphin; or &plasma; Folder View and click the <guimenuitem>Decrypt</guimenuitem> entry in the context menu. Note that this entry will be visible only when selecting encrypted files.
tr: Bir ya da daha fazla dosyayı <option>decrypt</option> seçeneğinden sonra vererek şifresini çözebilirsiniz. Ayrıca dosyaları &dolphin; veya &plasma; Klasör Görünümü’nde seçerek içerik menüsündeki <guimenuitem>Şifre Aç</guimenuitem>a tıklayabilirsiniz. Bu girdinin yalnızca şifreli dosyaları seçtiğinizde görüneceğini unutmayın.

source: Managing a Decryption Operation
tr: Bir Şifre Çözme İşleminin Yönetilmesi

source: The decryption operation will take some time depending on the number of files and on their size. You can track the progress of the operation from the notification applet provided by &plasma;. From the notification plasmoid you can also abort the decryption operation if necessary.
tr: Şifre çözme işlemi dosya sayısı ve boyutuna göre belirli bir zaman alır. İşlemin ilerleyişini &plasma; tarafından sağlanan bilgilendirme uygulamacığıyla takip edebilirsiniz. Bilgilendirme Plasmoid’inden gerekirse şifre çözme işlemini iptal edebilirsiniz.

source: OPTIONS
tr: SEÇENEKLER

source: Encrypts the given list of files after asking a passphrase. This option is implicitly set if there are no other options.
tr: Bir parola sorduktan sonra verilen dosya listesini şifreler. Bu seçenek başka bir seçenek verilmemişse seçilir.

source: Decrypts the given list of files after asking the decryption key. Note that <option>encrypt</option> and <option>decrypt</option> are mutually exclusive.
tr: Şifre çözme anahtarını sorduktan sonra verilen dosya listesinin şifresini açar. <option>encrypt</option> ve <option>decrypt</option> seçeneklerinin karşılıklı olarak özel olduklarını unutmayın.

source: Shows a brief synopsis and description of the command line options.
tr: Komut satırı seçeneklerin kısa bir özetini ve açıklamasını gösterir.

source: Shows the version of this program.
tr: Bu programın sürümünü gösterir.

source: Shows information about the author of this program.
tr: Program yazarıyla ilgili bilgi gösterir.

source: Shows information about the license of this program.
tr: Programın lisans bilgisini gösterir.
