Repository: yakushabb/foss-desktop-turkish
Catalog: KDE/docmessages/systemsettings.po
Languages: tr

source: The &systemsettings; Handbook
tr: &systemsettings; El Kitabı

source: ROLES_OF_TRANSLATORS
tr: <othercredit role="translator"><firstname>Volkan</firstname><surname>Gezer</surname><affiliation><address><email>volkangezer@gmail.com</email></address></affiliation><contrib>Çeviri</contrib></othercredit>

source: This documentation describes system configuration and administration center for your desktop.
tr: Bu belgelendirme, masaüstünüz için olan sistem yapılandırmasını ve yönetim merkezini açıklar.

source: System
tr: Sistem

source: Settings
tr: Ayarlar

source: configuration
tr: yapılandırma

source: administration
tr: yönetim

source: config
tr: yapılandır

source: admin
tr: yönetici

source: Introduction
tr: Giriş

source: The &systemsettings; provides the user with a centralized and convenient way to configure all of the settings for your desktop.
tr: &systemsettings;, tüm masaüstü ayarlarınızı yapılandırmanız için merkezi ve pratik bir çözüm sunar.

source: &systemsettings; is made up of multiple modules. Each module is a separate application, however the &systemsettings; organizes all of these applications into a single location.
tr: &systemsettings;, birden fazla modülden oluşur. Her modül farklı bir uygulamadır; ancak &systemsettings;, bu uygulamaların tümünü tek bir konumda toplar.

source: Each &systemsettings; module can be executed individually
tr: Her &systemsettings; modülü bağımsız olarak yürütülebilir

source: See section entitled <link linkend="run-modules-individually">Running individual &systemsettings; modules</link> for more information.
tr: Daha fazla bilgi için <link linkend="run-modules-individually">&systemsettings; modüllerini bağımsız yürütme</link> bölümüne bakın.

source: &systemsettings; groups all of the configuration modules into several categories:
tr: &systemsettings;, tüm yapılandırma modüllerini çeşitli kategorilerde gruplar:

source: <link linkend="appearance">Appearance</link>
tr: <link linkend="appearance">Görünüş</link>

source: <link linkend="workspace">Workspace</link>
tr: <link linkend="workspace">Çalışma Alanı</link>

source: <link linkend="personalization">Personalization</link>
tr: <link linkend="personalization">Kişiselleştirme</link>

source: <link linkend="network">Network</link>
tr: <link linkend="network">Ağ</link>

source: <link linkend="hardware">Hardware</link>
tr: <link linkend="hardware">Donanım</link>

source: <link linkend="system_administration">System Administration</link>
tr: <link linkend="personalization">Sistem Yönetimi</link>

source: The modules that make up &systemsettings; fall under one of the above categories, making it easier to locate the correct configuration module.
tr: &systemsettings; uygulamasını yapan modüller, yukarıdaki kategorilerden birinde yer alarak doğru yapılandırma modülünün konumlandırılmasında kolaylık sağlar.

source: Using &systemsettings;
tr: &systemsettings; Kullanımı

source: This section details the use of &systemsettings; itself. For information on each individual module, please see <link linkend="modules">&systemsettings; Modules</link>.
tr: Bu bölüm, &systemsettings; uygulamasının kendisinin kullanımını ayrıntılı bir biçimde açıklar. Her modülün kendisi hakkında bilgi için <link linkend="modules">&systemsettings; Modüller</link> bölümüne bakın.

source: Starting &systemsettings;
tr: &systemsettings; Uygulamasını Başlatmak

source: The &systemsettings; can be started in one of three ways:
tr: &systemsettings;, üç şekilde başlatılabilir:

source: By selecting <menuchoice><guimenu>Settings</guimenu><guimenuitem>System Settings</guimenuitem></menuchoice> from the <guilabel>Application Menu</guilabel>.
tr: <guilabel>Uygulama Menüsü</guilabel>’nden <menuchoice><guimenu>Ayarlar</guimenu><guimenuitem>Sistem Ayarları</guimenuitem></menuchoice>’nı seçerek.

source: By pressing <keycombo>&Alt;<keycap>F2</keycap></keycombo> or <keycombo>&Alt;<keycap>Space</keycap></keycombo>. This will bring up the &krunner; dialog. Type <command>systemsettings</command>, and press &Enter;.
tr: <keycombo>&Alt;<keycap>F2</keycap></keycombo> veya <keycombo>&Alt;<keycap>Boşluk</keycap></keycombo> düğmelerine basarak. Bu, &krunner; iletişim kutusunu açar, burada <command>sistem ayarları</command> yazın ve &Enter;’e basın.

source: Type <command>systemsettings &amp;</command> at any command prompt.
tr: Herhangi bir komut istemine <command>systemsettings &amp;</command> yazın.

source: All three of these methods are equivalent, and produce the same result.
tr: Bu üç yöntem de eşdeğerdir ve aynı sonucu üretir.

source: The &systemsettings; Screen
tr: &systemsettings; Ekranı

source: When you start &systemsettings;, you are presented with a window, which is divided into two functional parts.
tr: &systemsettings; uygulamasını başlattığınızda, iki işlevsel bölüme ayrılmış bir pencere ile karşılaşacaksınız.

source: Across the top is a toolbar. The toolbar provides the user with the ability to go back into the main view from within a module using <guibutton>All Settings</guibutton>. You can also find a <guimenu>Help</guimenu> menu as well as a <guibutton>Configure</guibutton> button which provides you a dialog with alternate view settings.
tr: En üstte bir araç çubuğu bulunur. Araç çubuğu, kullanıcıya <guibutton>Tüm Ayarlar</guibutton>’ı kullanarak bir modül içinden ana görünüme geri dönme yeteneği sağlar. Ayrıca bir <guimenu>Yardım</guimenu> menüsü ve size alternatif görünüm ayarlarıyla bir iletişim kutusu sağlayan bir <guibutton>Yapılandır</guibutton> düğmesi de bulabilirsiniz.

source: To search for something within all of the modules, start to type keywords into the search field at the right of the toolbar in the <guibutton>All Settings</guibutton> view. When you start typing, a list of matching topics will popup. Select one and only the groups with settings for this keyword are enabled, the other are greyed out.
tr: Tüm modüllerde bir arama yapmak için <guibutton>Tüm Ayarlar</guibutton> içindeki araç çubuğunun sağındaki arama kutusuna anahtar sözcükler yazmaya başlayın. Yazmaya başladığınızda eşleşen konular çıkar. Bir anahtar sözcük bir seçim yaptığınızda, yalnızca bu sözcük ile ilgili gruplar etkinleştirilecek ve diğerleri gri olacaktır.

source: When the icon window has the focus, you can type the first letter of any module or module group name to select it. Typing this letter again the selection moves to the next match.
tr: Simge penceresi odağa sahip olduğunda, seçmek için herhangi bir modülün veya modül grubu adının ilk harfini yazabilirsiniz. Bu harf yeniden yazıldığında seçim bir sonraki eşleşmeye geçer.

source: Underneath the toolbar is an icon view of the individual modules or module groups that make up &systemsettings; grouped by different categories. By default, if your mouse stays a few seconds over an icon, a tooltip appears, either explaining the purpose of the module or showing the modules in this group.
tr: Araç çubuğunun altında, &systemsettings; uygulamasını oluşturan bağımsız modüllerin veya modül gruplarının farklı kategorilere göre gruplandırılan bir simge görünümü bulunur. Öntanımlı olarak, fareniz bir simgenin üzerinde birkaç saniye kalırsa modülün amacını açıklayan veya bu gruptaki modülleri gösteren bir araç ipucu görünür.

source: &systemsettings; Categories and Modules
tr: &systemsettings; Kategorileri ve Modülleri

source: A brief overview of all categories and their modules:
tr: Tüm kategorilere ve modüllerine kısa bir genel bakış:

source: <term>Appearance</term>
tr: <term>Görünüş</term>

source: Global Theme
tr: Global Tema

source: Plasma Style
tr: Plasma Biçemi

source: Application Style (Application Style, Window Decorations)
tr: Uygulama Biçemi (Uygulama Biçemi, Pencere Dekorasyonları)

source: Colors
tr: Renkler

source: Font (Fonts, Font Management)
tr: Yazıtipi (Yazıtipi, Yazıtipi Yönetimi)

source: Icons
tr: Simgeler

source: Cursors
tr: İmleçler

source: <term>Workspace</term>
tr: <term>Çalışma Alanı</term>

source: Workspace Behavior (General Behavior, Desktop Effects, Screen Edges, Touch Screen, Screen Locking, Virtual Desktops, Activities)
tr: Çalışma Alanı Davranışı (Genel Davranış, Masaüstü Efektleri, Ekran Kenarları, Dokunmatik Ekran, Ekran Kilidi, Sanal Masaüstleri, Etkinlikler)

source: Window Management (Window Behavior, Task Switcher, KWin Scripts, Window Rules)
tr: Pencere Yönetimi (Pencere Davranışı, Görev Değiştiricisi, KWin Betikleri, Pencere Kuralları)

source: Shortcuts (Shortcuts, Custom Shortcuts)
tr: Kısayollar (Kısayollar, Özel Kısayollar)

source: Startup and Shutdown (Login Screen (SDDM), Autostart, Background Services, Desktop Session, Splash Screen)
tr: Açılış ve Kapanış (Oturum Ekranı (SDDM), Otomatik Başlatma, Arka Plan Hizmetleri, Masaüstü Oturumu, Önyükleme Ekranı)

source: Search (File Search, Krunner, Web Search Keywords)
tr: Arama (Dosya Arama, Krunner, Web Arama Anahtar Kelimeleri)

source: <term>Personalization</term>
tr: <term>Kişiselleştirme</term>

source: Notifications
tr: Bildirimler

source: Users
tr: Kullanıcılar

source: Regional Settings (Language, Formats, Spell Check, Date &amp; Time)
tr: Bölgesel Ayarlar (Dil, Biçimler, Yazım Denetimi, Tarih &amp; Zaman)

source: Accessibility
tr: Erişilebilirlik

source: Applications (Default Applications, File Associations, Locations, Launch Feedback)
tr: Uygulamalar (Öntanımlı Uygulamalar, Dosya İlişkileri, Konumlar, Çalıştırma Geri Bildirimi)

source: KDE Wallet
tr: KDE Cüzdanı

source: Online Accounts
tr: Çevrimiçi Hesaplar

source: User Feedback
tr: Kullanıcı Geri Bildirimi

source: <term>Network</term>
tr: <term>Ağ</term>

source: Settings (Proxy, Connection Preferences, SSL Preferences, Cache, Cookies, Browser Identification, Windows Shares)
tr: Ayarlar (Vekil, Bağlantı Tercihleri, SSL Tercihleri, Önbellek, Çerezleri, Tarayıcı Tanımlama, Windows Paylaşımları)

source: <term>Hardware</term>
tr: <term>Donanım</term>

source: Input Devices (Keyboard, Mouse, Game Controller, Graphic Tablet, Touchpad)
tr: Giriş Aygıtları (Klavye, Fare, Oyun Kumandası. Grafik Tablet, Dokunmatik Yüzey)

source: Display and Monitor (Display Configuration, Compositor, Gamma, Night Color)
tr: Görüntü ve Monitör (Görüntü Yapılandırması, Bileşikleştirici, Gama, Gece Rengi)

source: Audio
tr: Ses

source: Multimedia (Audio CDs, CDDB Retrieval)
tr: Çoklu Ortam (Ses CD’leri, CDDB Alımı)

source: Power Management (Energy Saving, Activity Settings, Advanced Settings)
tr: Güç Yönetimi (Enerji Tasarrufu, Etkinlik Ayarları, Gelişmiş Ayarlar)

source: Removable Storage (Device Actions, Digital Camera, Removable Devices)
tr: Çıkarılabilir Depolama (Aygıt Eylemleri, Sayısal Kamera, Çıkarılabilir Aygıtlar)

source: <term>System Administration</term>
tr: <term>Sistem Yönetimi</term>

source: System Information
tr: Sistem Bilgisi

source: Use the search field at the top right in <guibutton>All Settings</guibutton> view to find all matching modules for a given keyword. Start typing a keyword opens a list of keywords and only the matching modules are enabled.
tr: Belirli bir anahtar kelime için eşleşen tüm modülleri bulmak için <guibutton>Tüm Ayarlar</guibutton> görünümünde sağ üstteki arama alanını kullanın. Bir anahtar kelime yazmaya başlamak anahtar kelime listesi açar ve yalnızca eşleşen modüller etkinleştirilir.

source: Exiting the &systemsettings;
tr: &systemsettings; Uygulamasından Çıkmak

source: &systemsettings; can be exited in one of two ways:
tr: &systemsettings; iki yoldan biriyle kapatılabilir:

source: Press <keycombo>&Ctrl;<keycap>Q</keycap></keycombo> on the keyboard.
tr: Klavyeden <keycombo>&Ctrl;<keycap>Q</keycap></keycombo> düğmelerine basın.

source: Click on the <guibutton>Close</guibutton> button located in the toolbar.
tr: Araç çubuğundaki <guibutton>Çık</guibutton> düğmesine basın.

source: Configuring &systemsettings;
tr: &systemsettings; Yapılandırması

source: The <guiicon>Configure</guiicon> icon in the toolbar allows you to change some &systemsettings; parameters. You can change from <guilabel>Icon View</guilabel> (default view) to <guilabel>Sidebar View</guilabel>. In <guilabel>Sidebar View</guilabel> mode, the welcome page shows the frequently used modules for quick access.
tr: Araç çubuğundaki <guiicon>Yapılandır</guiicon> simgesi, bazı &systemsettings; parametrelerini değiştirmenize izin verir. <guilabel>Simge Görünümü</guilabel>’nden (öntanımlı görünüm) <guilabel>Kenar Çubuğu Görünümü</guilabel>’ne geçebilirsiniz. <guilabel>Kenar Çubuğu Görünümü</guilabel> kipindeki karşılama sayfası, tez erişim için sıkça kullanılan modülleri gösterir.

source: You can also turn off the detailed tooltips by unchecking <guilabel>Show detailed tooltips</guilabel>. You will then get only normal tooltips and not the content of a module group.
tr: Ayrıca <guilabel>Ayrıntılı ipuçlarını göster</guilabel> işaretini kaldırarak ayrıntılı araç ipuçlarını kapatabilirsiniz. Ardından sadece normal araç ipuçları gösterilecektir, bir modül grup içeriği değil.

source: Running Individual &systemsettings; Modules
tr: Bağımsız &systemsettings; Modüllerini Çalıştırmak

source: Individual modules can be run without running &systemsettings; using the command <command>kcmshell5</command> from the command line. Type <command>kcmshell5 --list</command> to see a list of the available &systemsettings; modules.
tr: Bağımsız modüller &systemsettings; kullanmadan, komut satırında <command>kcmshell5</command> komutu ile çalıştırılabilir. Kullanılabilir tüm &systemsettings; modüllerini görmek için <command>kcmshell5 --list</command> yazın.

source: Additionally you can start KRunner and start type keywords. When you start typing, a list of matching modules prefixed with &systemsettings; will popup.
tr: Ek olarak K Çalıştır’ı başlatabilir ve anahtar sözcükler yazmaya başlayabilirsiniz. Yazmaya başladığınızda, &systemsettings; ile öneklenmiş eşleşen modül listesi çıkar.

source: The &systemsettings; Modules
tr: &systemsettings; Modülleri

source: In order to make it as easy as possible, the &systemsettings; has organized options into six categories. Under each category, there are icons grouped together under subcategories. Each icon is called a module. When you double click on a module icon, you will be presented with the options of the module in the main window.
tr: Olabildiğince kolaylaştırmak için &systemsettings; seçenekleri beş kategoriye ayrılmıştır. Her kategorinin altında alt kategorilerde gruplanmış simgeler bulunur. Her simgeye bir modül denir. Bir modül simgesine tıkladığınızda, ana pencerede modülün seçenekleri ile karşılaşacaksınız.

source: Each module will have some or all of the following buttons:
tr: Her modül aşağıdaki düğmelerin bazılarını veya tümünü içerecektir:

source: Help
tr: Yardım

source: This button will provide help specific to the current module. Clicking the button will open &khelpcenter; in a new window providing detailed information on the module.
tr: Bu düğme geçerli modülle alakalı yardımı gösterecektir. Düğmeye tıklamak, modül hakkında ayrıntılı bilgi sağlayan &khelpcenter;&apos;ı yeni bir pencerede açacaktır.

source: Defaults
tr: Öntanımlılar

source: Clicking this button will restore this module to its default values. You must click <guibutton>Apply</guibutton> to save the options.
tr: Bu düğmeye basmak bu modülü öntanımlı değerlerine sıfırlayacaktır. Seçenekleri kaydetmek için <guibutton>Uygula</guibutton> düğmesine basmalısınız.

source: Reset
tr: Sıfırla

source: This button will <quote>Reset</quote> the module to the previous settings.
tr: Bu buton modülü, önceki ayarlara <quote>Sıfırlayacaktır</quote>.

source: Apply
tr: Uygula

source: Clicking this button will save all changes. If you have changed anything, clicking <guibutton>Apply</guibutton> will cause the changes to take effect.
tr: Bu butona tıklamak tüm ayarları kaydedecektir. Eğer bir değişiklik yapmışsanız <guibutton>Uygula</guibutton> butonuna tıklamak değişikliklerin etkili olmasını sağlayacaktır.

source: You must either <quote>Reset</quote> or <quote>Apply</quote> the changes before changing to another module.
tr: Diğer bir modüle geçiş yapmadan önce tüm değişiklikleri <quote>Sıfırlamalı</quote> veya tüm değişiklikleri <quote>Uygulamalısınız</quote>.

source: If you try to change without saving or resetting your options, you will be asked if you want to save your changes, or discard them.
tr: Seçeneklerinizi kaydetmeden veya sıfırlamadan değişiklik yapmaya çalışırsanız değişikliklerinizi kaydetmek mi yoksa atmak mı istediğiniz sorulacaktır.

source: Credits and License
tr: Krediler ve Lisans

source: Program copyright 2007 Benjamin C. Meyer.
tr: Program telif hakkı 2007 Benjamin C. Meyer.

source: Program copyright 2009 Ben Cooksley.
tr: Program telif hakkı 2009 Ben Cooksley.

source: Contributors:
tr: Katkıda bulunanlar:

source: Documentation Copyright &copy; 2008 &Richard.Johnson; &Richard.Johnson.mail;
tr: Belgelendirme Telif Hakkı &copy; 2008 &Richard.Johnson; &Richard.Johnson.mail;

source: CREDIT_FOR_TRANSLATORS
tr: <para>Volkan Gezer<email>volkangezer@gmail.com</email></para>
